[
  {
    "surah_no" : 62,
    "total_ayah" : 11,
    "name" : "Surah e AL-Jummah",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "يُسَـبِّحُ لِلّٰهِ مَا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ الْمَلِكِ الْقُدُّوْسِ الْعَزِيْزِ الْحَكِـيْمِ",
        "Urdu" : "اللہ کی پاکی بیان کرتا ہے وہ سب کچھ جو کہ آسمانوں میں ہے اور وہ سب کچھ بھی جو کہ زمین میں ہے جو کہ بادشاہ ہے ہر طرح سے پاک سب پر غالب اور انتہائی حکمت والا ہے",
        "English" : "All that is in the heavens and all that is in the earth proclaim the purity of Allah, the Sovereign, the Supreme in Holiness, the All-Mighty, the All-Wise."
      },
      {
        "ayet_no" : 2,
        "arbi" : "هُوَ الَّذِيْ بَعَثَ فِي الْاُمِّيّٖنَ رَسُوْلًا مِّنْهُمْ يَتْلُوْا عَلَيْهِمْ اٰيٰتِهٖ وَيُزَكِّيْهِمْ وَيُعَلِّمُهُمُ الْكِتٰبَ وَالْحِكْمَةَ ۤ وَاِنْ كَانُوْا مِنْ قَبْلُ لَفِيْ ضَلٰلٍ مُّبِيْنٍ",
        "Urdu" : "وہ (اللہ) وہی ہے جس نے (عرب کے) ان ان پڑھوں میں ان ہی میں سے ایک ایسا عظیم الشان رسول بھیجا جو کہ پڑھ پڑھ کر سناتا (سمجھاتا) ہے ان کو اس کی آیتیں اور وہ سنوارتا (نکھارتا) ہے ان کے باطن کو اور سکھاتا (پڑھاتا) ہے ان کو کتاب و حکمت (کے مطالب و معانی کے انمول خزانے) جب کہ یہ لوگ اس سے قبل یقینا پڑے تھے کھلی گمراہی میں",
        "English" : "He is the One who raised amidst the unlettered people a messenger from among themselves who recites to them His verses, and purifies them, and teaches them the Book and the wisdom, while they were earlier in open error."
      },
      {
        "ayet_no" : 3,
        "arbi" : "وَّاٰخَرِيْنَ مِنْهُمْ لَمَّا يَلْحَقُوْا بِهِمْ ۭ وَهُوَ الْعَزِيْزُ الْحَكِيْمُ",
        "Urdu" : "نیز (اس رسول کی تشریف آوری) ان دوسرے تمام لوگوں کے لئے بھی ہے جو ابھی تک ان سے نہیں ملے اور وہی (اللہ) ہے سب پر غالب نہایت حکمت والا",
        "English" : "And (this Messenger is sent also) to others from them who did not join them so far, and He is the All-Mighty, the All-Wise."
      },
      {
        "ayet_no" : 4,
        "arbi" : "ذٰلِكَ فَضْلُ اللّٰهِ يُؤْتِيْهِ مَنْ يَّشَاۗءُ ۭ وَاللّٰهُ ذُو الْفَضْلِ الْعَظِيْمِ",
        "Urdu" : "یہ اللہ کا فضل ہے وہ اس کو جسے چاہتا ہے عطا فرما دیتا ہے اور اللہ بڑا ہی فضل کرنے والا ہے ف۱",
        "English" : "It is Allah‘s bounty that He gives to whomsoever He wills, and Allah is the Lord of the great bounty."
      },
      {
        "ayet_no" : 5,
        "arbi" : "مَثَلُ الَّذِيْنَ حُمِّلُوا التَّوْرٰىةَ ثُمَّ لَمْ يَحْمِلُوْهَا كَمَثَلِ الْحِمَارِ يَحْمِلُ اَسْفَارًا   ۭ بِئْسَ مَثَلُ الْقَوْمِ الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِ اللّٰهِ   ۭ وَاللّٰهُ لَا يَهْدِي الْقَوْمَ الظّٰلِمِيْنَ",
        "Urdu" : "مثال ان لوگوں کی جن سے اٹھوائی گئی تورات (اور ان کو اس پر عمل کا پابند کیا گیا) مگر انہوں نے اس کا بار نہ اٹھایا (اور اس پر عمل نہ کیا) اس گدھے کی سی ہے جس کی پیٹھ پر لدی ہوں بہت سی (بھاری بھر کم) کتابیں بڑی ہی بری مثال ہے ان لوگوں کی جنہوں نے جھٹلایا اللہ کی آیتوں کو اور اللہ نہیں نوازتا ہدایت (کی دولت عظیم) سے ایسے ظالم لوگوں کو ف۲",
        "English" : "The example of those who were ordered to bear (the responsibility of acting upon) the Torah, then they did not bear it, is like a donkey that carries a load of books. Evil is the example of those who have rejected Allah‘s verses. And Allah does not guide the wrongdoing people."
      },
      {
        "ayet_no" : 6,
        "arbi" : "قُلْ يٰٓاَيُّهَا الَّذِيْنَ هَادُوْٓا اِنْ زَعَمْتُمْ اَنَّكُمْ اَوْلِيَاۗءُ لِلّٰهِ مِنْ دُوْنِ النَّاسِ فَتَمَنَّوُا الْمَوْتَ اِنْ كُنْتُمْ صٰدِقِيْنَ",
        "Urdu" : "(ان سے) کہو کہ اے وہ لوگوں جو یہودی بن گئے ہو اگر تم نے یہ سمجھ رکھا ہے کہ تم اللہ کے دوست (اور پیار ے) ہو باقی لوگوں کو چھوڑ کر تو تم تمنا کرو موت کی اگر تم سچے ہو (اپنے قول و قرار میں)",
        "English" : "Say, :O you who are Jews, if you claim that you are the friends of Allah to the exclusion of all other people, then express your desire for death, if you are true."
      },
      {
        "ayet_no" : 7,
        "arbi" : "وَلَا يَتَمَنَّوْنَهٗٓ اَبَدًۢا بِمَا قَدَّمَتْ اَيْدِيْهِمْ ۭ وَاللّٰهُ عَلِيْمٌۢ بِالظّٰلِمِيْنَ",
        "Urdu" : "مگر وہ کبھی بھی اس کی تمنا نہیں کریں گے بوجہ اپنے ان کرتوتوں کے جو وہ خود اپنے ہاتھوں آگے بھیج چکے ہیں اور اللہ خوب جانتا ہے ایسے ظالموں کو ف۱",
        "English" : "And they will never express this desire, because of what their hands have sent ahead. And Allah is fully aware of the wrongdoers."
      },
      {
        "ayet_no" : 8,
        "arbi" : "قُلْ اِنَّ الْمَوْتَ الَّذِيْ تَفِرُّوْنَ مِنْهُ فَاِنَّهٗ مُلٰقِيْكُمْ ثُمَّ تُرَدُّوْنَ اِلٰى عٰلِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُوْنَ",
        "Urdu" : "(ان سے) کہو کہ یہ قطعی حقیقت ہے کہ جس موت سے تم لوگ بھاگتے ہو وہ بہر طور تمہیں آ کر رہے گی پھر تم سب کو آخرکار بہرحال لوٹ کر جانا ہے اس (ذات اقدس و اعلیٰ) کے حضور جو ایک برابر جانتا ہے نہاں اور عیاں کو تب وہ خبر کر دے گا تم کو ان سب کاموں کی جو تم لوگ (زندگی بھر) کرتے رہے تھے",
        "English" : "Say, :Indeed, the death from which you (try to) run away has to visit you, then you will be sent back to the Knower of the Unseen and the seen, and He will tell you what you used to do."
      },
      {
        "ayet_no" : 9,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِذَا نُوْدِيَ لِلصَّلٰوةِ مِنْ يَّوْمِ الْجُمُعَةِ فَاسْعَوْا اِلٰى ذِكْرِ اللّٰهِ وَذَرُوا الْبَيْعَ ۭ ذٰلِكُمْ خَيْرٌ لَّكُمْ اِنْ كُنْتُمْ تَعْلَمُوْنَ",
        "Urdu" : "اے وہ لوگوں جو ایمان لائے ہو جب اذان دی جائے نماز کے لئے جمعہ کے دن تو تم دوڑ پڑا کرو اللہ کے ذکر (اور اس کی یاد دلشاد) کی طرف اور چھوڑ دیا کرو تم خرید و فروخت (اور ہر طرح کے کاروبار) کو یہ تمہارے لئے کہیں زیادہ بہتر ہے اگر تم جانو",
        "English" : "O you who believe, when the call for Salah (prayer) is proclaimed on Friday, hasten for the remembrance of Allah, and leave off business. That is much better for you, if you but know."
      },
      {
        "ayet_no" : 10,
        "arbi" : "فَاِذَا قُضِيَتِ الصَّلٰوةُ فَانْتَشِرُوْا فِي الْاَرْضِ وَابْتَغُوْا مِنْ فَضْلِ اللّٰهِ وَاذْكُرُوا اللّٰهَ كَثِيْرًا لَّعَلَّكُمْ تُفْلِحُوْنَ",
        "Urdu" : "پھر جب ادا کردی جائے نماز تو تم لوگ پھیل جایا کرو (اللہ کی) زمین میں اور تلاش کیا کرو اللہ کا فضل (اور اس کی مہربانی یعنی تمہیں اس کی اجازت ہے) اور یاد کرتے رہا کرو تم لوگ (ہمیشہ اور ہر حال میں اور) کثرت کے ساتھ (اپنے) اللہ کو تاکہ تم فلاح پاسکو",
        "English" : "Then once the Salah is over, disperse in the land, and seek the grace of Allah, and remember Allah abundantly, so that you may be successful."
      },
      {
        "ayet_no" : 11,
        "arbi" : "وَاِذَا رَاَوْا تِجَارَةً اَوْ لَهْوَۨا انْفَضُّوْٓا اِلَيْهَا وَتَرَكُوْكَ قَاۗىِٕمًا   ۭ قُلْ مَا عِنْدَ اللّٰهِ خَيْرٌ مِّنَ اللَّهْوِ وَمِنَ التِّجَارَةِ    ۭ وَاللّٰهُ خَيْرُ الرّٰزِقِيْنَ",
        "Urdu" : "اور (ان لوگوں کا حال یہ ہے کہ) جب انہوں نے دیکھ لیا کوئی سامان تجارت یا کسی طرح کا کوئی (کھیل) تماشہ تو ٹوٹ پڑے اس پر اور چھوڑ دیا آپ کو کھڑا (اے پیغمبر سو ان سے) کہو کہ جو کچھ اللہ کے پاس ہے وہ بہرحال کہیں بہتر (اور بڑھیا) ہے ایسے (کھیل) تماشے اور سامان تجارت سے اور اللہ سب سے اچھا روزی دینے والا ہے ف۲",
        "English" : "And when they beheld merchandise or sport, they flocked thereto, and left thee standing. Say thou: that which is with Allah is better than sport and better than merchandise; and Allah is the Best of providers."
      }
    ]
  }
]