[
  {
    "surah_no" : 19,
    "total_ayah" : 98,
    "name" : "Surah e Maryam",
    "detail" : [

      {
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے (پاک) نام سے شروع کرتا ہوں جو کہ بڑا مہربان، نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "كۗهٰيٰعۗصۗ",
        "Urdu" : "کهيعص",
        "English" : "Kaf- Ha-Ya-'Ain-Sad."
      },
      {
        "ayet_no" : 2,
        "arbi" : "ذِكْرُ رَحْمَتِ رَبِّكَ عَبْدَهٗ زَكَرِيَّا",
        "Urdu" : "یہ ذکر ہے تیرے رب کی اس رحمت کا جو اس نے اپنے ایک خاص بندے زکریا پر فرمائی",
        "English" : "Mention of the mercy of thy Lord to His bondman Zakariyya."
      },
      {
        "ayet_no" : 3,
        "arbi" : "اِذْ نَادٰى رَبَّهٗ نِدَاۗءً خَفِيًّا",
        "Urdu" : "جب کہ اس نے پکارا اپنے رب کو چپکے سے",
        "English" : "Recall what time he cried unto his Lord with a cry secret."
      },
      {
        "ayet_no" : 4,
        "arbi" : "قَالَ رَبِّ اِنِّىْ وَهَنَ الْعَظْمُ مِنِّيْ وَاشْتَعَلَ الرَّاْسُ شَيْبًا وَّلَمْ اَكُنْۢ بِدُعَاۗىِٕكَ رَبِّ شَقِيًّا",
        "Urdu" : "اور عرض کیا اے میرے پروردگار میری ہڈیاں تک گھل گئی ہیں اور بڑھاپے سے میرا سر بھڑک اٹھا ہے ۔ اور میں کبھی آپ سے دعا مانگنے میں نامراد و ناکام نہیں ہوا ف۳",
        "English" : "He said, :My Lord, I am in a state that bones in my body have turned feeble, and the head has flared up grey with old age, and I never remained, My Lord, unanswered in my prayer to You."
      },
      {
        "ayet_no" : 5,
        "arbi" : "وَاِنِّىْ خِفْتُ الْمَوَالِيَ مِنْ وَّرَاۗءِيْ وَكَانَتِ امْرَاَتِيْ عَاقِرًا فَهَبْ لِيْ مِنْ لَّدُنْكَ وَلِيًّا",
        "Urdu" : "اور میں ڈرتا ہوں اپنے پیچھے اپنے رشتہ داروں سے اور میری بیوی بانجھ ہے پس تو اے میرے مالک! مجھے اپنے یہاں سے ایک ایسا جانشین عطا فرما دے",
        "English" : "And verily I fear my kindred after me, and my wife hath been barren; so bestow on me from before Thee an heir."
      },
      {
        "ayet_no" : 6,
        "arbi" : "يَّرِثُنِيْ وَيَرِثُ مِنْ اٰلِ يَعْقُوْبَ ڰ وَاجْعَلْهُ رَبِّ رَضِيًّا",
        "Urdu" : "جو میرا بھی وارث ہو اور یعقوب کے خاندان کا بھی اور اے میرے رب اس کو ایک پسندیدہ انسان بنا ۔ ف۱",
        "English" : "Inheriting me and inheriting the Children of Ya'qub; and make him, my Lord, acceptable!"
      },
      {
        "ayet_no" : 7,
        "arbi" : "يٰزَكَرِيَّآ اِنَّا نُبَشِّرُكَ بِغُلٰمِۨ اسْمُهٗ يَحْــيٰى ۙ لَمْ نَجْعَلْ لَّهٗ مِنْ قَبْلُ سَمِيًّا",
        "Urdu" : "جواب ملا اے زکریا ہم تمہیں ایک ایسے لڑکے کی خوشخبری دیتے ہیں جس کا نام یحیٰی ہوگا اور ہم نے اس سے پہلے اس کا کوئی ہم نام پیدا نہیں کیا ۔ ف۲",
        "English" : "O Zakariyya! verily We give thee the glad tidings of a boy: his name shall be Yahya; We have not afore-time made his namesake."
      },
      {
        "ayet_no" : 8,
        "arbi" : "قَالَ رَبِّ اَنّٰى يَكُوْنُ لِيْ غُلٰمٌ وَّكَانَتِ امْرَاَتِيْ عَاقِرًا وَّقَدْ بَلَغْتُ مِنَ الْكِبَرِ عِتِيًّا",
        "Urdu" : "عرض کیا اے میرے رب میرے یہاں لڑکا کیسے ہوگا، جب کہ میری بیوی بانجھ ہے، اور میں خود پہنچ چکا ہوں بڑھاپے کی انتہا کو ؟",
        "English" : "He Said, :My Lord, how shall there be a boy for me while my wife is barren, and I have reached the extreme of old age ?"
      },
      {
        "ayet_no" : 9,
        "arbi" : "قَالَ كَذٰلِكَ  ۚ قَالَ رَبُّكَ هُوَ عَلَيَّ هَيِّنٌ وَّقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَـيْـــــًٔـا",
        "Urdu" : "جواب ملا ایسے ہی ہوگا، تمہارے رب نے کہا کہ یہ میرے لیے بڑا آسان ہے آخر میں اس سے پہلے خود تمہیں بھی پیدا کر چکا ہوں، جب کہ تم کچھ بھی نہ تھے،",
        "English" : "He said, :So it is; your Lord said _it is easy for Me, and I did create you before, when you were nothing.‘"
      },
      {
        "ayet_no" : 10,
        "arbi" : "قَالَ رَبِّ اجْعَلْ لِّيْٓ اٰيَةً ۭ قَالَ اٰيَتُكَ اَلَّا تُكَلِّمَ النَّاسَ ثَلٰثَ لَيَالٍ سَوِيًّا",
        "Urdu" : "اس پر زکریا علیہ السلام نے عرض کیا اچھا تو اے میرے رب، میرے لیے اس پر کوئی نشانی مقرر فرما دیجئے، ارشاد ہوا تمہارے لیے نشانی یہ ہے کہ تم تین دن رات تک لوگوں سے بات نہیں کر سکو گے جب کہ تم صحیح سالم ہو گے،",
        "English" : "He said, :My Lord, make for me a sign. He said, : Your sign is that you will not (be able to) speak to the people for three (consecutive) nights, even though you will be sound in health."
      },
      {
        "ayet_no" : 11,
        "arbi" : "فَخَرَجَ عَلٰي قَوْمِهٖ مِنَ الْمِحْرَابِ فَاَوْحٰٓى اِلَيْهِمْ اَنْ سَبِّحُوْا بُكْرَةً وَّعَشِـيًّا",
        "Urdu" : "چنانچہ وہ اپنے حجرے سے نکل کراپنی قوم کے پاس آئے، تو انھیں اشارے سے کہا کہ تم لوگ تسبیح کرو اپنے رب کی صبح و شام،",
        "English" : "Then he came out to his people from the place of prayer, and directed them by gestures to proclaim the purity of Allah at morning and evening."
      },
      {
        "ayet_no" : 12,
        "arbi" : "يٰــيَحْـيٰى خُذِ الْكِتٰبَ بِقُوَّةٍ ۭ وَاٰتَيْنٰهُ الْحُكْمَ صَبِيًّا",
        "Urdu" : "پھر جب یحییٰ پیدا ہو کر سن شعور کو پہنچ گئے تو ان کو حکم ہوا اے یحییٰ مضبوطی سے تھام لو تم ہماری کتاب کو اور ہم نے انھیں بچپن ہی میں نواز دیا تھا حکم سے",
        "English" : "(When the child was born, Allah said to him,) :O YaHya, hold on to the Book firmly. And We gave him wisdom, while he was still a child,"
      },
      {
        "ayet_no" : 13,
        "arbi" : "وَّحَنَانًا مِّنْ لَّدُنَّا وَزَكٰوةً ۭ وَكَانَ تَقِيًّا",
        "Urdu" : "اور نہیں ہم نےاپنی طرف سے ایک عظیم رحمدلی بھی عطا کی تھی اور پاکیزگی بھی اور وہ بڑے پرہیزگار تھے",
        "English" : "And tenderness from Our presence and purity, and he was God-fearing."
      },
      {
        "ayet_no" : 14,
        "arbi" : "وَّځ ابِوَالِدَيْهِ وَلَمْ يَكُنْ جَبَّارًا عَصِيًّا",
        "Urdu" : "اور وہ بڑے نیکوکار اور خدمت گزار تھے اپنے ماں باپ کے ساتھ، اور ان میں کسی بھی طرح کی نہ کوئی سرکشی تھی نہ نافرمانی،",
        "English" : "And duteous unto his parents, and Was not high-handed rebel."
      },
      {
        "ayet_no" : 15,
        "arbi" : "وَسَلٰمٌ عَلَيْهِ يَوْمَ وُلِدَ وَيَوْمَ يَمُوْتُ وَيَوْمَ يُـبْعَثُ حَيًّا",
        "Urdu" : "سلام ہو اس پر، جس دن کہ وہ پیدا ہوا اور جس دن وہ مرے گا، اور جس دن اس کو اٹھایا جائے گا زندہ کر کے ۔",
        "English" : "Peace on him the day he was born, the day he dies and the day he will be raised alive."
      },
      {
        "ayet_no" : 16,
        "arbi" : "وَاذْكُرْ فِى الْكِتٰبِ مَرْيَمَ ۘاِذِ انْتَبَذَتْ مِنْ اَهْلِهَا مَكَانًا شَرْقِيًّا",
        "Urdu" : "اور اس کتاب میں ان کو مریم علیہا السلام کا قصہ بھی پڑھ کر سنا دو، جب کہ وہ اپنے گھر والوں سے علیحدہ ہو کر مشرقی جانب کی ایک جگہ میں جا بیٹھیں - ف۱",
        "English" : "And mention in the Book (the Qur'n, O Muhammad , the story of) Maryam (Mary), when she withdrew in seclusion from her family to a place facing east."
      },
      {
        "ayet_no" : 17,
        "arbi" : "فَاتَّخَذَتْ مِنْ دُوْنِهِمْ حِجَابًا    ڨ فَاَرْسَلْنَآ اِلَيْهَا رُوْحَنَا فَتَمَثَّلَ لَهَا بَشَرًا سَوِيًّا",
        "Urdu" : "پھر انہوں نے ان لوگوں کے سامنے ایک پردہ ڈال لیا، اس وقت ہم نے اپنا فرشتہ ان کے پاس بھیجا تو وہ ایک پورے انسان کی شکل میں ان کے سامنے نمودار ہوا ف۲",
        "English" : "Then she took beside them a curtain; then We sent unto her Our Spirit, and he took unto her the form of a human being sound."
      },
      {
        "ayet_no" : 18,
        "arbi" : "قَالَتْ اِنِّىْٓ اَعُوْذُ بِالرَّحْمٰنِ مِنْكَ اِنْ كُنْتَ تَقِيًّا",
        "Urdu" : "تب مریم علیہا السلام اسے ایک انسان سمجھ کر فوراً بول اٹھیں کہ میں تجھ سے خدائے رحمان کی پناہ مانگتی ہوں اگر تو کوئی خدا ترس انسان ہے، ف۳",
        "English" : "She said: verily seek refuge with the Compassionate from thee if thou art God-fearing."
      },
      {
        "ayet_no" : 19,
        "arbi" : "قَالَ اِنَّمَآ اَنَا رَسُوْلُ رَبِّكِ ڰ لِاَهَبَ لَكِ غُلٰمًا زَكِيًّا",
        "Urdu" : "اس نے کہا ڈرو نہیں کہ میں کوئی انسان نہیں بلکہ میں تو تمہارے رب کا فرستادہ ہوں اور اس لیے بھیجا گیا ہوں کہ تاکہ تمہیں ایک پاکیزہ لڑکا دوں، ف٤",
        "English" : "(The angel) said: (I am only a Messenger from your Lord, (to announce) to you the gift of a righteous son.)"
      },
      {
        "ayet_no" : 20,
        "arbi" : "قَالَتْ اَنّٰى يَكُوْنُ لِيْ غُلٰمٌ وَّلَمْ يَمْسَسْنِيْ بَشَرٌ وَّلَمْ اَكُ بَغِيًّا",
        "Urdu" : "مریم علیہا السلام نے کہا کہ میرے یہاں لڑکا کیسے ہوگا، جب کہ مجھے کسی انسان نے چھوا تک نہیں، اور نہ ہی میں کوئی بدکار عورت ہوں ؟",
        "English" : "She said: (How can I have a son, when no man has touched me, nor am I unchaste ? )"
      },
      {
        "ayet_no" : 21,
        "arbi" : "قَالَ كَذٰلِكِ ۚ قَالَ رَبُّكِ هُوَ عَلَيَّ هَيِّنٌ ۚ وَلِنَجْعَلَهٗٓ اٰيَةً لِّلنَّاسِ وَرَحْمَةً مِّنَّا  ۚ وَكَانَ اَمْرًا مَّقْضِيًّا",
        "Urdu" : "کہا ایسے ہی ہوگا تمہارے رب نے فرمایا ہے کہ یہ میرے لیے بہت آسان ہے اور یہ بھی فرمایا کہ ہم یہ اس لیے کریں گے تاکہ ہم اس لڑکے کو ایک نشانی بنا دیںاپنی قدرت و عنایت کی سب لوگوں کے لیے اور ایک رحمتاپنی طرف سے، اور یہ ایک طے شدہ بات ہے،",
        "English" : "He said: even so! Thy Lord saith: it is With Me easy, and it is in order that We may make him a sign unto mankind and a mercy from Us, and it is an affair decreed."
      },
      {
        "ayet_no" : 22,
        "arbi" : "فَـحَمَلَتْهُ فَانْتَبَذَتْ بِهٖ مَكَانًا قَصِيًّا",
        "Urdu" : "سو مریم علیہا السلام کو اس بچے کا حمل ہوگیا، تو وہ اسے لے کر ایک دور جگہ چلی گئیں،",
        "English" : "So she conceived him, and she withdrew with him to a far place (i.e. Bethlehem valley about 4-6 miles from Jerusalem)."
      },
      {
        "ayet_no" : 23,
        "arbi" : "فَاَجَاۗءَهَا الْمَخَاضُ اِلٰى جِذْعِ النَّخْلَةِ  ۚ قَالَتْ يٰلَيْتَنِيْ مِتُّ قَبْلَ ھٰذَا وَكُنْتُ نَسْيًا مَّنْسِيًّا",
        "Urdu" : "پھر پہنچا دیا ان کو دردِ زہ کی شدت نے کھجور کے درخت کے نیچے، تب انہوں نے حسرت بھرے انداز میں کہا اے کاش کہ میں مر گئی ہوتی اس سے پہلے، اور میرا کوئی نام و نشان بھی باقی نہ رہ گیا ہوتا، ف۵",
        "English" : "Then the labour pains brought her to the trunk of a palm-tree. She said :O that I would have died before this, and would have been something gone, forgotten."
      },
      {
        "ayet_no" : 24,
        "arbi" : "فَنَادٰىهَا مِنْ تَحْتِهَآ اَلَّا تَحْزَنِيْ قَدْ جَعَلَ رَبُّكِ تَحْتَكِ سَرِيًّا",
        "Urdu" : "تب فرشتے نے ان کو ان کے ایک نشیبی مقام سے پکار کر کہا، غم نہ کر، تمہارے رب نے تمہارے نیچے ایک چشمہ رواں کر دیا ہے",
        "English" : "Then he called her from beneath her: :Do not grieve; your Lord has placed a stream beneath you."
      },
      {
        "ayet_no" : 25,
        "arbi" : "وَهُزِّيْٓ اِلَيْكِ بِجِذْعِ النَّخْلَةِ تُسٰقِطْ عَلَيْكِ رُطَبًا جَنِيًّا",
        "Urdu" : "اور ہلاؤ تماپنی طرف کھجور کے اس تنے کو، یہ گرائے گا تم پر تروتازہ کھجوریں،",
        "English" : "And shake toward thee the trunk of the palm-tree it shall drop on thee dates fresh and ripe."
      },
      {
        "ayet_no" : 26,
        "arbi" : "فَكُلِيْ وَاشْرَبِيْ وَقَرِّيْ عَيْنًا ۚ فَاِمَّا تَرَيِنَّ مِنَ الْبَشَرِ اَحَدًا ۙ فَقُوْلِيْٓ اِنِّىْ نَذَرْتُ لِلرَّحْمٰنِ صَوْمًا فَلَنْ اُكَلِّمَ الْيَوْمَ اِنْسِـيًّا",
        "Urdu" : "پس تم کھاؤ پیو اور ٹھنڈا کرواپنی انکھوں کو، پھر اگر تمہیں کوئی آدمی نظر آئے اور اعتراض کرے تو تو اس کو اشارے سے کہہ دو کہ میں نے خدائے رحمان کے لیے نہ بولنے کے روزے کی نذر مان رکھی ہے لہذا میں آج کسی انسان سے بات نہیں کروں گی، ف۱",
        "English" : "So eat, drink and cool your eyes. Then if you see any human being, say (to him), :I have vowed a fast (of silence) for the All-Merciful (Allah,) and therefore, I shall never speak to any human today."
      },
      {
        "ayet_no" : 27,
        "arbi" : "فَاَتَتْ بِهٖ قَوْمَهَا تَحْمِلُهٗ  ۭ قَالُوْا يٰمَرْيَمُ لَقَدْ جِئْتِ شَـيْـــــًٔـا فَرِيًّا",
        "Urdu" : "پھر وہ اس بچے کو لیےاپنی قوم کے پاس آئیں تو وہ لوگ بچے کو دیکھتے ہی بول پڑے کہ اے مریم، تو نے تو بڑے غضب کا کام کر ڈالا،",
        "English" : "Then she came to her people carrying him (the baby). They said, :O Maryam you have committed something grave indeed."
      },
      {
        "ayet_no" : 28,
        "arbi" : "يٰٓاُخْتَ هٰرُوْنَ مَا كَانَ اَبُوْكِ امْرَاَ سَوْءٍ وَّمَا كَانَتْ اُمُّكِ بَغِيًّا",
        "Urdu" : "اے ہارون کی بہن، نہ تو تیرا باپ کوئی برا آدمی تھا اور نہ ہی تیری ماں کوئی بدکار عورت تھی",
        "English" : "O sister of Harun: thy father was not a man of evil, nor was thy mother a harlot."
      },
      {
        "ayet_no" : 29,
        "arbi" : " فَاَشَارَتْ اِلَيْهِ ۭ قَالُوْا كَيْفَ نُكَلِّمُ مَنْ كَانَ فِي الْمَهْدِ صَبِيًّا",
        "Urdu" : "تو پھر تو نے یہ غضب کس طرح ڈھایا ہے؟ اس کے جواب میں مریم علیہا السلام نے اس بچے کی طرف اشارہ کر دیا، ف۲ اس پر ان لوگوں نے کہا کہ ہم گہوارے میں پڑے ہوئے ایک بچے سے کیونکر بات کر سکتے ہیں ؟",
        "English" : "Then she Pointed to him. They said: how shall we speak to one who is in the cradle, a child ?"
      },
      {
        "ayet_no" : 30,
        "arbi" : "قَالَ اِنِّىْ عَبْدُ اللّٰهِ ڜ اٰتٰىنِيَ الْكِتٰبَ وَجَعَلَنِيْ نَبِيًّا",
        "Urdu" : "اتنے میں وہ معصوم بچہ خود بول اٹھا کہ بیشک میں اللہ کا بندہ ہوں، اس نے مجھے کتاب بخشی ہے اور مجھے نبی بنایا ہے",
        "English" : "He Said: verily I am a bondman of Allah; He hath vouchsafed me the Book and made me a prophet."
      },
      {
        "ayet_no" : 31,
        "arbi" : "وَّجَعَلَنِيْ مُبٰرَكًا اَيْنَ مَا كُنْتُ  ۠‎وَاَوْصٰىنِيْ بِالصَّلٰوةِ وَالزَّكٰوةِ مَا دُمْتُ حَيًّا",
        "Urdu" : "اور مجھے برکت والا بنایا ہے، جہاں کہیں بھی میں ہوں گا اور مجھے تاکید فرمائی نماز اور زکوٰة کی جب تک میں زندہ رہوں - ف۳",
        "English" : "And He has made me blessed wheresoever I be, and has enjoined on me Salt (prayer), and Zakat, as long as I live."
      },
      {
        "ayet_no" : 32,
        "arbi" : "وَځ ا بِوَالِدَتِيْ ۡ وَلَمْ يَجْعَلْنِيْ جَبَّارًا شَقِيًّا",
        "Urdu" : "اس نے مجھے نیک سلوک کرنے والا بنایااپنی والدہ کے ساتھ، اور مجھے کوئی سرکش اور بدبخت انسان نہیں بنایا،",
        "English" : "And dutiful to my mother, and He has not made me insolent, un-blessed;"
      },
      {
        "ayet_no" : 33,
        "arbi" : "وَالسَّلٰمُ عَلَيَّ يَوْمَ وُلِدْتُّ وَيَوْمَ اَمُوْتُ وَيَوْمَ اُبْعَثُ حَيًّا",
        "Urdu" : "اور سلام ہو مجھ پر جس دن کہ میں پیدا ہوا اور جس دن میں مروں گا، اور جس دن مجھے اٹھایا جائے گا زندہ کر کے ۔",
        "English" : "And peace is upon me the day I was born, the day I shall die, and the day I shall be raised alive again."
      },
      {
        "ayet_no" : 34,
        "arbi" : "ذٰلِكَ عِيْسَى ابْنُ مَرْيَمَ ۚ قَوْلَ الْحَــقِّ الَّذِيْ فِيْهِ يَمْتَرُوْنَ",
        "Urdu" : "یہ ہے عیسیٰ علیہ السلام بیٹا مریم کا، ہم عینِ حق کہتے ہیں اس بات کے بارے میں جس میں کہ یہ لوگ جھگڑ رہے ہیں،",
        "English" : "Such is 'lsa, son of Maryam: this Is the word of truth wherein they are doubting."
      },
      {
        "ayet_no" : 35,
        "arbi" : "مَا كَانَ لِلّٰهِ اَنْ يَّــتَّخِذَ مِنْ وَّلَدٍ  ۙ سُبْحٰــنَهٗ  ۭ اِذَا قَضٰٓى اَمْرًا فَاِنَّمَا يَقُوْلُ لَهٗ كُنْ فَيَكُوْنُ",
        "Urdu" : "اللہ کے شایان نہیں کہ وہ کسی کو اپنا بیٹا بنائے، وہ پاک ہے، اس کو جب کوئی کام کرنا ہوتا ہے تو وہ صرف اتنا فرماتا ہے کہ ہو جا پس وہ ہو چکا ہوتا ہے",
        "English" : "Allah is not one to take to Himself a son. Hallowed be He! whensoever He decree an affair he only Saith to it: be, and it become."
      },
      {
        "ayet_no" : 36,
        "arbi" : "وَاِنَّ اللّٰهَ رَبِّيْ وَرَبُّكُمْ فَاعْبُدُوْهُ ۭھٰذَا صِرَاطٌ مُّسْتَقِيْمٌ",
        "Urdu" : "اور عیسیٰ علیہ السلام نے یہ بھی کہا کہ بلاشبہ اللہ ہے رب میرا بھی اور تمہارا بھی، پس تم لوگ اسی کی بندگی کرو کہ خالص توحید والا یہی ہے سیدھا راستہ ۔ ف۱",
        "English" : "And verily Allah is my Lord and your Lord; so worship Him; this is a way straight."
      },
      {
        "ayet_no" : 37,
        "arbi" : "فَاخْتَلَفَ الْاَحْزَابُ مِنْۢ بَيْنِهِمْ  ۚ فَوَيْلٌ لِّـلَّذِيْنَ كَفَرُوْا مِنْ مَّشْهَدِ يَوْمٍ عَظِيْمٍ",
        "Urdu" : "پھر بھی مختلف جماعتیں آ پس میں اختلاف میں پڑ گئیں ۔ سو بڑی خرابی ہے ان لوگوں کے لیے جنہوں نے کفر و انکار کیا ایک بڑے دن کے انے سے",
        "English" : "Then the groups among them fell in dispute. So, how evil is the fate of the disbelievers when they have to face the Great Day."
      },
      {
        "ayet_no" : 38,
        "arbi" : "اَسْمِعْ بِهِمْ وَاَبْصِرْ ۙيَوْمَ يَاْتُوْنَنَا لٰكِنِ الظّٰلِمُوْنَ الْيَوْمَ فِيْ ضَلٰلٍ مُّبِيْنٍ",
        "Urdu" : "کیا ہی خوب سنتے اور دیکھتے ہوں گے یہ لوگ اس دن جس دن کہ یہ ہمارے پاس آئیں گے مگر آج یہ ظالم حق سے انکھ اور کان بند کر کے کھلی گمراہی میں پڑے ہوئے ہیں ف۲",
        "English" : "How strong will their hearing be, and how strong their vision, the day they will come to Us! But today the transgressors are straying in clear error."
      },
      {
        "ayet_no" : 39,
        "arbi" : "وَاَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ اِذْ قُضِيَ الْاَمْرُ  ۘ وَهُمْ فِيْ غَفْلَةٍ وَّهُمْ لَا يُؤْمِنُوْنَ",
        "Urdu" : "اور خبردار کرتے رہو ان کو اے پیغمبر! حسرت کے اس دن سے جب کہ فیصلہ کر دیا جائے گا معاملے کا عملی اور آخری طور پر اور یہ ہیں کہ غفلت میں پڑے ایمان نہیں لاتے ۔ ف۳",
        "English" : "Warn them of The Day of Remorse when the whole thing will be settled, while they are heedless and do not believe."
      },
      {
        "ayet_no" : 40,
        "arbi" : "اِنَّا نَحْنُ نَرِثُ الْاَرْضَ وَمَنْ عَلَيْهَا وَاِلَيْنَا يُرْجَعُوْنَ",
        "Urdu" : "اور بلاشبہ آخرکار ہماری ہی ہو کر رہے گی یہ زمین اور وہ سب بھی جو اس کے اوپر ہیں اور ہماری ہی طرف لوٹ کر انا ہے ان سب نے،",
        "English" : "Surely We, only We, shall be the ultimate owner of the earth and all those on it, and to Us they will be returned."
      },
      {
        "ayet_no" : 41,
        "arbi" : "وَاذْكُرْ فِي الْكِتٰبِ اِبْرٰهِيْمَ ڛ اِنَّهٗ كَانَ صِدِّيْقًا نَّبِيًّا",
        "Urdu" : "اور ان کو اے پیغمبر اس کتاب میں ابراہیم کا قصہ بھی پڑھ کر سناؤ، بیشک وہ بڑے ہی راست باز اور عظیم الشان پیغمبر تھے",
        "English" : "And mention in the Book (the Qur'n) Ibrhim (Abraham). Verily! He was a man of truth, a Prophet."
      },
      {
        "ayet_no" : 42,
        "arbi" : "اِذْ قَالَ لِاَبِيْهِ يٰٓاَبَتِ لِمَ تَعْبُدُ مَا لَا يَسْمَعُ وَلَا يُبْصِرُ وَلَا يُغْنِيْ عَنْكَ شَـيْــــــًٔــا",
        "Urdu" : "اور خاص کر یاد کرو کہ جب انہوں نے درد بھرے انداز میں اپنے باپ سے کہا، ابا جان آپ کیوں ایسی چیزوں کی پوجا کرتے ہیں جو نہ سنتی ہیں نہ دیکھتی ہیں اور نہ ہی وہ آپ کے کچھ کام آسکتی ہیں ؟",
        "English" : "When he said to his father: (O my father! Why do you worship that which hears not, sees not and cannot avail you in anything) ?"
      },
      {
        "ayet_no" : 43,
        "arbi" : "يٰٓاَبَتِ اِنِّىْ قَدْ جَاۗءَنِيْ مِنَ الْعِلْمِ مَا لَمْ يَاْتِكَ فَاتَّبِعْنِيْٓ اَهْدِكَ صِرَاطًا سَوِيًّا",
        "Urdu" : "ابا جان، میرے پاس ایسا علم آگیا ہے جو آپ کے پاس نہیں آیا، لہذا آپ میرے کہنے پر چلیں، میں آپ کو سیدھا راستہ بتاؤں گا،",
        "English" : "My dear father, indeed there has come to me a knowledge that has not come to you; so, follow me, and I shall lead you to a straight path."
      },
      {
        "ayet_no" : 44,
        "arbi" : "يٰٓاَبَتِ لَا تَعْبُدِ الشَّيْطٰنَ ۭ اِنَّ الشَّيْطٰنَ كَانَ لِلرَّحْمٰنِ عَصِيًّا",
        "Urdu" : "ابا جان، آپ شیطان کی بندگی مت کریں، کیونکہ شیطان تو بلاشبہ خدائے رحمان کا نافرمان ہے،",
        "English" : "O My father! worship not the satan; hath been Unto the Compassionate a rebel."
      },
      {
        "ayet_no" : 45,
        "arbi" : "يٰٓاَبَتِ اِنِّىْٓ اَخَافُ اَنْ يَّمَسَّكَ عَذَابٌ مِّنَ الرَّحْمٰنِ فَتَكُوْنَ لِلشَّيْطٰنِ وَلِيًّا",
        "Urdu" : "ابا جان مجھے تو اس بات کا سخت ڈر ہے کہ کہیں آپ پر خدائے رحمان کی طرف سے کوئی ایسا عذاب آپڑے کہ آپ ہمیشہ کے لیے شیطان کے ساتھی بن کر رہ جائیں",
        "English" : "O my father! Lo! I fear lest a punishment from the Beneficent overtake thee so that thou become a comrade of the devil."
      },
      {
        "ayet_no" : 46,
        "arbi" : "قَالَ اَ رَاغِبٌ اَنْتَ عَنْ اٰلِــهَـتِيْ يٰٓاِبْرٰهِيْمُ ۚ لَىِٕنْ لَّمْ تَنْتَهِ لَاَرْجُمَـــنَّكَ وَاهْجُرْنِيْ مَلِيًّا",
        "Urdu" : "یہ سب کچھ سن لینے کے بعد اس نے کہا ابراہیم کیا تم میرے معبودوں سے پھر رہے ہو؟ سن لو اگر تم باز نہ آئے تو میں تمہیں سنگسار کردوں گا اور تم دور ہو جاؤ مجھ سے ہمیشہ کے لیے ۔ ف۱",
        "English" : "He said, :Are you averse to my gods O Ibrahim ? Should you not stop, I will definitely stone you. And leave me for good."
      },
      {
        "ayet_no" : 47,
        "arbi" : "قَالَ سَلٰمٌ عَلَيْكَ ۚ سَاَسْتَغْفِرُ لَكَ رَبِّيْ  ۭاِنَّهٗ كَانَ بِيْ حَفِيًّا",
        "Urdu" : "ابراہیم نے کہا اچھا تو سلام ہو آپ پر البتہ میں آپ کے لیے اپنے رب سے بخشش کی دعا کرتا رہوں گا کہ میرا رب بلاشبہ وہ مجھ پر بڑا ہی مہربان ہے",
        "English" : "He said: Peace be unto thee! I shall ask forgiveness of my Lord for thee. Lo! He was ever gracious unto me."
      },
      {
        "ayet_no" : 48,
        "arbi" : "وَاَعْتَزِلُكُمْ وَمَا تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ وَاَدْعُوْا رَبِّيْ ڮ عَسٰٓى اَلَّآ اَكُوْنَ بِدُعَاۗءِ رَبِّيْ شَقِيًّا",
        "Urdu" : "اور میں آپ لوگوں سے بھی کنارہ کشی اختیار کرتا ہوں اور ان سب چیزوں سے بھی جن کو تم لوگ پوجتے پکارتے ہو اللہ کے سوا، اور میں تو بہرحال اپنے رب کو ہی پکارتا رہوں گا، امید ہے کہ میں اپنے رب کو پکار کر کبھی محروم نہیں رہوں گا، ف۲",
        "English" : "And I go away from you and what you invoke besides Allah. And I shall invoke my Lord. Hopefully I shall not be a looser by invoking my Lord."
      },
      {
        "ayet_no" : 49,
        "arbi" : "فَلَمَّا اعْتَزَلَهُمْ وَمَا يَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ  ۙ وَهَبْنَا لَهٗٓ اِسْحٰقَ وَيَعْقُوْبَ  ۭ وَكُلًّا جَعَلْنَا نَبِيًّا",
        "Urdu" : "پھر جب وہ الگ ہوگئے ان سے اور ان کے ان تمام معبودان باطلہ سے جن کو وہ پوجتے پکارتے تھے خدا کے سوا، تو ہم نے انھیں اسحاق جیسا بیٹا بھی عطا کیا اور یعقوب جیسا پوتا بھی اور ان میں سے ہر ایک کو ہم نے نبوت سے سرفراز کیا ف۳",
        "English" : "So when he had turned away from them and from those whom they worshipped besidesAllah, We gave him Ishque (Isaac) and Ya'qb (Jacob), and each one of them We made a Prophet."
      },
      {
        "ayet_no" : 50,
        "arbi" : "وَوَهَبْنَا لَهُمْ مِّنْ رَّحْمَتِنَا وَجَعَلْنَا لَهُمْ لِسَانَ صِدْقٍ عَلِيًّا",
        "Urdu" : "ہم نے ان سب کواپنی رحمت سے نوازا اور ان کو سرفراز کیا سچی ناموری سے،",
        "English" : "And We bestowed on them of Our mercy, and We made for them a renown lofty."
      },
      {
        "ayet_no" : 51,
        "arbi" : "وَاذْكُرْ فِي الْكِتٰبِ مُوْسٰٓى ۡ اِنَّهٗ كَانَ مُخْلَصًا وَّكَانَ رَسُوْلًا نَّبِيًّا",
        "Urdu" : "اور اس کتاب میں اے پیغمبر ان کو موسیٰ کا قصہ بھی سناؤ بیشک وہ بھی ہمارے ایک چنے ہوئے بندے اور بھیجے ہوئے پیغمبر تھے،",
        "English" : "And mention in the Book (this Qur'n) Msa (Moses). Verily! He was chosen and he was a Messenger (and) a Prophet."
      },
      {
        "ayet_no" : 52,
        "arbi" : "وَنَادَيْنٰهُ مِنْ جَانِبِ الطُّوْرِ الْاَيْمَنِ وَقَرَّبْنٰهُ نَجِيًّا",
        "Urdu" : "اور ہم نے ان کو پکارا طور کی دائیں جانب سے اور ان کو اپنے قرب سے نوازا راز کی باتیں کرنے کے لیے،",
        "English" : "And We cried unto him from the right side of the mount, and We drew him nigh for whispering."
      },
      {
        "ayet_no" : 53,
        "arbi" : "وَوَهَبْنَا لَهٗ مِنْ رَّحْمَتِنَآ اَخَاهُ هٰرُوْنَ نَبِيًّا",
        "Urdu" : "اور ہم نے ان کی مدد کے لیے ان کے بھائی ہارون علیہ السلام کو بھیاپنی مہربانی سے نبی بنا دیا،",
        "English" : "And We bestowed on him, out of Our mercy, his brother Harun, a prophet."
      },
      {
        "ayet_no" : 54,
        "arbi" : "وَاذْكُرْ فِي الْكِتٰبِ اِسْمٰعِيْلَ ۡ اِنَّهٗ كَانَ صَادِقَ الْوَعْدِ وَكَانَ رَسُوْلًا نَّبِيًّا",
        "Urdu" : "اور اس کتاب میں ان کو اسماعیل علیہ السلام کا ذکر بھی سناؤ، بلاشبہ وہ بھی وعدے کے سچے اور ہمارے بھیجے ہوئے پیغمبر تھے ۔",
        "English" : "And mention thou in the Book lsma'il; verily he was true in promise, and was apostle, prophet."
      },
      {
        "ayet_no" : 55,
        "arbi" : "وَكَانَ يَاْمُرُ اَهْلَهٗ بِالصَّلٰوةِ وَالزَّكٰوةِ  ۠ وَكَانَ عِنْدَ رَبِّهٖ مَرْضِيًّا",
        "Urdu" : "وہ اپنے گھر والوں کو خاص طور پر حکم دیا کرتے تھے نماز اور زکوٰة کا، اور وہ اپنے رب کے یہاں ایک پسندیدہ انسان تھے ۔ ف۱",
        "English" : "And he was wont to command his household to the Prayer and the poor-rate, and he was with his Lord an approved one."
      },
      {
        "ayet_no" : 56,
        "arbi" : "وَاذْكُرْ فِي الْكِتٰبِ اِدْرِيْسَ ۡ اِنَّهٗ كَانَ صِدِّيْقًا نَّبِيًّا",
        "Urdu" : "اور اس کتاب میں ان کو ادریس کا ذکر بھی سناؤ بلاشبہ وہ بھی ایک بڑے ہی سچے پیغمبر تھے",
        "English" : "And mention thou in the book ldris, verily he was a man of truth, a prophet."
      },
      {
        "ayet_no" : 57,
        "arbi" : "وَّرَفَعْنٰهُ مَكَانًا عَلِيًّا",
        "Urdu" : "اور ہم نے انھیں ایک بڑے بلند مرتبے تک پہنچا دیا تھا،",
        "English" : "And We exalted him to a position lofty."
      },
      {
        "ayet_no" : 58,
        "arbi" : "اُولٰۗىِٕكَ الَّذِيْنَ اَنْعَمَ اللّٰهُ عَلَيْهِمْ مِّنَ النَّبِيّٖنَ مِنْ ذُرِّيَّةِ اٰدَمَ ۤ وَمِمَّنْ حَمَلْنَا مَعَ نُوْحٍ ۡ وَّمِنْ ذُرِّيَّةِ اِبْرٰهِيْمَ وَاِسْرَاۗءِيْلَ ۡ وَمِمَّنْ هَدَيْنَا وَاجْتَبَيْنَا ۭاِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُ الرَّحْمٰنِ خَرُّوْا سُجَّدًا وَّبُكِيًّا {السجدہ}",
        "Urdu" : "یہ حضرات جن کا ذکر ہوا وہ لوگ ہیں جن پر اللہ نے خاص انعام فرمایا اولاد آدم کے پیغمبروں میں سے اور ان لوگوں کی نسل میں سے جن کو ہم نے سوار کیا تھا نوح کے ساتھ ان کی کشتی میں اور ابراہیم علیہ السلام اور اسرائیل علیہ السلام کی اولاد میں سے اور یہ سب ان لوگوں میں سے تھے جن کو ہم نے ہدایت سے نوازا تھا اور ان کو چن لیا تھا مگر اس قدر مرتبہ و مقام کے باوجود ان کی شان عبدیت و بندگی کا عالم یہ تھا کہ جب ان کو پڑھ کر سنائی جاتیں خدائے رحمان کی آیتیں، تو یہ سنتے ہی اس کے حضور سجدے میں گر پڑتے روتے ہوئے",
        "English" : "Those are the people whom Allah has blessed with bounties, the prophets from the progeny of ‘Adam, and of those whom We caused to board (the Ark) along with NuH, and from the progeny of Ibrahim and Isra‘il (Jacob), and from those whom We guided and selected. When the verses of The RaHman (The All-Merciful) were recited before them, they used to fall down in Sajdah (prostration), while they were weeping."
      },
      {
        "ayet_no" : 59,
        "arbi" : "فَخَــلَفَ مِنْۢ بَعْدِهِمْ خَلْفٌ اَضَاعُوا الصَّلٰوةَ وَاتَّـبَعُوا الشَّهَوٰتِ فَسَوْفَ يَلْقَوْنَ غَيًّا",
        "Urdu" : "پھر ان کے بعد ان کے ایسے ناخلف جانشین ہوئے جنہوں نے ضائع کر دیا نماز کو، اور وہ پیچھے لگ گئےاپنی خواہشات کے، سو وہ پا کر رہیں گے انجاماپنی گمراہی کا،",
        "English" : "Then there succeeded to them a posterity who neglected the prayers and followed lusts; so presently they shall meet with perdition."
      },
      {
        "ayet_no" : 60,
        "arbi" : "اِلَّا مَنْ تَابَ وَاٰمَنَ وَعَمِلَ صَالِحًـا فَاُولٰۗىِٕكَ يَدْخُلُوْنَ الْجَــنَّةَ وَلَا يُظْلَمُوْنَ شَـيْــــــًٔا",
        "Urdu" : "ہاں مگر جنہوں نے توبہ کر لی، اور وہ ایمان لے آئے سچے دل سے اور انہوں نے کام بھی اچھے کیے تو وہ داخل ہوں گے جنت میں اور ان کی ذرہ برابر کوئی حق تلفی نہ ہوگی،",
        "English" : "Excepting those who may repent and believe and work righteously; these shall enter the Garden and shall not be wronged at all"
      },
      {
        "ayet_no" : 61,
        "arbi" : "جَنّٰتِ عَدْنِۨ الَّتِيْ وَعَدَ الرَّحْمٰنُ عِبَادَهٗ بِالْغَيْبِ  ۭ اِنَّهٗ كَانَ وَعْدُهٗ مَاْتِيًّا",
        "Urdu" : "یعنی ہمیشہ رہنے والی ان عظیم الشان جنتوں میں جن کا وعدہ فرما رکھا ہے خدائے رحمان نے اپنے بندوں سے بن دیکھے، بلاشبہ اس کے وعدہ نے بہرحال پورا ہو کر رہنا ہے ۔",
        "English" : "Gardens Everlasting, which the Compassionate hath promised unto his bondmen, unseen; verily His premise is ever to be fulfilled."
      },
      {
        "ayet_no" : 62,
        "arbi" : "لَا يَسْمَعُوْنَ فِيْهَا لَغْوًا اِلَّا سَلٰمًا ۭ وَلَهُمْ رِزْقُـهُمْ فِيْهَا بُكْرَةً وَّعَشِيًّا",
        "Urdu" : "وہاں یہ خوش نصیب کوئی بےہودہ بات نہ سننے پائیں گے ۔ بجز سلامتی کی دلنواز صداؤں کے اور وہاں ان کو ان کا رزق صبح و شام ملتا رہے گا ۔",
        "English" : "They shall not hear therein any vain word, but they shall hear only peace; and therein they shall have their provision morning and evening."
      },
      {
        "ayet_no" : 63,
        "arbi" : "تِلْكَ الْجَــــنَّةُ الَّتِيْ نُوْرِثُ مِنْ عِبَادِنَا مَنْ كَانَ تَقِيًّا",
        "Urdu" : "یہ ہے وہ جنت جس کا وارث بنادیں گے ہم اپنے بندوں میں سے ان لوگوں کو جو پرہیزگار رہے ہوں گے ۔",
        "English" : "That is the Paradise We will give as inheritance to those of Our servants who have been God-fearing."
      },
      {
        "ayet_no" : 64,
        "arbi" : "وَمَا نَتَنَزَّلُ اِلَّا بِاَمْرِ رَبِّكَ ۚ لَهٗ مَا بَيْنَ اَيْدِيْــنَا وَمَا خَلْفَنَا وَمَا بَيْنَ ذٰلِكَ ۚ وَمَا كَانَ رَبُّكَ نَسِـيًّا",
        "Urdu" : "اور اے پیغمبر صلی اللہ علیہ وسلم ہم فرشتے تو آپ کے رب کے حکم کے بغیر نہیں اتر سکتے اسی کا ہے وہ سب کچھ جو کہ ہمارے سامنے ہے اور وہ سب کچھ بھی جو کہ ہمارے پیچھے ہے اور جو اس کے درمیان ہے اور آپ کا رب بھولنے والا نہیں ف۱",
        "English" : "(Jibra‘il X said to the Holy Prophet) :We do not descend but with the command of your Lord. To Him belongs what is in front of us and what is behind us and what is in between; and your Lord is not the One who forgets."
      },
      {
        "ayet_no" : 65,
        "arbi" : "رَبُّ السَّمٰوٰتِ وَالْاَرْضِ وَمَا بَيْنَهُمَا فَاعْبُدْهُ وَاصْطَبِرْ لِعِبَادَتِهٖ ۭ هَلْ تَعْلَمُ لَهٗ سَمِيًّا",
        "Urdu" : "وہ رب ہے آسمانوں اور زمین کا اور ان سب چیزوں کا جو کہ ان دونوں کے درمیان ہیں پس تم اسی کی بندگی کرو اور پکے رہو اس کی عبادت و بندگی پر کیا تمہارے علم میں ہے کوئی ایسی ہستی جو اس کی ہم پایہ ہو ؟",
        "English" : "(He is) the Lord of the heavens and the earth and whatever lies between them. So, worship Him and persevere in His worship. Do you know any one worthy of His name?"
      },
      {
        "ayet_no" : 66,
        "arbi" : "وَيَقُوْلُ الْاِنْسَانُ ءَ اِذَا مَا مِتُّ لَسَوْفَ اُخْرَجُ حَيًّا",
        "Urdu" : "اور آخرت کا منکر انسان کہتا ہے کہ کیا واقعی جب میں مر چکوں گا تو پھر زندہ کر کے نکال لایا جاؤں گا ؟",
        "English" : "Man says, :Is it that, once I die, I shall be brought forth alive ?"
      },
      {
        "ayet_no" : 67,
        "arbi" : "اَوَلَا يَذْكُرُ الْاِنْسَانُ اَنَّا خَلَقْنٰهُ مِنْ قَبْلُ وَلَمْ يَكُ شَـيْـــــًٔـا",
        "Urdu" : "کیا ایسے انسان کو خود اپنے بارے میں یہ حقیقت یاد نہیں کہ ہم اس سے پہلے خود اس کو پیدا کر چکے ہیں جب کہ یہ کچھ بھی نہ تھا ؟",
        "English" : "Does not the man remember that We created him before, when he was nothing ?"
      },
      {
        "ayet_no" : 68,
        "arbi" : "فَوَرَبِّكَ لَنَحْشُرَنَّهُمْ وَالشَّيٰطِيْنَ ثُمَّ لَنُحْضِرَنَّهُمْ حَوْلَ جَهَنَّمَ جِثِيًّا",
        "Urdu" : "پس سن لیں یہ لوگ کہ قسم ہے تمہارے رب کی ہم ضرور بالضرور اکٹھا کر لائیں گے ان سب کو بھی، اور ان کے شیطانوں کو بھی پھر ہم حاضر کریں گے ان سب کو جہنم کے گرد گھٹنوں کے بل گھسٹتا ہوا",
        "English" : "By thy Lord, then, We shall surely gather them and the satans; thereafter We shall surely bring them round Hell, kneeling."
      },
      {
        "ayet_no" : 69,
        "arbi" : "ثُمَّ لَنَنْزِعَنَّ مِنْ كُلِّ شِيْعَةٍ اَيُّهُمْ اَشَدُّ عَلَي الرَّحْمٰنِ عِتِيًّا",
        "Urdu" : "پھر ہم چھانٹ کر نکال لائیں گے ہر گروہ میں سے ہر ایسے شخص کو جو خدائے رحمان کے مقابلے میں سب سے زیادہ سرکش بنا ہوا تھا",
        "English" : "Then, out of every group, We will certainly draw out those who were more rebellious against the All-Merciful (Allah)."
      },
      {
        "ayet_no" : 70,
        "arbi" : "ثُمَّ لَنَحْنُ اَعْلَمُ بِالَّذِيْنَ هُمْ اَوْلٰى بِهَا صِلِيًّا",
        "Urdu" : "پھر یہ نہیں کہ اس چھانٹی کے سلسلہ میں ہمیں کسی تحقیق کی ضرورت ہوگی کہ ہم خود ہی خوب جانتے ہیں ان لوگوں کو جو سب سے زیادہ حق دار ہوں گے دوزخ میں جھونک دئیے جانے کے",
        "English" : "Then of course, We are most aware of those who are more deserving to enter it ( the Jahannam )."
      },
      {
        "ayet_no" : 71,
        "arbi" : "وَاِنْ مِّنْكُمْ اِلَّا وَارِدُهَا  ۚ كَانَ عَلٰي رَبِّكَ حَتْمًا مَّقْضِيًّا",
        "Urdu" : "اور تم میں سے کوئی بھی نہیں جس کا دوزخ پر سے گزر نہ ہو، تمہارے رب کے ذمے ایک لازم اور طے شدہ امر ہے",
        "English" : "There is none among you who does not have to arrive at it. This is undertaken by your Lord as an absolute decree, bound to be enforced."
      },
      {
        "ayet_no" : 72,
        "arbi" : "ثُمَّ نُـنَجِّي الَّذِيْنَ اتَّقَوْا وَّنَذَرُ الظّٰلِمِيْنَ فِيْهَا جِثِيًّا",
        "Urdu" : "پھر اس گزرنے کے دوران ان لوگوں کو تو ہم بچا لیں گے جو دنیا میں پرہیزگار رہے ہوں گے اور ظالموں کو اسی میں پڑا ہوا چھوڑ دیں گے گھٹنوں کے بل",
        "English" : "Then We will save those who feared Allah, and will leave the wrongdoers in it, fallen on their knees."
      },
      {
        "ayet_no" : 73,
        "arbi" : "وَاِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُنَا بَيِّنٰتٍ قَالَ الَّذِيْنَ كَفَرُوْا لِلَّذِيْنَ اٰمَنُوْٓا  ۙ اَيُّ الْفَرِيْقَيْنِ خَيْرٌ مَّقَامًا وَّاَحْسَنُ نَدِيًّا",
        "Urdu" : "اور جب ان لوگوں کو پڑھ کر سنائی جاتی ہیں، ہماری آیتیں کھلی کھلی تو وہ لوگ جو اڑے ہوئے ہیں اپنے کفر و باطل پر اپنے دنیاوی مال و اسباب کے بل بوتے پر ایسے لوگ ایمان والوں سے کہتے ہیں کہ ذرا یہ تو بتاؤ کہ ہم دونوں گروہوں میں سے کس کی حالت زیادہ اچھی ہے؟ اور کس کی مجلس زیادہ شاندار ہے ؟ ف۱",
        "English" : "When Our verses are recited to them in all their clarity, the disbelievers say to the believers, :Which of the two groups is superior in its place and better in its assembly ?"
      },
      {
        "ayet_no" : 74,
        "arbi" : "وَكَمْ اَهْلَكْنَا قَبْلَهُمْ مِّنْ قَرْنٍ هُمْ اَحْسَنُ اَثَاثًا وَّرِءْيًا",
        "Urdu" : "حالانکہ ان سے پہلے ہم کتنی ہی ایسی قوموں کو ملیامیٹ کر چکے ہیں جو دنیاوی سازو سامان اور ظاہری شان وشوکت میں ان سے بھی کہیں بڑھ کر تھیں",
        "English" : "And how many a generation have We destroyed before these, who were goodlier in goods and outward appearance ?"
      },
      {
        "ayet_no" : 75,
        "arbi" : "قُلْ مَنْ كَانَ فِي الضَّلٰلَةِ فَلْيَمْدُدْ لَهُ الرَّحْمٰنُ مَدًّا ڬحَتّٰٓي اِذَا رَاَوْا مَا يُوْعَدُوْنَ اِمَّا الْعَذَابَ وَاِمَّا السَّاعَةَ  ۭ فَسَيَعْلَمُوْنَ مَنْ هُوَ شَرٌّ مَّكَانًا وَّاَضْعَفُ جُنْدًا",
        "Urdu" : "(ان سے) کہو کہ جو شخص گمراہی میں مبتلا ہوتا ہے (خدائے) رحمان اسے ڈھیل دئیے چلا جاتا ہے، یہاں تک کہ جب ایسے لوگ اس چیز کو دیکھ لیتے ہیں جس کا ان سے وعدہ کیا گیا ہوتا ہے، خواہ عذاب الہٰی ہو یا قیامت کی وہ گھڑی، تو اس وقت انھیں معلوم ہو جاتا ہے کہ کس کا حال سب سے برا ہے اور کس کا جتھا سب سے کمزور ہے،",
        "English" : "Say, :Whoever stays straying, let his term be extended by the All-Merciful (Allah) still longer, until when they will see what they are being warned of: either the punishment or the Hour (of Doom), then they will know who was worse in his place and weaker in his forces."
      },
      {
        "ayet_no" : 76,
        "arbi" : "وَيَزِيْدُ اللّٰهُ الَّذِيْنَ اهْتَدَوْا هُدًى ۭ وَالْبٰقِيٰتُ الصّٰلِحٰتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَّخَيْرٌ مَّرَدًّا",
        "Urdu" : "اس کے برعکس، جو لوگ راہ راست اختیار کرتے ہیں، اللہ انھیں راست روی میں اور ترقی عطا فرماتا ہے، اور باقی رہ جانے والی نیکیاں ہی تیرے رب کے یہاں سب سے زیادہ اچھی ہیں ثواب کے اعتبار سے بھی، اور انجام کے لحاظ سے بھی",
        "English" : "Allah makes those on the right path excel in guidance. And the everlasting virtues are better with your Lord in respect of reward and better in their return."
      },
      {
        "ayet_no" : 77,
        "arbi" : "اَفَرَءَيْتَ الَّذِيْ كَفَرَ بِاٰيٰتِنَا وَقَالَ لَاُوْتَيَنَّ مَالًا وَّوَلَدًا",
        "Urdu" : "پھر کیا تم نے اس شخص کو بھی دیکھا جو انکار کرتا ہے ہماری آیتوں کا، اور کہتا ہے کے مجھے (آخرت میں بھی اگر وہ ہوئی تو) ضرور نوازا جائے گا مال واولاد سے، ف۲",
        "English" : "Have you, then, seen him who rejected Our verses and said, :I shall certainly be given wealth and children ?"
      },
      {
        "ayet_no" : 78,
        "arbi" : "اَطَّلَعَ الْغَيْبَ اَمِ اتَّخَذَ عِنْدَ الرَّحْمٰنِ عَهْدًا",
        "Urdu" : "کیا اس نے غیب پر اطلاع پالی؟ یا اس نے (خدائے) رحمان سے کوئی عہد لے رکھا ہے ؟",
        "English" : "Has he peeped into the Unseen or taken a covenant with the All-Merciful (Allah) ?"
      },
      {
        "ayet_no" : 79,
        "arbi" : "كَلَّا  ۭ سَنَكْـتُبُ مَا يَقُوْلُ وَنَمُدُّ لَهٗ مِنَ الْعَذَابِ مَدًّا",
        "Urdu" : "ہرگز نہیں، ہم لکھتے چلے جا رہے ہیں جو بھی کچھ وہ کہتا ہے اور (اس طرح) اس کے لئے ہم بڑھاتے جائیں گے (اپنا عذاب) اور بڑھانا، اور ہم ہی وارث ہوں اس (کے اس تمام سازو سامان اور لاؤ لشکر) کے",
        "English" : "Never! We will write what he says and extend for him the punishment extensively."
      },
      {
        "ayet_no" : 80,
        "arbi" : "وَّنَرِثُهٗ مَا يَقُوْلُ وَيَاْتِيْنَا فَرْدًا",
        "Urdu" : "جن کا یہ (اس قدر فخر وغرور سے) ذکر کرتا ہے، اور اسے تن تنہا ہمارے پاس انا ہوگا،",
        "English" : "And We shall inherit from him that whereof he spake, and he shall come to us alone."
      },
      {
        "ayet_no" : 81,
        "arbi" : "وَاتَّخَذُوْا مِنْ دُوْنِ اللّٰهِ اٰلِهَةً لِّيَكُوْنُوْا لَهُمْ عِزًّا",
        "Urdu" : "اور ان لوگوں نے اللہ کے سوا اور معبود بنا رکھے ہیں تاکہ وہ ان کے مددگار ہوں، ف۳",
        "English" : "They have taken gods other than Allah, so that they may be a source of might for them."
      },
      {
        "ayet_no" : 82,
        "arbi" : "كَلَّا ۭ سَيَكْفُرُوْنَ بِعِبَادَتِهِمْ وَيَكُوْنُوْنَ عَلَيْهِمْ ضِدًّا",
        "Urdu" : "ہرگز نہیں، وہ تو ان کی عبادت ہی کا انکار کر دیں گے اور وہ الٹے ان کے مخالف بن جائیں گے،",
        "English" : "By no means! anon they shall deny their worship, and become unto them an adversary."
      },
      {
        "ayet_no" : 83,
        "arbi" : "اَلَمْ تَرَ اَنَّآ اَرْسَلْنَا الشَّيٰطِيْنَ عَلَي الْكٰفِرِيْنَ تَـــؤُزُّهُمْ اَزًّا",
        "Urdu" : "کیا تمہیں معلوم نہیں کہ ہم نے شیطانوں کو ان کافروں پر چھوڑ رکھا ہے جو انھیں طرح طرح سے اکساتے ہیں (حق اور اہل حق کی مخالفت پر)",
        "English" : "Have you not seen that We have sent the devils onto the disbelievers inciting them with all their incitements."
      },
      {
        "ayet_no" : 84,
        "arbi" : "فَلَا تَعْجَلْ عَلَيْهِمْ ۭ اِنَّمَا نَعُدُّ لَهُمْ عَدًّا",
        "Urdu" : "پس تم ان پر (نزول عذاب کے لئے) جلدی نہ کرنا، ہم خود ہی ان کے دن پوری طرح گن رہے ہیں،  ف۱",
        "English" : "So make no hurry about them; We are but counting for them a count down."
      },
      {
        "ayet_no" : 85,
        "arbi" : "يَوْمَ نَحْشُرُ الْمُتَّقِيْنَ اِلَى الرَّحْمٰنِ وَفْدًا",
        "Urdu" : "جس دن کہ ہم پرہیزگاروں کو تو اکٹھا کر لائیں گے (خدائے) رحمان کے حضور (معزز) مہمانوں کے طور پر،",
        "English" : "The day We will assemble the God-fearing before the All-Merciful (Allah) as guests,"
      },
      {
        "ayet_no" : 86,
        "arbi" : "وَّنَسُوْقُ الْمُجْرِمِيْنَ اِلٰى جَهَنَّمَ وِرْدًا",
        "Urdu" : "اور مجرموں کو ہم ہانک لائیں گے دوزخ کی طرف پیاسے جانوروں کی طرح،",
        "English" : "And shall drive the culprits to Hell as a herd."
      },
      {
        "ayet_no" : 87,
        "arbi" : "لَا يَمْلِكُوْنَ الشَّفَاعَةَ اِلَّا مَنِ اتَّخَذَ عِنْدَ الرَّحْمٰنِ عَهْدًا",
        "Urdu" : "وہاں ان کو کسی سفارش کا بھی کوئی اختیار نہیں ہوگا سوائے اس شخص کے جس نے (خدائے) رحمان سے (اس بارے) کوئی اجازت لی ہو،",
        "English" : "They shall not own intercession, excepting those who have taken of the Compassionate a covenant."
      },
      {
        "ayet_no" : 88,
        "arbi" : "وَقَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَدًا",
        "Urdu" : "اور کہتے ہیں کہ (خدائے) رحمان نے اولاد ٹھہرا رکھی ہے،",
        "English" : "They say, :The All-Merciful (Allah) has got a son."
      },
      {
        "ayet_no" : 89,
        "arbi" : "لَقَدْ جِئْتُمْ شَـيْــــــًٔـا اِدًّا",
        "Urdu" : "(ظالمو!) تم نے ایک اتنی سخت بےجا اور بیہودہ بات کہہ دی ہے، ف۲",
        "English" : "Indeed you have brought forth (said) a terrible evil thing."
      },
      {
        "ayet_no" : 90,
        "arbi" : "تَكَادُ السَّمٰوٰتُ يَــتَفَطَّرْنَ مِنْهُ وَتَنْشَقُّ الْاَرْضُ وَتَخِرُّ الْجِبَالُ هَدًّا",
        "Urdu" : "کہ قریب ہے کہ پھٹ پڑیں اس سے آسمان شق ہو جائے زمین، اور گر پڑیں پہاڑ دھماکے سے،",
        "English" : "Well-nigh the heavens are rent thereat and the earth cleft in sunder and the mountains fall down in pieces."
      },
      {
        "ayet_no" : 91,
        "arbi" : "اَنْ دَعَوْا لِلرَّحْمٰنِ وَلَدًا",
        "Urdu" : "اس لئے کہ ان لوگوں نے (خدائے) رحمان کے لئے اولاد کا دعوی کیا ہے، ف۳",
        "English" : "That they should ascribe unto the Compassionate a son."
      },
      {
        "ayet_no" : 92,
        "arbi" : "وَمَا يَنْۢبَغِيْ لِلرَّحْمٰنِ اَنْ يَّـتَّخِذَ وَلَدًا",
        "Urdu" : "حالانکہ (خدائے) رحمان کی یہ شان نہیں کہ وہ کسی کواپنی اولاد بنائے،",
        "English" : "When it is not meet for (the Majesty of) the Beneficent that He should choose a son."
      },
      {
        "ayet_no" : 93,
        "arbi" : "اِنْ كُلُّ مَنْ فِي السَّمٰوٰتِ وَالْاَرْضِ اِلَّآ اٰتِي الرَّحْمٰنِ عَبْدًا",
        "Urdu" : "(کیونکہ) آسمانوں اور زمین (کی اس ساری کائنات) میں جو بھی کچھ ہے ان میں سے کوئی بھی ایسا نہیں جو (خدائے) رحمان کے حضور پیش نہ ہو بندہ (سرافگندہ) ہو کر،",
        "English" : "Not one of the beings in the heavens and the earth but must come to (Allah) Most Gracious as a servant."
      },
      {
        "ayet_no" : 94,
        "arbi" : "لَقَدْ اَحْصٰىهُمْ وَعَدَّهُمْ عَدًّا",
        "Urdu" : "یقینا اس نے احاطہ کر رکھا ہے ان سب کا، اور ان کو شمار کر رکھا ہے گن کر،",
        "English" : "Assuredly He hath comprehanded them and counted them a full Counting."
      },
      {
        "ayet_no" : 95,
        "arbi" : "وَكُلُّهُمْ اٰتِيْهِ يَوْمَ الْقِيٰمَةِ فَرْدًا",
        "Urdu" : "اور ان سب کو قیامت کے دن اس (وحدہ لا شریک) کے یہاں حاضر ہونا ہوگا فرداً فرداً،",
        "English" : "And each of them is to come to Him on the Day of Judgment alone."
      },
      {
        "ayet_no" : 96,
        "arbi" : "اِنَّ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ سَيَجْعَلُ لَهُمُ الرَّحْمٰنُ وُدًّا",
        "Urdu" : "بلاشبہ جو لوگ ایمان لائے اور انہوں نے (اس کے مطابق) نیک کام بھی کئے، (خدائے) رحمان ان کو نواز دے گا (اپنے فضل وکرم سے) ایک خاص محبت سے،",
        "English" : "Verily those who believe and do righteous works--anon the Compassionate shall appoint for them affection."
      },
      {
        "ayet_no" : 97,
        "arbi" : "فَاِنَّمَا يَسَّرْنٰهُ بِلِسَانِكَ لِتُبَشِّرَ بِهِ الْمُتَّقِيْنَ وَتُنْذِرَ بِهٖ قَوْمًا لُّدًّا",
        "Urdu" : "سو (آپ حق کی تبلیغ کرتے رہیں کہ) بلاشبہ ہم نے آسان کر دیا ہے اس (قران) کو آپ کی زبان میں، تاکہ آپ اس کے ذریعے بشارت (وخوشخبری) سنا سکیں پرہیزگاروں کو اور ڈرا سکیں ہٹ دھرم لوگوں کو،",
        "English" : "So We have made it (the Qur‘an) easy through your tongue, so that you give with it the good news to the God-fearing, and warn with it an obstinate people."
      },
      {
        "ayet_no" : 98,
        "arbi" : "وَكَمْ اَهْلَكْنَا قَبْلَهُمْ مِّنْ قَرْنٍ ۭ هَلْ تُـحِسُّ مِنْهُمْ مِّنْ اَحَدٍ اَوْ تَسْمَعُ لَهُمْ رِكْزًا",
        "Urdu" : "اور (یہ بھی ان کو بتا دیں کہ) ہم ان سے پہلے کتنی ہی قوموں کو تباہ کر چکے ہیں، (اور اس طرح کہ ان کا نام ونشان مٹا کر رکھ دیا) کیا تم ان میں سے کسی کو بھی دیکھتے ہو؟ یا ان کی کوئی بھنک بھی سن سکتے ہو ؟ ف۱",
        "English" : "And how many a generation We have destroyed before them! Do you sense (the presence of) any one of them, or hear from them even a whisper ?"
      }

    ]
  }
]