[
  {
    "surah_no" : 63,
    "total_ayah" : 11,
    "name" : "Surah e AL-Munafiqun",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "اِذَا جَاۗءَكَ الْمُنٰفِقُوْنَ قَالُوْا نَشْهَدُ اِنَّكَ لَرَسُوْلُ اللّٰهِ ۘ وَاللّٰهُ يَعْلَمُ اِنَّكَ لَرَسُوْلُهٗ ۭ وَاللّٰهُ يَشْهَدُ اِنَّ الْمُنٰفِقِيْنَ لَكٰذِبُوْنَ",
        "Urdu" : "جب یہ منافق آپ کے پاس آتے ہیں تو کہتے ہیں کہ ہم گواہی دیتے ہیں کہ آپ بلاشبہ اللہ کے رسول ہیں اور اللہ کو خوب معلوم ہے کہ آپ قطعی طور پر اسکے رسول ہیں مگر اللہ گواہی دیتا ہے کہ یہ منافق قطعی طور پر جھوٹے ہیں ف۱",
        "English" : "When the hypocrites come Unto thee, they say: we bear witness that thou art indeed the apostle of Allah. Allah know that thou art indeed His apostle, and Allah bear witness that; the hypocrites are indeed liars."
      },
      {
        "ayet_no" : 2,
        "arbi" : "اِتَّخَذُوْٓا اَيْمَانَهُمْ جُنَّةً فَصَدُّوْا عَنْ سَبِيْلِ اللّٰهِ    ۭ اِنَّهُمْ سَاۗءَ مَا كَانُوْا يَعْمَلُوْنَ",
        "Urdu" : "انہوں نے تواپنی قسموں کو ڈھال بنا رکھا ہے پھر یہ (دوسروں کو بھی) روکتے ہیں اللہ کی راہ سے بلاشبہ بڑی ہی بری ہیں وہ حرکتیں جو یہ لوگ کر رہے ہیں ف۲",
        "English" : "They have made their oaths a shield, and thus they have prevented (others) from the way of Allah. Surely evil is what they have been doing."
      },
      {
        "ayet_no" : 3,
        "arbi" : "ذٰلِكَ بِاَنَّهُمْ اٰمَنُوْا ثُمَّ كَفَرُوْا فَطُبِعَ عَلٰي قُلُوْبِهِمْ فَهُمْ لَا يَفْقَهُوْنَ",
        "Urdu" : "یہ اس لیے کہ یہ لوگ ایمان لائے پھر انہوں نے کفر کیا تو انکے دلوں پر مہر کر دی گئی جسکے نتیجے میں اب یہ کچھ نہیں سمجھتے",
        "English" : "That is because they declared faith (in Islam apparently) , then disbelieved (secretly) . Therefore a seal has been set on their hearts, and thus they do not understand."
      },
      {
        "ayet_no" : 4,
        "arbi" : "وَاِذَا رَاَيْتَهُمْ تُعْجِبُكَ اَجْسَامُهُمْ ۭ وَاِنْ يَّقُوْلُوْا تَسْمَعْ لِقَوْلِهِمْ ۭ كَاَنَّهُمْ خُشُبٌ مُّسَنَّدَةٌ      ۭ يَحْسَبُوْنَ كُلَّ صَيْحَةٍ عَلَيْهِمْ ۭ هُمُ الْعَدُوُّ فَاحْذَرْهُمْ ۭ قٰتَلَهُمُ اللّٰهُ  ۡ اَنّٰى يُؤْفَكُوْنَ",
        "Urdu" : "اور جب تم انہیں دیکھو انکے ڈیل ڈول تم کو اچھے لگیں اور اگر یہ بولیں تو تم انکی باتیں سنتے رہ جاؤ (مگر حقیقت میں) یہ گویا لکڑی کے ایسے کندے ہیں جو (دیوار وغیرہ کی) ٹیک پر رکھ دئیے گئے ہوں ہر اونچی آواز کو یہ لوگ اپنے ہی اوپر سمجھتے ہیں یہ دشمن ہیں پس تم ان سے بچ کر رہو اللہ انہیں غارت کرے یہ کہاں سے کہاں بہکے جا رہے ہیں",
        "English" : "And when you look at them, their bodies please you; and when they speak, you listen to their words. They are as blocks of wood propped up. They think that every cry is against them. They are the enemies, so beware of them. MayAllah curse them! How are they denying (or deviating from) the Right Path."
      },
      {
        "ayet_no" : 5,
        "arbi" : "وَاِذَا قِيْلَ لَهُمْ تَعَالَوْا يَسْتَغْفِرْ لَكُمْ رَسُوْلُ اللّٰهِ لَوَّوْا رُءُوْسَهُمْ وَرَاَيْتَهُمْ يَصُدُّوْنَ وَهُمْ مُّسْـتَكْبِرُوْنَ",
        "Urdu" : "اور (انکا حال تو یہ ہے کہ) جب ان سے کہا جاتا ہے کہ آؤ تم لوگ (بارگاہِ رسالت میں) تاکہ بخشش کی دعاء کریں تمہارے لیے اللہ کے رسول تو یہ اپنے سر جھٹک کر (اور پیٹھ پھیر کر) چل دیتے ہیں اور تم انکو دیکھو گے تو (انکو ایسا پاؤ گے کہ) یہ بےرخی برتتے ہیں (قبولِ حق سے)اپنی بڑائی کے گھمنڈ میں مبتلا ہو کر",
        "English" : "And when it is said to them, :Come on, so that Allah‘s Messenger may pray for your forgiveness , they twist their heads (in aversion) , and you see them turning away in arrogance."
      },
      {
        "ayet_no" : 6,
        "arbi" : "سَوَاۗءٌ عَلَيْهِمْ اَسْتَغْفَرْتَ لَهُمْ اَمْ لَمْ تَسْتَغْفِرْ لَهُمْ ۭ لَنْ يَّغْفِرَ اللّٰهُ لَهُمْ ۭ اِنَّ اللّٰهَ لَا يَهْدِي الْقَوْمَ الْفٰسِقِيْنَ",
        "Urdu" : "(اے پیغمبر) آپ ان کیلئے معافی کی درخواست کریں یا نہ کریں ان کیلئے بہرحال برابر ہے اللہ انکو ہرگز معاف نہیں کرے گا بیشک اللہ ہدایت (کی دولت) سے نہیں نوازتا ایسے بدکار لوگوں کو ف۱",
        "English" : "It is equal in their case, whether you (O prophet,) pray for their forgiveness or do not pray, Allah will never forgive them. Indeed Allah does not guide the sinning people."
      },
      {
        "ayet_no" : 7,
        "arbi" : "هُمُ الَّذِيْنَ يَقُوْلُوْنَ لَا تُنْفِقُوْا عَلٰي مَنْ عِنْدَ رَسُوْلِ اللّٰهِ حَتّٰى يَنْفَضُّوْا ۭ وَلِلّٰهِ خَزَاۗىِٕنُ السَّمٰوٰتِ وَالْاَرْضِ وَلٰكِنَّ الْمُنٰفِقِيْنَ لَا يَفْقَهُوْنَ",
        "Urdu" : "یہ وہی لوگ ہیں جو کہتے ہیں کہ تم ان لوگوں پر مت خرچ کرو جو رسول اللہ کے پاس ہیں یہاں تک کہ وہ تتر بتر ہوجائیں حالانکہ اللہ ہی کے لیے ہیں سب خزانے آسمانوں اور زمین کے مگر یہ منافق لوگ سمجھتے نہیں",
        "English" : "They are those who say, :Do not spend on those who are with Allah‘s Messenger until they disperse. And to Allah belong the treasures of the heavens and the earth, but the hypocrites do not understand."
      },
      {
        "ayet_no" : 8,
        "arbi" : "يَقُوْلُوْنَ لَىِٕنْ رَّجَعْنَآ اِلَى الْمَدِيْنَةِ لَيُخْرِجَنَّ الْاَعَزُّ مِنْهَا الْاَذَلَّ ۭ وَلِلّٰهِ الْعِزَّةُ وَلِرَسُوْلِهٖ وَلِلْمُؤْمِنِيْنَ وَلٰكِنَّ الْمُنٰفِقِيْنَ لَا يَعْلَمُوْنَ",
        "Urdu" : "یہ کہتے ہیں کہ اگر ہم مدینے وا پس پہنچ گئے تو جو عزت والا ہے وہ ذلت والے کو وہاں سے نکال کر دم لے گا حالانکہ عزت تو اصل میں اللہ ہی کیلئے ہے اور اسکے رسول اور ایمان والوں کیلئے مگر یہ منافق جانتے نہیں",
        "English" : "They say, :If we return to Madinah, the more honorable ones will drive out the meaner ones from there. And to Allah belongs the honour, and to His Messenger, and to the believers, but the hypocrites do not know."
      },
      {
        "ayet_no" : 9,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تُلْهِكُمْ اَمْوَالُكُمْ وَلَآ اَوْلَادُكُمْ عَنْ ذِكْرِ اللّٰهِ ۚ وَمَنْ يَّفْعَلْ ذٰلِكَ فَاُولٰۗىِٕكَ هُمُ الْخٰسِرُوْنَ",
        "Urdu" : "اے وہ لوگوں جو ایمان لائے ہو (خبردار! کہیں) غافل نہ کرنے پائیں تم کو تمہارے مال اور نہ تمہاری اولاد اللہ کے ذکر (اور اسکی یاد دلشاد) سے اور جو کوئی ایسا کرے گا تو ایسے لوگ خود اپنا ہی نقصان کرنے والے ہونگے",
        "English" : "O you who believe, your riches and your children must not divert you from the remembrance of Allah. And those who do that are the losers."
      },
      {
        "ayet_no" : 10,
        "arbi" : "وَاَنْفِقُوْا مِنْ مَّا رَزَقْنٰكُمْ مِّنْ قَبْلِ اَنْ يَّاْتِيَ اَحَدَكُمُ الْمَوْتُ فَيَقُوْلَ رَبِّ لَوْلَآ اَخَّرْتَنِيْٓ اِلٰٓى اَجَلٍ قَرِيْبٍ ۙ فَاَصَّدَّقَ وَاَكُنْ مِّنَ الصّٰلِحِيْنَ",
        "Urdu" : "اور خرچ کرو تم اس میں سے جو کہ دیا ہے ہم نے تم کو (اپنے کرم سے) قبل اس سے کہ آپہنچے تم میں سے کسی کو موت پھر وہ (مارے افسوس کے) یوں کہنے لگے کہ اے میرے رب تو نے مجھے تھوڑی سی مہلت اور کیوں نہ دے دی تاکہ میں خوب صدقہ (و خیرات) کرتا اور میں ہو جاتا نیک لوگوں میں سے",
        "English" : "And spend out of what We have given to you before death overtakes one of you and he says, :My Lord, would you not give me respite to a near term, so that I should pay Sadaqah (alms) and become one of the righteous ?"
      },
      {
        "ayet_no" : 11,
        "arbi" : "وَلَنْ يُّؤَخِّرَ اللّٰهُ نَفْسًا اِذَا جَاۗءَ اَجَلُهَا ۭ وَاللّٰهُ خَبِيْرٌۢ بِمَا تَعْمَلُوْنَ",
        "Urdu" : "اور اللہ ہرگز ڈھیل نہیں دیتا کسی شخص کو جبکہ آپہنچے اسکا وقت (مقرر) اور اللہ پوری طرح باخبر ہے ان سب کاموں سے جو تم لوگ کرتے ہو ف۱",
        "English" : "But Allah will never give respite to anyone, once his appointed time will come. And Allah is All-Aware of what you do."
      }
    ]
  }
]