[
  {
    "surah_no" : 70,
    "total_ayah" : 44,
    "name" : "Surah e AL-Meeraj",
    "detail" : [

      {
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "سَاَلَ سَاۗىِٕلٌۢ بِعَذَابٍ وَّاقِعٍ",
        "Urdu" : "مانگا ایک مانگنے والے نے وہ ہولناک عذاب جس نے (اپنے وقت پر) بہر حال واقع ہو کر رہنا ہے",
        "English" : "A questioner asked concerning a torment about to befall"
      },
      {
        "ayet_no" : 2,
        "arbi" : "لِّلْكٰفِرِيْنَ لَيْسَ لَهٗ دَافِعٌ",
        "Urdu" : "کافروں پر جس کو کوئی ٹالنے والا نہیں ف۲",
        "English" : "Upon the disbelievers, which no one can repel."
      },
      {
        "ayet_no" : 3,
        "arbi" : "مِّنَ اللّٰهِ ذِي الْمَعَارِجِ",
        "Urdu" : "(بے پایا عظمتوں والے) اس اللہ کی طرف سے جو مالک ہے عروج کے زینوں کا",
        "English" : "From Allah, Owner of the ascending steps."
      },
      {
        "ayet_no" : 4,
        "arbi" : "تَعْرُجُ الْمَلٰۗىِٕكَةُ وَالرُّوْحُ اِلَيْهِ فِيْ يَوْمٍ كَانَ مِقْدَارُهٗ خَمْسِيْنَ اَلْفَ سَـنَةٍ",
        "Urdu" : "اسی کی طرف چڑھ کر جاتے ہیں فرشتے بھی اور روح بھی (وہ عذاب) ایک ایسے دن میں ہوگا جس کی مقدار پچاس ہزار برس ہے",
        "English" : "Whereby the angels ascend Unto Him and also the spirit, On a Day whereof the measure is fifty thousand years."
      },
      {
        "ayet_no" : 5,
        "arbi" : "فَاصْبِرْ صَبْرًا جَمِيْلًا",
        "Urdu" : "پس آپ صبر جمیل ہی سے کام لیتے رہیں (اے پیغمبر!)",
        "English" : "So, observe patience, a good patience."
      },
      {
        "ayet_no" : 6,
        "arbi" : "اِنَّهُمْ يَرَوْنَهٗ بَعِيْدًا",
        "Urdu" : "یہ لوگ تو اسے بڑا دور سمجھتے ہیں",
        "English" : "Verily they behold it afar off."
      },
      {
        "ayet_no" : 7,
        "arbi" : "وَّنَرٰىهُ قَرِيْبًا",
        "Urdu" : "مگر ہم اسے بہت ہی قریب دیکھ رہے ہیں",
        "English" : "But We see it (quite) near."
      },
      {
        "ayet_no" : 8,
        "arbi" : "يَوْمَ تَكُوْنُ السَّمَاۗءُ كَالْمُهْلِ",
        "Urdu" : "جس دن کہ ہو جائے گا یہ (نیلگوں) آسمان پگھلی ہوئی چاندی کی طرح",
        "English" : "It shall befall on a Day whereon the heaven shall become like Unto dregs of oil."
      },
      {
        "ayet_no" : 9,
        "arbi" : "وَتَكُوْنُ الْجِبَالُ كَالْعِهْنِ",
        "Urdu" : "اور یہ پہاڑ (دھنکی ہوئی) رنگ برنگی اون کی مانند (اڑتے پھر رہے) ہوں گے",
        "English" : "And then the mountains shall become like Unto wool dyed."
      },
      {
        "ayet_no" : 10,
        "arbi" : "وَلَا يَسْـَٔــلُ حَمِيْمٌ حَمِـيْمًا",
        "Urdu" : "اور (اس دن) کوئی گہرا دوست بھی کسی دوست کو نہیں پوچھے گا",
        "English" : "And no familiar friend will ask a question of his friend"
      },
      {
        "ayet_no" : 11,
        "arbi" : " يُّبَصَّرُوْنَهُمْ ۭ يَوَدُّ الْمُجْرِمُ لَوْ يَفْتَدِيْ مِنْ عَذَابِ يَوْمِىِٕذٍۢ بِبَنِيْهِ",
        "Urdu" : "حالانکہ وہ ایک دوسرے کو دکھائے بھی جائیں گے مجرم چاہے گا کہ کاش کہ وہ اس دن کے عذاب سے بچنے کے لئے اپنے بدلے میں اپنے سب بیٹوں کو بھی دے دے",
        "English" : "Though they shall be made to see one another. Fain would the guilty ransom himself from the torment of that Day by his children."
      },
      {
        "ayet_no" : 12,
        "arbi" : "وَصَاحِبَتِهٖ وَاَخِيْهِ",
        "Urdu" : "اپنی بیوی اور اپنے بہائی کو بھی",
        "English" : "And his spouse and his brother."
      },
      {
        "ayet_no" : 13,
        "arbi" : "وَفَصِيْلَتِهِ الَّتِيْ تُـــــْٔوِيْهِ",
        "Urdu" : "اور اپنے اس پورے کنبے کو بھی جو کہ اس کو پناہ دیا کرتا تھا",
        "English" : "And his kin that sheltered him."
      },
      {
        "ayet_no" : 14,
        "arbi" : "وَمَنْ فِي الْاَرْضِ جَمِيْعًا   ۙ ثُمَّ يُنْجِيْهِ",
        "Urdu" : "اور ان سب لوگوں کو بھی جو کہ روئے زمین میں موجود ہیں پھر یہ (بدلہ دینا) اس کو بچالے",
        "English" : "And all those on earth, then he may redeem himself."
      },
      {
        "ayet_no" : 15,
        "arbi" : "كَلَّا ۭ اِنَّهَا لَظٰى",
        "Urdu" : "ہرگز نہیں ف۱ وہ تو شعلہ مارتی ہوئی ایک (ہولناک) آگ ہوگی",
        "English" : "By no means! Verily it is a Flame."
      },
      {
        "ayet_no" : 16,
        "arbi" : "نَزَّاعَةً لِّلشَّوٰى",
        "Urdu" : "ادھیڑ کر رکھ دینے والی کھال کو ف۲",
        "English" : "Flaying off the scalp-skin."
      },
      {
        "ayet_no" : 17,
        "arbi" : "تَدْعُوْا مَنْ اَدْبَرَ وَتَوَلّٰى",
        "Urdu" : "تو (پکار پکار کراپنی طرف) بلا رہی ہوگی ہر اس شخص کو جس نے منہ موڑا ہوگا (حق سے) اور پیٹھ پھیری ہوگی",
        "English" : "It shall call him who turn back and backslide."
      },
      {
        "ayet_no" : 18,
        "arbi" : "وَجَمَعَ فَاَوْعٰى",
        "Urdu" : "اور جمع کیا ہوگا (دنیاوی مال و دولت کو) اور سینت سینت کر رکھا ہوگا (اس کو)",
        "English" : "And mass and then hoard."
      },
      {
        "ayet_no" : 19,
        "arbi" : "اِنَّ الْاِنْسَانَ خُلِقَ هَلُوْعًا",
        "Urdu" : "واقعی انسان بڑا تھڑدلا (اور کم حوصلہ) ہے",
        "English" : "Verily man is formed impatient."
      },
      {
        "ayet_no" : 20,
        "arbi" : "اِذَا مَسَّهُ الشَّرُّ جَزُوْعًا",
        "Urdu" : "جب اس کو تکلیف پہنچتی ہے تو یہ گھبرا اٹھتا ہے",
        "English" : "When evil touch him, he is bewailing."
      },
      {
        "ayet_no" : 21,
        "arbi" : "وَاِذَا مَسَّهُ الْخَيْرُ مَنُوْعًا",
        "Urdu" : "اور جب اسے خوشحالی نصیب ہوتی ہے تو یہ بخل کرنے لگتا ہے",
        "English" : "And when good touch him he is begrudging."
      },
      {
        "ayet_no" : 22,
        "arbi" : "اِلَّا الْمُصَلِّيْنَ",
        "Urdu" : "سوائے ان نمازیوں کے",
        "English" : "Not so are the prayerful."
      },
      {
        "ayet_no" : 23,
        "arbi" : "الَّذِيْنَ هُمْ عَلٰي صَلَاتِهِمْ دَاۗىِٕمُوْنَ",
        "Urdu" : "جو اپنے نماز کی (حفاظت اور اس کی) پابندی کرتے ہیں",
        "English" : "Who are at their prayer constant."
      },
      {
        "ayet_no" : 24,
        "arbi" : "وَالَّذِيْنَ فِيْٓ اَمْوَالِهِمْ حَقٌّ مَّعْلُوْمٌ",
        "Urdu" : "جنکے مالوں کے اندر حق ہوتا ہے مقرر (اور طے شدہ)",
        "English" : "And those in whose riches is a known right."
      },
      {
        "ayet_no" : 25,
        "arbi" : "لِّلسَّاۗىِٕلِ وَالْمَحْرُوْمِ",
        "Urdu" : "ان کے لئے بھی جو سوال کرتے ہیں اور ان کیلئے بھی جو سوال نہیں کرتے ہیں",
        "English" : "For the beggar and the destitute."
      },
      {
        "ayet_no" : 26,
        "arbi" : "وَالَّذِيْنَ يُصَدِّقُوْنَ بِيَوْمِ الدِّيْنِ",
        "Urdu" : "جو سچے دل سے مانتے ہیں بدلے (اور جزا) کے دن کو)",
        "English" : "And those who testify to the Day of Requital."
      },
      {
        "ayet_no" : 27,
        "arbi" : "وَالَّذِيْنَ هُمْ مِّنْ عَذَابِ رَبِّهِمْ مُّشْفِقُوْنَ",
        "Urdu" : "اور وہ ڈرتے رہتے ہیں اپنے رب (کی پکڑ اور اس) کے عذاب سے",
        "English" : "And those who fear the torment of their Lord;"
      },
      {
        "ayet_no" : 28,
        "arbi" : "اِنَّ عَذَابَ رَبِّهِمْ غَيْرُ مَاْمُوْنٍ",
        "Urdu" : "(اور) بلاشبہ ان کے رب کا عذاب نڈر (اور بےخوف) ہونے کی چیز ہے ہی نہیں",
        "English" : "Verily the torment of their Lord is not a thing to feel secure from."
      },
      {
        "ayet_no" : 29,
        "arbi" : "وَالَّذِيْنَ هُمْ لِفُرُوْجِهِمْ حٰفِظُوْنَ",
        "Urdu" : "اور جو حفاظت کرتے ہیںاپنی شرمگاہوں کی",
        "English" : "And those who of their private parts are guards."
      },
      {
        "ayet_no" : 30,
        "arbi" : "اِلَّا عَلٰٓي اَزْوَاجِهِمْ اَوْ مَا مَلَكَتْ اَيْمَانُهُمْ فَاِنَّهُمْ غَيْرُ مَلُوْمِيْنَ",
        "Urdu" : "مگراپنی بیویوں یا ان باندیوں سے جن کے وہ مالک ہوتے ہیں کہ ان میں ان پر کوئی ملامت نہیں",
        "English" : "Except from their wives or the female slaves they possess. So (in this) there is no blame on them."
      },
      {
        "ayet_no" : 31,
        "arbi" : "فَمَنِ ابْتَغٰى وَرَاۗءَ ذٰلِكَ فَاُولٰۗىِٕكَ هُمُ الْعٰدُوْنَ",
        "Urdu" : "پس جس نے ڈھونڈی کوئی راہ اس کے سوا (اپنی شہوت رانی کے لئے) تو ایسے ہی لوگ ہیں حد سے نکلنے والے",
        "English" : "But who so seek more than that, those are they who are transgressors;"
      },
      {
        "ayet_no" : 32,
        "arbi" : "وَالَّذِيْنَ هُمْ لِاَمٰنٰتِهِمْ وَعَهْدِهِمْ رٰعُوْنَ",
        "Urdu" : "اور جو پاس (و لحاظ) رکھتے ہیںاپنی امانتوں اور اپنے عہدوں کا",
        "English" : "And those who of their trusts and their covenant are keepers."
      },
      {
        "ayet_no" : 33,
        "arbi" : "وَالَّذِيْنَ هُمْ بِشَهٰدٰتِهِمْ قَاۗىِٕمُوْنَ",
        "Urdu" : "اور جو قائم رہتے ہیںاپنی گواہیوں کی ادائیگی میں (صداقت و راست بازی پر)",
        "English" : "And those who stand firm in their testimonies."
      },
      {
        "ayet_no" : 34,
        "arbi" : "وَالَّذِيْنَ هُمْ عَلٰي صَلَاتِهِمْ يُحَافِظُوْنَ",
        "Urdu" : "اور جو حفاظت کرتے ہیںاپنی نمازوں (کی ادائیگی اور پابندی) کی ف۱",
        "English" : "And those who of their prayer are observant."
      },
      {
        "ayet_no" : 35,
        "arbi" : "اُولٰۗىِٕكَ فِيْ جَنّٰتٍ مُّكْرَمُوْنَ",
        "Urdu" : "سوا ایسے ہی لوگ ہیں جو نہایت عزت (و آرام) سے رہیں گے عظیم الشان جنتوں میں",
        "English" : "Those shall dwell in Gardens, honoured."
      },
      {
        "ayet_no" : 36,
        "arbi" : "فَمَالِ الَّذِيْنَ كَفَرُوْا قِبَلَكَ مُهْطِعِيْنَ",
        "Urdu" : "پھر کیا ہوگیا ان کافروں کو جو دوڑے چلے آتے ہیں آپ کی طرف (اے پیغمبر!)",
        "English" : "So what has happened to those who disbelieve that they are rushing towards you"
      },
      {
        "ayet_no" : 37,
        "arbi" : "عَنِ الْيَمِيْنِ وَعَنِ الشِّمَالِ عِزِيْنَ",
        "Urdu" : "دائیں سے بھی اور بائیں سے بھی گروہ در گروہ ہو کر ف۲",
        "English" : "(Sitting) in groups on the right and on the left (of you, O Muhammad) ?"
      },
      {
        "ayet_no" : 38,
        "arbi" : "اَيَطْمَعُ كُلُّ امْرِۍ مِّنْهُمْ اَنْ يُّدْخَلَ جَنَّةَ نَعِيْمٍ",
        "Urdu" : "کیا ان میں سے ہر کوئی یہ چاہتا ہے کہ اسے یونہی داخل کر دیا جائے گا نعمتوں بھری جنت میں",
        "English" : "Does every one of them aspire to be admitted to the garden of bliss ?"
      },
      {
        "ayet_no" : 39,
        "arbi" : "كَلَّا ۭ اِنَّا خَلَقْنٰهُمْ مِّمَّا يَعْلَمُوْنَ",
        "Urdu" : "( نہیں اور) ہرگز نہیں بلاشبہ ہم نے پیدا کیا ان کو اس چیز سے جس کو یہ خود بھی جانتے ہیں",
        "English" : "By no means! We have created them from what they know."
      },
      {
        "ayet_no" : 40,
        "arbi" : "فَلَآ اُقْسِمُ بِرَبِّ الْمَشٰرِقِ وَالْمَغٰرِبِ اِنَّا لَقٰدِرُوْنَ",
        "Urdu" : "پس نہیں میں قسم کھاتا ہوں مشرقوں اور مغربوں کے رب کی کہ بلاشبہ ہم پوری طرح قادر ہیں",
        "English" : "I swear by the Lord of the easts and the wests, that, verily We are Able."
      },
      {
        "ayet_no" : 41,
        "arbi" : "عَلٰٓي اَنْ نُّبَدِّلَ خَيْرًا مِّنْهُمْ ۙ وَمَا نَحْنُ بِمَسْبُوْقِيْنَ",
        "Urdu" : "اس بات پر کہ ہم ان کی جگہ ان سے بہتر لوگ لے آئیں اور ہم سے کوئی بازی نہیں لے جاسکتا",
        "English" : "To replace them by others better than they; and We are not to be outrun."
      },
      {
        "ayet_no" : 42,
        "arbi" : "فَذَرْهُمْ يَخُوْضُوْا وَيَلْعَبُوْا حَتّٰى يُلٰقُوْا يَوْمَهُمُ الَّذِيْ يُوْعَدُوْنَ",
        "Urdu" : "پس چھوڑ دو ان کو کہ یہ یونہی پڑے رہیںاپنی بےہودہ باتوں اور اپنے (لایعنی) کھیل تماشوں میں یہاں تک یہ پہنچ جائیں اپنے اس دن کو جس کا وعدہ ان سے کیا جا رہا ہے",
        "English" : "So leave them to plunge in vain talk and play about, until they meet their Day which they are promised."
      },
      {
        "ayet_no" : 43,
        "arbi" : "يَوْمَ يَخْرُجُوْنَ مِنَ الْاَجْدَاثِ سِرَاعًا كَاَنَّهُمْ اِلٰى نُصُبٍ يُّوْفِضُوْنَ",
        "Urdu" : "جس دن کہ یہ لوگاپنی قبروں سے نکل نکل کر ایسے دوڑے جا رہے ہوں گے جیسے کہ وہ اپنے بتوں کے استھانوں کی طرف (لپک لپک کر) دوڑے جا رہے ہوں",
        "English" : "The Day whereon they shall come forth from the sepulchres hastily, as though they were to an altar hurrying."
      },
      {
        "ayet_no" : 44,
        "arbi" : "خَاشِعَةً اَبْصَارُهُمْ تَرْهَقُهُمْ ذِلَّةٌ ۭ ذٰلِكَ الْيَوْمُ الَّذِيْ كَانُوْا يُوْعَدُوْنَ",
        "Urdu" : "(اس روز) ان کا حال یہ ہوگا کہ (مارے شرم کے) جھکی ہوئی ہوں گی ان کی نگاہیں اور چھا رہی ہوگی ان (کے چہروں) پر ایک ہولناک (سیاہی اور) ذلت یہ ہے وہ دن جس کا ان سے وعدہ کیا جاتا تھا ف۱",
        "English" : "Downcast shall be their looks; abjectness shall overspread them. Such is the Day which they are promised."
      }
    ]
  }
]