[
  {
    "surah_no" : 74,
    "total_ayah" : 56,
    "name" : "Surah e AL-Mudasir",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "يٰٓاَيُّهَا الْمُدَّثِّرُ",
        "Urdu" : "اے کپڑے میں لپٹنے والے ف۳",
        "English" : "O you who are clothed!"
      },
      {
        "ayet_no" : 2,
        "arbi" : "قُمْ فَاَنْذِرْ",
        "Urdu" : "اٹھو اور خبردار کرو",
        "English" : "Arise, and warn."
      },
      {
        "ayet_no" : 3,
        "arbi" : "وَرَبَّكَ فَكَبِّرْ",
        "Urdu" : "اپنے رب کی بڑائی کا اعلان کرو",
        "English" : "And glorify the Greatness (and Majesty) of your Lord."
      },
      {
        "ayet_no" : 4,
        "arbi" : "وَثِيَابَكَ فَطَهِّرْ",
        "Urdu" : "اپنے کپڑوں کو پاک رکھو",
        "English" : "And thine raiment purify."
      },
      {
        "ayet_no" : 5,
        "arbi" : "وَالرُّجْزَ فَاهْجُرْ",
        "Urdu" : "گندگی سے دور رہو",
        "English" : "And keep away from the idols (and sins as usual)."
      },
      {
        "ayet_no" : 6,
        "arbi" : "وَلَا تَمْنُنْ تَسْتَكْثِرُ",
        "Urdu" : "اور احسان نہ کرو زیادہ حاصل کرنے کے لئے",
        "English" : "And do not do a favour (to anyone merely) to seek more (in return)."
      },
      {
        "ayet_no" : 7,
        "arbi" : "وَلِرَبِّكَ فَاصْبِرْ",
        "Urdu" : "اور اپنے رب (کی رضا) کے لئے صبر سے کام لیتے رہو",
        "English" : "And for the sake of your Lord, observe patience."
      },
      {
        "ayet_no" : 8,
        "arbi" : "فَاِذَا نُقِرَ فِي النَّاقُوْرِ",
        "Urdu" : "پھر (ان کو خبردار کر دو اس ہولناک انجام سے کہ) جب پھونک مار دی جائے گی اس کھوکھری چیز (صور) میں",
        "English" : "Then when the horn shall be blown,"
      },
      {
        "ayet_no" : 9,
        "arbi" : "فَذٰلِكَ يَوْمَىِٕذٍ يَّوْمٌ عَسِيْرٌ",
        "Urdu" : "تو یہ دن بڑا ہی سخت دن ہوگا",
        "English" : "That shall be - that Day-a day hard."
      },
      {
        "ayet_no" : 10,
        "arbi" : "عَلَي الْكٰفِرِيْنَ غَيْرُ يَسِيْرٍ",
        "Urdu" : "کافروں پر وہ (کسی بھی طرح) آسان نہیں ہوگا",
        "English" : "For the infidels, not easy."
      },
      {
        "ayet_no" : 11,
        "arbi" : "ذَرْنِيْ وَمَنْ خَلَقْتُ وَحِيْدًا",
        "Urdu" : "چھوڑ دو مجھے اور اس شخص کو جس کو میں نے پیدا کیا اکیلا",
        "English" : "Let Me alone with him whom I created lonely."
      },
      {
        "ayet_no" : 12,
        "arbi" : "وَّجَعَلْتُ لَهٗ مَالًا مَّمْدُوْدًا",
        "Urdu" : "اور اس کو میں نے بہت سارا مال بھی دیا",
        "English" : "And for whom I appointed wealth extended."
      },
      {
        "ayet_no" : 13,
        "arbi" : "وَّبَنِيْنَ شُهُوْدًا",
        "Urdu" : "اور حاضر رہنے والے بیٹے بھی",
        "English" : "And sons present by his side."
      },
      {
        "ayet_no" : 14,
        "arbi" : "وَّمَهَّدْتُّ لَهٗ تَمْهِيْدًا",
        "Urdu" : "اور بھی اس کے لئے ہر طرح کا سامان مہیا کر دیا",
        "English" : "And for whom I smoothed everything."
      },
      {
        "ayet_no" : 15,
        "arbi" : "ثُمَّ يَطْمَعُ اَنْ اَزِيْدَ",
        "Urdu" : "پھر بھی وہ اس بات کی طمع رکھتا ہے کہ میں اسے اور زیادہ دوں",
        "English" : "Still, he aspires that I should give him more."
      },
      {
        "ayet_no" : 16,
        "arbi" : "كَلَّا ۭ اِنَّهٗ كَانَ لِاٰيٰتِنَا عَنِيْدًا",
        "Urdu" : "ہرگز نہیں کہ وہ میری آیتوں سے عناد رکھتا ہے",
        "English" : "Never! He is inimical towards Our verses."
      },
      {
        "ayet_no" : 17,
        "arbi" : "سَاُرْهِقُهٗ صَعُوْدًا",
        "Urdu" : "میں تو اسے (دوزخ کے ایک پہاڑ یعنی) صعود پر چڑھاؤں گا",
        "English" : "I will make a distressing punishment overtake him."
      },
      {
        "ayet_no" : 18,
        "arbi" : "اِنَّهٗ فَكَّرَ وَقَدَّرَ",
        "Urdu" : "اس نے سوچا اور کچھ بات بنانے کی کوشش کی",
        "English" : "Verily he considered, and devised."
      },
      {
        "ayet_no" : 19,
        "arbi" : "فَقُتِلَ كَيْفَ قَدَّرَ",
        "Urdu" : "پس خدا کی مار ہو اس پر اس نے کیسی بات بنانے کی کوشش کی",
        "English" : "So let him be cursed! How he plotted!"
      },
      {
        "ayet_no" : 20,
        "arbi" : "ثُمَّ قُتِلَ كَيْفَ قَدَّرَ",
        "Urdu" : "ہاں پھر اس پر خدا کی مار ہو اس نے کیسی بات بنانے کی کوشش کی",
        "English" : "And again perish he! How maliciously he devised!"
      },
      {
        "ayet_no" : 21,
        "arbi" : "ثُمَّ نَــظَرَ",
        "Urdu" : "پھر اس نے (لوگوں کی طرف) دیکھا",
        "English" : "Then looked he,"
      },
      {
        "ayet_no" : 22,
        "arbi" : "ثُمَّ عَبَسَ وَبَسَرَ",
        "Urdu" : "پھر اس نے تیوری چڑھائی اور منہ بنایا",
        "English" : "Then frowned he and scowled."
      },
      {
        "ayet_no" : 23,
        "arbi" : "ثُمَّ اَدْبَرَ وَاسْتَكْبَرَ",
        "Urdu" : "پھر اس نے پیٹھ پھیری اوراپنی بڑائی کا گھمنڈ کیا",
        "English" : "Then turned he back, and grew stiff-necked."
      },
      {
        "ayet_no" : 24,
        "arbi" : "فَقَالَ اِنْ هٰذَآ اِلَّا سِحْرٌ يُّؤْثَرُ",
        "Urdu" : "پھر اس نے (اپنی قوم کو خوش کرنے کے لئے) کہا کہ نہیں ہے یہ (قران) مگر ایک جادو جو نقل ہوتا چلا آ رہا ہے",
        "English" : "Then he said: ‘This (Qur’an) is nothing but magic which is being transmitted from the past (magicians)."
      },
      {
        "ayet_no" : 25,
        "arbi" : "اِنْ هٰذَآ اِلَّا قَوْلُ الْبَشَرِ",
        "Urdu" : "یہ نہیں ہے مگر انسان کا (بنایا ہوا) کلام",
        "English" : "Naught is this but the word of Man."
      },
      {
        "ayet_no" : 26,
        "arbi" : "سَاُصْلِيْهِ سَقَرَ",
        "Urdu" : "میں عنقریب ہی جھونک دوں گا اس کو دوزخ (کی اس دہکتی بھڑکتی آگ) میں",
        "English" : "I will put him into Saqar (Hell)."
      },
      {
        "ayet_no" : 27,
        "arbi" : "وَمَآ اَدْرٰىكَ مَا سَقَرُ",
        "Urdu" : "اور تم کیا جانو کہ کیا ہے وہ دوزخ (کی دہکتی آگ) ؟ ف۱",
        "English" : "And what can let you know what Saqar is ?"
      },
      {
        "ayet_no" : 28,
        "arbi" : "لَا تُبْقِيْ وَلَا تَذَرُ",
        "Urdu" : "وہ نہ کسی پر ترس کھائے گی اور نہ کسی کو چھوڑے گی ف۲",
        "English" : "It neither spares (anything inside it from burning) nor leaves (any disbeliever outside)."
      },
      {
        "ayet_no" : 29,
        "arbi" : "لَوَّاحَةٌ لِّلْبَشَرِ",
        "Urdu" : "وہ انسان کو جھلس جھلس کر رکھ دے گی ف۳",
        "English" : "It will disfigure the skins."
      },
      {
        "ayet_no" : 30,
        "arbi" : "عَلَيْهَا تِسْعَةَ عَشَرَ",
        "Urdu" : "اور اس پر انیس (کارندے) مقرر ہوں گے",
        "English" : "Appointed on it are nineteen (wardens)."
      },
      {
        "ayet_no" : 31,
        "arbi" : "وَمَا جَعَلْنَآ اَصْحٰبَ النَّارِ اِلَّا مَلٰۗىِٕكَةً ۠ وَمَا جَعَلْنَا عِدَّتَهُمْ اِلَّا فِتْنَةً لِّلَّذِيْنَ كَفَرُوْا ۙ لِيَسْتَيْقِنَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ وَيَزْدَادَ الَّذِيْنَ اٰمَنُوْٓا اِيْمَانًا وَّلَا يَرْتَابَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ وَالْمُؤْمِنُوْنَ ۙ وَلِيَقُوْلَ الَّذِيْنَ فِيْ قُلُوْبِهِمْ مَّرَضٌ وَّالْكٰفِرُوْنَ مَاذَآ اَرَادَ اللّٰهُ بِهٰذَا مَثَلًا ۭ كَذٰلِكَ يُضِلُّ اللّٰهُ مَنْ يَّشَاۗءُ وَيَهْدِيْ مَنْ يَّشَاۗءُ ۭ وَمَا يَعْلَمُ جُنُوْدَ رَبِّكَ اِلَّا هُوَ ۭ وَمَا ھِيَ اِلَّا ذِكْرٰى لِلْبَشَرِ",
        "Urdu" : "اور ہم نے دوزخ کے یہ کارندے نہیں بنائے مگر فرشتے اور ان کی اس تعداد کو بھی ہم نے نہیں بنایا مگر ایک آزمائش کفر والوں کے لئے تاکہ یقین کرلیں وہ لوگ جن کو کتاب دی گئی ہے اور ان لوگوں کا ایمان اور بڑھ جائے جو ایمان لا چکے ہیں اور شک میں نہ پڑیں وہ لوگ جن کو کتاب دی گئی ہے اور ایمان والے اور تاکہ کہیں وہ لوگ جن کے دلوں میں روگ ہے اور (دوسرے) کھلے کافر کہ بھلا اللہ کو کیا لگے ایسی مثالوں کے بیان سے؟ اسی طرح اللہ گمراہی میں ڈال دیتا ہے جس کو چاہتا ہے اور ہدایت سے سرفراز فرما دیتا ہے جس کو چاہتا ہے اور نہیں جان سکتا کوئی تمہارے رب کے لشکروں کو مگر خود وہی ف ۱ اور نہیں ہے یہ (سفر اور اس کے احوال کا ذکر) مگر ایک عظیم الشان نصیحت سب لوگوں کے لئے",
        "English" : "And We did not make wardens of the Fire but (from) angels, and did not fix their number but as a test for those who disbelieve, so that those who are given the Book may come to believe, and those who believe may improve in belief, and so that those who are given the Book and those who believe may not doubt (its correctness) , and so that those having malady in their hearts and the disbelievers say, :What has Allah meant by this strange statement? Thus Allah lets go astray whomever He wills, and leads to the right path whomever He wills. And no one knows the hosts of your Lord but He. And this is nothing else but a reminder for mankind."
      },
      {
        "ayet_no" : 32,
        "arbi" : "كَلَّا وَالْقَمَرِ",
        "Urdu" : "ہرگز نہیں قسم ہے چاند کی",
        "English" : "Truly, I swear by the moon,"
      },
      {
        "ayet_no" : 33,
        "arbi" : "وَالَّيْلِ اِذْ اَدْبَرَ",
        "Urdu" : "اور رات کی جب کہ وہ ڈھل جائے",
        "English" : "By the night when it with draw."
      },
      {
        "ayet_no" : 34,
        "arbi" : "وَالصُّبْحِ اِذَآ اَسْفَرَ",
        "Urdu" : "اور صبح کی جب کہ وہ روشن ہو جائے",
        "English" : "By the morning when it brighten."
      },
      {
        "ayet_no" : 35,
        "arbi" : "اِنَّهَا لَاِحْدَى الْكُبَرِ",
        "Urdu" : "بلاشبہ وہ (دوزخ) بڑی بھاری چیزوں میں سے ایک ہے",
        "English" : "Surely this (Hell) is one of the greatest calamities."
      },
      {
        "ayet_no" : 36,
        "arbi" : "نَذِيْرًا لِّلْبَشَرِ",
        "Urdu" : "ایک بڑا بھاری ڈراوا (نوع) بشر کے لئے ف۲",
        "English" : "A warning to mankind,"
      },
      {
        "ayet_no" : 37,
        "arbi" : "لِمَنْ شَاۗءَ مِنْكُمْ اَنْ يَّتَقَدَّمَ اَوْ يَتَاَخَّرَ",
        "Urdu" : "تم میں سے ہر ایک شخص کے لئے جو آگے بڑھنا چاہے یا پیچھے رہ جانا چاہے",
        "English" : "A warning Unto him of you who shall go forward or who choose to lag behind."
      },
      {
        "ayet_no" : 38,
        "arbi" : "كُلُّ نَفْسٍۢ بِمَا كَسَبَتْ رَهِيْنَةٌ",
        "Urdu" : "ہر شخص اپنے کئے کے بدلہ میں رہن ہوگا",
        "English" : "Every soul will be (held) in pledge for its deeds."
      },
      {
        "ayet_no" : 39,
        "arbi" : "اِلَّآ اَصْحٰبَ الْيَمِيْنِ",
        "Urdu" : "مگر دائیں بازو والے",
        "English" : "Save the fellows of the right."
      },
      {
        "ayet_no" : 40,
        "arbi" : "فِيْ جَنّٰتٍ   ۺ يَتَسَاۗءَلُوْنَ",
        "Urdu" : "کہ وہ عالیشان جنتوں میں ہوں گے پوچھتے ہوں گے",
        "English" : "In gardens they will ask one another"
      },
      {
        "ayet_no" : 41,
        "arbi" : "عَنِ الْمُجْرِمِيْنَ",
        "Urdu" : "مجرم لوگوں سے",
        "English" : "And (ask) of the Sinners:"
      },
      {
        "ayet_no" : 42,
        "arbi" : "مَا سَلَكَكُمْ فِيْ سَقَرَ",
        "Urdu" : "کہ کس چیز نے داخل کر دیا تم کو دوزخ (کی اس دہکتی آگ) میں ؟",
        "English" : "What has caused you to enter Hell ?"
      },
      {
        "ayet_no" : 43,
        "arbi" : "قَالُوْا لَمْ نَكُ مِنَ الْمُصَلِّيْنَ",
        "Urdu" : "وہ کہیں گے کہ ہم نہیں تھے نماز پڑھنے والوں میں",
        "English" : "They will say. 'we have not been of those who prayed."
      },
      {
        "ayet_no" : 44,
        "arbi" : "وَلَمْ نَكُ نُطْعِمُ الْمِسْكِيْنَ",
        "Urdu" : "اور نہ ہی ہم کھانا کھلایا کرتے تھے مسکین کو",
        "English" : "And we have not been feeding the poor."
      },
      {
        "ayet_no" : 45,
        "arbi" : "وَكُنَّا نَخُوْضُ مَعَ الْخَاۗىِٕضِيْنَ",
        "Urdu" : "اور ہم باتیں بنانے میں لگے رہا کرتے تھے (حق کیخلاف) باتیں بنانے والوں کے ساتھ",
        "English" : "And we used to talk falsehood (all that which Allah hated) with vain talkers."
      },
      {
        "ayet_no" : 46,
        "arbi" : "وَكُنَّا نُكَذِّبُ بِيَوْمِ الدِّيْنِ",
        "Urdu" : "اور ہم جھٹلایا کرتے تھے بدلے کے دن کو",
        "English" : "And we have been belying the Day of Requital."
      },
      {
        "ayet_no" : 47,
        "arbi" : "حَتّىٰٓ اَتٰىنَا الْيَقِيْنُ",
        "Urdu" : "یہاں تک کہ آ پہنچی ہم کو وہ یقینی حقیقت (یعنی موت)",
        "English" : "Until there came to us (the death) that is certain."
      },
      {
        "ayet_no" : 48,
        "arbi" : "فَمَا تَنْفَعُهُمْ شَفَاعَةُ الشّٰفِعِيْنَ",
        "Urdu" : "تب انکے کچھ بھی کام نہ آ سکے گی سفارش کرنے والوں کی کوئی سفارش",
        "English" : "Then intercession of intercessors will not benefit them."
      },
      {
        "ayet_no" : 49,
        "arbi" : "فَمَا لَهُمْ عَنِ التَّذْكِرَةِ مُعْرِضِيْنَ",
        "Urdu" : "تو کیا ہوگیا ان لوگوں کو جو اس (عظیم الشان) نصیحت سے منہ موڑے ہوئے ہیں",
        "English" : "Then what is wrong with them (i.e. the disbelievers) that they turn away from (receiving) admonition ?"
      },
      {
        "ayet_no" : 50,
        "arbi" : "كَاَنَّهُمْ حُمُرٌ مُّسْتَنْفِرَةٌ",
        "Urdu" : "گویا کہ یہ بدکنے والے (جنگلی) گدھے ہیں",
        "English" : "As if they were frightened (wild) donkeys."
      },
      {
        "ayet_no" : 51,
        "arbi" : "فَرَّتْ مِنْ قَسْوَرَةٍ",
        "Urdu" : "جو بھاگ کھڑے ہوئے ہیں شیر سے",
        "English" : "Fleeing away from a lion."
      },
      {
        "ayet_no" : 52,
        "arbi" : "بَلْ يُرِيْدُ كُلُّ امْرِۍ مِّنْهُمْ اَنْ يُّؤْتٰى صُحُفًا مُّنَشَّرَةً",
        "Urdu" : "بلکہ ان میں سے ہر شخص یہ چاہتا ہے کہ اسکو براہ راست دیئے جائیں کھلے ہوئے نوشتے",
        "English" : "Rather, every one of them wishes that he should be given unrolled (divine) scriptures."
      },
      {
        "ayet_no" : 53,
        "arbi" : "كَلَّا ۭ بَلْ لَّا يَخَافُوْنَ الْاٰخِرَةَ",
        "Urdu" : "ہرگز نہیں بلکہ اصل بات یہ ہے کہ یہ لوگ ڈرتے نہیں آخرت (کی پکڑ اور اسکے عذاب) سے",
        "English" : "Never! But they do not fear the Hereafter."
      },
      {
        "ayet_no" : 54,
        "arbi" : "كَلَّآ اِنَّهٗ تَذْكِرَةٌ",
        "Urdu" : "ہرگز نہیں یہ (قران) تو قطعی طور پر ایک عظیم الشان نصیحت (اور یاد دہانی) ہے",
        "English" : "Never! Indeed, this is a Reminder."
      },
      {
        "ayet_no" : 55,
        "arbi" : "فَمَنْ شَاۗءَ ذَكَرَهٗ",
        "Urdu" : "سو جس کا جی چاہے اس سے نصیحت حاصل کرے",
        "English" : "So, whoever so wishes may take advice from it."
      },
      {
        "ayet_no" : 56,
        "arbi" : "وَمَا يَذْكُرُوْنَ اِلَّآ اَنْ يَّشَاۗءَ اللّٰهُ ۭ هُوَ اَهْلُ التَّقْوٰى وَاَهْلُ الْمَغْفِرَةِ",
        "Urdu" : "اور یہ لوگ نصیحت نہیں حاصل کر سکتے مگر یہ کہ اللہ ہی چاہے وہی ہے اس لائق کہ اس سے ڈرا جائے اور اسی کی شان ہے بخشش فرمانا ف۱",
        "English" : "And they will not take advice unless Allah so wills. He is worthy to be feared, and worthy to forgive."
      }
    ]
  }
]