[
  {
    "surah_no" : 71,
    "total_ayah" : 28,
    "name" : "Surah e Noah",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "اِنَّآ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖٓ اَنْ اَنْذِرْ قَوْمَكَ مِنْ قَبْلِ اَنْ يَّاْتِيَهُمْ عَذَابٌ اَلِيْمٌ",
        "Urdu" : "بلا شبہ ہم ہی نے بھیجا نوح کو (پیغمبر بنا کر) ان کی قوم کی طرف کہ خبردار کرواپنی قوم کو قبل اس سے کہ آ پہنچے ان کو (ان کے کفر و انکار پر) ایک بڑا ہی (ہولناک اور) دردناک عذاب",
        "English" : "We sent NuH to his people (and said to him) : :Warn your people before a painful punishment comes to them."
      },
      {
        "ayet_no" : 2,
        "arbi" : "قَالَ يٰقَوْمِ اِنِّىْ لَكُمْ نَذِيْرٌ مُّبِيْنٌ",
        "Urdu" : "چنانچہ انہوں نے (پوری صراحت و وضاحت سے اور درد بھرے انداز میں ان سے) کہا اے میری قوم کے لوگوں بلاشبہ میں تمہارے لئے خبردار کرنے والا ہوں کھول کر (حق اور حقیقت کو)",
        "English" : "He said: O my people! verily I am Unto you a warner manifest."
      },
      {
        "ayet_no" : 3,
        "arbi" : "اَنِ اعْبُدُوا اللّٰهَ وَاتَّقُوْهُ وَاَطِيْعُوْنِ",
        "Urdu" : "(میرا پیغام یہ ہے) کہ تم لوگ بندگی کرو (ایک) اللہ کی اسی سے ڈرو اور میرا کہا مانو",
        "English" : "Worship Allah, and fear Him, and obey me."
      },
      {
        "ayet_no" : 4,
        "arbi" : "يَغْفِرْ لَكُمْ مِّنْ ذُنُوْبِكُمْ وَيُؤَخِّرْكُمْ اِلٰٓى اَجَلٍ مُّسَمًّى ۭ اِنَّ اَجَلَ اللّٰهِ اِذَا جَاۗءَ لَا يُؤَخَّرُ  ۘ لَوْ كُنْتُمْ تَعْلَمُوْنَ",
        "Urdu" : "جس پر درگزر فرما لے گا وہ (غفور رحیم) تمہارے گناہوں میں سے اور مہلت عطا فرما دے گا تم کو ایک مقرر وقت تک بلاشبہ اللہ کا مقرر کیا ہوا وقت جب آ پہنچتا ہے تو پھر اسے ٹالا نہیں جا سکتا کاش کہ تم لوگ جان لیتے",
        "English" : "He will forgive you your sins, and will defer you to an appointed term. Verily the term of Allah when it come shall not be deferred, if ye but knew."
      },
      {
        "ayet_no" : 5,
        "arbi" : "قَالَ رَبِّ اِنِّىْ دَعَوْتُ قَوْمِيْ لَيْلًا وَّنَهَارًا",
        "Urdu" : "(آخر کار) نوح نے (نہایت درد بھرے انداز میں اپنے رب کے حضور) عرض کیا کہ اے میرے رب بیشک میں نے بلایااپنی قوم کو (حق و ہدایت کی طرف) دن کو بھی اور رات کو بھی",
        "English" : "He said: my Lord! verily have called my people night and day."
      },
      {
        "ayet_no" : 6,
        "arbi" : "فَلَمْ يَزِدْهُمْ دُعَاۗءِيْٓ اِلَّا فِرَارًا",
        "Urdu" : "مگر میری اس دعوت (و پکار) سے وہ اور بھی (بدکتے اور) بھاگتے گئے (راہ حق و صواب سے)",
        "English" : "But all my calling added nothing but to (their) flight (from the truth)."
      },
      {
        "ayet_no" : 7,
        "arbi" : "وَاِنِّىْ كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوْٓا اَصَابِعَهُمْ فِيْٓ اٰذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَاَصَرُّوْا وَاسْتَكْبَرُوا اسْتِكْبَارًا",
        "Urdu" : "اور میں نے جب بھی ان کو بلایا کہ تو بخشش فرما دے ان کی (اے میرے مالک!) تو انہوں نے ٹھونس دیںاپنی انگلیاں اپنے کانوں میں اور لپیٹ لئے (اپنے اوپر) اپنے کپڑے اور وہ اڑ گئے (اپنے کفر و باطل پر) اور بپھر گئےاپنی (جھوٹی) بڑائی کے گھمنڈ میں بہت بری طرح سے ف۱",
        "English" : "Whenever I called them, so that You might forgive them, they put their fingers into their ears, and wrapped their clothes around themselves, and grew obstinate, and waxed proud in extreme arrogance."
      },
      {
        "ayet_no" : 8,
        "arbi" : "ثُمَّ اِنِّىْ دَعَوْتُهُمْ جِهَارًا",
        "Urdu" : "پھر بھی میں ان کو (حق کی) دعوت دی ہانکے پکارے",
        "English" : "And lo! I have called unto them aloud,"
      },
      {
        "ayet_no" : 9,
        "arbi" : "ثُمَّ اِنِّىْٓ اَعْلَنْتُ لَهُمْ وَاَسْرَرْتُ لَهُمْ اِسْرَارًا",
        "Urdu" : "پھر میں نے ان کو اعلانیہ بھی تبلیغ کی اور چپکے چپکے بھی ان کو سمجھایا",
        "English" : "Then verily spake Unto them openly, and secretly also I addressed them."
      },
      {
        "ayet_no" : 10,
        "arbi" : "فَقُلْتُ اسْتَغْفِرُوْا رَبَّكُمْ ۭ اِنَّهٗ كَانَ غَفَّارًا",
        "Urdu" : "سو میں نے (ان سے) کہا کہ تم لوگ بخشش مانگو اپنے رب سے (اپنے گناہوں کی وہ بخش دے گا کہ) بلاشبہ وہ بڑا ہی بخشنے والا ہے ف۲",
        "English" : "And I said: ask forgiveness of your Lord; verily He is ever Most Forgiving."
      },
      {
        "ayet_no" : 11,
        "arbi" : "يُّرْسِلِ السَّمَاۗءَ عَلَيْكُمْ مِّدْرَارًا",
        "Urdu" : "وہ (اپنی رحمت و عنایت سے) تم پر دھانے کھول دے گا باران رحمت کے",
        "English" : "He will send down on you torrents of rain,"
      },
      {
        "ayet_no" : 12,
        "arbi" : "وَّيُمْدِدْكُمْ بِاَمْوَالٍ وَّبَنِيْنَ وَيَجْعَلْ لَّكُمْ جَنّٰتٍ وَّيَجْعَلْ لَّكُمْ اَنْهٰرًا",
        "Urdu" : "وہ تم کو نوازے گا طرح طرح کے مالوں (کی ترقی و) مدد سے اور (ہونہار) بیٹوں سے وہ تمہارے لئے باغات بھی پیدا فرما دے گا اور نہریں بھی جاری کر دے گا",
        "English" : "And He will add Unto you riches and children and will appoint Unto you gardens and will appoint Unto you rivers."
      },
      {
        "ayet_no" : 13,
        "arbi" : "مَا لَكُمْ لَا تَرْجُوْنَ لِلّٰهِ وَقَارًا",
        "Urdu" : "تمہیں کیا ہوگیا (اے میری قوم کے لوگو!) کہ تم لوگ اللہ (پاک سبحانہ و تعالیٰ) کے لئے توقع نہیں رکھتے کسی (عظمت و) وقار کی",
        "English" : "What is the matter with you, [that you fear notAllah (His punishment) , and] you hope not for reward (from Allah or you believe not in His Oneness)."
      },
      {
        "ayet_no" : 14,
        "arbi" : "وَقَدْ خَلَقَكُمْ اَطْوَارًا",
        "Urdu" : "حالانکہ اس نے تم کو پیدا کیا طرح طرح سے (اور مختلف مراحل سے گزار کر)",
        "English" : "And surely He hath created you by stages."
      },
      {
        "ayet_no" : 15,
        "arbi" : "اَلَمْ تَرَوْا كَيْفَ خَلَقَ اللّٰهُ سَبْعَ سَمٰوٰتٍ طِبَاقًا",
        "Urdu" : "کیا تم دیکھتے نہیں کہ اللہ نے کس طرح بنایا سات آسمانوں کو تہ بہ تہ",
        "English" : "Behold you not in what wise Allah hath created seven heavens in storeys."
      },
      {
        "ayet_no" : 16,
        "arbi" : "وَّجَعَلَ الْقَمَرَ فِيْهِنَّ نُوْرًا وَّجَعَلَ الشَّمْسَ سِرَاجًا",
        "Urdu" : "اور ان میں اس نے رکھ دیا چاند کو ایک عظیم الشان نور کی شکل میں اور سورج کو ایک عظیم الشان چراغ بنا کر",
        "English" : "And has made the moon a light therein, and made the sun a lamp?"
      },
      {
        "ayet_no" : 17,
        "arbi" : "وَاللّٰهُ اَنْۢبَتَكُمْ مِّنَ الْاَرْضِ نَبَاتًا",
        "Urdu" : "اور اللہ ہی نے اگایا تم سب کو زمین سے ایک عظیم الشان (اور حکمتوں بھرے) طریقے سے",
        "English" : "And Allah hath caused you to grow from the earth as a growth."
      },
      {
        "ayet_no" : 18,
        "arbi" : "ثُمَّ يُعِيْدُكُمْ فِيْهَا وَيُخْرِجُكُمْ اِخْرَاجًا",
        "Urdu" : "پھر وہی تم کو وا پس لے جائے گا اس میں اور وہی تم کو اس سے باہر نکال لائے گا (قیامت کے روز) ایک ہی حکم سے",
        "English" : "And thereafter He will cause you to return there into, and He will bring you forth a forth bringing."
      },
      {
        "ayet_no" : 19,
        "arbi" : "وَاللّٰهُ جَعَلَ لَكُمُ الْاَرْضَ بِسَاطًا",
        "Urdu" : "اور اللہ ہی نے بنا دیا تمہارے لئے (اپنی قدرت کاملہ اور حکمت بالغہ سے) اس زمین کو ایک عظیم الشان بچھونا",
        "English" : "And Allah has made for you the earth wide spread (an expanse)."
      },
      {
        "ayet_no" : 20,
        "arbi" : "لِّتَسْلُكُوْا مِنْهَا سُبُلًا فِجَاجًا",
        "Urdu" : "تاکہ تم لوگ چلو اس کے اندر کھلے (کشادہ) راستوں میں",
        "English" : "That of it ye may traverse the ways open."
      },
      {
        "ayet_no" : 21,
        "arbi" : "قَالَ نُوْحٌ رَّبِّ اِنَّهُمْ عَصَوْنِيْ وَاتَّبَعُوْا مَنْ لَّمْ يَزِدْهُ مَالُهٗ وَوَلَدُهٗٓ اِلَّا خَسَارًا",
        "Urdu" : "نوح نے عرض کیا اے میرے رب ان لوگوں نے رد کر دیا ہے میری بات کو اور یہ پیچھے چل پڑے ان لوگوں کے جن کو ان کے مال و اولاد (وغیرہ نعمتوں) نے خسارے (اور نقصان) میں اضافے کے سوا کچھ نہیں دیا",
        "English" : "Nuh said. my Lord! verily they have disobeyed me and followed them whose riches and children have only increased them in loss."
      },
      {
        "ayet_no" : 22,
        "arbi" : "وَمَكَرُوْا مَكْرًا كُبَّارًا",
        "Urdu" : "انہوں نے بڑی بھاری چالیں چلیں",
        "English" : "And they have plotted a mighty plot."
      },
      {
        "ayet_no" : 23,
        "arbi" : "وَقَالُوْا لَا تَذَرُنَّ اٰلِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَّلَا سُوَاعًا ڏ وَّلَا يَغُوْثَ وَيَعُوْقَ وَنَسْرًا",
        "Urdu" : "اور انہوں نے (اپنے پیرؤوں سے) کہا کہ تم لوگ اپنے معبودوں کو ہرگز نہ چھوڑنا اور نہ ہی تم ود ف۱، سواع اور یغوث، یعوق اور نسر کو کسی قیمت پر چھوڑنا",
        "English" : "And they have said: Forsake not your gods. Forsake not Wadd, nor Suwa', nor Yaghuth and Ya'uq and Nasr."
      },
      {
        "ayet_no" : 24,
        "arbi" : "وَقَدْ اَضَلُّوْا كَثِيْرًا   ڬ وَلَا تَزِدِ الظّٰلِمِيْنَ اِلَّا ضَلٰلًا",
        "Urdu" : "انہں نے بہتوں کو گمراہ کر دیا ہے پس اب تو بھی (اے میرے مالک!) ان ظالموں کو گمراہی کے سوا اور کسی چیز میں ترقی نہ دے",
        "English" : "And surely they have misled many. And increase Thou these wrong-doers in naught save error."
      },
      {
        "ayet_no" : 25,
        "arbi" : "مِمَّا خَطِيْۗـــٰٔــتِهِمْ اُغْرِقُوْا فَاُدْخِلُوْا نَارًا ڏ فَلَمْ يَجِدُوْا لَهُمْ مِّنْ دُوْنِ اللّٰهِ اَنْصَارًا",
        "Urdu" : "(سو انجام کار) غرق کر دیا گیا ان لوگوں کو ان کیاپنی انہی خطاؤں کی بناء پر پھر (غرقابی کے بعد) جھونک دیا گیا ان کو ایک بڑی ہی ہولناک آگ میں پھر نہ مل سکا ان کو اپنے لئے اللہ (کی پکڑ اور اس کے عذاب) سے بچانے والا کوئی (یارو) مددگار",
        "English" : "And because of their misdeeds they were drowned, and then they were made to enter a Fire. Then they found not for themselves, beside Allah, any helpers."
      },
      {
        "ayet_no" : 26,
        "arbi" : "وَقَالَ نُوْحٌ رَّبِّ لَا تَذَرْ عَلَي الْاَرْضِ مِنَ الْكٰفِرِيْنَ دَيَّارًا",
        "Urdu" : "اور نوح نے مزید عرض کیا کہ اے میرے رب اب اس زمین پر ان کافروں میں سے کوئی ایک باشندہ بھی باقی نہ چھوڑنا",
        "English" : "And said Nuh, :My Lord, do not leave on earth even a single inhabitant (surviving) out of the disbelievers."
      },
      {
        "ayet_no" : 27,
        "arbi" : "اِنَّكَ اِنْ تَذَرْهُمْ يُضِلُّوْا عِبَادَكَ وَلَا يَلِدُوْٓا اِلَّا فَاجِرًا كَفَّارًا",
        "Urdu" : "(کیونکہ) اگر تو نے ان کو (زندہ) چھوڑ دیا (اے میرے مالک!) تو یہ گمراہ کریں گے تیرے بندوں کو (راہ حق و صواب سے) اور ان کی نسل سے بھی اب بدکار اور سخت کافر کے سوا کوئی جنم نہ لے گا",
        "English" : "If You leave them (surviving) , they will lead Your servants astray, and will beget none but a sinful disbeliever."
      },
      {
        "ayet_no" : 28,
        "arbi" : "رَبِّ اغْفِرْ لِيْ وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَّلِلْمُؤْمِنِيْنَ وَالْمُؤْمِنٰتِ ۭ وَلَا تَزِدِ الظّٰلِمِيْنَ اِلَّا تَبَارًا",
        "Urdu" : "اے میرے رب بخشش فرما دے تو میری بھی میرے ماں باپ کی بھی اور ہر اس شخص کی بھی جو داخل ہو میرے گھر میں ایمان کی حالت میں اور سب ہی ایماندار مردوں اور ایماندار عورتوں کو اور ظالموں کے لئے تباہی (اور بربادی) کے سوا اور کسی چیز میں اضافہ نہیں فرمانا ف۲",
        "English" : "My Lord, grant pardon to me, and to my parents, and to everyone who enters my home as a believer, and to all the believing men and believing women, and do not increase the wrongdoers but in ruin."
      }
    ]
  }
]