[
  {
    "surah_no" : 29,
    "total_ayah" : 69,
    "name" : "Surah e Ankabut",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "الۗمّۗ",
        "Urdu" : "الۗمّۗ",
        "English" : "Alif. Lam. Mim."
      },
      {
        "ayet_no" : 2,
        "arbi" : "اَحَسِبَ النَّاسُ اَنْ يُّتْرَكُوْٓا اَنْ يَّقُوْلُوْٓا اٰمَنَّا وَهُمْ لَا يُفْتَنُوْنَ",
        "Urdu" : "کیا گمان کر لیا ہے لوگوں نے کہ وہ چھوڑ دیئے جائیں گے (صرف اسی چیز پر) کہ وہ کہہ دیںہم ایمان لائے اور وہ نہیں آزمائے جائیں گے ۔",
        "English" : "Do people think that they will be left (at ease) only on their saying, :We believe and will not be put to any test ?"
      },
      {
        "ayet_no" : 3,
        "arbi" : "وَلَقَدْ فَتَنَّا الَّذِيْنَ مِنْ قَبْلِهِمْ فَلَيَعْلَمَنَّ اللّٰهُ الَّذِيْنَ صَدَقُوْا وَلَيَعْلَمَنَّ الْكٰذِبِيْنَ",
        "Urdu" : "اور بلاشبہ یقیناً ہم نے آزمایا (اُن کو) جو ان سے پہلے تھے سو ضرور بالضرور جان لے گا اللہ ( اُن لوگوں کو) جنہوں نے سچ کہا اور وہ ضرور بالضرور جان لے گا جھوٹوں کو ۔",
        "English" : "And assuredly We have tempted those who were before them. So Allah will surely know those who are true and He will surely know the liars."
      },
      {
        "ayet_no" : 4,
        "arbi" : "اَمْ حَسِبَ الَّذِيْنَ يَعْمَلُوْنَ السَّـيِّاٰتِ اَنْ يَّسْبِقُوْنَا  ۭ سَاۗءَ مَا يَحْكُمُوْنَ",
        "Urdu" : "کیا گمان کیا ہے (ان لوگوں نے ) جوبُرے عمل کرتے ہیں یہ کہ وہ بچ کر نکل جائیں گے ہم سے ؟ بُرا ہے جو وہ فیصلہ کرتے ہیں ۔",
        "English" : "Or do those who commit evils think that they will outstrip Us? Evil is what they predicate."
      },
      {
        "ayet_no" : 5,
        "arbi" : "مَنْ كَانَ يَرْجُوْا لِقَاۗءَ اللّٰهِ فَاِنَّ اَجَلَ اللّٰهِ لَاٰتٍ ۭ وَهُوَ السَّمِيْعُ الْعَلِيْمُ",
        "Urdu" : "جو (شخص) امید رکھتا ہے اللہ کی ملاقات کی تو بے شک اللہ کا مقرر وقت ضرور آنے والا ہے اور وہی خوب سننے والا خوب جاننے والا ہے ۔",
        "English" : "Whoever hopes to meet Allah (must be sure that) Allah‘s appointed time has to come, and He is the All-Hearing, the All-Knowing."
      },
      {
        "ayet_no" : 6,
        "arbi" : "وَمَنْ جَاهَدَ فَاِنَّمَا يُجَاهِدُ لِنَفْسِهٖ  ۭ اِنَّ اللّٰهَ لَغَنِيٌّ عَنِ الْعٰلَمِيْنَ",
        "Urdu" : "اور جو جہاد کرے تو بلاشبہ صرف وہ جہاد کرتا ہے اپنی ذات (کے فائدے) کے لیے بیشک اللہ یقیناً بے پروا ہے سب جہان والوں سے ۔",
        "English" : "Whoever strives, strives for his own benefit. Surely Allah is independent of all the worlds."
      },
      {
        "ayet_no" : 7,
        "arbi" : "وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَنُكَفِّرَنَّ عَنْهُمْ سَيِّاٰتِهِمْ وَلَنَجْزِيَنَّهُمْ اَحْسَنَ الَّذِيْ كَانُوْا يَعْمَلُوْنَ",
        "Urdu" : "اور جو (لوگ) ایمان لائے اور انہوں نےنیک عمل کیے بلاشبہ ضرور ہم مٹا دیں گے اُن سے اُن کی بُرائیاں اور ضرور بالضرور ہم جزا دیں گے اُنہیں بہترین (اس عمل کی) جو وہ کیا کرتے تھے ۔",
        "English" : "Those who believe and do righteous deeds, We will expiate their bad deeds and will give them a better reward (than their expectation) for what they used to do."
      },
      {
        "ayet_no" : 8,
        "arbi" : "وَوَصَّيْنَا الْاِنْسَانَ بِوَالِدَيْهِ حُسْـنًا  ۭ وَاِنْ جَاهَدٰكَ لِتُشْرِكَ بِيْ مَا لَيْسَ لَكَ بِهٖ عِلْمٌ فَلَا تُطِعْهُمَا  ۭ اِلَيَّ مَرْجِعُكُمْ فَاُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُوْنَ",
        "Urdu" : "اور ہم نے وصیت (تاکید) کی انسان کو اپنے والدین کے ساتھ بھلائی کی اور اگر وہ دونوں زور دیں تجھ پرکہ تو شریک ٹھہرائے میرے ساتھ (اس چیز کو) جو کہ نہیں ہے تجھ کو اس کا کوئی علم تو تواطاعت کرنہ ان دونوں کی میری طرف ہی تمہارا لوٹ کر آنا ہےپھر میں خبر دوں گا تمہیں (اس )کی جو تم عمل کرتے تھے ۔",
        "English" : "We have instructed man to do good to his parents. And if they insist upon you that you should ascribe partners to Me, then do not obey them. To Me is your return; then I shall tell you what you used to do."
      },
      {
        "ayet_no" : 9,
        "arbi" : "وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَــنُدْخِلَنَّهُمْ فِي الصّٰلِحِيْنَ",
        "Urdu" : "اور جو (لوگ)ایمان لائے اور انہوں نے عمل کیے نیک، بلاشبہ یقیناً ہم داخل کریں گے اُنہیں نیک لوگوں میں ۔",
        "English" : "And those who believe and work righteous works--We shall surely cause them enter among the righteous."
      },
      {
        "ayet_no" : 10,
        "arbi" : "وَمِنَ النَّاسِ مَنْ يَّقُوْلُ اٰمَنَّا بِاللّٰهِ فَاِذَآ اُوْذِيَ فِي اللّٰهِ جَعَلَ فِتْنَةَ النَّاسِ كَعَذَابِ اللّٰهِ  ۭ وَلَىِٕنْ جَاۗءَ نَصْرٌ مِّنْ رَّبِّكَ لَيَقُوْلُنَّ اِنَّا كُنَّا مَعَكُمْ  ۭ اَوَلَيْسَ اللّٰهُ بِاَعْلَمَ بِمَا فِيْ صُدُوْرِ الْعٰلَمِيْنَ",
        "Urdu" : "اور لوگوں میں (کوئی ایسا ہے ) جو کہتا ہے ہم ایمان لائے اللہ پرپھر جب وہ ایذادیا جائے اللہ (کی راہ) میں (تو) وہ بنا لیتا ہے لوگوں کی ایذا رسانی کو اللہ کے عذاب کی مانند اور بلاشبہ اگر آجائے کوئی مدد آپ کے رب کی طرف سے (تو) یقیناً ضرور وہ کہیں گے بیشک ہم تھے تمہارے ساتھ اور(بھلا ) کیا نہیں ہے اللہ خوب جاننے والا (اُس ) کو جو جہان والوں کے سینوں میں ہے ۔",
        "English" : "Among men there are those who say, :We believe in Allah , but when they are persecuted in (the way of) Allah, they take the persecution of men, as equal to the punishment of Allah. And should any help come from your Lord, they will certainly say, :We were with you. Is it not that Allah knows well what lies in the hearts of the people of all the worlds ?"
      },
      {
        "ayet_no" : 11,
        "arbi" : "وَلَيَعْلَمَنَّ اللّٰهُ الَّذِيْنَ اٰمَنُوْا وَلَيَعْلَمَنَّ الْمُنٰفِقِيْنَ",
        "Urdu" : "اور بلاشبہ ضرور جان لے گا اللہ(ان لوگوں کو ) جو ایمان لائے اور وہ ضرور بالضرور جان لے گا منافقوں کو (بھی) ۔",
        "English" : "Allah will certainly know those who believe and He will certainly know the hypocrites."
      },
      {
        "ayet_no" : 12,
        "arbi" : "وَقَالَ الَّذِيْنَ كَفَرُوْا لِلَّذِيْنَ اٰمَنُوا اتَّبِعُوْا سَبِيْلَنَا وَلْنَحْمِلْ خَطٰيٰكُمْ ۭ وَمَا هُمْ بِحٰمِلِيْنَ مِنْ خَطٰيٰهُمْ مِّنْ شَيْءٍ  ۭ اِنَّهُمْ لَكٰذِبُوْنَ",
        "Urdu" : "اور کہا (اُن لوگوں نے) جنہوں نے کفر کیا (ان لوگوں کو ) سے جو ایمان لائے تم پیروی کرو ہمارے راستے کی اور لازم ہے کہ ہم اُٹھالیں تمہارے گناہ حالانکہ نہیں ہیں وہ ہرگز اُٹھانے والے اُن کے گناہوں میں کچھ بھی بے شک وہ یقیناً جھوٹے ہیں ۔",
        "English" : "Those who disbelieve say to those who believe, :Follow our way, and we will bear the burden of your sins. And they are not (able) to bear the burden of their sins in the least. Indeed they are pure liars."
      },
      {
        "ayet_no" : 13,
        "arbi" : "وَلَيَحْمِلُنَّ اَثْــقَالَهُمْ وَاَثْــقَالًا مَّعَ اَثْقَالِهِمْ ۡ وَلَيُسْـَٔــلُنَّ يَوْمَ الْقِيٰمَةِ عَمَّا كَانُوْا يَفْتَرُوْنَ",
        "Urdu" : "اور بلاشبہ ضرور وہ اُٹھائیں گے اپنے بوجھ اور کئی (اور) بوجھ اپنے بوجھوں کے ساتھ اور یقیناً ضرور وہ پوچھے جائیں گے قیامت کے دن اس کے متعلق جو جھوٹ باندھا کرتے تھے ۔",
        "English" : "They shall certainly bear their own loads, and some other loads along with their own loads, and they will certainly be questioned about what they used to forge."
      },
      {
        "ayet_no" : 14,
        "arbi" : "وَلَقَدْ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖ فَلَبِثَ فِيْهِمْ اَلْفَ سَنَةٍ اِلَّا خَمْسِيْنَ عَامًا  ۭ فَاَخَذَهُمُ الطُّوْفَانُ وَهُمْ ظٰلِمُوْنَ",
        "Urdu" : "اور بلاشبہ یقیناً ہم نے بھیجا نوحؑ کواُس کی قوم کی طرف پھر وہ ٹھہرا رہا اُن میں ہزار سال مگر پچاس سال (کم) پھر پکڑ لیا اُنہیں طوفان نے اس حال میں کہ وہ ظالم تھے ۔",
        "English" : "We sent NuH to his people. So he stayed with them one thousand, less fifty, years. Then the Deluge seized them, and they were transgressors."
      },
      {
        "ayet_no" : 15,
        "arbi" : "فَاَنْجَيْنٰهُ وَاَصْحٰبَ السَّفِيْنَةِ وَجَعَلْنٰهَآ اٰيَةً لِّــلْعٰلَمِيْنَ",
        "Urdu" : "پھر بچا لیا ہم نے اُسے اور کشتی والوں کو اور ہم نے بنا دیا اُسے ایک نشانی جہاں والوں کیلیے",
        "English" : "So We saved him and the people of the Ark, and made it a sign for all the worlds."
      },
      {
        "ayet_no" : 16,
        "arbi" : "وَاِبْرٰهِيْمَ اِذْ قَالَ لِقَوْمِهِ اعْبُدُوا اللّٰهَ وَاتَّــقُوْهُ  ۭ ذٰلِكُمْ خَيْرٌ لَّكُمْ اِنْ كُنْتُمْ تَعْلَمُوْنَ",
        "Urdu" : "اور (ہم نے بھیجا) ابراہیمؑ کو جب اُس نے کہا اپنی قوم سے تم عبادت کرو اللہ کی اور اُس سے ڈرو، یہی بہتر ہےتمہارے لیےاگر ہو تم جانتے ۔",
        "English" : "And (We sent) Ibrahim when he said to his people, :Worship Allah and fear Him. That is better for you if you know."
      },
      {
        "ayet_no" : 17,
        "arbi" : "اِنَّمَا تَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ اَوْثَانًا وَّتَخْلُقُوْنَ اِفْكًا ۭ اِنَّ الَّذِيْنَ تَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ لَا يَمْلِكُوْنَ لَكُمْ رِزْقًا فَابْتَغُوْا عِنْدَ اللّٰهِ الرِّزْقَ وَاعْبُدُوْهُ وَاشْكُرُوْا لَهٗ ۭ اِلَيْهِ تُرْجَعُوْنَ",
        "Urdu" : "بے شک صرف تم عبادت کرتے ہو اللہ کے سوا چند بتوں کی (ہی ) اور تم گھڑتے ہو جھوٹ ،بے شک جن کی تم عبادت کرتے ہو اللہ کے سوا نہیں ہیں وہ مالک تمہارے لیے کسی رزق کے سو تم تلاش کرو اللہ کے ہاں ہی رزق کو اور عبادت کرو اُسی کی اور شکر کرو اُسی کا اُسی کی طرف تم لوٹائے جاؤ گے ۔",
        "English" : "You only worship idols beside Allah, and you invent a lie. In fact those whom you worship beside Allah do not have power to give you provision. So seek provision with Allah and worship Him and be grateful to Him. To Him you are to be returned."
      },
      {
        "ayet_no" : 18,
        "arbi" : "وَاِنْ تُكَذِّبُوْا فَقَدْ كَذَّبَ اُمَمٌ مِّنْ قَبْلِكُمْ  ۭ وَمَا عَلَي الرَّسُوْلِ اِلَّا الْبَلٰــغُ الْمُبِيْنُ",
        "Urdu" : "اور اگر تم جھٹلاؤ (مجھے) تو یقیناً جھٹلایا تھا کئی اُمتوں نے تم سے پہلے اور نہیں ہے رسول پر مگر واضح طور پر پہنچا دینا ۔",
        "English" : "And if you reject me, then many nations have rejected their messengers before you. The messenger has no more obligation than to convey the message clearly."
      },
      {
        "ayet_no" : 19,
        "arbi" : "اَوَلَمْ يَرَوْا كَيْفَ يُبْدِئُ اللّٰهُ الْخَــلْقَ ثُمَّ يُعِيْدُهٗ ۭ اِنَّ ذٰلِكَ عَلَي اللّٰهِ يَسِيْرٌ",
        "Urdu" : "اور(بھلا) کیا نہیں دیکھا انہوں نے کیسے پہلی بار پیدا کرتا ہےاللہ مخلوق کو پھر وہ لوٹائے گا اُسے بلاشبہ یہ اللہ پر بہت آسان ہے ۔",
        "English" : "Did they not see how Allah originates the creation, then He will do it again. Surely this is easy for Allah."
      },
      {
        "ayet_no" : 20,
        "arbi" : "قُلْ سِيْرُوْا فِي الْاَرْضِ فَانْظُرُوْاكَيْفَ بَدَاَ الْخَــلْقَ ثُمَّ اللّٰهُ يُنْشِئُ النَّشْاَةَ الْاٰخِرَةَ  ۭ اِنَّ اللّٰهَ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
        "Urdu" : "کہہ دیجیے تم چلو پھرو زمین میں پھر دیکھو کیسے اُس نے پہلی بار پیدا کیا مخلوق کو پھر اللہ ہی پیدا کرے گا (اُس کو) دوسری بار پیدا کرنا بیشک اللہ ہر چیز پر خوب قدرت رکھنے والا ہے ۔",
        "English" : "Say, :Go about in the land and look how He has originated the creation. Then Allah will create the subsequent creation. Surely Allah is powerful to do everything."
      },
      {
        "ayet_no" : 21,
        "arbi" : "يُعَذِّبُ مَنْ يَّشَاۗءُ وَيَرْحَمُ مَنْ يَّشَاۗءُ ۚ وَاِلَيْهِ تُقْلَبُوْنَ",
        "Urdu" : "وہ عذاب دیتا ہے جسے وہ چاہتا ہے اور وہ رحم کرتا ہے جس پر چاہتا ہے اور اُسی کی طرف تم لوٹائے جاؤ گے ۔",
        "English" : "He punishes whom He wills and has mercy on whom He wills. And to Him you are to be turned back."
      },
      {
        "ayet_no" : 22,
        "arbi" : "وَمَآ اَنْتُمْ بِمُعْجِزِيْنَ فِي الْاَرْضِ وَلَا فِي السَّمَاۗءِ  ۡ وَمَا لَكُمْ مِّنْ دُوْنِ اللّٰهِ مِنْ وَّلِيٍّ وَّلَا نَصِيْرٍ",
        "Urdu" : "اور نہیں تم ہرگز عاجز کرنے والے (اللہ کو) زمین میں اور نہ آسمان میں اور نہیں ہے تمہارے لیے اللہ کے سوا کوئی دوست اور نہ کوئی مددگار ۔",
        "English" : "You are not (able) to frustrate (Allah) neither in the earth nor in the sky. And, apart from Allah, you have neither a protector nor a helper."
      },
      {
        "ayet_no" : 23,
        "arbi" : "وَالَّذِيْنَ كَفَرُوْا بِاٰيٰتِ اللّٰهِ وَلِقَاۗىِٕهٖٓ اُولٰۗىِٕكَ يَىِٕسُوْا مِنْ رَّحْمَتِيْ وَاُولٰۗىِٕكَ لَهُمْ عَذَابٌ اَلِيْمٌ",
        "Urdu" : "اور جن لوگوں نے انکار کیا اللہ کی آیتوں کا اور اسکی ملاقات( کا) وہ لوگ نااُمید ہو چکے ہیں میری رحمت سے اور یہی لوگ ہیں (کہ) اُن کیلیے دردناک عذاب ہے ۔",
        "English" : "And those who deny the signs of Allah and meeting with Him — those will despair of My mercy, and those are the ones for whom there is a painful punishment."
      },
      {
        "ayet_no" : 24,
        "arbi" : "فَمَا كَانَ جَوَابَ قَوْمِهٖٓ اِلَّا اَنْ قَالُوا اقْتُلُوْهُ اَوْ حَرِّقُوْهُ فَاَنْجٰىهُ اللّٰهُ مِنَ النَّارِ ۭ اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يُّؤْمِنُوْنَ",
        "Urdu" : "پھر نہ تھا جواب اُس کی قوم کا مگر یہ کہ انہوں نے کہا قتل کردو اسے یا جلادو اُسے پھر نجات دی اُسے اللہ نے آگ سے بے شک اس میں یقیناً نشانیاں ہیں ان لوگوں کے لیے (جو) ایمان لاتے ہیں ۔",
        "English" : "So, the response of his (Ibrahim) people was none but that they said, :Kill him or :Burn him . So Allah saved him from the fire. Surely in this there are signs for a people who believe."
      },
      {
        "ayet_no" : 25,
        "arbi" : "وَقَالَ اِنَّمَا اتَّخَذْتُمْ مِّنْ دُوْنِ اللّٰهِ اَوْثَانًا ۙ مَّوَدَّةَ بَيْنِكُمْ فِي الْحَيٰوةِ الدُّنْيَا ۚ ثُمَّ يَوْمَ الْقِيٰمَةِ يَكْفُرُ بَعْضُكُمْ بِبَعْضٍ وَّيَلْعَنُ بَعْضُكُمْ بَعْضًا ۡ وَّمَاْوٰىكُمُ النَّارُ وَمَا لَكُمْ مِّنْ نّٰصِرِيْنَ",
        "Urdu" : "اور کہا (ابراہیمؑ نے) بے شک صرف تم نے تو بنایا ہے اللہ کے سوا بتوں کو (معبود) اپنی آپس کی دوستی کی وجہ سے دنیوی زندگی میں پھر قیامت کے دن انکار کرے گاتمہارا بعض بعض کا اور لعنت کرے گا تمہارا بعض بعض کواور تمہارا ٹھکانا آگ ہی ہو گا اور نہیں ہونگے تمہارے لیے کوئی مدد کرنیوالے ۔",
        "English" : "And he (Ibrahim) said, :You have adopted idols instead of Allah, only because of love (you have) with each other in the worldly life. Then on the Day of Judgment you will reject each other, and will curse each other. And your abode is the Fire, and you will have no helpers."
      },
      {
        "ayet_no" : 26,
        "arbi" : "فَاٰمَنَ لَهٗ لُوْطٌ  ۘ وَقَالَ اِنِّىْ مُهَاجِرٌ اِلٰى رَبِّيْ  ۭ اِنَّهٗ هُوَ الْعَزِيْزُ الْحَكِيْمُ",
        "Urdu" : "تو ایمان لایا اُس (ابراہیمؑ) پر لوطؑ اور کہا (ابراہیم نے) بے شک میں ہجرت کرنے والا ہوں اپنے رب کی طرف بیشک وہی ہے نہایت غالب بہت حکمت والا ۔",
        "English" : "And Lut believed in him. And he said: verily I am going to migrate to my Lord; verily He is the Mighty, the Wise."
      },
      {
        "ayet_no" : 27,
        "arbi" : "وَوَهَبْنَا لَهٗٓ اِسْحٰقَ وَيَعْقُوْبَ وَجَعَلْنَا فِيْ ذُرِّيَّتِهِ النُّبُوَّةَ وَالْكِتٰبَ وَاٰتَيْنٰهُ اَجْرَهٗ فِي الدُّنْيَا ۚ وَاِنَّهٗ فِي الْاٰخِرَةِ لَمِنَ الصّٰلِحِيْنَ",
        "Urdu" : "اور ہم نے عطا کیے اُس کو اسحاقؑ اور یعقوبؑ اور ہم نے رکھ دی اُس کی اولاد میں نبوت اور کتاب اور ہم نے دیا اُسے اُس کا اجر دنیا میں اور بیشک وہ آخرت میں یقیناً نیکوں میں سے ہو گا ۔",
        "English" : "And We granted him IsHaq (Isaac) and Ya'qub (Jacob), and assigned prophet-hood and Book to his progeny, and gave him his reward in the world; and of course, in the Hereafter, he will be one of the righteous."
      },
      {
        "ayet_no" : 28,
        "arbi" : "وَلُوْطًا اِذْ قَالَ لِقَوْمِهٖٓ اِنَّكُمْ لَتَاْتُوْنَ الْفَاحِشَةَ  ۡ مَا سَبَقَكُمْ بِهَا مِنْ اَحَدٍ مِّنَ الْعٰلَمِيْنَ",
        "Urdu" : "اور (ہم نے بھیجا) لوطؑ کو جب اس نے کہا اپنی قوم سے بیشک تم یقیناً تم ارتکاب کرتے ہو (ایسی) بے حیائی کا (جو) نہیں تم سے پہلےکیا اُس کو کسی ایک نے جہانوں میں سے ۔",
        "English" : "And (We sent) LuT when he said to his people, :Indeed you commit the shameful act that no one in the worlds has ever preceded you in it."
      },
      {
        "ayet_no" : 29,
        "arbi" : "اَىِٕنَّكُمْ لَتَاْتُوْنَ الرِّجَالَ وَتَقْطَعُوْنَ السَّبِيْلَ ڏوَتَاْتُوْنَ فِيْ نَادِيْكُمُ الْمُنْكَرَ ۭ فَمَا كَانَ جَوَابَ قَوْمِهٖٓ اِلَّآ اَنْ قَالُوا ائْتِنَا بِعَذَابِ اللّٰهِ اِنْ كُنْتَ مِنَ الصّٰدِقِيْنَ",
        "Urdu" : "کیا بیشک تم یقیناً آتے ہو مَردوں کے پاس (جنسی تسکین کیلیے) اور تم راستہ کاٹتے ہو (یعنی مسافروں کو ستاتے ہو) اور ارتکاب کرتے ہو اپنی مجلس میں بُرائی کا تو نہ تھا اُس کی قوم کا جواب مگر یہ کہ اُنہوں نے کہا تولے آ ہم پر اللہ کے عذاب کو اگر ہے تو سچوں میں سے ۔",
        "English" : "Is it (not) a fact that you go for men (to satisfy your lust) and rob the wayfarers and commit evil in your gathering? So the answer of his people was none but that they said, :Bring us Allah‘s punishment, if you are one of the truthful."
      },
      {
        "ayet_no" : 30,
        "arbi" : "قَالَ رَبِّ انْصُرْنِيْ عَلَي الْقَوْمِ الْمُفْسِدِيْنَ",
        "Urdu" : "کہا (لوطؑ نے،اے میرے ) رب میری مدد فرما فساد کرنے والے لوگوں پر ۔",
        "English" : "He said, :My Lord, help me against the people who make mischief."
      },
      {
        "ayet_no" : 31,
        "arbi" : "وَلَمَّا جَاۗءَتْ رُسُلُنَآ اِبْرٰهِيْمَ بِالْبُشْرٰى ۙ قَالُوْٓا اِنَّا مُهْلِكُوْٓا اَهْلِ هٰذِهِ الْقَرْيَةِ ۚ اِنَّ اَهْلَهَا كَانُوْا ظٰلِمِيْنَ",
        "Urdu" : "اور جب آئے ہمارے قاصد (فرشتے) ابراہیمؑ کے پاس خوشخبری کے ساتھ انہوں نے کہا بے شک ہم ہلاک کرنے والے ہیں اس بستی کے باشندوں کو بے شک اس کے باشندے ظالم ہیں ۔",
        "English" : "And when Our messengers came to Ibrahim with the good news, they said, :We are going to destroy the people of this town. Surely its people have been transgressors."
      },
      {
        "ayet_no" : 32,
        "arbi" : " قَالَ اِنَّ فِيْهَا لُوْطًا  ۭ قَالُوْا نَحْنُ اَعْلَمُ بِمَنْ فِيْهَا  ۅلَنُنَجِّيَنَّهٗ وَاَهْلَهٗٓ اِلَّا امْرَاَتَهٗ ڭ كَانَتْ مِنَ الْغٰبِرِيْنَ",
        "Urdu" : "کہا (ابراہیمؑ نے) بے شک اس میں (تو) لوطؑ (بھی) ہے انہوں نے کہا ہم خوب جاننے والے ہیں (اس )کوجو اس میں ہے، بلاشبہ ضرور ہم بچالیں گے اُسے اور اُس کے گھر والوں کوسوائے اس کی بیوی کے وہ ہے(عذاب کے لیے )پیچھے رہنے والوں میں سے ۔",
        "English" : "He said, :There is LuT in it. They said, :We know well who is in it. We will certainly save him and his family except his wife who will be among those remaining behind."
      },
      {
        "ayet_no" : 33,
        "arbi" : "وَلَمَّآ اَنْ جَاۗءَتْ رُسُلُنَا لُوْطًا سِيْۗءَ بِهِمْ وَضَاقَ بِهِمْ ذَرْعًا وَّقَالُوْا لَا تَخَفْ وَلَا تَحْزَنْ ۣاِنَّا مُنَجُّوْكَ وَاَهْلَكَ اِلَّا امْرَاَتَكَ كَانَتْ مِنَ الْغٰبِرِيْنَ",
        "Urdu" : "اور جب یہ کہ آئے ہمارے قاصد لوطؑ کے پاس وہ مغموم ہوا اُن کی وجہ سے اور تنگ ہوا اُنکے سبب دل میں اور انہوں نے کہا تونہ ڈر اور تو غم نہ کر بے شک ہم بچانے والے ہیں تجھے اور تیرے گھر والوں کو سوائے تیری بیوی کے وہ ہو گی (عذاب کے لیے )پیچھے رہنے والوں میں سے ۔",
        "English" : "And when Our messengers came to LuT, he grieved for them and his heart was straitened because of them, but they said, :We are going to save you and your family, except your wife who will be among those remaining behind."
      },
      {
        "ayet_no" : 34,
        "arbi" : "اِنَّا مُنْزِلُوْنَ عَلٰٓي اَهْلِ هٰذِهِ الْقَرْيَةِ رِجْزًا مِّنَ السَّمَاۗءِ بِمَا كَانُوْا يَفْسُقُوْنَ",
        "Urdu" : "بے شک ہم نازل کرنے والے ہیں اس بستی کے رہنے والوں پر عذاب آسمان سے اس وجہ سے جووہ نافرمانی کیا کرتے تھے ۔",
        "English" : "We are going to bring down on the people of this town a punishment from the sky, because they used to act sinfully."
      },
      {
        "ayet_no" : 35,
        "arbi" : "وَلَقَدْ تَّرَكْنَا مِنْهَآ اٰيَةًۢ بَيِّنَةً لِّقَوْمٍ يَّعْقِلُوْنَ",
        "Urdu" : "اور بلاشبہ یقیناً ہم نے چھوڑی اس (بستی) میں ایک واضح نشانی ان لوگوں کے لیے (جو) عقل رکھتے ہیں ۔",
        "English" : "And We left from it (the town) an evident sign for a people who understand."
      },
      {
        "ayet_no" : 36,
        "arbi" : "وَاِلٰى مَدْيَنَ اَخَاهُمْ شُعَيْبًا  ۙ فَقَالَ يٰقَوْمِ اعْبُدُوا اللّٰهَ وَارْجُوا الْيَوْمَ الْاٰخِرَ وَلَا تَعْثَوْا فِي الْاَرْضِ مُفْسِدِيْنَ",
        "Urdu" : "اور (ہم نے بھیجا) مدین کی طرف اُن کے بھائی شعیب کو تو اُس نے کہا اے( میری )قوم تم عبادت کرواللہ کی اور تم اُمید رکھو یومِ آخرت کی اور تم مت پھرو زمین میں فسادی بن کر ۔",
        "English" : "And (We sent) to Madyan their brother Shu'aib. So he said, :O my people, worship Allah and fear the Last Day, and do not roam about in the land as mischief makers."
      },
      {
        "ayet_no" : 37,
        "arbi" : "فَكَذَّبُوْهُ فَاَخَذَتْهُمُ الرَّجْفَةُ فَاَصْبَحُوْا فِيْ دَارِهِمْ جٰثِمِيْنَ",
        "Urdu" : "تو اُنہوں نے جھٹلایا اُسے تو پکڑ لیا اُنہیں زلزلے نے پھر وہ ہو گئے اپنے گھروں میں گھٹنوں کے بل گِرے ہوئے ۔",
        "English" : "So they gave the lie to him, then they were seized by the earthquake and they remained in their homes lying on their faces."
      },
      {
        "ayet_no" : 38,
        "arbi" : "وَعَادًا وَّثَمُــوْدَا۟ وَقَدْ تَّبَيَّنَ لَكُمْ مِّنْ مَّسٰكِنِهِمْ ۣ وَزَيَّنَ لَهُمُ الشَّيْطٰنُ اَعْمَالَهُمْ فَصَدَّهُمْ عَنِ السَّبِيْلِ وَكَانُوْا مُسْتَبْصِرِيْنَ",
        "Urdu" : "اورعاد کواور ثمود کو(ہم نے ہلاک کیا) اور یقیناً واضح ہوچکی تم پر (یہ بات) اُن کے (اُجڑے) گھروں سے اور مزین کر دیا اُن کیلیے شیطان نے اُنکے اعمال کو پس اُس نے روک دیا اُنہیں (اصل) راستے سے حالانکہ وہ تھے بصیرت رکھنے والے ۔",
        "English" : "And (We destroyed) 'Aad and Thamud, and it is visible to you through their dwellings. And the Satan had beautified for them their deeds, so he prevented them from the (right) way, even though they were people of insight."
      },
      {
        "ayet_no" : 39,
        "arbi" : "وَقَارُوْنَ وَفِرْعَوْنَ وَهَامٰنَ ۣ وَلَقَدْ جَاۗءَهُمْ مُّوْسٰي بِالْبَيِّنٰتِ فَاسْتَكْبَرُوْا فِي الْاَرْضِ وَمَا كَانُوْا سٰبِقِيْنَ",
        "Urdu" : "اور (ہم نے ہلاک کیا) قارون اور فرعون اور ہامان کو اور بلاشبہ یقیناً آئے اُنکے پاس موسٰی واضح دلائل کیساتھ تو انہوں نے تکبر کیا زمین میں اور نہ تھے وہ آگے نکل جانے والے (یعنی بچ نکلنے والے)",
        "English" : "And (We also destroyed) Qarun and Pharaoh and Haman. Indeed Musa came to them with clear signs; so they acted arrogantly on the earth, and were not (able) to escape."
      },
      {
        "ayet_no" : 40,
        "arbi" : "فَكُلًّا اَخَذْنَا بِذَنْۢبِهٖ ۚ فَمِنْهُمْ مَّنْ اَرْسَلْنَا عَلَيْهِ حَاصِبًا ۚوَمِنْهُمْ مَّنْ اَخَذَتْهُ الصَّيْحَةُ ۚ وَمِنْهُمْ مَّنْ خَسَفْنَا بِهِ الْاَرْضَ ۚ وَمِنْهُمْ مَّنْ اَغْرَقْنَا ۚ وَمَا كَانَ اللّٰهُ لِيَظْلِمَهُمْ وَلٰكِنْ كَانُوْٓا اَنْفُسَهُمْ يَظْلِمُوْنَ",
        "Urdu" : "تو ہر ایک کو ہم نے پکڑا اس کے گناہ کے سبب پھر اُن میں سے (کوئی ایسا تھا) جو (کہ) ہم نے بھیجی اُس پر پتھراؤ کرنے والی آندھی اور اُن میں سے (کوئی وہ تھا) جو (کہ) پکڑا اُسے چیخ نے اور اُن میں سے (کوئی وہ تھا) جو (کہ) ہم نے دھنسا دیا اُس کو زمین میں اور اُن میں سے (کوئی وہ تھا) جسے ہم نے غرق کر دیا اور نہیں تھا اللہ(ایسا ) کہ وہ ظلم کرتا اُن پر اور لیکن تھے وہ (خود) اپنے نفسوں پر ظلم کرتے ۔",
        "English" : "Thus We seized each one of them for his sin. So to some of them We sent a violent wind; and some of them were seized by a Cry; and some of them We made to sink in the earth; and some of them We drowned. And Allah was not to do injustice to them, but they used to do injustice to their own selves."
      },
      {
        "ayet_no" : 41,
        "arbi" : "مَثَلُ الَّذِيْنَ اتَّخَذُوْا مِنْ دُوْنِ اللّٰهِ اَوْلِيَاۗءَ كَمَثَلِ الْعَنْكَبُوْتِ ښ اِتَّخَذَتْ بَيْتًا ۭ وَاِنَّ اَوْهَنَ الْبُيُوْتِ لَبَيْتُ الْعَنْكَبُوْتِ ۘ لَوْ كَانُوْا يَعْلَمُوْنَ",
        "Urdu" : "مثال(اُن لوگوں کی ) جنہوں نے بنا رکھے ہیں اللہ کے سوا کئی مددگارمکڑی کی مثال کی طرح ہے اس نے بنایا ایک گھراور بے شک گھروں میں سب سے زیادہ کمزور یقیناً مکڑی کا گھر ہے کاش وہ جانتے ہوتے ۔",
        "English" : "The example of those who have adopted patrons other than Allah is like the spider that has made a house, while indeed the weakest of houses is the house of the spider. If only they know."
      },
      {
        "ayet_no" : 42,
        "arbi" : "اِنَّ اللّٰهَ يَعْلَمُ مَا يَدْعُوْنَ مِنْ دُوْنِهٖ مِنْ شَيْءٍ ۭ وَهُوَ الْعَزِيْزُ الْحَكِيْمُ",
        "Urdu" : "بیشک اللہ جانتا ہے جسے وہ (مشرک) پکارتے ہیں اُس کے سوا (خواہ وہ ) کوئی چیز بھی ہو اور وہی بہت غالب خوب حکمت والا ہے ۔",
        "English" : "Surely, Allah knows whatever thing they invoke beside Allah, and He is the Mighty, the Wise."
      },
      {
        "ayet_no" : 43,
        "arbi" : "وَتِلْكَ الْاَمْثَالُ نَضْرِبُهَا لِلنَّاسِ ۚ وَمَا يَعْقِلُهَآ اِلَّا الْعٰلِمُوْنَ",
        "Urdu" : "اور یہ مثالیں ہیں ہم بیان کرتے ہیں ان کو لوگوں کے لیے اور نہیں سمجھتے ان کو مگر علم رکھنے والے ہی ۔",
        "English" : "We site these examples for people, but no one understands them except the knowledgeable ones."
      },
      {
        "ayet_no" : 44,
        "arbi" : "خَلَقَ اللّٰهُ السَّمٰوٰتِ وَالْاَرْضَ بِالْحَـقِّ ۭ اِنَّ فِيْ ذٰلِكَ لَاٰيَةً لِّــلْمُؤْمِنِيْنَ",
        "Urdu" : "پیدا کیا اللہ نے آسمانوںاور زمین کو حق کے ساتھ بلاشبہ اس میں یقیناً نشانی ہے ایمان والوں کے لیے ۔",
        "English" : "Allah has created the heavens and the earth with truth. Surely in this there is a sign for the believers."
      },
      {
        "ayet_no" : 45,
        "arbi" : "اُتْلُ مَآ اُوْحِيَ اِلَيْكَ مِنَ الْكِتٰبِ وَاَقِـمِ الصَّلٰوةَ ۭاِنَّ الصَّلٰوةَ تَنْهٰى عَنِ الْفَحْشَاۗءِ وَالْمُنْكَرِ ۭ وَلَذِكْرُ اللّٰهِ اَكْبَرُ ۭ وَاللّٰهُ يَعْلَمُ مَا تَصْنَعُوْنَ",
        "Urdu" : "تلاوت کیجیے جو وحی کی گئی ہے آپکی طرف کتاب سے اور نماز قائم کیجیے ،بے شک نماز روکتی ہے بے حیائی اور برائی سے اور یقیناً اللّٰہ کا ذکر سب سے بڑا ہے اور اللّٰہ جانتاہے جو کچھ تم کرتے ہو ۔",
        "English" : "Recite (O Prophet) what is revealed to you of the Book, and establish Salah . Surely Salah restrains one from shameful and evil acts. Indeed remembrance of Allah is the greatest of all things. Allah knows what you do."
      },
      {
        "ayet_no" : 46,
        "arbi" : "وَلَا تُجَادِلُوْٓا اَهْلَ الْكِتٰبِ اِلَّا بِالَّتِيْ ھِىَ اَحْسَنُ ڰ اِلَّا الَّذِيْنَ ظَلَمُوْا مِنْهُمْ وَقُوْلُوْٓا اٰمَنَّا بِالَّذِيْٓ اُنْزِلَ اِلَيْنَا وَاُنْزِلَ اِلَيْكُمْ وَاِلٰـهُنَا وَاِلٰــهُكُمْ وَاحِدٌ وَّنَحْنُ لَهٗ مُسْلِمُوْنَ",
        "Urdu" : "اور تم مت جھگڑو اہل کتاب سے مگر اس (طریقے ) سے جو (کہ )وہ سب سے اچھا ہومگر وہ( لوگ) جنہوں نے ظلم کیا اُن میں سے(تو اُن سے ویسا ہی برتاؤ کرو) اور تم کہو ہم ایمان لائے(اُس) پر جو نازل کیا گیا ہماری طرف اور (جو ) نازل کیا گیا تمہاری طرف ہمارا معبود اور تمہارا معبودایک ہے ۔اور ہم اُسی کی فرمانبرداری کرنے والے ہیں ۔",
        "English" : "Do not debate with the people of the Book unless it is in the best manner, except with those of them who commit injustice. And say, :We believe in what is sent down to us and sent down to you, and our God and your God is One, and to Him we submit (ourselves)."
      },
      {
        "ayet_no" : 47,
        "arbi" : "وَكَذٰلِكَ اَنْزَلْنَآ اِلَيْكَ الْكِتٰبَ ۭ فَالَّذِيْنَ اٰتَيْنٰهُمُ الْكِتٰبَ يُؤْمِنُوْنَ بِهٖ ۚ وَمِنْ هٰٓؤُلَاۗءِ مَنْ يُّؤْمِنُ بِهٖ ۭ وَمَا يَجْحَدُ بِاٰيٰتِنَآ اِلَّا الْكٰفِرُوْنَ",
        "Urdu" : "اور( جیسے پہلی کتابیں اُتاریں )اِسی طرح ہم نے اُتاری آپ کی طرف کتاب پھر(وہ لوگ) جو (کہ) ہم نے دی اُنہیں کتاب وہ ایمان لاتے ہیں اُس پر اور اِن (اہل مکہ ) میں سے (بھی کوئی ایسا ہے) جوایمان لاتاہے اس پر، اور نہیں انکار کرتے ہماری آیات کا مگر کافر لوگ ہی ۔",
        "English" : "Thus We have sent down the Book to you. So those to whom We have given the Book believe in it. And from these (the people of Makkah) there are ones who believe in it, and no one rejects Our verses except the infidels."
      },
      {
        "ayet_no" : 48,
        "arbi" : "وَمَا كُنْتَ تَتْلُوْا مِنْ قَبْلِهٖ مِنْ كِتٰبٍ وَّلَا تَخُــطُّهٗ بِيَمِيْنِكَ اِذًا لَّارْتَابَ الْمُبْطِلُوْنَ",
        "Urdu" : "اور نہیں تھے آپ پڑھتے اِس (قرآن )سے پہلے کوئی کتاب اور نہ آپ لکھتے تھےاُسے اپنے دائیں ہاتھ سے (اگر ایسا ہوتا)تب ضرور شک کرتے باطل پرست ۔",
        "English" : "You (O Prophet,) have never been reciting any book before this, nor have you been writing it with your right hand; had it been so, the adherents of falsehood would have raised doubts."
      },
      {
        "ayet_no" : 49,
        "arbi" : "بَلْ هُوَ اٰيٰتٌۢ بَيِّنٰتٌ فِيْ صُدُوْرِ الَّذِيْنَ اُوْتُوا الْعِلْمَ ۭ وَمَا يَجْـحَدُ بِاٰيٰتِنَآ اِلَّا الظّٰلِمُوْنَ",
        "Urdu" : "بلکہ وہ (قرآن تو)واضح آیات ہیں (اُن لوگوں کے )سینوں میں جو علم دیے گئے اور نہیں انکار کرتے ہماری آیات کا مگرظالم لوگ ہی ۔",
        "English" : "But it (the Qur‘an in itself) is (a package of) evident signs in the hearts of those who are given knowledge. And no one rejects our verses except the wrongdoers."
      },
      {
        "ayet_no" : 50,
        "arbi" : "وَقَالُوْا لَوْلَآ اُنْزِلَ عَلَيْهِ اٰيٰتٌ مِّنْ رَّبِّهٖ ۭ قُلْ اِنَّمَا الْاٰيٰتُ عِنْدَ اللّٰهِ ۭ وَاِنَّمَآ اَنَا نَذِيْرٌ مُّبِيْنٌ",
        "Urdu" : "اوراُنہوں نے کہا کیوں نہیں اُتاری گئیں اُس پر نشانیاں(یعنی معجزات) اُسکے رب کی طرف سے،کہہ دیجیےنشانیاں توبیشک صرف اللّٰہ کے پاس ہیں اور بیشک صرف میں(تو) ایک واضح ڈرانے والا ہوں ۔",
        "English" : "And they say, :Why is it that no signs (miracles) have been sent down to him from his Lord? Say, :Signs are only with Allah, and I am only a plain warner."
      },
      {
        "ayet_no" : 51,
        "arbi" : "اَوَلَمْ يَكْفِهِمْ اَنَّآ اَنْزَلْنَا عَلَيْكَ الْكِتٰبَ يُتْلٰى عَلَيْهِمْ ۭ اِنَّ فِيْ ذٰلِكَ لَرَحْمَةً وَّذِكْرٰي لِقَوْمٍ يُّؤْمِنُوْنَ",
        "Urdu" : "اور (بھلا)کیا نہیں کافی ہوا اُنہیں کہ بیشک ہم نے ناز ل کی آپ پر(یہ) کتاب(جو) پڑھی جاتی ہے اُن پر بلاشبہ اس میں یقیناًرحمت اور نصیحت ہے اُن لوگوں کے لیے (جو)ایمان لاتے ہیں ۔",
        "English" : "Is it not sufficient for them that We have sent down to you the Book that is being recited to them? Surely in it there is mercy and advice for a people who believe."
      },
      {
        "ayet_no" : 52,
        "arbi" : "قُلْ كَفٰي بِاللّٰهِ بَيْنِيْ وَبَيْنَكُمْ شَهِيْدًا ۚ يَعْلَمُ مَا فِي السَّمٰوٰتِ وَالْاَرْضِ ۭ وَالَّذِيْنَ اٰمَنُوْا بِالْبَاطِلِ وَكَفَرُوْا بِاللّٰهِ ۙ اُولٰۗىِٕكَ هُمُ الْخٰسِرُوْنَ",
        "Urdu" : "آپ کہہ دیجیے کافی ہے اللّٰہ میرے درمیان اور تمہارے درمیان (بطور)گواہ وہ جانتاہے جوکچھ آسمانوں اور زمین میں ہے اور (وہ لوگ) جو ایمان لائے باطل پر اور اُنہوں نے کفر کیا اللّٰہ کے ساتھ وہی( لوگ) ہی خسارہ پانے والے ہیں ۔",
        "English" : "Say, :Allah is enough as a witness between me and you. He knows what is in the heavens and the earth. And those who believe in falsity and do not believe in Allah,__those are the losers."
      },
      {
        "ayet_no" : 53,
        "arbi" : "وَيَسْتَعْجِلُوْنَكَ بِالْعَذَابِ ۭ وَلَوْلَآ اَجَلٌ مُّسَمًّى لَّجَاۗءَهُمُ الْعَذَابُ ۭ وَلَيَاْتِيَنَّهُمْ بَغْتَةً وَّهُمْ لَا يَشْعُرُوْنَ",
        "Urdu" : "اور وہ(لوگ) جلد مانگ رہے ہیں آپ سے عذاب کو اوراگر نہ ہوتا (عذاب کا )وقتِ مقررتو ضرور آجاتااُن پر عذاب اور بلاشبہ یقیناًوہ آئے گااُن پر اچانک ہی جب کہ وہ شعور نہ رکھتے ہوں گے ۔",
        "English" : "They ask you to bring the punishment soon. Had there not been an appointed time, the punishment would have come to them. It will surely come to them suddenly while they will not be aware."
      },
      {
        "ayet_no" : 54,
        "arbi" : "يَسْتَعْجِلُوْنَكَ بِالْعَذَابِ ۭ وَاِنَّ جَهَنَّمَ لَمُحِيْطَةٌۢ بِالْكٰفِرِيْنَ",
        "Urdu" : "وہ لوگ جلدی مانگتے ہیں آپ سے عذاب کو اور بلاشبہ جہنم یقیناً گھیرنے والی ہے کافروں کو ۔",
        "English" : "They ask thee to hasten on the torment; and verily the Hell is about to encompass the infidels."
      },
      {
        "ayet_no" : 55,
        "arbi" : "يَوْمَ يَغْشٰـىهُمُ الْعَذَابُ مِنْ فَوْقِهِمْ وَمِنْ تَحْتِ اَرْجُلِهِمْ وَيَقُوْلُ ذُوْقُوْا مَا كُنْتُمْ تَعْمَلُوْنَ",
        "Urdu" : "(اُسی) دن ڈھانپ لے گا اُنہیں عذاب اُن کے اوپر سے اور اُن کے پاؤں کے نیچے سےاور وہ(اللّٰہ ) فرمائے گاچکھو(مزااُسکا) جو تم عمل کرتے تھے ۔",
        "English" : "On the Day when the punishment will envelop them from above them and from under their feet and He (Allah) will say, :Taste what you used to do."
      },
      {
        "ayet_no" : 56,
        "arbi" : "يٰعِبَادِيَ الَّذِيْنَ اٰمَنُوْٓا اِنَّ اَرْضِيْ وَاسِعَةٌ فَاِيَّايَ فَاعْبُدُوْنِ",
        "Urdu" : "اے میرے بندو! جو ایمان لائے ہوبیشک میری زمین وسیع ہے سو صرف میری ہی پس تم عبادت کرو ۔",
        "English" : "O My servants who believe, surely My earth is vast. So, Me alone you must worship."
      },
      {
        "ayet_no" : 57,
        "arbi" : "كُلُّ نَفْسٍ ذَاۗىِٕقَةُ الْمَوْتِ ۣثُمَّ اِلَيْنَا تُرْجَعُوْنَ",
        "Urdu" : "ہر جان چکھنے والی ہے موت کو پھر ہماری طرف ہی تم لوٹائے جاؤ گے ۔",
        "English" : "Every person has to taste death, then to Us you are to be returned."
      },
      {
        "ayet_no" : 58,
        "arbi" : "وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَنُبَوِّئَنَّهُمْ مِّنَ الْجَنَّةِ غُرَفًا تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَا  ۭ نِعْمَ اَجْرُ الْعٰمِلِيْنَ",
        "Urdu" : "اور (وہ لوگ )جو ایمان لائے اور اُنہوں نے نیک عمل کیے بلاشبہ ضرور ہم جگہ دیں گے اُنہیں جنت کے بالا خانوں میں ، بہتی ہوں گی اُنکے نیچے سے نہریں (وہ)ہمیشہ رہنے والے ہیں اُن میں اچھا اجر ہے(نیک ) عمل کرنے والوں کا ۔",
        "English" : "And those who believe (in the Oneness of Allah Islamic Monotheism) and do righteous good deeds, to them We shall surely give lofty dwellings in Paradise, underneath which rivers flow, to live therein forever. Excellent is the reward of the workers."
      },
      {
        "ayet_no" : 59,
        "arbi" : "الَّذِيْنَ صَبَرُوْا وَعَلٰي رَبِّهِمْ يَتَوَكَّلُوْنَ",
        "Urdu" : "جنہوں نے صبر کیا اور اپنے رب پر وہ بھروسا کرتے ہیں ۔",
        "English" : "(These are the people) who remain steadfast and always trust their Lord alone."
      },
      {
        "ayet_no" : 60,
        "arbi" : "وَكَاَيِّنْ مِّنْ دَاۗبَّةٍ لَّا تَحْمِلُ رِزْقَهَا   ٤اَللّٰهُ يَرْزُقُهَا وَاِيَّاكُمْ ڮ وَهُوَ السَّمِيْعُ الْعَلِيْمُ",
        "Urdu" : "اور کتنے ہی چلنے والے (جاندار)ہیں (کہ ) نہیں اُٹھائے پھرتےاپنا رزق اللّٰہ ہی رزق دیتاہے اُنہیں اور تمہیں بھی اوروہی خوب سننے والا خوب جاننے والا ہے ۔",
        "English" : "How many an animal there is that does not carry its provision. Allah gives provision to it as well as to you, and He is the All-Hearing, the All-knowing."
      },
      {
        "ayet_no" : 61,
        "arbi" : "وَلَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ وَسَخَّــرَ الشَّمْسَ وَالْقَمَرَ لَيَقُوْلُنَّ اللّٰهُ فَاَنّٰى يُؤْفَكُوْنَ",
        "Urdu" : "اور بلا شبہ اگر آپ پوچھیں اِن سے کس نے پیدا کیا آسمانوں اور زمین کو اور(کس نے) مسخر کیا سورج اور چاند کو بلا شبہ ضرور وہ کہیں گے اللّٰہ نے پھر کہاں وہ بہکائے جاتے ہیں ۔",
        "English" : "If you ask them as to who has created the heavens and the earth and has subjugated the sun and the moon, they will certainly say, :Allah . How then are they driven aback (by their whims ?)"
      },
      {
        "ayet_no" : 62,
        "arbi" : "اَللّٰهُ يَبْسُطُ الرِّزْقَ لِمَنْ يَّشَاۗءُ مِنْ عِبَادِهٖ وَيَقْدِرُ لَهٗ ۭ اِنَّ اللّٰهَ بِكُلِّ شَيْءٍ عَلِيْمٌ",
        "Urdu" : "اللّٰہ ہی رزق کو فراخ کرتاہے جس کیلیے وہ چاہتاہے اپنے بندوں میں سےاور وہی تنگ کرتاہے اُسکے لیے بیشک اللّٰہ ہر چیز کو خوب جاننے والا ہے ۔",
        "English" : "Allah extends provision to whom He wills from His servants, and straitens it (for whom He wills). Surely Allah knows every thing well."
      },
      {
        "ayet_no" : 63,
        "arbi" : "وَلَىِٕنْ سَاَلْتَهُمْ مَّنْ نَّزَّلَ مِنَ السَّمَاۗءِ مَاۗءً فَاَحْيَا بِهِ الْاَرْضَ مِنْۢ بَعْدِ مَوْتِهَا لَيَقُوْلُنَّ اللّٰهُ ۭ قُلِ الْحَمْدُ لِلّٰهِ ۭ بَلْ اَكْثَرُهُمْ لَا يَعْقِلُوْنَ",
        "Urdu" : "اور یقیناً اگرآپ پوچھیں اُن سے کس نے اُتاراآسمان سے پانی پھر اُس نے زندہ (آباد)کیا اس کے ساتھ زمین کو اس کی موت (ویرانی )کے بعد بلاشبہ ضرور وہ کہیں گے اللّٰہ نے آپ کہہ دیجیے سب تعریف اللّٰہ کے لیے ہے بلکہ اُن کے اکثر نہیں سمجھتے ۔",
        "English" : "And if you ask them as to who sends down water from the sky, then revives the land with it, they will certainly say, :Allah . Say, :Praise is for Allah. But most of them do not understand."
      },
      {
        "ayet_no" : 64,
        "arbi" : "وَمَا هٰذِهِ الْحَيٰوةُ الدُّنْيَآ اِلَّا لَهْوٌ وَّلَعِبٌ ۭ وَاِنَّ الدَّارَ الْاٰخِرَةَ لَھِىَ الْحَـيَوَانُ ۘ لَوْ كَانُوْا يَعْلَمُوْنَ",
        "Urdu" : "اور نہیں ہے یہ دنیوی زندگی مگر دل لگی ،اور کھیل کود (کھیل تماشا) اور بلاشبہ اُخروی گھر یقیناً وہی (اصل)زندگی ہے کا ش وہ جانتے ہوتے ۔",
        "English" : "What is the life of this world but amusement and play ? but verily the Home in the Hereafter,- that is life indeed, if they but knew."
      },
      {
        "ayet_no" : 65,
        "arbi" : "فَاِذَا رَكِبُوْا فِي الْفُلْكِ دَعَوُا اللّٰهَ مُخْلِصِيْنَ لَهُ الدِّيْنَ ڬ فَلَمَّا نَجّٰىهُمْ اِلَى الْبَرِّ اِذَا هُمْ يُشْرِكُوْنَ",
        "Urdu" : "پھر جب وہ (مشرک)سوار ہوتے ہیں کشتی میں وہ پکارتے ہیں اللّٰہ کو خالص کرتےہوئےاُسی کے لیےدین (عبادت)کو پھر جب وہ بچا لیتاہے اُنہیں خشکی کی طرف(لا کر) (تو) اچانک وہ شرک کرنے لگتے ہیں ۔",
        "English" : "And when they embark on a ship, they invokeAllah, making their Faith pure for Him only, but when He brings them safely to land, behold, they give a share of their worship to others."
      },
      {
        "ayet_no" : 66,
        "arbi" : "لِيَكْفُرُوْا بِمَآ اٰتَيْنٰهُمْ ڌ وَلِيَتَمَتَّعُوْا ۪ فَسَوْفَ يَعْلَمُوْنَ",
        "Urdu" : "تاکہ وہ ناشکری کریں(اس) کی جو ہم نے دیا اُنہیں اور تاکہ وہ فائدہ اُٹھا لیں تو عنقریب وہ جان لیں گے ۔",
        "English" : "So that they become ingrate for that which We have vouchsafed unto them, and that they enjoy themselves; but presently they shall know."
      },
      {
        "ayet_no" : 67,
        "arbi" : "اَوَلَمْ يَرَوْا اَنَّا جَعَلْنَا حَرَمًا اٰمِنًا وَّيُتَخَطَّفُ النَّاسُ مِنْ حَوْلِهِمْ ۭ اَفَبِالْبَاطِلِ يُؤْمِنُوْنَ وَبِنِعْمَةِ اللّٰهِ يَكْفُرُوْنَ",
        "Urdu" : "اور(بھلا) کیا انہوں نے نہیں دیکھا کہ بیشک ہم نے بنایا حرم کو امن والا جبکہ اچک لیے جاتے ہیں لوگ اُنکے اردگرد سے تو (بھلا)کیا باطل پر یہ ایمان (یقین)رکھتے ہیں اور اللّٰہ کی نعمت کی ناشکری کرتے ہیں ۔",
        "English" : "Did they not see that We have made a peaceful sanctuary (Haram) while (other) people around them are being snatched away? Do they still believe in falsity and reject Allah‘s grace ?"
      },
      {
        "ayet_no" : 68,
        "arbi" : "وَمَنْ اَظْلَمُ مِمَّنِ افْتَرٰي عَلَي اللّٰهِ كَذِبًا اَوْ كَذَّبَ بِالْحَقِّ لَمَّا جَاۗءَهٗ   ۭ اَلَيْسَ فِيْ جَهَنَّمَ مَثْوًى لِّلْكٰفِرِيْنَ",
        "Urdu" : "اور کون بڑا ظالم ہے( اس) سے جس نے اللّٰہ پر جھوٹ باندھا یا جھٹلایا حق کو جب وہ آیااسکے پاس کیا نہیں جہنم میں (اِن)کافروں کا ٹھکانا",
        "English" : "Who is more unjust than the one who forges a lie against Allah or rejects the truth when it comes to him? Is there not in Jahannam a home for disbelievers ?"
      },
      {
        "ayet_no" : 69,
        "arbi" : "وَالَّذِيْنَ جَاهَدُوْا فِيْنَا لَـنَهْدِيَنَّهُمْ سُـبُلَنَا ۭ وَاِنَّ اللّٰهَ لَمَعَ الْمُحْسِنِيْنَ",
        "Urdu" : "اور(وہ لوگ) جنہوں نے کوشش کی ہماری (راہ) میں بلاشبہ ضرور ہم ہدایت دیںگے اُنہیں اپنے راستوں کی اور بے شک اللّٰہ یقیناً نیکی کرنےو الوں کے ساتھ ہے ۔",
        "English" : "As for those who strive in Our way, We will certainly take them onto Our paths, and indeed Allah is with those who are good in deeds."
      }
    ]
  }
]