[
  {
    "surah_no" : 75,
    "total_ayah" : 40,
    "name" : "Surah e AL-Qiyamah",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "لَآ اُقْسِمُ بِيَوْمِ الْقِيٰمَةِ",
        "Urdu" : "نہیں میں قسم کھاتا ہوں قیامت کے دن کی",
        "English" : "I swear by the Day of Resurrection,"
      },
      {
        "ayet_no" : 2,
        "arbi" : "وَلَآ اُقْسِمُ بِالنَّفْسِ اللَّوَّامَةِ",
        "Urdu" : "اور نہیں میں قسم کھاتا ہوں ایسے نفس کی جو ملامت کرنے والا ہے (خود اپنے آپ کو)",
        "English" : "And I swear by the self-reproaching soul."
      },
      {
        "ayet_no" : 3,
        "arbi" : "اَيَحْسَبُ الْاِنْسَانُ اَلَّنْ نَّجْمَعَ عِظَامَهٗ",
        "Urdu" : "کیا انسان یہ سمجھ رہا ہے کہ ہم (دوبارہ) جمع نہ کر سکیں گے اس کی ہڈیوں کو ؟",
        "English" : "Does man think that We will never reassemble his bones ?"
      },
      {
        "ayet_no" : 4,
        "arbi" : "بَلٰى قٰدِرِيْنَ عَلٰٓي اَنْ نُّسَوِّيَ بَنَانَهٗ",
        "Urdu" : "کیوں نہیں جب کہ ہم اس پر بھی قادر ہیں کہ پوری طرح برابر کر دیں اس کے پور پور تک کو",
        "English" : "Why (can We) not (do so) , while We are able to reset (even) his fingertips perfectly ?"
      },
      {
        "ayet_no" : 5,
        "arbi" : "بَلْ يُرِيْدُ الْاِنْسَانُ لِيَفْجُرَ اَمَامَهٗ",
        "Urdu" : "مگر انسان دراصل چاہتا یہ ہے کہ وہ بدعملیاں کرتا رہےاپنی آئندہ زندگی میں",
        "English" : "But man wishes to go on violating Allah‘s injunctions (even in future) ahead of him."
      },
      {
        "ayet_no" : 6,
        "arbi" : "يَسْــَٔـلُ اَيَّانَ يَوْمُ الْقِيٰمَةِ",
        "Urdu" : "وہ پوچھتا ہے (استہزا و انکار کے طور پر) کہ صاحب آخر کب انا ہے قیامت کے اس دن نے ؟",
        "English" : "He asks, :When will be this Day of Resurrection ?"
      },
      {
        "ayet_no" : 7,
        "arbi" : "فَاِذَا بَرِقَ الْبَصَرُ",
        "Urdu" : "سو جب (مارے دہشت و حیرت کے) خیرہ ہو جائیں گی ان کی نگاہیں",
        "English" : "When, then, the sight shall be confounded."
      },
      {
        "ayet_no" : 8,
        "arbi" : "وَخَسَفَ الْقَمَرُ",
        "Urdu" : "اور بےنور ہو جائے گا (یہ چکمتا دمکتا) چاند",
        "English" : "And the moon is buried in darkness."
      },
      {
        "ayet_no" : 9,
        "arbi" : "وَجُمِعَ الشَّمْسُ وَالْقَمَرُ",
        "Urdu" : "اور جمع کر دیا جائے گا (بے نور ہونے میں) سورج اور چاند کو",
        "English" : "And the sun and the moon shall be joined."
      },
      {
        "ayet_no" : 10,
        "arbi" : "يَقُوْلُ الْاِنْسَانُ يَوْمَىِٕذٍ اَيْنَ الْمَفَرُّ",
        "Urdu" : "اس روز (مارے خوف و حیرت کے) کہے گا یہ انسان کہ اب کدھر کو بھاگوں میں ؟",
        "English" : "On that Day shall man say: whither is the fleeing."
      },
      {
        "ayet_no" : 11,
        "arbi" : "كَلَّا لَا وَزَرَ",
        "Urdu" : "ہرگز نہیں وہاں کوئی جائے پناہ نہ ہوگی",
        "English" : "Never! There will be no refuge at all."
      },
      {
        "ayet_no" : 12,
        "arbi" : "اِلٰى رَبِّكَ يَوْمَىِٕذِۨ الْمُسْتَــقَرُّ",
        "Urdu" : "تیرے رب ہی کے پاس اس روز جا ٹھہرنا ہوگا (سب کو) ف۱",
        "English" : "On that day, towards your Lord will be the destination (of everyone.)"
      },
      {
        "ayet_no" : 13,
        "arbi" : "يُنَبَّؤُا الْاِنْسَانُ يَوْمَىِٕذٍۢ بِمَا قَدَّمَ وَاَخَّرَ",
        "Urdu" : "اس روز انسان کو (پوری طرح) بتا دیا جائے گا وہ سب کچھ جو کہ اس نے آگے بھیجا ہوگا اور جو کچھ کہ اس نے پیچھے چھوڑا ہوگا ف۲",
        "English" : "Man will be informed of what he sent ahead and what he left behind."
      },
      {
        "ayet_no" : 14,
        "arbi" : "بَلِ الْاِنْسَانُ عَلٰي نَفْسِهٖ بَصِيْرَةٌ",
        "Urdu" : "بلکہ (حقیقت یہ ہے کہ) انسان اپنے آپ کو خود ہی اچھی طرح جانتا ہے",
        "English" : "Aye! man against himself shall be an enlightenment."
      },
      {
        "ayet_no" : 15,
        "arbi" : "وَّلَوْ اَلْقٰى مَعَاذِيْرَهٗ",
        "Urdu" : "اگرچہ وہ کتنے ہی بہانے ( کیوں نہ) پیش کرے",
        "English" : "Though he may put forth his excuses (to cover his evil deeds)."
      },
      {
        "ayet_no" : 16,
        "arbi" : "لَا تُحَرِّكْ بِهٖ لِسَانَكَ لِتَعْجَلَ بِهٖ",
        "Urdu" : "اوراپنی زبان کو مت ہلایا کرو اس (قران) کے ساتھ (اے پیغمبر !) اس کو جلدی جلدی یاد کر لینے کی غرض سے",
        "English" : "(O Prophet,) do not move your tongue (during revelation) for (reciting) it (the Qur‘an) to receive it in hurry."
      },
      {
        "ayet_no" : 17,
        "arbi" : "اِنَّ عَلَيْنَا جَمْعَهٗ وَقُرْاٰنَه ٗ",
        "Urdu" : "بلاشبہ ہمارے ذمے ہے اس کو جمع کر دینا (آپ کے سینے میں) اور اس کو پڑھا دینا (آپ کی زبان سے)",
        "English" : "Verily upon us is the collecting thereof and the reciting thereof."
      },
      {
        "ayet_no" : 18,
        "arbi" : "فَاِذَا قَرَاْنٰهُ فَاتَّبِعْ قُرْاٰنَهٗ",
        "Urdu" : "پس جب ہم اس کو پڑھا کریں تو آپ غور سے سنتے رہا کریں اس کے پڑھنے کو",
        "English" : "Therefore, when it is recited by Us (through the angel) , follow its recitation (by concentration of your heart)."
      },
      {
        "ayet_no" : 19,
        "arbi" : "ثُمَّ اِنَّ عَلَيْنَا بَيَانَهٗ",
        "Urdu" : "پھر ہمارے ہی ذمے ہے بیان کر دینا اس (کے معانی و مطالب) کو",
        "English" : "Then, it is undertaken by Us to explain it."
      },
      {
        "ayet_no" : 20,
        "arbi" : "كَلَّا بَلْ تُحِبُّوْنَ الْعَاجِلَةَ",
        "Urdu" : "ہرگز نہیں بلکہ (اصل بات یہ ہے کہ) تم لوگ محبت رکھتے ہو جلد ملنے والی چیز (یعنی دنیا) سے",
        "English" : "By no means! Verily ye love the Herein."
      },
      {
        "ayet_no" : 21,
        "arbi" : "وَتَذَرُوْنَ الْاٰخِرَةَ",
        "Urdu" : "اور تم چھوڑ رہے ہو آخرت (کی اصل اور حقیقی زندگی) کو",
        "English" : "And leave the Hereafter."
      },
      {
        "ayet_no" : 22,
        "arbi" : "وُجُوْهٌ يَّوْمَىِٕذٍ نَّاضِرَةٌ",
        "Urdu" : "بہت سے چہرے تو اس روز تروتازہ ہوں گے",
        "English" : "Countenances on that Day shall be resplendent,"
      },
      {
        "ayet_no" : 23,
        "arbi" : "اِلٰى رَبِّهَا نَاظِرَةٌ",
        "Urdu" : "اپنے رب کی طرف دیکھ رہے ہوں گے",
        "English" : "Looking toward their Lord."
      },
      {
        "ayet_no" : 24,
        "arbi" : "وَوُجُوْهٌ يَّوْمَىِٕذٍۢ بَاسِرَةٌ",
        "Urdu" : "جب کہ بہت سے چہرے اس روز بگڑے ہوئے ہوں گے",
        "English" : "And countenances on that Day shall be scowling."
      },
      {
        "ayet_no" : 25,
        "arbi" : "تَظُنُّ اَنْ يُّفْعَلَ بِهَا فَاقِرَةٌ",
        "Urdu" : "وہ سمجھ رہے ہوں گے کہ ان کے ساتھ کمر توڑ معاملہ کیا جانے والا ہے",
        "English" : "Thinking that they will be subjected to such a harsh treatment which will break their backbones."
      },
      {
        "ayet_no" : 26,
        "arbi" : "كَلَّآ اِذَا بَلَغَتِ التَّرَاقِيَ",
        "Urdu" : "ہرگز نہیں (ذرا یاد کرو اس وقت کو کہ) جب پہنچ جائے گی جان ہنسلی تک",
        "English" : "By no means! When it come up to he collar-bone."
      },
      {
        "ayet_no" : 27,
        "arbi" : "وَقِيْلَ مَنْ ۫رَاقٍ",
        "Urdu" : "اور کہا جائے گا کہ ہے کوئی جھاڑ پھونک کرنے والا ؟",
        "English" : "And it is cried. who can charm ?"
      },
      {
        "ayet_no" : 28,
        "arbi" : "وَّظَنَّ اَنَّهُ الْفِرَاقُ",
        "Urdu" : "اور اسے یقین ہو جائے گا کہ یہ جدائی کا وقت ہے",
        "English" : "And he be think that it is the time of parting."
      },
      {
        "ayet_no" : 29,
        "arbi" : "وَالْتَفَّتِ السَّاقُ بِالسَّاقِ",
        "Urdu" : "اور جڑ جائے گی پنڈلی پنڈلی سے",
        "English" : "And one shank is entangled with the other shank."
      },
      {
        "ayet_no" : 30,
        "arbi" : "اِلٰى رَبِّكَ يَوْمَىِٕذِۨ الْمَسَاقُ",
        "Urdu" : "تیرے رب ہی کی طرف ہوگی اس روز یہ روانگی",
        "English" : "Unto thy Lord that Day is the drive."
      },
      {
        "ayet_no" : 31,
        "arbi" : "فَلَا صَدَّقَ وَلَا صَلّٰى",
        "Urdu" : "پھر بھی (اس غافل انسان کا حال یہ ہے کہ) اس نے نہ تصدیق کی (حق کی) اور نہ اس نے نماز پڑھی (اپنے رب کی رضا کے لئے)",
        "English" : "For he neither trusted, nor prayed."
      },
      {
        "ayet_no" : 32,
        "arbi" : "وَلٰكِنْ كَذَّبَ وَتَوَلّٰى",
        "Urdu" : "بلکہ اس نے جھٹلایا (حق کو) اور منہ موڑا (اپنے رب کے حکم سے)",
        "English" : "But he belied and turned away."
      },
      {
        "ayet_no" : 33,
        "arbi" : "ثُمَّ ذَهَبَ اِلٰٓى اَهْلِهٖ يَتَمَطّٰى",
        "Urdu" : "پھر یہ چل دیا وہ اپنے گھر والوں کی طرف اکڑتا (اور ناز کرتا) ہوا",
        "English" : "Then he departed Unto his house hold conceitedly."
      },
      {
        "ayet_no" : 34,
        "arbi" : "اَوْلٰى لَكَ فَاَوْلٰى",
        "Urdu" : "ہلاکت ہے تیرے لئے (اے بدبخت انسان) پھر ہلاکت",
        "English" : "Woe to you [O man (disbeliever) ]! And then (again) woe to you!"
      },
      {
        "ayet_no" : 35,
        "arbi" : "ثُمَّ اَوْلٰى لَكَ فَاَوْلٰى",
        "Urdu" : "ہاں ہلاکت ہے تیرے لئے (اے شقی) پھر ہلاکت",
        "English" : "Again nearer unto thee and nearer (is the doom)."
      },
      {
        "ayet_no" : 36,
        "arbi" : "اَيَحْسَبُ الْاِنْسَانُ اَنْ يُّتْرَكَ سُدًى",
        "Urdu" : "کیا ایسے انسان نے یہ سمجھ رکھا ہے کہ اس کو یونہی بےکار چھوڑ دیا جائے گا ؟",
        "English" : "Does man presume that he will be left unchecked ?"
      },
      {
        "ayet_no" : 37,
        "arbi" : "اَلَمْ يَكُ نُطْفَةً مِّنْ مَّنِيٍّ يُّمْـنٰى",
        "Urdu" : "کیا یہ ایک حقیر بوند نہیں تھا منی کی جس کو ٹپکایا جاتا ہے ؟",
        "English" : "Was he not an ejaculated drop of semen ?"
      },
      {
        "ayet_no" : 38,
        "arbi" : "ثُمَّ كَانَ عَلَقَةً فَخَلَقَ فَسَوّٰى",
        "Urdu" : "پھر یہ ایک لوتھڑا بنا پھر اس (قادر مطلق) نے اس کا جسم بنایا اور اس کے اعضا درست کئے",
        "English" : "Then he became a clot; then He created him and formed him."
      },
      {
        "ayet_no" : 39,
        "arbi" : "فَجَعَلَ مِنْهُ الزَّوْجَيْنِ الذَّكَرَ وَالْاُنْثٰى",
        "Urdu" : "اس نے پھر اس سے (اپنی قدرت کاملہ اور حکمت بالغہ سے) دو قسمیں بنائیں مرد اور عورت",
        "English" : "And made of him the two sexes, male and female."
      },
      {
        "ayet_no" : 40,
        "arbi" : "اَلَيْسَ ذٰلِكَ بِقٰدِرٍ عَلٰٓي اَنْ يُّـحْيِۦ الْمَوْتٰى",
        "Urdu" : "تو کیا وہ اللہ (جس نے یہ سب کچھ کیا) اس پر قادر نہیں کہ (پھر سے) زندہ کر دے مردوں کو ؟ ف۱",
        "English" : "Is not That One then Able to quicken the dead ?"
      }
    ]
  }
]