[
  {
    "surah_no" : 54,
    "total_ayah" : 55,
    "name" : "Surah e AL-Qamar",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "اِقْتَرَبَتِ السَّاعَةُ وَانْشَقَّ الْقَمَرُ",
        "Urdu" : "قریب آگئی (قیامت کی) وہ ہولناک گھڑی اور پھٹ گیا چاند",
        "English" : "The Hour (of doom) has drawn near, and the moon has split asunder."
      },
      {
        "ayet_no" : 2,
        "arbi" : "وَاِنْ يَّرَوْا اٰيَةً يُّعْرِضُوْا وَيَقُوْلُوْا سِحْرٌ مُّسْتَمِرٌّ",
        "Urdu" : "مگر لوگوں کا حال یہ ہے کہ اگر یہ کوئی بڑی نشانی بھی دیکھ لیں تو اس سے (غفلت و لاپرواہی کے ساتھ) منہ موڑ لیتے ہیں اور کہتے ہیں کہ یہ تو ایک جادو ہے چلتا ہوا",
        "English" : "When these people see a sign, they turn away and say, :(This is) a transient magic."
      },
      {
        "ayet_no" : 3,
        "arbi" : "وَكَذَّبُوْا وَاتَّبَعُوْٓا اَهْوَاۗءَهُمْ وَكُلُّ اَمْرٍ مُّسْتَقِرٌّ",
        "Urdu" : "انہوں نے جھٹلایا (حق اور حقیقت کو) اور پیچھے چل پڑےاپنی خواہشات کے اور ہر کام کا بہرحال ایک وقت مقرر ہے",
        "English" : "They have rejected (the Truth) and followed their desires, while every matter has to settle (at some time)."
      },
      {
        "ayet_no" : 4,
        "arbi" : "وَلَقَدْ جَاۗءَهُمْ مِّنَ الْاَنْۢبَاۗءِ مَا فِيْهِ مُزْدَجَرٌ",
        "Urdu" : "اور بلاشبہ ان لوگوں کے پاس (پچھلی قوموں کی) اتنی سرگذشتیں پہنچ چکی ہیں جن میں بڑا سامان عبرت ہے",
        "English" : "And assuredly there hath come Unto them tidings wherein is a deterrent."
      },
      {
        "ayet_no" : 5,
        "arbi" : "حِكْمَةٌۢ بَالِغَةٌ فَمَا تُغْنِ النُّذُرُ",
        "Urdu" : "یعنی اعلیٰ درجے کی ایک دانش مندی مگر (ایسوں کے لئے مفید اور) کارگر نہیں ہو سکتیں ایسی تنبیہات",
        "English" : "Wisdom consummate. But warnings avail not."
      },
      {
        "ayet_no" : 6,
        "arbi" : "فَتَوَلَّ عَنْهُمْ ۘ يَوْمَ يَدْعُ الدَّاعِ اِلٰى شَيْءٍ نُّكُرٍ",
        "Urdu" : "پس آپ منہ موڑ لیں ان (ناہنجاروں) سے (ان کو خود معلوم ہو جائے گا اس دن) جس دن کہ پکارے گا (حشر کا) وہ داعی ایک بڑی ہی ناگوار چیز کی طرف",
        "English" : "Therefore, turn aside (O Prophet,) from them. (They will see the reality) on the day in which the caller will call (them) to a gruesome object."
      },
      {
        "ayet_no" : 7,
        "arbi" : "خُشَّعًا اَبْصَارُهُمْ يَخْرُجُوْنَ مِنَ الْاَجْدَاثِ كَاَنَّهُمْ جَرَادٌ مُّنْتَشِرٌ",
        "Urdu" : "(اس دن ان کا حال یہ ہوگا کہ) جھکی ہوئی ہوں گی ان کی نگاہیںاپنی قبروں سے اس طرح نکل رہے ہوں گے جیسے ٹڈی دل ہیں جو پھیل پڑے ہیں",
        "English" : "With looks downcast they will come forth, from the tombs, as though they were locusts scattered abroad."
      },
      {
        "ayet_no" : 8,
        "arbi" : "مُّهْطِعِيْنَ اِلَى الدَّاعِ ۭ يَقُوْلُ الْكٰفِرُوْنَ ھٰذَا يَوْمٌ عَسِرٌ",
        "Urdu" : "دوڑے جا رہے ہوں گے اس بلانے والے کی طرف (اس روز) یہ کافر لوگ کہہ رہے ہوں گے کہ یہ تو بڑا ہی سخت دن ہے ف۱",
        "English" : "Rushing quickly towards the caller. (On that Day) the disbelievers will say, :This is a hard day."
      },
      {
        "ayet_no" : 9,
        "arbi" : "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوْحٍ فَكَذَّبُوْا عَبْدَنَا وَقَالُوْا مَجْنُوْنٌ وَّازْدُجِرَ",
        "Urdu" : "ان سے پہلے قوم نوح نے بھی جھٹلایا (حق اور داعی حق کو) چنانچہ انہوں نے جھٹلایا ہمارے بندہ (نوح) کو اور کہا کہ یہ تو ایک دیوانہ ہے اور اسے بری طرح جھڑکا گیا",
        "English" : "The people of NuH denied (the truth) before them. So they rejected Our servant, and said, :(He is) a madman , and he was (also) threatened (by them)."
      },
      {
        "ayet_no" : 10,
        "arbi" : "فَدَعَا رَبَّهٗٓ اَنِّىْ مَغْلُوْبٌ فَانْتَصِرْ",
        "Urdu" : "آخرکار انہوں نے پکارا اپنے رب کو (اور عرض کیا) کہ میں بالکل بےبس ہوں پس تو ہی (اے میرے مالک ان سے) میرا بدلہ لے",
        "English" : "So he prayed to his Lord saying, :I am overpowered, so defend (me)."
      },
      {
        "ayet_no" : 11,
        "arbi" : "فَفَتَحْنَآ اَبْوَابَ السَّمَاۗءِ بِمَاۗءٍ مُّنْهَمِرٍ",
        "Urdu" : "پھر کیا تھا ہم نے کھول دئیے آسمان کے دروازے ایک بڑی ہی ہولناک موسلادھار بارش کے ساتھ",
        "English" : "Then We opened the portals of heaven with water poured out."
      },
      {
        "ayet_no" : 12,
        "arbi" : " وَّفَجَّــرْنَا الْاَرْضَ عُيُوْنًا فَالْتَقَى الْمَاۗءُ عَلٰٓي اَمْرٍ قَدْ قُدِرَ",
        "Urdu" : "اور زمین کو ہم نے پھاڑ کر چشمے ہی چشمے کر دیا یہاں تک کہ یہ سارا پانی پہنچ گیا اس حد کو جو (اللہ تعالیٰ کے یہاں) طے کر دی گئی تھی",
        "English" : "And We made the earth break forth with springs; SO that the water met for an affair already decreed."
      },
      {
        "ayet_no" : 13,
        "arbi" : "وَحَمَلْنٰهُ عَلٰي ذَاتِ اَلْوَاحٍ وَّدُسُرٍ",
        "Urdu" : "اور ہم نے ان کو سوار کیا تختوں اور میخوں والی (اس کشتی) پر",
        "English" : "And We bare him on a thing of planks and nails."
      },
      {
        "ayet_no" : 14,
        "arbi" : "تَجْرِيْ بِاَعْيُنِنَا ۚ جَزَاۗءً لِّمَنْ كَانَ كُفِرَ",
        "Urdu" : "جو چل رہی تھی ہماری نگرانی میں اس شخص کے بدلے (اور اس کے انتقام) کے طور پر جس کی ناقدری کی گئی تھی",
        "English" : "Moving forward under Our eyes: a requital for him who had been rejected."
      },
      {
        "ayet_no" : 15,
        "arbi" : "وَلَقَدْ تَّرَكْنٰهَآ اٰيَةً فَهَلْ مِنْ مُّدَّكِرٍ",
        "Urdu" : "اور بلاشبہ ہم نے اس کو چھوڑ دیا ایک عظیم الشان نشانی کے طور پر تو کیا ہے کوئی نصیحت قبول کرنے والا ؟",
        "English" : "And We left it (the ship) as a sign. So, is there one to take lesson ?"
      },
      {
        "ayet_no" : 16,
        "arbi" : "فَكَيْفَ كَانَ عَذَابِيْ وَنُذُرِ",
        "Urdu" : "سو (دیکھ لو اے لوگو! کہ) کیسا تھا میرا عذاب اور میرا خبردار کرنا",
        "English" : "Then how was My torment and My warnings ?"
      },
      {
        "ayet_no" : 17,
        "arbi" : "وَلَقَدْ يَسَّرْنَا الْقُرْاٰنَ لِلذِّكْرِ فَهَلْ مِنْ مُّدَّكِرٍ",
        "Urdu" : "اور بلاشبہ ہم نے آسان کر دیا اس قران کو نصیحت کے لئے تو کیا ہے کوئی نصیحت قبول کرنے والا ؟",
        "English" : "Indeed We have made the Qur‘an easy for seeking advice. So, is there one to heed to the advice ?"
      },
      {
        "ayet_no" : 18,
        "arbi" : "كَذَّبَتْ عَادٌ فَكَيْفَ كَانَ عَذَابِيْ وَنُذُرِ",
        "Urdu" : "قوم عاد نے بھی جھٹلایا پھر (دیکھ لو) کیسا تھا میرا عذاب اور میرا ڈرانا",
        "English" : "(The people of) 'Aad rejected (their prophet). So how was My torment and My warnings ?"
      },
      {
        "ayet_no" : 19,
        "arbi" : "اِنَّآ اَرْسَلْنَا عَلَيْهِمْ رِيْحًا صَرْصَرًا فِيْ يَوْمِ نَحْسٍ مُّسْتَمِرٍّ",
        "Urdu" : "ہم نے ان پر ایک ایسی سخت قسم کی اندھی بھیجی ایک دائمی نحوست کے دن میں ف۱",
        "English" : "Verily We! We sent against them a raging Wind On a day of calamity continuous."
      },
      {
        "ayet_no" : 20,
        "arbi" : "تَنْزِعُ النَّاسَ ۙ كَاَنَّهُمْ اَعْجَازُ نَخْلٍ مُّنْقَعِرٍ",
        "Urdu" : "جو ان لوگوں کو اس طرح اٹھا اٹھا کر پھینک رہی تھی جیسے وہ تنے ہوں اکھڑے ہوئے کھجور کے درختوں کے ف۲",
        "English" : "Sweeping men away as though they were uprooted trunks of palm-trees."
      },
      {
        "ayet_no" : 21,
        "arbi" : "فَكَيْفَ كَانَ عَذَابِيْ وَنُذُرِ",
        "Urdu" : "سو (دیکھ لو !) کیسا تھا میرا عذاب اور میرا ڈرانا",
        "English" : "So how was My torment and My warnings ?"
      },
      {
        "ayet_no" : 22,
        "arbi" : "وَلَقَدْ يَسَّرْنَا الْقُرْاٰنَ لِلذِّكْرِ فَهَلْ مِنْ مُّدَّكِرٍ",
        "Urdu" : "اور بلاشبہ ہم نے آسان کر دیا اس قران (عظیم) کو نصیحت حاصل کرنے کے لئے تو کیا ہے کوئی نصیحت قبول کرنے والا ؟",
        "English" : "Indeed We have made the Qur‘an easy for seeking advice. So, is there one to heed to the advice ?"
      },
      {
        "ayet_no" : 23,
        "arbi" : "كَذَّبَتْ ثَمُوْدُ بِالنُّذُرِ",
        "Urdu" : "اور قوم ثمود نے بھی جھٹلایا خبردار کرنے والوں کو",
        "English" : "And the Thamud belied the warnings."
      },
      {
        "ayet_no" : 24,
        "arbi" : "فَقَالُوْٓا اَبَشَرًا مِّنَّا وَاحِدًا نَّتَّبِعُهٗٓ ۙ اِنَّآ اِذًا لَّفِيْ ضَلٰلٍ وَّسُعُرٍ",
        "Urdu" : "چنانچہ انہوں نے کہا کہ کیا ہم اپنے ہی میں سے ایک بشر کی پیروی کرنے لگ جائیں؟ ایسی صورت میں تو ہم یقینا بڑی گمراہی اور دیوانگی میں پڑے ہوں گے",
        "English" : "So they said, :Shall we follow a single human being from among us? Then we will be in error and insanity."
      },
      {
        "ayet_no" : 25,
        "arbi" : "ءَاُلْقِيَ الذِّكْرُ عَلَيْهِ مِنْۢ بَيْنِنَا بَلْ هُوَ كَذَّابٌ اَشِرٌ",
        "Urdu" : "کیا ہم سب میں سے بس اسی پر خدا کا ذکر اتارا جانا تھا؟ نہیں بلکہ یہ تو پرلے درجے کا ایک جھوٹا اور شیخی باز شخص ہے",
        "English" : "Is it that the advice has been cast upon him alone out of all of us? No, but he is a bragging liar."
      },
      {
        "ayet_no" : 26,
        "arbi" : "سَيَعْلَمُوْنَ غَدًا مَّنِ الْكَذَّابُ الْاَشِرُ",
        "Urdu" : "(ادھر صالح سے کہا گیا کہ) کل ان کو خود ہی معلوم ہو جائے گا کہ کون ہے پرلے درجے کا جھوٹا شیخی باز",
        "English" : "They shall know tomorrow which so ever is a liar insolent."
      },
      {
        "ayet_no" : 27,
        "arbi" : "اِنَّا مُرْسِلُوا النَّاقَةِ فِتْنَةً لَّهُمْ فَارْتَقِبْهُمْ وَاصْطَبِرْ",
        "Urdu" : "ہم اس اونٹنی کو ان کے لئے آزمائش بنا کر بھیج رہے ہیں پس آپ انتظار کریں اور صبر ہی سے کام لیتے رہیں",
        "English" : "Verify We are sending the she-camel as a test for them, so watch them thou and have patience."
      },
      {
        "ayet_no" : 28,
        "arbi" : "وَنَبِّئْهُمْ اَنَّ الْمَاۗءَ قِسْمَةٌۢ بَيْنَهُمْ ۚ كُلُّ شِرْبٍ مُّحْتَضَرٌ",
        "Urdu" : "اور انہیں بتا دیں کہ پانی ان کے (اور اس اونٹنی کے) درمیان تقسیم کر دیا گیا ہے ہر ایکاپنی باری پر آیا کرے",
        "English" : "And declare thou Unto them that water hath been divided between them; every drinking shall be by turns."
      },
      {
        "ayet_no" : 29,
        "arbi" : "فَنَادَوْا صَاحِبَهُمْ فَتَعَاطٰى فَعَقَرَ",
        "Urdu" : "پھر انہوں نے پکارا اپنے ساتھی کو تو اس نے اس کام کا بیڑا اٹھایا اور اس اونٹنی کو ہلاک کر دیا",
        "English" : "Then they called their man (to kill the she-camel,) so he undertook (the task) and killed (the she-camel)."
      },
      {
        "ayet_no" : 30,
        "arbi" : "فَكَيْفَ كَانَ عَذَابِيْ وَنُذُرِ",
        "Urdu" : "پھر (دیکھ لو) کیسا تھا میرا عذاب اور میرا خبردار کرنا",
        "English" : "So how was My torment and My warnings ?"
      },
      {
        "ayet_no" : 31,
        "arbi" : "اِنَّآ اَرْسَلْنَا عَلَيْهِمْ صَيْحَةً وَّاحِدَةً فَكَانُوْا كَهَشِيْمِ الْمُحْتَظِرِ",
        "Urdu" : "ہم نے ان پر ایک ایسی ہولناک آواز بھیجی کہ اس کے نتیجے میں وہ سب کے سب باڑ والے کی روندی ہوئی باڑ کی طرح چورا بن کر رہ گئے",
        "English" : "We sent upon them a single Cry, and they were like crushed leafs of a hedge-builder."
      },
      {
        "ayet_no" : 32,
        "arbi" : "وَلَقَدْ يَسَّرْنَا الْقُرْاٰنَ لِلذِّكْرِ فَهَلْ مِنْ مُّدَّكِرٍ",
        "Urdu" : "اور بلاشبہ ہم نے آسان کر دیا اس قران (عظیم) کو نصیحت کے لئے تو کیا ہے کوئی نصیحت قبول کرنے والا ؟",
        "English" : "Indeed We have made the Qur‘an easy for seeking advice. So, is there one to heed to the advice ?"
      },
      {
        "ayet_no" : 33,
        "arbi" : "كَذَّبَتْ قَوْمُ لُوْطٍۢ بِالنُّذُرِ",
        "Urdu" : "قوم لوط نے بھی جھٹلایا خبردار کرنے والوں کو",
        "English" : "The people of Lout (Lot) belied the warnings."
      },
      {
        "ayet_no" : 34,
        "arbi" : "اِنَّآ اَرْسَلْنَا عَلَيْهِمْ حَاصِبًا اِلَّآ اٰلَ لُوْطٍ ۭ نَجَّيْنٰهُمْ بِسَحَرٍ",
        "Urdu" : "بیشک ہم نے ان پر پتھر برسانے والی ایک ایسی ہولناک ہوا بھیجی جس نے ان کو تہس نہس کر کے رکھ دیا بجز آل لوط کے کہ ان کو ہم نے بچا لیا رات کے پچھلے حصے میں ف۱",
        "English" : "Verily We! We sent upon them a gravel-storm save the household of Lut; them We delivered at early dawn."
      },
      {
        "ayet_no" : 35,
        "arbi" : "نِّعْمَةً مِّنْ عِنْدِنَا ۭ كَذٰلِكَ نَجْزِيْ مَنْ شَكَرَ",
        "Urdu" : "محضاپنی مہربانی سے اسی طرح ہم بدلہ دیا کرتے ہیں ہر اس شخص کو جو شکر کرتا ہے",
        "English" : "As a favour from us. Thus We recompense him who give thanks."
      },
      {
        "ayet_no" : 36,
        "arbi" : "وَلَقَدْ اَنْذَرَهُمْ بَطْشَتَنَا فَتَـمَارَوْا بِالنُّذُرِ",
        "Urdu" : "اور بلاشبہ لوط نے ان لوگوں کو خبردار کر دیا تھا ہماری پکڑ سے مگر وہ لوگ جھگڑے ہی کرتے رہے ہماری تنبیہات کے بارے میں",
        "English" : "And he (LuT) had certainly warned them of Our grasp, but they disputed the warnings."
      },
      {
        "ayet_no" : 37,
        "arbi" : "وَلَقَدْ رَاوَدُوْهُ عَنْ ضَيْفِهٖ فَطَمَسْـنَآ اَعْيُنَهُمْ فَذُوْقُوْا عَذَابِيْ وَنُذُرِ",
        "Urdu" : "اور انہوں نے لوط سے ان کے مہمانوں کے بارے میں مطالبہ شروع کر دیا آخرکار ہم نے موندھ کر رکھ دیا ان کی انکھوں کو (اور ان سے کہا گیا کہ لو اب) چکھو تم لوگ مزہ میرے عذاب کا اور میرے ڈرانے کا",
        "English" : "And assuredly they solicited him for his guests: then We wiped out their eyes: taste then My torment and My warnings."
      },
      {
        "ayet_no" : 38,
        "arbi" : "وَلَقَدْ صَبَّحَهُمْ بُكْرَةً عَذَابٌ مُّسْتَقِرٌّ",
        "Urdu" : "اور ان کو صبح سویرے ہی آلیا ایک ہولناک دائمی عذاب نے",
        "English" : "And assuredly there met them early in the morning a torment settled."
      },
      {
        "ayet_no" : 39,
        "arbi" : "فَذُوْقُوْا عَذَابِيْ وَنُذُرِ",
        "Urdu" : "پس اب چکھو تم لوگ مزہ میرے عذاب کا اور میرے خبردار کرنے کا",
        "English" : "Then taste you My Torment and My Warnings."
      },
      {
        "ayet_no" : 40,
        "arbi" : "وَلَقَدْ يَسَّرْنَا الْقُرْاٰنَ لِلذِّكْرِ فَهَلْ مِنْ مُّدَّكِرٍ",
        "Urdu" : "اور بلاشبہ ہم نے آسان کر دیا اس قران (حکیم) کو نصیحت کے لئے تو کیا ہے کوئی نصیحت قبول کرنے والا ؟",
        "English" : "Indeed We have made the Qur‘an easy for seeking advice. So, is there one to heed to the advice ?"
      },
      {
        "ayet_no" : 41,
        "arbi" : "وَلَقَدْ جَاۗءَ اٰلَ فِرْعَوْنَ النُّذُرُ",
        "Urdu" : "اور بلاشبہ فرعون والوں کے پاس بھی پہنچ گئے خبردار کرنے کے طرح طرح کے سامان",
        "English" : "And the warners came to the family of Fir'awn (Pharaoh)."
      },
      {
        "ayet_no" : 42,
        "arbi" : "كَذَّبُوْا بِاٰيٰتِنَا كُلِّهَا فَاَخَذْنٰهُمْ اَخْذَ عَزِيْزٍ مُّقْتَدِرٍ",
        "Urdu" : "مگر انہوں نے جھٹلا دیا (پوری ڈھٹائی اور ہٹ دھرمی کے ساتھ) ہماری سب نشانیوں کو سو آخرکار ہم نے ان کو پکڑا ایک بڑے ہی زبردست قدرت والے کا پکڑنا",
        "English" : "(But) they rejected all Our signs; so We seized them_ a seizure by One Mighty, Powerful."
      },
      {
        "ayet_no" : 43,
        "arbi" : "اَكُفَّارُكُمْ خَيْرٌ مِّنْ اُولٰۗىِٕكُمْ اَمْ لَكُمْ بَرَاۗءَةٌ فِي الزُّبُرِ",
        "Urdu" : "کیا تمہارے کفار بہتر ہیں ان لوگوں سے (اے دور حاضر کے منکرو اور ان کے ہم مشربو !) یا تمہارے لئے کوئی (معافی اور) براءت لکھی ہے آسمانی کتابوں میں ؟",
        "English" : "Are the disbelievers among you in a better position than all of the aforesaid (punished people), or do you have immunity (recorded) in the sacred books ?"
      },
      {
        "ayet_no" : 44,
        "arbi" : "اَمْ يَقُوْلُوْنَ نَحْنُ جَمِيْعٌ مُّنْتَــصِرٌ",
        "Urdu" : "کیا ان لوگوں کا یہ کہنا ہے کہ ہم لوگ ایک بھاری جتھا ہیں جو غالب ہی رہے گا ؟",
        "English" : "Or do they say, :We are a large group, well-defended. ?"
      },
      {
        "ayet_no" : 45,
        "arbi" : "سَيُهْزَمُ الْجَمْعُ وَيُوَلُّوْنَ الدُّبُرَ",
        "Urdu" : "عنقریب ہی شکست کھائے گا ان کا یہ جتھا اور ان کو بھاگنا ہوگااپنی پیٹھیں پھیر کر ف۲",
        "English" : "Soon this 'large group‘ shall be defeated, and all of them will turn their backs."
      },
      {
        "ayet_no" : 46,
        "arbi" : "بَلِ السَّاعَةُ مَوْعِدُهُمْ وَالسَّاعَةُ اَدْهٰى وَاَمَرُّ",
        "Urdu" : "(اور اسی پر بس نہیں) بلکہ ان کا اصل وعدہ تو قیامت ہے اور قیامت کی وہ گھڑی انتہائی ہولناک اور بڑی ہی تلخ ہے",
        "English" : "Aye! the Hour is their appointed term, and the Hour shall be far more grievous and far more bitter."
      },
      {
        "ayet_no" : 47,
        "arbi" : "اِنَّ الْمُجْرِمِيْنَ فِيْ ضَلٰلٍ وَّسُعُرٍ",
        "Urdu" : "بلاشبہ مجرم لوگ پڑے ہیں ایک بڑی گمراہی اور ہولناک دیوانگی میں",
        "English" : "Surely the guilty ones are in error and madness."
      },
      {
        "ayet_no" : 48,
        "arbi" : "يَوْمَ يُسْحَبُوْنَ فِي النَّارِ عَلٰي وُجُوْهِهِمْ ۭ ذُوْقُوْا مَسَّ سَقَرَ",
        "Urdu" : "(جس کی پوری حقیقت اس دن کھلے گی) جس دن کہ ان کو گھسیٹا جا رہا ہوگا اس (ہولناک) آگ میں ان کے چہروں کے بل (اور ان سے کہا جا رہا ہوگا کہ لو اب) چکھو تم لوگ مزہ دوزخ کی لپٹ کا",
        "English" : "On the Day when they will be dragged into the Fire on their faces, (it will be said to them,) :Taste the touch of Hell."
      },
      {
        "ayet_no" : 49,
        "arbi" : "اِنَّا كُلَّ شَيْءٍ خَلَقْنٰهُ بِقَدَرٍ",
        "Urdu" : "بلاشبہ ہم نے پیدا کیا ہرچیز کو (اپنی قدرت و حکمت سے) ایک خاص اندازے کے ساتھ ف۱",
        "English" : "Verily, We have created every thing according to (Our) predestination."
      },
      {
        "ayet_no" : 50,
        "arbi" : "وَمَآ اَمْرُنَآ اِلَّا وَاحِدَةٌ كَلَمْحٍۢ بِالْبَصَرِ",
        "Urdu" : "اور ہمارا معاملہ تو بس ایک فرماں کا ہوتا ہے جو پل جھپکنے کی طرح پورا ہو کر رہتا ہے",
        "English" : "And (implementation of) Our command is no more than a single act like the twinkling of an eye."
      },
      {
        "ayet_no" : 51,
        "arbi" : "وَلَقَدْ اَهْلَكْنَآ اَشْيَاعَكُمْ فَهَلْ مِنْ مُّدَّكِرٍ",
        "Urdu" : "اور بلاشبہ ہم (اس سے پہلے) تم جیسے بہت سوں کو ہلاک کر چکے ہیں تو کیا ہے کوئی نصیحت قبول کرنے والا ؟",
        "English" : "We have destroyed people like you; so, is there one to take lesson ?"
      },
      {
        "ayet_no" : 52,
        "arbi" : "وَكُلُّ شَيْءٍ فَعَلُوْهُ فِي الزُّبُرِ",
        "Urdu" : "اور جو بھی کچھ انہوں نے کیا وہ سب درج ہے ہمارے دفتروں میں",
        "English" : "And every thing they have done is recorded in the books (of deeds)."
      },
      {
        "ayet_no" : 53,
        "arbi" : "وَكُلُّ صَغِيْرٍ وَّكَبِيْرٍ مُّسْـتَـطَرٌ",
        "Urdu" : "اور ہر چھوٹی بڑی بات لکھی ہوئی موجود ہے",
        "English" : "And every thing, small and big, is written down."
      },
      {
        "ayet_no" : 54,
        "arbi" : "اِنَّ الْمُتَّقِيْنَ فِيْ جَنّٰتٍ وَّنَهَرٍ",
        "Urdu" : "بلاشبہ پرہیزگار لوگ رہ بس رہے ہوں گے عظیم الشان جنتوں اور طرح طرح کی نہروں میں",
        "English" : "Verily the God-fearing will be in Gardens and among rivers."
      },
      {
        "ayet_no" : 55,
        "arbi" : "فِيْ مَقْعَدِ صِدْقٍ عِنْدَ مَلِيْكٍ مُّقْتَدِرٍ",
        "Urdu" : "سچی عزت کے مقام میں ایک بڑے ہی اقتدار والے بادشاہ کے پاس ف۲",
        "English" : "Firmly established in the favour of a Mighty King."
      }

    ]
  }
]