[
  {
    "surah_no" : 85,
    "total_ayah" : 22,
    "name" : "Surah e AL-Buruj",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "وَالسَّمَاۗءِ ذَاتِ الْبُرُوْجِ",
        "Urdu" : "قسم ہے برجوں والے آسمان کی",
        "English" : "By the heaven adorned with big stars."
      },
      {
        "ayet_no" : 2,
        "arbi" : "وَالْيَوْمِ الْمَوْعُوْدِ",
        "Urdu" : "اور وعدہ دیے ہوئے دن کی ۔",
        "English" : "And by the Promised Day."
      },
      {
        "ayet_no" : 3,
        "arbi" : "وَشَاهِدٍ وَّمَشْهُوْدٍ",
        "Urdu" : "اور حاضر ہونے والے اور حاضر کیے ہوئے کی",
        "English" : "And the bearer of witness and those against whom the witness is borne."
      },
      {
        "ayet_no" : 4,
        "arbi" : "قُتِلَ اَصْحٰبُ الْاُخْدُوْدِ",
        "Urdu" : "مارے گئے خندق والے",
        "English" : "Cursed were the people of the ditch (the story of the Boy and the King)."
      },
      {
        "ayet_no" : 5,
        "arbi" : "النَّارِ ذَاتِ الْوَقُوْدِ",
        "Urdu" : "جو آگ ہے ایندھن والی",
        "English" : "Fire supplied (abundantly) with fuel:"
      },
      {
        "ayet_no" : 6,
        "arbi" : "اِذْ هُمْ عَلَيْهَا قُعُوْدٌ",
        "Urdu" : "جب وہ اس پر بیٹھے تھے",
        "English" : "When they sat by it"
      },
      {
        "ayet_no" : 7,
        "arbi" : "وَّهُمْ عَلٰي مَا يَفْعَلُوْنَ بِالْمُؤْمِنِيْنَ شُهُوْدٌ",
        "Urdu" : "اور وہ اس پر جو وہ کر رہے تھے مومنوں کے ساتھ مشاہدہ کرنے والے تھے",
        "English" : "And to that which they did to the believers were witnesses."
      },
      {
        "ayet_no" : 8,
        "arbi" : "وَمَا نَقَمُوْا مِنْهُمْ اِلَّآ اَنْ يُّؤْمِنُوْا بِاللّٰهِ الْعَزِيْزِ الْحَمِيْدِ",
        "Urdu" : "اور نہیں انتقام لیا انہوں نے ان سے مگر اس بات کا کہ وہ ایمان لائے اللہ پر جو بڑا زبردست نہایت قابل تعریف ہے",
        "English" : "And they persecuted them for naught save that they believed in Allah, the Mighty, the Praiseworthy"
      },
      {
        "ayet_no" : 9,
        "arbi" : "الَّذِيْ لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ ۭ وَاللّٰهُ عَلٰي كُلِّ شَيْءٍ شَهِيْدٌ",
        "Urdu" : "وہ جو کہ اسی کیلیے ہے بادشاہی آسمانوں اور زمین کی اور اللہ ہر چیز پر گواہ ہے",
        "English" : "Him, Whose is the dominion of heavens and the earth. And Allah is over everything a Witness."
      },
      {
        "ayet_no" : 10,
        "arbi" : "اِنَّ الَّذِيْنَ فَتَنُوا الْمُؤْمِنِيْنَ وَالْمُؤْمِنٰتِ ثُمَّ لَمْ يَتُوْبُوْا فَلَهُمْ عَذَابُ جَهَنَّمَ وَلَهُمْ عَذَابُ الْحَرِيْقِ",
        "Urdu" : "بے شک وہ لوگ جنہوں نے آزمائش میں ڈالا مومن مردوں اور مون عورتوں کو پھر نہیں توبہ کی تو ان کے لیے جہنم کا عذاب ہے اور ان کے لیے جلنے کا عذاب ہے",
        "English" : "Surely, those who persecuted the believing men and the believing women, then did not repent, __for them there is the torment of Jahannam (Hell) , and for them there is the torment of burning."
      },
      {
        "ayet_no" : 11,
        "arbi" : "اِنَّ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَهُمْ جَنّٰتٌ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ ۀ ذٰلِكَ الْفَوْزُ الْكَبِيْرُ",
        "Urdu" : "بے شک وہ لوگ جو ایمان لائے اور انہوں نے نیک اعمال کیے ان کے لیے ایسے باغات ہیں بہتی ہیں ان کے نیچے سے نہریں یہی بہت بڑی کامیابی ہے",
        "English" : "Verily those who believed and worked righteons works, theirs shall be Gardens whereunder the rivers flow; that is the supreme achievement."
      },
      {
        "ayet_no" : 12,
        "arbi" : "اِنَّ بَطْشَ رَبِّكَ لَشَدِيْدٌ",
        "Urdu" : "بلاشبہ تیرے رب کی پکڑ یقینا بہت سخت ہے",
        "English" : "Verily the grip of thine Lord is severe."
      },
      {
        "ayet_no" : 13,
        "arbi" : "اِنَّهٗ هُوَ يُبْدِئُ وَيُعِيْدُ",
        "Urdu" : "بے شک وہی پہلی بار پیدا کرتا ہے اور وہی دوبارہ پیدا کرے گا",
        "English" : "Surely He originates (creation) and repeats (it after death)."
      },
      {
        "ayet_no" : 14,
        "arbi" : "وَهُوَ الْغَفُوْرُ الْوَدُوْدُ",
        "Urdu" : "اور وہی بہت بخشنے والا اور بہت محبت کرنے والا",
        "English" : "And He is the Forgiving, the Loving,"
      },
      {
        "ayet_no" : 15,
        "arbi" : "ذُو الْعَرْشِ الْمَجِيْدُ",
        "Urdu" : "عرش والا ہے اونچی شان والا ہے",
        "English" : "The Lord of the Throne (controlling the whole universe) and the Lord of Honour."
      },
      {
        "ayet_no" : 16,
        "arbi" : "فَعَّالٌ لِّمَا يُرِيْدُ",
        "Urdu" : "کر گزرنے والا ہے اس کو جو وہ چاہتا ہے",
        "English" : "He is ever doer of what He intends."
      },
      {
        "ayet_no" : 17,
        "arbi" : "هَلْ اَتٰىكَ حَدِيْثُ الْجُــنُوْدِ",
        "Urdu" : "کیا آئی ہے آپ کے پاس لشکروں کی بات",
        "English" : "Has the news of the troops reached you ?"
      },
      {
        "ayet_no" : 18,
        "arbi" : "فِرْعَوْنَ وَثَمُــوْدَ",
        "Urdu" : "یعنی فرعون اور ثمود کی",
        "English" : "Of the Fir'awn and the Thamud ?"
      },
      {
        "ayet_no" : 19,
        "arbi" : "بَلِ الَّذِيْنَ كَفَرُوْا فِيْ تَكْذِيْبٍ",
        "Urdu" : "بلکہ وہ لوگ جنہوں نے کفر کیا جھٹلانے میں لگے ہوئے ہیں",
        "English" : "But those who disbelieve are (engaged) in denying (the truth)."
      },
      {
        "ayet_no" : 20,
        "arbi" : "وَّاللّٰهُ مِنْ وَّرَاۗىِٕهِمْ مُّحِيْــطٌ",
        "Urdu" : "اور اللہ ان کے پیچھے سے انہیں گھیرے ہوئے ہے",
        "English" : "Allah has encompassed them from all sides."
      },
      {
        "ayet_no" : 21,
        "arbi" : "بَلْ هُوَ قُرْاٰنٌ مَّجِيْدٌ",
        "Urdu" : "بلکہ وہ قران ہے اونچی شان والا",
        "English" : "Nay, but it is a glorious Qur'an."
      },
      {
        "ayet_no" : 22,
        "arbi" : "فِيْ لَوْحٍ مَّحْفُوْظٍ",
        "Urdu" : "لوح محفوظ میں(لکھا ہواہے)",
        "English" : "Inscribed in a tablet preserved."
      }
    ]
  }
]