[
  {
    "surah_no" : 5,
    "total_ayah" : 120,
     "name" : "Surah e Maida",
     "detail" : [

       {
         "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
         "Urdu" : "شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے",
         "English" : "In the name of Allah, the Compassionate, the Merciful."
       },
       {
         "ayet_no" : 1,
         "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوْٓا اَوْفُوْا بِالْعُقُوْدِ ڛ اُحِلَّتْ لَكُمْ بَهِيْمَةُ الْاَنْعَامِ اِلَّا مَا يُتْلٰى عَلَيْكُمْ غَيْرَ مُحِلِّي الصَّيْدِ وَاَنْتُمْ حُرُمٌ  ۭاِنَّ اللّٰهَ يَحْكُمُ مَا يُرِيْدُ",
         "Urdu" : "اے وہ لوگو جو ایمان لائے ہو! پورا کرو عہدوں کو حلال کئے گئے تمہارے لیے چوپائے چرنے والے سوائے (انکے) جو پڑھ کر سنائے جاتے ہیں تم پر (کہ تم) نہ حلال سمجھنے والے ہو شکار کو اس حال میں (کہ) تم احرام (کی حالت ) میں ہو بیشک اللہ حکم دیتا ہے جو وہ چاہتا ہے ۔",
         "English" : "O you who believe, fulfill the contracts. The animals from the cattle have been made lawful for you, except that which shall be read over to you, provided that you do not treat hunting as lawful while you are in IHram. Surely, Allah ordains what He wills."
       },
       {
         "ayet_no" : 2,
         "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوْا لَا تُحِلُّوْا شَعَاۗىِٕرَ اللّٰهِ وَلَا الشَّهْرَ الْحَرَامَ وَلَا الْهَدْيَ وَلَا الْقَلَاۗىِٕدَ وَلَآ اٰۗمِّيْنَ الْبَيْتَ الْحَرَامَ يَبْتَغُوْنَ فَضْلًا مِّنْ رَّبِّهِمْ وَرِضْوَانًا  ۭوَاِذَا حَلَلْتُمْ فَاصْطَادُوْا  ۭوَلَا يَجْرِمَنَّكُمْ شَـنَاٰنُ قَوْمٍ اَنْ صَدُّوْكُمْ عَنِ الْمَسْجِدِ الْحَرَامِ اَنْ تَعْتَدُوْا  ۘوَتَعَاوَنُوْا عَلَي الْبِرِّ وَالتَّقْوٰى ۠ وَلَا تَعَاوَنُوْا عَلَي الْاِثْمِ وَالْعُدْوَانِ ۠وَاتَّقُوا اللّٰهَ ۭاِنَّ اللّٰهَ شَدِيْدُ الْعِقَابِ",
         "Urdu" : "اے وہ لوگوجو ایمان لائے ہو! بے حرمتی نہ کرو اللہ کی نشانیوں کی اور نہ حرمت والے مہینے کی اور نہ قربانی کے جانور کی اور نہ پٹے والے (جانوروں) کی اور نہ (ان کی جو) حرمت والے گھر کا قصد کرنیوالے ہوں (کہ) وہ چاہتے ہوں اپنے رب کا فضل اور خوشنودی اور جب تم حلال ہوجاا (احرام اتاردو تو) پھر شکار کرلو اور ہرگز آمادہ نہ کرے تمہیں کسی قوم کی دشمنی کہ انہوں نے روکا تمہیں(حدیبیہ کے سال)مسجد حرام سے (اس بات پر) کہ تم زیادتی کرو(ان پر) اور ایک دوسرے کی مددکرو نیکی اور پرہیزگاری (کے کاموں) پر اور ایک دوسرے کے ساتھ تعاون نہ کرو گناہ اور زیادتی (کے کاموں) پر اور تم اللہ تعالی سے ڈر جاؤ بے شک اللہ سخت عذاب والا ہے ۔",
         "English" : "O you who believe, do not violate (the sanctity) of the Marks of Allah, nor of the sacred month, nor of the sacrificial animal, nor of the garlands, 6 nor of those proceeding to the Sacred House, seeking the grace of their Lord and (His) Pleasure. When you are out of IHram, you may hunt. Malice against a people for their having prevented you from Al-Masjid-ul-Haram, should not cause you to cross the limits. Help each other in righteousness and piety, and do not help each other in sin and aggression. Fear Allah. Surely, Allah is severe at punishment."
       },
       {
         "ayet_no" : 3,
         "arbi" : "حُرِّمَتْ عَلَيْكُمُ الْمَيْتَةُ وَالدَّمُ وَلَحْمُ الْخِنْزِيْرِ وَمَآ اُهِلَّ لِغَيْرِ اللّٰهِ بِهٖ وَالْمُنْخَنِقَةُ وَالْمَوْقُوْذَةُ وَالْمُتَرَدِّيَةُ وَالنَّطِيْحَةُ وَمَآ اَ كَلَ السَّبُعُ اِلَّا مَا ذَكَّيْتُمْ ۣ وَمَا ذُبِحَ عَلَي النُّصُبِ وَاَنْ تَسْـتَقْسِمُوْا بِالْاَزْلَامِ ۭذٰلِكُمْ فِسْقٌ ۭ اَلْيَوْمَ يَىِٕسَ الَّذِيْنَ كَفَرُوْا مِنْ دِيْنِكُمْ فَلَا تَخْشَوْهُمْ وَاخْشَوْنِ ۭ اَلْيَوْمَ اَ كْمَلْتُ لَكُمْ دِيْنَكُمْ وَاَتْمَمْتُ عَلَيْكُمْ نِعْمَتِيْ وَرَضِيْتُ لَكُمُ الْاِسْلَامَ دِيْنًا ۭ فَمَنِ اضْطُرَّ فِيْ مَخْمَصَةٍ غَيْرَ مُتَجَانِفٍ لِّاِثْمٍ ۙ فَاِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ",
         "Urdu" : "حرام کردیا تم پر مردار اور (بہتاہوا)خون اور سور کا گوشت اور (وہ) جو نام لیا گیا ہو غیر اللہ کا اس پر اور (وہ جانور جو) گلا گھٹ کر مرے اور (جو) چوٹ لگ کر مرےاور (جو) اوپر سے گر کر مرے اور جو سینگ لگ کر مرے اور وہ جانور جسے درندے پھاڑکھائیں مگر وہ جسے مرنے سے پہلے تم ذبح کرلو اور وہ بھی حرام ہے جو ذبح کیا گیاہو آستانے پر اور وہ بھی کہ تم قسمت معلوم کرو فال کے تیروں سے یہ سب گناہ کے کام ہیں آج مایوس ہوگئے ہیں وہ لوگ جنہوں نے کفر کیا تمہارے دین سے تو تم نہ ڈرو ان سے اور مجھ سے ڈرو آج (کے دن) میں نے مکمل کردیا ہے تمہارے لیے تمہارا دین اور میں نے پوری کردی ہے تم پراپنی نعمت اور میں نے پسند کیا ہے تمہارے لیے اسلام کو بطور دین پھر جو مجبور ہوجائے بھوک (کی حالت) میں (حرام کردہ چیزوں کو کھانے پر) نہ جھکنے والا ہو گناہ کی طرف تو بیشک اللہ تعالی بخشنے والا مہربان ہے ۔",
         "English" : "Prohibited for you are: carrion, blood, the flesh of swine, and those upon which (a name) other than that of Allah has been invoked (at the time of slaughter), animal killed by strangulation, or killed by a blow, or by a fall, or by goring, or that which is eaten by a beast unless you have properly slaughtered it; and that which has been slaughtered before the idols, and that you determine shares through the arrows. (All of) this is sin. Today those who disbelieve have lost all hope of (damaging) your faith. So, do not fear them, and fear Me. Today, I have perfected your religion for you, and have completed My blessing upon you, and chosen Islam as Din (religion and a way of life) for you. But whoever is compelled by extreme hunger, having no inclination towards sin, 8 then Allah is Most-Forgiving, Very-Merciful."
       },
       {
         "ayet_no" : 4,
         "arbi" : "يَسْـــَٔلُوْنَكَ مَاذَآ اُحِلَّ لَهُمْ ۭقُلْ اُحِلَّ لَكُمُ الطَّيِّبٰتُ ۙوَمَا عَلَّمْتُمْ مِّنَ الْجَوَارِحِ مُكَلِّبِيْنَ تُعَلِّمُوْنَهُنَّ مِمَّا عَلَّمَكُمُ اللّٰهُ ۡ فَكُلُوْا مِمَّآ اَمْسَكْنَ عَلَيْكُمْ وَاذْكُرُوا اسْمَ اللّٰهِ عَلَيْهِ  ۠ وَاتَّقُوا اللّٰهَ  ۭاِنَّ اللّٰهَ سَرِيْعُ الْحِسَابِ",
         "Urdu" : "لوگ پوچھتے ہیں آپ سے کیا حلال کیا گیا ہے ان کے لیے ، آپ کہہ دیں حلال کیا گیا ہے تمہارے لیے تمام پاکیزہ چیزوں کو اور (ان شکاری جانوروں کا شکار بھی) جنہیں تم نے سدھایا ہو زخم دینے والے(جنہیں تم) شکاری بنانیوالےہو(جانوروں)سے تم سکھاتے ہو انہیں اس سے جو تمہیں اللہ نے سکھایا ہے پس کھالو اس سے جو (یہ شکاری جانور) پہکڑ رکھیں تمہارے لیے اوراللہ کا نام لیا کرو اس پر (چھوڑتے ہوئے) اور اللہ تعالی سے ڈر جاؤ بے شک اللہ تعالی جلد حساب لینے والے ہیں ۔",
         "English" : "They ask you as to what has been made lawful for them. Say, :Made lawful for you are good things, and (hunting through) birds and beasts of prey that you train, teaching them out of what Allah has taught you. So, eat of what they hold for you, and recite the name of Allah upon it. Fear Allah. Surely, Allah is swift at reckoning."
       },
       {
         "ayet_no" : 5,
         "arbi" : "اَلْيَوْمَ اُحِلَّ لَكُمُ الطَّيِّبٰتُ ۭ وَطَعَامُ الَّذِيْنَ اُوْتُوا الْكِتٰبَ حِلٌّ لَّكُمْ ۠ وَطَعَامُكُمْ حِلٌّ لَّهُمْ ۡ وَالْمُحْصَنٰتُ مِنَ الْمُؤْمِنٰتِ وَالْمُحْصَنٰتُ مِنَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ مِنْ قَبْلِكُمْ اِذَآ اٰتَيْتُمُوْهُنَّ اُجُوْرَهُنَّ مُحْصِنِيْنَ غَيْرَ مُسٰفِحِيْنَ وَلَا مُتَّخِذِيْٓ اَخْدَانٍ ۭوَمَنْ يَّكْفُرْ بِالْاِيْمَانِ فَقَدْ حَبِطَ عَمَلُهٗ ۡ وَهُوَ فِي الْاٰخِرَةِ مِنَ الْخٰسِرِيْنَ",
         "Urdu" : "آج حلال کردی گئیں تمہارے لیے تمام پاکیزہ چیزیں اور کھانا ان لوگوں کا جو دیے گے کتاب تمہارے لیے حلال ہے اور تمہارا کھانا ان کے لیے حلال ہے اور پاک دامن مومن عورتیں (بھی حلال ہیں) اور پاک دامن عورتیں ان لوگوں میں سے جو کتاب دیے گئے تم سے پہلے (حلال ہیں) جبکہ تم دو انہیں ان کے مہر (تم) نکاح میں لانے والے ہو نہ کہ بدکاری کرنیوالے اور نہ چھپے دوست بنانے والے اور جو انکار کرے ایمان (کی باتوں) کا تو یقینا ضائع ہوگیا اس کا عمل اور وہ آخرت میں خسارہ پانے والوں میں ہوگا ۔",
         "English" : "This day, good things have been made lawful for you. The food of the people of the Book is lawful for you, and your food is lawful for them, and good women from among believers, and good women from among those who were given the Book before you, provided you give them their dowers, binding yourself in marriage, neither going for lust, nor having paramours. Whoever rejects Faith, his effort will go to waste and, in the Hereafter, he will be among the losers."
       },
       {
         "ayet_no" : 6,
         "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوْٓا اِذَا قُمْتُمْ اِلَى الصَّلٰوةِ فَاغْسِلُوْا وُجُوْهَكُمْ وَاَيْدِيَكُمْ اِلَى الْمَرَافِقِ وَامْسَحُوْا بِرُءُوْسِكُمْ وَاَرْجُلَكُمْ اِلَى الْكَعْبَيْنِ ۭ وَاِنْ كُنْتُمْ جُنُبًا فَاطَّهَّرُوْا  ۭ وَاِنْ كُنْتُمْ مَّرْضٰٓى اَوْ عَلٰي سَفَرٍ اَوْ جَاۗءَ اَحَدٌ مِّنْكُمْ مِّنَ الْغَاۗىِٕطِ اَوْ لٰمَسْتُمُ النِّسَاۗءَ فَلَمْ تَجِدُوْا مَاۗءً فَتَيَمَّمُوْا صَعِيْدًا طَيِّبًا فَامْسَحُوْا بِوُجُوْهِكُمْ وَاَيْدِيْكُمْ مِّنْهُ  ۭ مَا يُرِيْدُ اللّٰهُ لِيَجْعَلَ عَلَيْكُمْ مِّنْ حَرَجٍ وَّلٰكِنْ يُّرِيْدُ لِيُطَهِّرَكُمْ وَلِيُتِمَّ نِعْمَتَهٗ عَلَيْكُمْ لَعَلَّكُمْ تَشْكُرُوْنَ",
         "Urdu" : "اے وہ لوگو جو ایمان لائے ہو!جب تم کھڑے ہونماز کے لیے تو دھولیا کرو اپنے منہ اور اپنے ہاتھ کہنیوں تک (کہنیوں سمیت) اور مسح کرلو اپنے سروں کا اور اپنے پاؤ ں کو دونوں ٹخنوں تک (ٹخنوں سمیت) اور اگر ہوتم جنابت (کی حالت ) میں تو (نہاکر) طہارت حاصل کرو اور اگر ہو تم بیمار یا سفر پر یا آیا ہو تم میں سے کوئی ایک بیت الخلا سے (ہوکر) یا تم نے چھوا ہو عورتوں کو (صحبت کی ہو) پھر نہ تم پاؤ پانی تو تیمم کرلو پاک مٹی سے پس مسح کرو اپنے چہروں کا اور اپنے ہاتھوں کا اس (مٹی) سے اللہ تعالی نہیں چاہتا کہ ڈالے تم پر کوئی تنگی اور لیکن وہ چاہتا ہے کہ تمہیں پاک کرے اور یہ کہ پوری کرےاپنی نعمت تم پر تاکہ تم شکر کرو ۔",
         "English" : "O you who believe, when you rise for Salah, (prayer) wash your faces and your hands up to the elbows, and make MasH (wiping by hands) of your heads and (wash) your feet up to the ankles. If you are in a state of major impurity, cleanse yourselves well (by taking bath). If you are sick, or on a journey, or if one of you has come after relieving himself, or you have had sexual contact with women, and you find no water, then, go for some clean dust and wipe your faces and hands with it. Allah does not like to impose a problem on you; He, rather likes to cleanse you and to complete His favour upon you, so that you may be grateful."
       },
       {
         "ayet_no" : 7,
         "arbi" : "وَاذْكُرُوْا نِعْمَةَ اللّٰهِ عَلَيْكُمْ وَمِيْثَاقَهُ الَّذِيْ وَاثَقَكُمْ بِهٖٓ ۙ اِذْ قُلْتُمْ سَمِعْنَا وَاَطَعْنَا ۡ وَاتَّقُوا اللّٰهَ ۭاِنَّ اللّٰهَ عَلِيْمٌۢ بِذَاتِ الصُّدُوْرِ",
         "Urdu" : "اور یاد کرو اللہ کے احسان کو جو تم پر اس نے کیا ہے اور اس کے عہد کو جو کہ پختگی سے لیا تم سے اس کو جب تم نے کہا ہم نے سن لیا اور ہم نے مان لیا اور اللہ سے ڈرو، بیشک اللہ تعالی خوب جاننے والا ہے سینوں والی بات کو ۔",
         "English" : "Remember Allah‘s favour upon you and His covenant that He has taken from you when you said, :We have listened and obeyed. Fear Allah. Allah is all-Aware of what lies in the hearts."
       },
       {
         "ayet_no" : 8,
         "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوْا كُوْنُوْا قَوّٰمِيْنَ لِلّٰهِ شُهَدَاۗءَ بِالْقِسْطِ ۡ وَلَا يَجْرِمَنَّكُمْ شَنَاٰنُ قَوْمٍ عَلٰٓي اَلَّا تَعْدِلُوْا  ۭاِعْدِلُوْا   ۣ هُوَ اَقْرَبُ لِلتَّقْوٰى ۡ وَاتَّقُوا اللّٰهَ  ۭاِنَّ اللّٰهَ خَبِيْرٌۢ بِمَا تَعْمَلُوْنَ",
         "Urdu" : "اے وہ لوگوجو ایمان لائے ہو! ہوجاؤ قائم رہنے والے اللہ کیلئے گواہی دینے والے انصاف کی اور نہ ہرگز آمادہ کرے تم کو کسی قوم کی دشمنی اس بات پر کہ تم عدل نہ کرو عدل کیا کرو (کہ) وہ زیادہ قریب ہے تقوی کے اور اللہ تعالی سے ڈر جاؤ ، بیشک اللہ تعالی خوب باخبر ہے اس سے جو تم عمل کرتے ہو ۔",
         "English" : "O you who believe, be steadfast for (obeying the commands of) Allah, (and) witnesses for justice. Malice against a people should not prompt you to avoid doing justice. Do justice. That is nearer to Taqwa. Fear Allah. Surely, Allah is All-Aware of what you do."
       },
       {
         "ayet_no" : 9,
         "arbi" : "وَعَدَ اللّٰهُ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ ۙ لَهُمْ مَّغْفِرَةٌ وَّاَجْرٌ عَظِيْمٌ",
         "Urdu" : "اللہ نے وعدہ فرمایا ہے ان لوگوں سے جو ایمان لائے اور نیک اعمال کرتے رہے (کہ) ان کے لیے بخشش اور اجرعظیم ہے ۔",
         "English" : "Allah has promised those who believe and do good deeds: For them there is forgiveness and a great reward."
       },
       {
         "ayet_no" : 10,
         "arbi" : "وَالَّذِيْنَ كَفَرُوْا وَكَذَّبُوْا بِاٰيٰتِنَآ اُولٰۗىِٕكَ اَصْحٰبُ الْجَحِيْمِ",
         "Urdu" : "اور وہ لوگ جنہوں نے کفر کیا اور جھٹلایا ہماری آیتوں کو وہی لوگ جہنم والے ہیں ۔",
         "English" : "Those who disbelieve and deny Our signs - they are the people of the Fire."
       },
       {
         "ayet_no" : 11,
         "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوا اذْكُرُوْا نِعْمَتَ اللّٰهِ عَلَيْكُمْ اِذْ هَمَّ قَوْمٌ اَنْ يَّبْسُطُوْٓا اِلَيْكُمْ اَيْدِيَهُمْ فَكَفَّ اَيْدِيَهُمْ عَنْكُمْ ۚ وَاتَّقُوا اللّٰهَ ۭ وَعَلَي اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُوْنَ",
         "Urdu" : "اے وہ لوگوجو ایمان لائے ہو! یاد کرو اللہ کے احسان کو (جو اس نے کیا ہے) تم پر جب ارادہ کیا ایک قوم نے کہ وہ بڑھائیں تمہاری طرف اپنے ہاتھوں کو تو روک دیا اس نے ان کے ہاتھوں کو تم سے اور اللہ سے ڈرو اور اللہ پر ہی پس چاہیے کہ بھروسہ کریں مومن ۔",
         "English" : "O you who believe, remember Allah‘s favour upon you, when some people planned to lay their hands on you, and He kept their hands away from you. Fear Allah; and in Allah the believers should place their trust."
       },
       {
         "ayet_no" : 12,
         "arbi" : "وَلَقَدْ اَخَذَ اللّٰهُ مِيْثَاقَ بَنِيْٓ اِ سْرَاۗءِيْلَ ۚ وَبَعَثْنَا مِنْهُمُ اثْنَيْ عَشَرَ نَقِيْبًا  ۭوَقَالَ اللّٰهُ اِنِّىْ مَعَكُمْ ۭلَىِٕنْ اَقَمْــتُمُ الصَّلٰوةَ وَاٰتَيْتُمُ الزَّكٰوةَ وَاٰمَنْتُمْ بِرُسُلِيْ وَعَزَّرْتُمُوْهُمْ وَاَقْرَضْتُمُ اللّٰهَ قَرْضًا حَسَـنًا لَّاُكَفِّرَنَّ عَنْكُمْ سَيِّاٰتِكُمْ  وَلَاُدْخِلَنَّكُمْ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْھٰرُ ۚ فَمَنْ كَفَرَ بَعْدَ ذٰلِكَ مِنْكُمْ فَقَدْ ضَلَّ سَوَاۗءَ السَّبِيْلِ",
         "Urdu" : "اور البتہ تحقیق اللہ نے عہد لیا بنی اسرائیل سے اور ہم نے مقرر کیے ان میں سے بارہ سردار اور اللہ نے فرمایا بیشک میں تمہارے ساتھ ہوں البتہ اگر تم قائم کروگے نماز اور تم اداکروگے زکوة اور تم ایمان لاؤ گے میرے رسولوں پر اور تم مددکروگے ان کی اور قرض دوگے اللہ کو قرض حسنہ تو البتہ ضرور میں دور کردوں گا تم سے تمہارے گناہ اور ضرور بضرور میں داخل کروں گا تمہیں باغات میں کہ چلتی ہوں گی ان کے نیچے نہریں پھر جس نے کفر کیا اس کے بعد تم میں سے تو یقینا وہ بھٹک گیا سیدھی راہ سے ۔",
         "English" : "Allah has made the Children of Israel take a pledge. We appointed twelve chiefs from among them. Allah said, :I am surely with you. If you establish Salah, and pay Zakah, and believe in My Messengers, and hold them in reverence, and advance to Allah a goodly loan, I shall certainly write off your evil deeds, and I shall certainly admit you into Gardens beneath which rivers flow. So, whoever from you disbelieves after that has lost the straight path."
       },
       {
         "ayet_no" : 13,
         "arbi" : "فَبِمَا نَقْضِهِمْ مِّيْثَاقَهُمْ لَعَنّٰهُمْ وَجَعَلْنَا قُلُوْبَهُمْ قٰسِـيَةً ۚ يُحَرِّفُوْنَ الْكَلِمَ عَنْ مَّوَاضِعِهٖ ۙ وَنَسُوْا حَظًّا مِّمَّا ذُكِّرُوْا بِهٖ ۚ وَلَا تَزَالُ تَطَّلِعُ عَلٰي خَاۗىِٕنَةٍ مِّنْهُمْ اِلَّا قَلِيْلًا مِّنْهُمْ فَاعْفُ عَنْهُمْ وَاصْفَحْ ۭ اِنَّ اللّٰهَ يُحِبُّ الْمُحْسِنِيْنَ",
         "Urdu" : "تو ان کے توڑ ڈالنے کی وجہ سے اپنے عہد کو ہم نے لعنت کی ان پر اور ہم نے کردیا ان کے دلوں کو سخت وہ بدل دیتے ہیں کلمات کو اپنے (اصل) مقامات سے اور انہوں نے بھلادیا ایک حصہ اس سے جو (کہ وہ نصیحت کیے گئے اس کی اور آپ ہمیشہ خبر پاتے رہتے ہیں، ان کی طرف سے خیانت کی سوائے تھوڑے لوگوں کے ان میں سے پس معاف کرو ان کو اور درگزر کرو بیشک اللہ تعالی پسند کرتا ہے احسان کرنیوالوں کو ۔",
         "English" : "So, because they broke their pledge, We cursed them and made their hearts hardened. They change words from their places, and they have overlooked a good deal of the Advice they were given. Every now and then you come across a certain treachery from all of them, except a few. So, forgive them and fore go. Indeed, Allah loves those who are good in deeds."
       },
       {
         "ayet_no" : 14,
         "arbi" : "وَمِنَ الَّذِيْنَ قَالُوْٓا اِنَّا نَصٰرٰٓى اَخَذْنَا مِيْثَاقَهُمْ فَنَسُوْا حَظًّا مِّمَّا ذُكِّرُوْا بِهٖ ۠ فَاَغْرَيْنَا بَيْنَهُمُ الْعَدَاوَةَ وَالْبَغْضَاۗءَ اِلٰي يَوْمِ الْقِيٰمَةِ  ۭ وَسَوْفَ يُنَبِّئُهُمُ اللّٰهُ بِمَا كَانُوْا يَصْنَعُوْنَ",
         "Urdu" : "اور ان لوگوں سے جنہوں نے کہا بیشک ہم نصاری ہیں ہم نے لیا ان سے عہد تو انہوں نے بھلادیا ایک حصہ اس سے جو کہ وہ نصیحت کیے گئے اس کی تو ہم نے ڈال دی ان کے درمیان دشمنی اور کینہ وبغض قیامت کے دن تک (کیلئے) اور عنقریب اللہ تعالی ان کو خبر دے گا اس کی جو وہ کرتے تھے ۔",
         "English" : "And from those who say, :We are Christians, We took a pledge. So, they have overlooked a good deal of the Advice they were given. So, We had them stuck with enmity and malice among them right through the Day of Doom, and (then) Allah will tell them what they were doing."
       },
       {
         "ayet_no" : 15,
         "arbi" : "يٰٓاَهْلَ الْكِتٰبِ قَدْ جَاۗءَكُمْ رَسُوْلُنَا يُبَيِّنُ لَكُمْ كَثِيْرًا مِّمَّا كُنْتُمْ تُخْفُوْنَ مِنَ الْكِتٰبِ وَيَعْفُوْا عَنْ كَثِيْرٍ ڛ قَدْ جَاۗءَكُمْ مِّنَ اللّٰهِ نُوْرٌ وَّكِتٰبٌ مُّبِيْنٌ",
         "Urdu" : "اے اہل کتاب! یقینا آیاہے تمہارے پاس ہمارا رسول (جو) بیان کرتا ہے تمہارے لیے بہت کچھ اس سے جو تم تھے چھپاتے کتاب میں سے اور وہ درگزر کرتا ہے بہت (سی باتوں) سے یقینا آچکی ہے تمہارے پاس اللہ کی طرف سے روشنی اور واضح کتاب",
         "English" : "O people of the Book, there has come to you Our Messenger disclosing to you much of what you have been concealing of the Book, while He overlooks much. There has come to you, from Allah, a Light and a clear Book."
       },
       {
         "ayet_no" : 16,
         "arbi" : "يَّهْدِيْ بِهِ اللّٰهُ مَنِ اتَّبَعَ رِضْوَانَهٗ سُبُلَ السَّلٰمِ وَيُخْرِجُهُمْ مِّنَ الظُّلُمٰتِ اِلَى النُّوْرِ بِاِذْنِهٖ وَيَهْدِيْهِمْ اِلٰي صِرَاطٍ مُّسْتَقِيْمٍ",
         "Urdu" : "اللہ تعالی ہدایت دیتا ہے اس کے ذریعے اسے جو پیروی کرے اس کی خوشنودی کی سلامتی کے راستوں کی اور وہ نکالتا ہے انہیں (کفر ک) اندھیروں سے (اسلام کی) روشنی کی طرف اپنے حکم سے اور وہ ہدایت دیتا ہے انہیں سیدھے راستے کی طرف ۔",
         "English" : "There with Allah guide those who follow His good will unto the ways of safety, and bring them forth out of darkness into the light by His leave, and guide them onto the right path."
       },
       {
         "ayet_no" : 17,
         "arbi" : "لَقَدْ كَفَرَ الَّذِيْنَ قَالُوْٓا اِنَّ اللّٰهَ هُوَ الْمَسِيْحُ ابْنُ مَرْيَمَ ۭ قُلْ فَمَنْ يَّمْلِكُ مِنَ اللّٰهِ شَـيْـــًٔـا اِنْ اَرَادَ اَنْ يُّهْلِكَ الْمَسِيْحَ ابْنَ مَرْيَمَ وَاُمَّهٗ وَمَنْ فِي الْاَرْضِ جَمِيْعًا ۭوَلِلّٰهِ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ وَمَا بَيْنَهُمَا يَخْلُقُ مَا يَشَاۗءُ ۭوَاللّٰهُ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
         "Urdu" : "البتہ تحقیق کافر ہوگئے وہ لوگ جنہوں نے کہا بیشک اللہ وہ مسیح بن مریم ہے (آپ ان سے) کہیں! پھر کون اختیار رکھتا ہے اللہ سے (بچانے کا) کچھ بھی اگر وہ ارادہ کرے کہ وہ ہلاک کرے مسیح بن مریم کو اور اس کی ماں کو اور جو زمین میں (لوگ) ہیں سب کو اور اللہ کے لیے آسمانوں کی بادشہی اور زمین کی اور جو ان دونوں کے درمیان میں ہے وہ پیدا کرتا ہے جو وہ چاہتا ہے اور اللہ تعالی ہر چیز پر قادر ہے",
         "English" : "Certainly, infidels are those who say, :God is the Masih, son of Maryam (Jesus son of Mary). Say, :Who then has the power to do anything against Allah, if He wills to eliminate the MasiH son of Maryam and his mother and all those on earth? Unto Allah belongs the kingdom of the heavens and the earth and what lies between them. He creates what He wills. Allah is powerful over everything."
       },
       {
         "ayet_no" : 18,
         "arbi" : "وَقَالَتِ الْيَھُوْدُ وَالنَّصٰرٰى نَحْنُ اَبْنٰۗؤُا اللّٰهِ وَاَحِبَّاۗؤُهٗ  ۭقُلْ فَلِمَ يُعَذِّبُكُمْ بِذُنُوْبِكُمْ ۭ بَلْ اَنْتُمْ بَشَرٌ مِّمَّنْ خَلَقَ ۭيَغْفِرُ لِمَنْ يَّشَاۗءُ وَيُعَذِّبُ مَنْ يَّشَاۗءُ  ۭوَلِلّٰهِ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ وَمَا بَيْنَهُمَا ۡ وَاِلَيْهِ الْمَصِيْرُ",
         "Urdu" : "اور کہا یہود ونصاری نے ہم اللہ کے بیٹے ہیں اور اس کے پیارے ہیں (ان سے) کہیں تو (پھر) کیوں وہ عذاب دیتا ہے تمہیں تمہارے گناہوں کے بدلے، بلکہ تم انسان ہو ان میں سے جو اس نے پیدا کیے ہیں وہ معاف کرتا ہے جس کو چاہتا ہے اور وہ عذاب دیتا ہے جسے چاہتا ہے اور اللہ ہی کے لیے بادشاہی ہے آسمانوں کی اور زمیں کی اور جو ان دونوں کے درمیان میں ہے اور اسی کی طرف لوٹنا ہے ۔",
         "English" : "The Jews and the Christians say, :We are the sons of Allah and His favourites. Say, :Why then would He punish you for your sins? In fact, you are just human, among those He has created. He forgives whom He wills and punishes whom He wills. Unto Allah belongs the kingdom of the heavens and the earth and what lies between them, and unto Him is the return."
       },
       {
         "ayet_no" : 19,
         "arbi" : "يٰٓاَهْلَ الْكِتٰبِ قَدْ جَاۗءَكُمْ رَسُوْلُنَا يُبَيِّنُ لَكُمْ عَلٰي فَتْرَةٍ مِّنَ الرُّسُلِ اَنْ تَقُوْلُوْا مَا جَاۗءَنَا مِنْۢ بَشِيْرٍ وَّلَا نَذِيْرٍ ۡ فَقَدْ جَاۗءَكُمْ بَشِيْرٌ وَّنَذِيْرٌ ۭ وَاللّٰهُ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
         "Urdu" : "اے اہل کتاب! تحقیق آیا ہے تمہارے پاس ہمارا رسول وہ (احکام) بیان کرتا ہے تمہیں رسولوں کے آنے کا سلسلہ منقطع ہوجانے کے بعد کہ تم یہ (نہ) کہو (کہ) نہیں آیا ہمارے پاس کوئی خوشخبری دینے والا اور نہ ڈرانے والا تو یقینا آچکا ہے تمہارے پاس خوشخبری دینے والا اور ڈرانے والا اور اللہ تعالی ہر چیز پر قادر ہے ۔",
         "English" : "O people of the Book, Our Messenger has come to you making things clear to you after a gap between Messengers, lest you were to say, :There has not come to us a bearer of good news, and a warner. So, now there has come to you a bearer of good news, and a warner. Allah is powerful over everything."
       },
       {
         "ayet_no" : 20,
         "arbi" : "وَاِذْ قَالَ مُوْسٰى لِقَوْمِهٖ يٰقَوْمِ اذْكُرُوْا نِعْمَةَ اللّٰهِ عَلَيْكُمْ اِذْ جَعَلَ فِيْكُمْ اَنْۢبِيَاۗءَ وَجَعَلَكُمْ مُّلُوْكًا ڰ وَّاٰتٰىكُمْ مَّا لَمْ يُؤْتِ اَحَدًا مِّنَ الْعٰلَمِيْنَ",
         "Urdu" : "اور جب کہا موسی نےاپنی قوم سے اے میری قوم! یاد کرو اپنے اوپر اللہ کی نعمتوں کو جب اس نے بنائے تم میں سے بہت سے انبیاء اور بنایا تمہیں بادشاہ اور اس نے دیا تمہیں وہ کچھ جو نہیں دیا کسی ایک کو جہان والوں میں سے ۔",
         "English" : "(Recall) when Musa said to his people, :O my people, remember the blessing of Allah upon you when He made prophets from among you, made you kings and gave you what He did not give to anyone in the worlds."
       },
       {
         "ayet_no" : 21,
         "arbi" : "يٰقَوْمِ ادْخُلُوا الْاَرْضَ الْمُقَدَّسَةَ الَّتِيْ كَتَبَ اللّٰهُ لَكُمْ وَلَا تَرْتَدُّوْا عَلٰٓي اَدْبَارِكُمْ فَتَنْقَلِبُوْا خٰسِرِيْنَ",
         "Urdu" : "اے میری قوم! داخل ہوجاؤ ارض مقدس (ملک شام) میں جسے لکھ رکھا ہے اللہ نے تمہارے لیے اور نہ پھر جانا اپنی پیٹھوں کے بل تو تم لوٹوگے نقصان اٹھانے والے بن کر ۔",
         "English" : "O my people, enter the Holy Land which Allah has destined for you, and do not turn back, lest you should turn losers."
       },
       {
         "ayet_no" : 22,
         "arbi" : "قَالُوْا يٰمُوْسٰٓى اِنَّ فِيْهَا قَوْمًا جَبَّارِيْنَ ڰ وَاِنَّا لَنْ نَّدْخُلَهَا حَتّٰي يَخْرُجُوْا مِنْهَا  ۚ فَاِنْ يَّخْرُجُوْا مِنْهَا فَاِنَّا دٰخِلُوْنَ",
         "Urdu" : "انہوں نے کہا اے موسی!بیشک اس میں زبردست قوم (رہتی ) ہے اور بیشک ہم ہرگز نہیں داخل ہوں گے اس میں یہاں تک کہ وہ نکل (نہ) جائیں اس سے پس اگر وہ نکل جائیں اس سے تو بیشک ہم داخل ہوں گے ۔",
         "English" : "They said, :O Musa, there is a nation of tyrants over there, and we shall never enter it until they get out of it. If they do get out of it, we are ready to go in."
       },
       {
         "ayet_no" : 23,
         "arbi" : "قَالَ رَجُلٰنِ مِنَ الَّذِيْنَ يَخَافُوْنَ اَنْعَمَ اللّٰهُ عَلَيْهِمَا ادْخُلُوْا عَلَيْهِمُ الْبَابَ ۚ فَاِذَا دَخَلْتُمُوْهُ فَاِنَّكُمْ غٰلِبُوْنَ ۥ ۚ وَعَلَي اللّٰهِ فَتَوَكَّلُوْٓا اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
         "Urdu" : "کہا دو آدمیوں نے ان میں جو ڈرتے تھے (اللہ سے) اور اللہ نے انعام کیا تھا ان دونوں پر داخل ہوجاؤ ان پر دروازے سے (اور حملہ کردو) پس جب تم داخل ہوجاؤ گے اس سے تو بیشک تم غالب ہوگے اور اللہ تعالی پر پس بھروسہ کرو اگر ہو تم مومن ۔",
         "English" : "Said two men from among the God-fearing, on whom Allah had bestowed His favour, :Enter the gate (charging) upon them. Once you have entered it, you will be the ones who will prevail. In Allah you must place your trust, if you are believers."
       },
       {
         "ayet_no" : 24,
         "arbi" : "قَالُوْا يٰمُوْسٰٓى اِنَّا لَنْ نَّدْخُلَهَآ اَبَدًا مَّا دَامُوْا فِيْهَا فَاذْهَبْ اَنْتَ وَرَبُّكَ فَقَاتِلَآ اِنَّا ھٰهُنَا قٰعِدُوْنَ",
         "Urdu" : "انہوں نے کہا اے موسی! بیشک ہم ہرگز نہیں داخل ہوں گے اس میں کبھی بھی جب تک وہ ہیں اس میں پس جا تو اور تیرا رب پس تم دونوں لڑو بیشک ہم یہاں بیٹھے ہیں ۔",
         "English" : "They said, :O Musa, we shall never enter it, in any case, so long as they are there. So go, you and your Lord, and fight. As for us, we are sitting right here."
       },
       {
         "ayet_no" : 25,
         "arbi" : "قَالَ رَبِّ اِنِّىْ لَآ اَمْلِكُ اِلَّا نَفْسِيْ وَاَخِيْ فَافْرُقْ بَيْنَنَا وَبَيْنَ الْقَوْمِ الْفٰسِقِيْنَ",
         "Urdu" : "کہا (موسی نے) اے میرے رب! بیشک میں نہیں اختیار رکھتا مگر اپنے نفس کا اور اپنے بھائی کا پس جدائی ڈال دے ہمارے درمیان اور فاسق قوم کے درمیان ۔",
         "English" : "He said, :O my Lord, I have no control except over myself and my brother. So, make a distinction between us and the sinning people."
       },
       {
         "ayet_no" : 26,
         "arbi" : "قَالَ فَاِنَّهَا مُحَرَّمَةٌ عَلَيْهِمْ اَرْبَعِيْنَ سَـنَةً ۚ يَتِيْھُوْنَ فِي الْاَرْضِ ۭ فَلَا تَاْسَ عَلَي الْقَوْمِ الْفٰسِقِيْنَ",
         "Urdu" : "فرمایا (اللہ نے) پس بیشک وہ (زمین) حرام کردی گئی ان پر چالیس سال تک وہ مارے مارے پھریں گے زمین میں پس افسوس نہ کر نافرمان قوم پر",
         "English" : "He (Allah) said, :This (land) is prohibited to them for forty years. They shall be wandering around the earth. So, do not grieve for the sinning people."
       },
       {
         "ayet_no" : 27,
         "arbi" : "وَاتْلُ عَلَيْهِمْ نَبَاَ ابْنَيْ اٰدَمَ بِالْحَقِّ ۘاِذْ قَرَّبَا قُرْبَانًا فَتُقُبِّلَ مِنْ اَحَدِهِمَا وَلَمْ يُتَقَبَّلْ مِنَ الْاٰخَرِ ۭ قَالَ لَاَقْتُلَنَّكَ ۭ قَالَ اِنَّمَا يَتَقَبَّلُ اللّٰهُ مِنَ الْمُتَّقِيْنَ",
         "Urdu" : "اور پڑھ کر سنائیے ان کو آدم کے دوبیٹوں کی خبر حق کے ساتھ، جب دونوں نے قربانی پیش کی تو قبول کرلی گئی ان دونوں میں سے ایک کی (قربانی) اور نہ قبول کی گئی دوسرے سے (تو) اس نے کہا میں ضروربضرور قتل کردونگا تمہیں کہا بےشک قبول کرتا ہے اللہ تعالی متقین سے ۔",
         "English" : "And recite to them the story of the two sons of ‘Adam rightly: When both of them offered a sacrifice, it was accepted from one of them, and was not accepted from the other. He said, :I will kill you. He said, :Allah accepts only from the God-fearing."
       },
       {
         "ayet_no" : 28,
         "arbi" : "لَىِٕنْۢ بَسَطْتَّ اِلَيَّ يَدَكَ لِتَقْتُلَنِيْ مَآ اَنَا بِبَاسِطٍ يَّدِيَ اِلَيْكَ لِاَقْتُلَكَ ۚ اِنِّىْٓ اَخَافُ اللّٰهَ رَبَّ الْعٰلَمِيْنَ",
         "Urdu" : "البتہ اگر تونے بڑھایا میری طرف اپنا ہاتھ تاکہ تومجھے قتل کرے (تو)میں نہیں بڑھانے والا اپنا ہاتھ تیری طرف تاکہ میں قتل کروں تجھے بے شک میں اللہ سے ڈرتا ہوں (جو)تمام جہانوں کا رب ہے ۔",
         "English" : "If you stretch your hand towards me to kill me, I am not going to stretch my hand towards you to kill you. Indeed, I fear Allah, the Lord of the worlds."
       },
       {
         "ayet_no" : 29,
         "arbi" : "اِنِّىْٓ اُرِيْدُ اَنْ تَبُوْۗاَ بِاِثْمِيْ وَاِثْمِكَ فَتَكُوْنَ مِنْ اَصْحٰبِ النَّارِ ۚ وَذٰلِكَ جَزٰۗؤُ ا الظّٰلِمِيْنَ",
         "Urdu" : "بے شک میں چاہتا ہوں کہ توسمیٹ لے میرے گناہ کو اور اپنے گناہ کو پس توہوجائے اہل دوزخ میں سے اوریہی بدلہ ہے ظالموں کا۔",
         "English" : "I would rather let you bear my sin and your sin, and then become one of the people of the Fire. That is the punishment of the unjust."
       },
       {
         "ayet_no" : 30,
         "arbi" : "فَطَوَّعَتْ لَهٗ نَفْسُهٗ قَتْلَ اَخِيْهِ فَقَتَلَهٗ فَاَصْبَحَ مِنَ الْخٰسِرِيْنَ",
         "Urdu" : "پس آمادہ کیااس کو اس کے نفس نے اپنے بھائی کے قتل پر تواس نے قتل کردیا اسے پس ہوگیا خسارہ پانے والوں میں سے",
         "English" : "His self, however, prompted him to kill his brother, so he killed him and became one of the losers."
       },
       {
         "ayet_no" : 31,
         "arbi" : "فَبَعَثَ اللّٰهُ غُرَابًا يَّبْحَثُ فِي الْاَرْضِ لِيُرِيَهٗ كَيْفَ يُوَارِيْ سَوْءَةَ اَخِيْهِ  ۭ قَالَ يٰوَيْلَتٰٓى اَعَجَزْتُ اَنْ اَكُوْنَ مِثْلَ هٰذَا الْغُرَابِ فَاُوَارِيَ سَوْءَةَ اَخِيْ ۚ فَاَصْبَحَ مِنَ النّٰدِمِيْنَ",
         "Urdu" : "پس بھیجا اللہ نے ایک کوا (جو) زمین کریدنے لگا تاکہ وہ دکھائے اسے کہ کیسے وہ چھپائے اپنے بھائی کی لاش کو کہنے لگا ہائے افسوس! کیا (اتنا) میں عاجز ہوگیا کہ میں ہوجاتا اس کوے جیسا پس میں چھپالیتا اپنے بھائی کی لاش پس وہ ہوگیا شرمندہ ہونے والوں میں سے ۔",
         "English" : "Then, Allah sent a crow that scratched the earth to show him how he should conceal the corpse of his brother. He said, :Alas! Was I not even able to be like this crow so that I could conceal the corpse of my brother? So, he stood regretful."
       },
       {
         "ayet_no" : 32,
         "arbi" : "مِنْ اَجْلِ ذٰلِكَ ۃ كَتَبْنَا عَلٰي بَنِيْٓ اِسْرَاۗءِيْلَ اَنَّهٗ مَنْ قَتَلَ نَفْسًۢابِغَيْرِ نَفْسٍ اَوْ فَسَادٍ فِي الْاَرْضِ فَكَاَنَّمَا قَتَلَ النَّاسَ جَمِيْعًا  ۭوَمَنْ اَحْيَاهَا فَكَاَنَّمَآ اَحْيَا النَّاسَ جَمِيْعًا  ۭوَلَقَدْ جَاۗءَتْهُمْ رُسُلُنَا بِالْبَيِّنٰتِ ۡ ثُمَّ اِنَّ كَثِيْرًا مِّنْهُمْ بَعْدَ ذٰلِكَ فِي الْاَرْضِ لَمُسْرِفُوْنَ",
         "Urdu" : "اسی وجہ سے ہم نے لکھ کر فرض کردیا بنی اسرائیل پر کہ یہ یقینی بات ہے کہ جس نے قتل کیا کسی جان کو بغیر کسی جان قصاص کے یا زمین میں فساد مچانے کے تو گویا کہ اس نے قتل کیا تمام لوگوں کو اور جس نے (کسی کو ناحق قتل سے بچاکر) زندگی دی اسے تو گویا کہ اس نے زندگی دی تمام لوگوں کو اور البتہ تحقیق آئے ان کے پاس ہمارے رسول واضح دلائل کے ساتھ، پھر (بھی) بیشک اکثر(لوگ) ان میں سے اس کے بعد زمین میں یقینا حد سے بڑھے ہوئے ہیں ۔",
         "English" : "For this reason, We decreed for the children of Isra‘il that whoever kills a person not in retaliation for a person killed, nor (as a punishment) for spreading disorder on the earth, is as if he has killed the whole of humankind, and whoever saves the life of a person is as if he has saved the life of the whole of humankind. Certainly, Our messengers have come to them with clear signs. Then, after all that, many of them are there to commit excesses on the earth."
       },
       {
         "ayet_no" : 33,
         "arbi" : "اِنَّمَا جَزٰۗؤُا الَّذِيْنَ يُحَارِبُوْنَ اللّٰهَ وَرَسُوْلَهٗ وَيَسْعَوْنَ فِي الْاَرْضِ فَسَادًا اَنْ يُّقَتَّلُوْٓا اَوْ يُصَلَّبُوْٓا اَوْ تُـقَطَّعَ اَيْدِيْهِمْ وَاَرْجُلُهُمْ مِّنْ خِلَافٍ اَوْ يُنْفَوْا مِنَ الْاَرْضِ ۭ ذٰلِكَ لَهُمْ خِزْيٌ فِي الدُّنْيَا وَلَهُمْ فِي الْاٰخِرَةِ عَذَابٌ عَظِيْمٌ",
         "Urdu" : "بے شک سزا ان لوگوں کی جو جنگ کرتے ہیں اللہ اور اس کے رسول سے اور کوشش کرتے ہیں زمین میں فساد مچانے کی(یہ ہے(کہ وہ قتل کردیے جائیں یا سولی پر چڑھا دیے جائیں یا کاٹ دیے جائیں ان کے ہاتھ اور ان کے پاؤں مخالف(سمتوں) سے یا وہ نکال دیے جائیں زمین (ملک)سے یہ ان کے لیے دنیا میں رسوائی ہے اور ان کے لیے آخرت میں بڑا عذاب ہے",
         "English" : "Those who fight against Allah and His Messenger and run about trying to spread disorder on the earth, their punishment is no other than that they shall be killed, or be crucified, or their hands and legs be cut off from different sides, or they be kept away from the land (they live in). That is a humiliation for them in this world, and for them there is a great punishment in the Here after."
       },
       {
         "ayet_no" : 34,
         "arbi" : " اِلَّا الَّذِيْنَ تَابُوْا مِنْ قَبْلِ اَنْ تَقْدِرُوْا عَلَيْهِمْ ۚ فَاعْلَمُوْٓا اَنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ",
         "Urdu" : "مگر وہ لوگ جنہوں نے توبہ کی اس سے پہلے کہ قابو پاؤ ان پر پس تم جان لو کہ بیشک اللہ تعالی بخشنے والا، مہربان ہے ۔",
         "English" : "Save those who repent ere ye have them in your power; for know that Allah is Forgiving, Merciful."
       },
       {
         "ayet_no" : 35,
         "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَابْتَغُوْٓا اِلَيْهِ الْوَسِيْلَةَ وَجَاهِدُوْا فِيْ سَبِيْلِهٖ لَعَلَّكُمْ تُفْلِحُوْنَ",
         "Urdu" : "اے وہ لوگو جو ایمان لائے ہو! اللہ سے ڈر جاؤ اور تلاش کرو اس کی طرف قرب حاصل کرنے کا ذریعہ اور جہاد کرو اس کے راستے میں تاکہ تم فلاح پا جاؤ ۔",
         "English" : "O you who believe, fear Allah and seek means of nearness to Him, and carry out Jihad in His way, so that you may succeed."
       },
       {
         "ayet_no" : 36,
         "arbi" : "اِنَّ الَّذِيْنَ كَفَرُوْا لَوْ اَنَّ لَهُمْ مَّا فِي الْاَرْضِ جَمِيْعًا وَّمِثْلَهٗ مَعَهٗ لِيَفْتَدُوْا بِهٖ مِنْ عَذَابِ يَوْمِ الْقِيٰمَةِ مَا تُقُبِّلَ مِنْهُمْ ۚ وَلَهُمْ عَذَابٌ اَلِيْمٌ",
         "Urdu" : "بیشک وہ لوگ جنہوں نے کفر کیا بلاشبہ اگر ان کے پاس ہو وہ سب کچھ جو زمین میں ہے اور اس جیسا اس کے ساتھ (اور بھی) تاکہ وہ بدلے میں دے دیں اس کو قیامت کے دن کے عذاب سے بچنے کے لیے تو نہیں قبول کیا جائے گا ان سے اور ان کے لیے دردناک عذاب ہے ۔",
         "English" : "Surely, if the disbelievers have all that is in the earth, and more as much besides it, to pay it as ransom against the punishment of the Day of Judgment, it shall not be accepted from them, and they will have a painful punishment."
       },
       {
         "ayet_no" : 37,
         "arbi" : "يُرِيْدُوْنَ اَنْ يَّخْرُجُوْا مِنَ النَّارِ وَمَا هُمْ بِخٰرِجِيْنَ مِنْهَا ۡ وَلَهُمْ عَذَابٌ مُّقِيْمٌ",
         "Urdu" : "وہ چاہیں گے کہ نکل جائیں آگ سے حالانکہ نہیں وہ نکل سکیں گے اس سے اور ان کے لیے ہمیشہ قائم رہنے والا عذاب ہوگا ۔",
         "English" : "They will wish to come out of the Fire, but they will not be able to come out from there. For them there will be a lasting punishment."
       },
       {
         "ayet_no" : 38,
         "arbi" : "وَالسَّارِقُ وَالسَّارِقَةُ فَاقْطَعُوْٓا اَيْدِيَهُمَا جَزَاۗءًۢ بِمَا كَسَـبَا نَكَالًا مِّنَ اللّٰهِ ۭ وَاللّٰهُ عَزِيْزٌ حَكِيْمٌ",
         "Urdu" : "اور چور مرد اور چور عورت پس کاٹ دو ان دونوں کے ہاتھ بدلہ ہے اس کا جو ان دونوں نے کیا اور عبرت ہے اللہ کی طرف اور اللہ تعالی غالب حکمت والا ہے ۔",
         "English" : "As for a man or a woman who commits theft, cut off the hands of both to punish them for what they earned,_a deterrent punishment from Allah. Allah is Mighty, Wise."
       },
       {
         "ayet_no" : 39,
         "arbi" : "فَمَنْ تَابَ مِنْۢ بَعْدِ ظُلْمِهٖ وَاَصْلَحَ فَاِنَّ اللّٰهَ يَتُوْبُ عَلَيْهِ  ۭاِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ",
         "Urdu" : "پھر جو توبہ کرے اپنے ظلم کرنے کے بعد اوراپنی اصلاح کر لے تو بیشک اللہ رجوع کرتا ہے اس پر بیشک اللہ تعالی بخشنے والا مہربان ہے ۔",
         "English" : "Whoever repents after his transgression and corrects himself, then Allah shall relent towards him. Surely, Allah is Most-Forgiving, Very-Merciful."
       },
       {
         "ayet_no" : 40,
         "arbi" : "اَلَمْ تَعْلَمْ اَنَّ اللّٰهَ لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ ۭ يُعَذِّبُ مَنْ يَّشَاۗءُ وَيَغْفِرُ لِمَنْ يَّشَاۗءُ ۭوَاللّٰهُ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
         "Urdu" : "کیا نہیں تم جانتے کہ بیشک اللہ ہی کے لیے آسمانوں اور زمین کی بادشاہی وہ عذاب دیتا ہے جسے چاہتا ہے اور معاف کردیتا ہے جس کو چاہتا ہے اور اللہ تعالی ہر چیز پر قادر ہے ۔",
         "English" : "Do you not know that to Allah alone belongs the kingdom of the heavens and the earth? He punishes whomsoever He wills and forgives whomsoever He wills. Allah is powerful over everything."
       },
       {
         "ayet_no" : 41,
         "arbi" : "يٰٓاَيُّھَا الرَّسُوْلُ لَا يَحْزُنْكَ الَّذِيْنَ يُسَارِعُوْنَ فِي الْكُفْرِ مِنَ الَّذِيْنَ قَالُوْٓا اٰمَنَّا بِاَفْوَاهِهِمْ وَلَمْ تُؤْمِنْ قُلُوْبُهُمْ ڔ وَمِنَ الَّذِيْنَ هَادُوْا ڔ سَمّٰعُوْنَ لِلْكَذِبِ سَمّٰعُوْنَ لِقَوْمٍ اٰخَرِيْنَ ۙ لَمْ يَاْتُوْكَ ۭيُحَرِّفُوْنَ الْكَلِمَ مِنْۢ بَعْدِ مَوَاضِعِهٖ ۚ يَقُوْلُوْنَ اِنْ اُوْتِيْتُمْ هٰذَا فَخُذُوْهُ وَاِنْ لَّمْ تُؤْتَوْهُ فَاحْذَرُوْا  ۭ وَمَنْ يُّرِدِ اللّٰهُ فِتْنَتَهٗ فَلَنْ تَمْلِكَ لَهٗ مِنَ اللّٰهِ شَـيْـــــًٔـا  ۭ اُولٰۗىِٕكَ الَّذِيْنَ لَمْ يُرِدِ اللّٰهُ اَنْ يُّطَهِّرَ قُلُوْبَهُمْ  ۭلَهُمْ فِي الدُّنْيَا خِزْيٌ ښ وَّلَهُمْ فِي الْاٰخِرَةِ عَذَابٌ عَظِيْمٌ",
         "Urdu" : "اے رسول! آپ کو غمگین نہ کریں وہ لوگ جو جلدی کرتے ہیں کفر میں ان میں سے کچھ ایسے ہیں جو کہتے ہیں اپنے منہ سے ہم ایمان لاتے ہیں حالانکہ نہیں ایمان لاتے ان کے دل اور ان میں سے جو یہودی ہوئے وہ کان لگاتے ہیں دوسری قوم کے لیے جو نہیں آتے آپ کے پاس، وہ بدل دیتے ہیں کلمات کو اس کے اصل موقع محل متعین ہونے کے بعد وہ کہتے ہیں لوگوں سے اگر تمہیں دیا جائے یہ بدلا ہوا حکم تو لے لینا اسے اور اگر نہ تم دیے جاؤ یہ (حکم تو)پھر بچو (اور نہ مانو) اور جس کو کہ ارادہ کرلے اللہ اس کی آزمائش گمراہ کرنے کا تو ہرگز نہیں تم اختیار رکھتے اس کیلئے اللہ سے ہدایت کا کچھ بھی یہ وہ لوگ ہیں جنہیں نہیں چاہتا اللہ تعالی کہ وہ پاک کرے ان کے دلوں کو ان کے لیے دنیا میں بھی رسوائی ہے اور ان کے لیے آخرت میں بڑا عذاب ہے",
         "English" : "O Messenger, those who race towards disbelief should not be a cause of grief for you, be they from those who say with their mouths, :We believe , while their hearts do not believe, or from those who are (pronounced) Jews. They are listeners to the fallacy, listeners to other people who did not come to you. They distort the words after they had been properly placed. They say, :If you are given this, take it, and if you are not given this, then avoid it. The one whom Allah wills to put to trial, you cannot do anything for him against Allah. They are the ones whose hearts Allah did not intend to purify. For them there is humiliation in this world, and for them there is a great punishment in the Hereafter."
       },
       {
         "ayet_no" : 42,
         "arbi" : "سَمّٰعُوْنَ لِلْكَذِبِ اَكّٰلُوْنَ لِلسُّحْتِ ۭ فَاِنْ جَاۗءُوْكَ فَاحْكُمْ بَيْنَهُمْ اَوْ اَعْرِضْ عَنْهُمْ ۚ وَاِنْ تُعْرِضْ عَنْهُمْ فَلَنْ يَّضُرُّوْكَ شَـيْـــًٔـا وَاِنْ حَكَمْتَ فَاحْكُمْ بَيْنَهُمْ بِالْقِسْطِ ۭاِنَّ اللّٰهَ يُحِبُّ الْمُقْسِطِيْنَ",
         "Urdu" : "یہ) کان لگانے والے ہیں جھوٹ بنانے کے لیے حرام کھانے والے ہیں پس اگر وہ آئیں آپ کے پاس کوئی مقدمہ لے کر تو آپ فیصلہ کریں ان کے درمیان ، یا آپ اعراض کریں ان سے (آپ کو اختیار ہے) اور اگر آپ اعراض کریں ان سے (اور فیصلہ نہ کریں) تو ہرگز نہیں بگاڑ سکیں گے آپ کا کچھ بھی اور اگر آپ فیصلہ کریں تو آپ فیصلہ کریں ان کے درمیان انصاف سے بیشک اللہ پسند کرتا ہے انصاف کرنے والوں کو ۔",
         "English" : "They are listeners to the fallacy, devourers of the unlawful. So, if they come to you, judge between them or turn away from them. If you turn away from them, they can do you no harm. But if you judge, judge between them with justice. Surely, Allah loves those who do justice."
       },
       {
         "ayet_no" : 43,
         "arbi" : "وَكَيْفَ يُحَكِّمُوْنَكَ وَعِنْدَهُمُ التَّوْرٰىةُ فِيْهَا حُكْمُ اللّٰهِ ثُمَّ يَتَوَلَّوْنَ مِنْۢ بَعْدِ ذٰلِكَ ۭ وَمَآ اُولٰۗىِٕكَ بِالْمُؤْمِنِيْنَ",
         "Urdu" : "اور کیونکر یہ فیصلہ کرائیں گے آپ سے حالانکہ ان کے پاس تورات ہے اور اس میں اللہ کا حکم بھی موجود ہے پھر منہ پھیرلیتے ہیں اس کو جان لینے کے بعد اور نہیں وہ ایمان لانے والے ہی ۔",
         "English" : "How do they ask you to judge while the Torah is with them, having the ruling of Allah? Still, they turn away, after all that. They are no believers."
       },
       {
         "ayet_no" : 44,
         "arbi" : "اِنَّآ اَنْزَلْنَا التَّوْرٰىةَ فِيْهَا هُدًى وَّنُوْرٌ ۚ يَحْكُمُ بِهَا النَّبِيُّوْنَ الَّذِيْنَ اَسْلَمُوْا لِلَّذِيْنَ هَادُوْا وَالرَّبّٰنِيُّوْنَ وَالْاَحْبَارُ بِمَا اسْتُحْفِظُوْا مِنْ كِتٰبِ اللّٰهِ وَكَانُوْا عَلَيْهِ شُهَدَاۗءَ ۚ فَلَا تَخْشَوُا النَّاسَ وَاخْشَوْنِ وَلَا تَشْتَرُوْا بِاٰيٰتِيْ ثَـمَنًا قَلِيْلًا ۭوَمَنْ لَّمْ يَحْكُمْ بِمَآ اَنْزَلَ اللّٰهُ فَاُولٰۗىِٕكَ هُمُ الْكٰفِرُوْنَ",
         "Urdu" : "بیشک ہم نے اتاری تورات اس میں ہدایت اور روشنی ہے حکم دیتے رہے اس کے مطابق تمام انبیاءجو فرمانبردار تھے، ان لوگوں کو جو یہودی ہوئے اور مشائخ (رب والے) اور علماء(بھی) (اس) وجہ سے جو وہ محافظ بنائے گئے تھے اللہ کی کتا ب کے اور وہ تھے اس پر گواہ پس تم نہ ڈرو لوگوں سے اور ڈرو مجھ سے اور نہ بدلے میں لو میری آیتوں کے تھوڑی قیمت اور جو نہ حکم دے اس کا جو اللہ نے اتارا ہے تو وہی لوگ ہی کافر ہیں ۔",
         "English" : "Surely We have sent down the Torah, in which there was guidance and light by which the prophets, who submitted themselves to Allah, used to judge for the Jews, and (so did) the Men of Allah and the Men of knowledge, because they were ordained to protect the Book of Allah, and they stood guard over it. So, (O Jews of today,) do not fear people. Fear Me, and do not take a paltry price for My verses. Those who do not judge according to what Allah has sent down are the disbelievers."
       },
       {
         "ayet_no" : 45,
         "arbi" : "وَكَتَبْنَا عَلَيْهِمْ فِيْهَآ اَنَّ النَّفْسَ بِالنَّفْسِ ۙوَالْعَيْنَ بِالْعَيْنِ وَالْاَنْفَ بِالْاَنْفِ وَالْاُذُنَ بِالْاُذُنِ وَالسِّنَّ بِالسِّنِّ ۙ وَالْجُرُوْحَ قِصَاصٌ ۭ فَمَنْ تَصَدَّقَ بِهٖ فَهُوَ كَفَّارَةٌ لَّهٗ  ۭ وَمَنْ لَّمْ يَحْكُمْ بِمَآ اَنْزَلَ اللّٰهُ فَاُولٰۗىِٕكَ هُمُ الظّٰلِمُوْنَ",
         "Urdu" : "اور ہم نے فرض کیا ان پر اس تورات میں کہ بیشک جان کے بدلے جان اور آنکھ کے بدلے آنکھ پھوڑی جائے اور ناک کے بدلے ناک (کاٹی جائے) اور کان کے بدلے کان (کاٹا جائے) اور دانت کے بدلے دانت (اکھاڑا جائے) اور زخموں کا بھی اسی طرح بدلہ ہے پس جو صدقہ معاف کردے اس کو تو وہ کفارہ ہوگا اس کے لیے اور جو نہ حکم اس کے مطابق جو اللہ نے نازل کیاتو وہی لوگ ہی ظالم ہیں ۔",
         "English" : "We prescribed for them therein: A life for a life, an eye for an eye, a nose for a nose, an ear for an ear and a tooth for a tooth; and for wounds, an equal retaliation. Then, if one forgives it, that will be expiation for him. Those who do not judge according to what Allah has sent down, they are the unjust."
       },
       {
         "ayet_no" : 46,
         "arbi" : "وَقَفَّيْنَا عَلٰٓي اٰثَارِهِمْ بِعِيْسَى ابْنِ مَرْيَمَ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ مِنَ التَّوْرٰىةِ ۠ وَاٰتَيْنٰهُ الْاِنْجِيْلَ فِيْهِ هُدًى وَّنُوْرٌ ۙ وَّمُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ مِنَ التَّوْرٰىةِ وَهُدًى وَّمَوْعِظَةً لِّلْمُتَّقِيْنَ",
         "Urdu" : "اور ہم نے بھیجا ان نبیوں کے نقش قدم پر عیسی بن مریم کو جو تصدیق کرنے والے تھے اس کی جو اس سے پہلے آئی تورات اور ہم نے دی اسے انجیل اس میں ہدایت اور روشنی ہے اور تصدیق کرنیوالی ہے اس کی جو اس سے پہلے آئی تورات اور ہدایت اور نصیحت ہے پرہیز گاروں کیلئے",
         "English" : "We sent lsa, son of Maryam after those prophets, confirming the Torah that was (revealed) before him, and We gave him the Injil having guidance and light therein, and confirming the Torah that was (revealed) before it; a guidance and a lesson for the God-fearing."
       },
       {
         "ayet_no" : 47,
         "arbi" : "وَلْيَحْكُمْ اَهْلُ الْاِنْجِيْلِ بِمَآ اَنْزَلَ اللّٰهُ فِيْهِ  ۭ وَمَنْ لَّمْ يَحْكُمْ بِمَآ اَنْزَلَ اللّٰهُ فَاُولٰۗىِٕكَ هُمُ الْفٰسِقُوْنَ",
         "Urdu" : "اور چاہیے کہ حکم دیا کریں اہل انجیل اس کا جو اللہ نے اتارا اس انجیل میں اور جو نہیں حکم دیتا اس کا جو اللہ نے اتارا تو وہی لوگ ہی نافرمان ہیں",
         "English" : "And the people of the Injil must judge according to what Allah has sent down therein. Those who do not judge according to what Allah has sent down, they are the sinners."
       },
       {
         "ayet_no" : 48,
         "arbi" : "وَاَنْزَلْنَآ اِلَيْكَ الْكِتٰبَ بِالْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ مِنَ الْكِتٰبِ وَمُهَيْمِنًا عَلَيْهِ فَاحْكُمْ بَيْنَهُمْ بِمَآ اَنْزَلَ اللّٰهُ وَلَا تَتَّبِعْ اَهْوَاۗءَهُمْ عَمَّا جَاۗءَكَ مِنَ الْحَقِّ ۭ لِكُلٍّ جَعَلْنَا مِنْكُمْ شِرْعَةً وَّمِنْهَاجًا ۭوَلَوْ شَاۗءَ اللّٰهُ لَجَعَلَكُمْ اُمَّةً وَّاحِدَةً وَّلٰكِنْ لِّيَبْلُوَكُمْ فِيْ مَآ اٰتٰىكُمْ فَاسْتَبِقُوا الْخَيْرٰتِ ۭ اِلَى اللّٰهِ مَرْجِعُكُمْ جَمِيْعًا فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ فِيْهِ تَخْتَلِفُوْنَ",
         "Urdu" : "اور ہم نے اتاری آپ کی طرف کتاب حق کے ساتھ تصدیق کرنیوالی ہے اس کی جو کتاب اس سے پہلے ہے اور نگران ہے اس پر، پس فیصلہ کرو ان کے درمیان اس کے مطابق جو اللہ نے اتارا ہے اور نہ پیروی کرو ان کی خواہشات کی اس سے ہٹ کر جو آیا ہے تیرے پاس حق ہم نے مقرر کیا ہے تم میں سے ہر ایک کے لیے ایک دستور اور طریقہ اور اگر اللہ چاہتا تو البتہ بنا دیتا تم سب کو ایک امت (ایک شریعت پر) اور لیکین (وہ چاہتا ہے) کہ وہ آزمائے تمہیں ان احکام کے بارے میں جو اس نے دیے ہیں تمہیں تو ایک دوسرے سے آگے بڑھو بھلائی کے کاموں میں، اللہ ہی کی طرف تم سب کا لوٹنا ہے پس وہ خبر دے گا تمہیں اس کی جو کہ تم تھے اس میں اختلاف کرے ۔",
         "English" : "We have sent down to you the Book with truth, confirming the Book before it, and a protector for it. So, judge between them according to what Allah has sent down, and do not follow their desires against the truth that has come to you. For each of you We have made a law and a method. Had Allah willed, He would have made a single community of people, but (He did not), so that He may test you in what He has given to you. Strive, then, to excel each other in good deeds. To Allah is the return for all of you. Then Allah shall tell you about that in which you disputed."
       },
       {
         "ayet_no" : 49,
         "arbi" : "وَاَنِ احْكُمْ بَيْنَهُمْ بِمَآ اَنْزَلَ اللّٰهُ وَلَا تَتَّبِعْ اَهْوَاۗءَهُمْ وَاحْذَرْهُمْ اَنْ يَّفْتِنُوْكَ عَنْۢ بَعْضِ مَآ اَنْزَلَ اللّٰهُ اِلَيْكَ ۭ فَاِنْ تَوَلَّوْا فَاعْلَمْ اَنَّمَا يُرِيْدُ اللّٰهُ اَنْ يُّصِيْبَهُمْ بِبَعْضِ ذُنُوْبِهِمْ ۭ وَاِنَّ كَثِيْرًا مِّنَ النَّاسِ لَفٰسِقُوْنَ",
         "Urdu" : "اور یہ کہ فیصلہ کرو ان کے درمیان اس کے مطابق جو اللہ نے نازل کیا اور نہ پیروی کرو انکی خواہشا ت کی اور بچو ان سے کہ وہ بہکا کر فتنے میں مبتلا نہ کریں آپکو بعض ایسے احکام سے جو اللہ نے اتارے آپ کی طرف، پھر اگر یہ پھر جائیں تو جان لو بیشک اللہ چاہتا ہے کہ پہنچائے انہیں سزا ان کے بعض گناہوں کے سبب، اور بیشک لوگوں میں سے بہت سے یقینا نافرمان ہیں ۔",
         "English" : "We order you to judge between them according to what Allah has sent down. Do not follow their desires, and beware of them, lest they should turn you away from some of what Allah has sent down to you. If they turn away, be assured that Allah intends to make them suffer for some of their sins. Surely, many of the people are sinners."
       },
       {
         "ayet_no" : 50,
         "arbi" : "اَفَحُكْمَ الْجَاهِلِيَّةِ يَبْغُوْنَ ۭوَمَنْ اَحْسَنُ مِنَ اللّٰهِ حُكْمًا لِّقَوْمٍ يُّوْقِنُوْنَ",
         "Urdu" : "توکیا زمانہ جاہلیت کا حکم یہ لوگ چاہتے ہیں اور کون زیادہ بہتر ہے اللہ سے حکم دینے میں اس قوم کو جو یقین رکھتے ہیں",
         "English" : "Is it, then, the judgement of (the days of) Ignorance that they seek? Who is better in judgement than Allah, for a people who believe?"
       },
       {
         "ayet_no" : 51,
         "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوْا لَا تَتَّخِذُوا الْيَھُوْدَ وَالنَّصٰرٰٓى اَوْلِيَاۗءَ  ۘبَعْضُهُمْ اَوْلِيَاۗءُ بَعْضٍ ۭ وَمَنْ يَّتَوَلَّهُمْ مِّنْكُمْ فَاِنَّهٗ مِنْهُمْ ۭاِنَّ اللّٰهَ لَا يَهْدِي الْقَوْمَ الظّٰلِمِيْنَ",
         "Urdu" : "اے لوگو جو ایمان لائے ہو! مت بناؤ یہود ونصاری کو دوست ان میں سے بعض، بعض کے دوست ہیں۔اورجو دوستی لگائے گا ان کے ساتھ تم میں سے تو بیشک وہ انہی میں سے ہے بیشک اللہ نہیں ہدایت دیتا ظالم قوم کو",
         "English" : "O you who believe, do not take the Jews and the Christians for intimate friends. They are friends to each other. Whoever takes them as intimate friends is one of them. Surely, Allah does not take the unjust people to the right path."
       },
       {
         "ayet_no" : 52,
         "arbi" : "فَتَرَى الَّذِيْنَ فِيْ قُلُوْبِهِمْ مَّرَضٌ يُّسَارِعُوْنَ فِيْهِمْ يَقُوْلُوْنَ نَخْشٰٓى اَنْ تُصِيْبَنَا دَاۗىِٕرَةٌ ۭفَعَسَى اللّٰهُ اَنْ يَّاْتِيَ بِالْفَتْحِ اَوْ اَمْرٍ مِّنْ عِنْدِهٖ فَيُصْبِحُوْا عَلٰي مَآ اَ سَرُّوْا فِيْٓ اَنْفُسِهِمْ نٰدِمِيْنَ",
         "Urdu" : "پس آپ دیکھتے ہیں ان لوگوں کو کہ ان کے دلوں میں نفاق کی بیماری ہے وہ جلدی کرتے ہیں ان کی دوستی میں، کہتے ہیں ہم ڈرتے ہیں کہ کہیں نہ پہنچے ہمیں گردش زمانہ کا انقلاب پس قریب ہے اللہ کہ لے آئے تم پر فتح کو یا کوئی صورت اپنی طرف سے غلبے کی پس ہوجائیں وہ اس پر جو انہوں نے چھپا رکھا تھا اپنے نفسوں میں شرمندہ ہونیوالے",
         "English" : "Now, you see those who have disease in their hearts race towards them saying, :We apprehend that some misfortune may overtake us. So, it is likely that Allah may bring victory or something else from His own side, whereupon they will become regretful over what they concealed in their hearts."
       },
       {
         "ayet_no" : 53,
         "arbi" : "وَيَقُوْلُ الَّذِيْنَ اٰمَنُوْٓا اَهٰٓؤُلَاۗءِ الَّذِيْنَ اَقْسَمُوْا بِاللّٰهِ جَهْدَ اَيْمَانِهِمْ ۙاِنَّهُمْ لَمَعَكُمْ ۭحَبِطَتْ اَعْمَالُهُمْ فَاَصْبَحُوْا خٰسِرِيْنَ",
         "Urdu" : "اور کہیں گے وہ لوگ جو ایمان لائے کیا یہ ہیں وہ لوگ جنہوں نے قسمیں کھائیں اللہ کی پکا کر کےاپنی قسموں کو کہ بیشک وہ یقینا تمہارے ساتھ ہیں، ضائع ہوگئے ان کے اعمال پس وہ ہوگئے خسارہ پانے والے",
         "English" : "Those who believe will say, :Are these the ones who swore their solemn oaths by Allah that they were with you? Their deeds have gone to waste, and they became losers."
       },
       {
         "ayet_no" : 54,
         "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوْا مَنْ يَّرْتَدَّ مِنْكُمْ عَنْ دِيْنِهٖ فَسَوْفَ يَاْتِي اللّٰهُ بِقَوْمٍ يُّحِبُّهُمْ وَيُحِبُّوْنَهٗٓ ۙ اَذِلَّةٍ عَلَي الْمُؤْمِنِيْنَ اَعِزَّةٍ عَلَي الْكٰفِرِيْنَ ۡ يُجَاهِدُوْنَ فِيْ سَبِيْلِ اللّٰهِ وَلَا يَخَافُوْنَ لَوْمَةَ لَاۗىِٕمٍ ۭ ذٰلِكَ فَضْلُ اللّٰهِ يُؤْتِيْهِ مَنْ يَّشَاۗءُ ۭوَاللّٰهُ وَاسِعٌ عَلِيْمٌ",
         "Urdu" : "اے وہ لوگو جو ایمان لائے ہو! جو کوئی پھرے گا تم میں سے اپنے دین سے تو عنقریب اللہ لے آئے گا ایسی قوم کو کہ) وہ محبت رکھتا ہو ان سے اور وہ محبت رکھتے ہوں اس سے مؤمنوں کے حق میں نرم دل ہوں اور کافروں کے حق میں سخت ہوں وہ جہاد کرتے ہوں اللہ کے راستے میں اور وہ نہ ڈرتے ہوں کسی ملامت کرنیوالے کی ملامت سے یہ اللہ کا فضل ہے وہ دیتا ہے اسے جسے چاہتاہے اور اللہ بہ وسعت والا، خوب جاننے والا ہے۔",
         "English" : "O you who believe, if anyone from you turns back from his Faith, then Allah will bring a people whom He loves and who love Him, humble toward the believers, hard on the disbelievers, who fight in the way of Allah and are not afraid of the reproach of any critic. That is a grace of Allah. He confers it on whom He wills. Allah is All-Embracing, All-Knowing"
       },
       {
         "ayet_no" : 55,
         "arbi" : "اِنَّمَا وَلِيُّكُمُ اللّٰهُ وَرَسُوْلُهٗ وَالَّذِيْنَ اٰمَنُوا الَّذِيْنَ يُقِيْمُوْنَ الصَّلٰوةَ وَيُؤْتُوْنَ الزَّكٰوةَ وَهُمْ رٰكِعُوْنَ",
         "Urdu" : "بیشک تمہارا دوست (تو) اللہ اور اس کا رسول ہے اور وہ لوگ جو ایمان لائے (وہ تمہارے دوست ہیں) جو نماز قائم کرتے ہیں زکوة ادا کرتے ہیں اور وہ اللہ کے سامنے جھکنے والے ہیں ۔",
         "English" : "Your only friend is Allah, then His Messenger and those who believe, who establish Salah and pay Zakah and bow before Allah."
       },
       {
         "ayet_no" : 56,
         "arbi" : "وَمَنْ يَّتَوَلَّ اللّٰهَ وَرَسُوْلَهٗ وَالَّذِيْنَ اٰمَنُوْا فَاِنَّ حِزْبَ اللّٰهِ هُمُ الْغٰلِبُوْنَ",
         "Urdu" : "اور جو دوستی کرے گا اللہ اور اس کے رسول سے اور ان لوگوں سے جو ایمان لائے تو بیشک اللہ کی جماعت ہی غالب آنیوالی ہے ۔",
         "English" : "Whoever maintains friendship with Allah and His Messenger and those who believe (must know that) it is the (members of the) Party of Allah that are the triumphant."
       },
       {
         "ayet_no" : 57,
         "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوْا لَا تَتَّخِذُوا الَّذِيْنَ اتَّخَذُوْا دِيْنَكُمْ هُزُوًا وَّلَعِبًا مِّنَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ مِنْ قَبْلِكُمْ وَالْكُفَّارَ اَوْلِيَاۗءَ ۚوَاتَّقُوا اللّٰهَ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
         "Urdu" : "اے وہ لوگو جو ایمان لائے ہو مت بناؤ ان لوگوں کو جنہوں نے بنایا تمہارے دین کو مذاق اور کھیل،ان لوگوں میں سے جو دئیے گئے کتاب تم سے پہلے اور کفار کو دوست (بھی مت بناؤ )اور اللہ سے ڈرتے رہو اگر ہو تم مومن",
         "English" : "O you who believe, do not take those who have taken your Faith in jest and fun for friends from those who have been given the Book prior to you, and the disbelievers. Fear Allah, if you are believers."
       },
       {
         "ayet_no" : 58,
         "arbi" : "وَاِذَا نَادَيْتُمْ اِلَى الصَّلٰوةِ اتَّخَذُوْهَا هُزُوًا وَّلَعِبًا  ۭذٰلِكَ بِاَنَّهُمْ قَوْمٌ لَّا يَعْقِلُوْنَ",
         "Urdu" : "اور جب اذان کہہ کر تم پکارتے ہو نماز کی طرف یہ بنالیتے ہیں اس کو مذاق اور کھیل یہ اس وجہ سے کہ بیشک وہ ایسی قوم ہے کہ عقل نہیں رکھتے",
         "English" : "When you call for Salah, they take it in jest and fun. That is because they are a people who do not understand"
       },
       {
         "ayet_no" : 59,
         "arbi" : "قُلْ يٰٓاَهْلَ الْكِتٰبِ هَلْ تَنْقِمُوْنَ مِنَّآ اِلَّآ اَنْ اٰمَنَّا بِاللّٰهِ وَمَآ اُنْزِلَ اِلَيْنَا وَمَآ اُنْزِلَ مِنْ قَبْلُ ۙ وَاَنَّ اَكْثَرَكُمْ فٰسِقُوْنَ",
         "Urdu" : "کہہ دیں اے اہل کتاب! نہیں تم عیب نکالتے ہم سے مگر اس وجہ سے کہ ہم ایمان لائے اللہ پر اور جو ہماری طرف نازل کیا گیا اور جو نازل کیا گیا اس سے پہلے اور بیشک تم میں سے اکثر نافرمان ہیں ۔",
         "English" : "Say, :O People of the Book, do you accuse us of anything else except that we have believed in Allah and in what has been sent down to us and what has been sent down earlier while most of you are sinners (and we do not follow you in your sins)"
       },
       {
         "ayet_no" : 60,
         "arbi" : "قُلْ هَلْ اُنَبِّئُكُمْ بِشَرٍّ مِّنْ ذٰلِكَ مَثُوْبَةً عِنْدَ اللّٰهِ  ۭ مَنْ لَّعَنَهُ اللّٰهُ وَغَضِبَ عَلَيْهِ وَجَعَلَ مِنْهُمُ الْقِرَدَةَ وَالْخَـنَازِيْرَ وَعَبَدَ الطَّاغُوْتَ ۭ اُولٰۗىِٕكَ شَرٌّ مَّكَانًا وَّاَضَلُّ عَنْ سَوَاۗءِ السَّبِيْلِ",
         "Urdu" : "کہہ دیں کیا میں خبردوں تمہیں بدتر کی اس سے انجام کے لحاظ سے اللہ کے نزدیک وہ جو کہ لعنت کی اس پر اللہ نے اور غضبناک ہوا اس پر اور بنادیا ان میں سے بعض کو بندر اور بعض کو سور اور جنہوں نے بندگی کی طاغوت کی یہ سب لوگ بدتر ہیں ٹھکانے کے لحاظ سے اور بہت بھٹکے ہوئے سیدھے راستے سے ۔",
         "English" : "Say, :Shall I tell you about the ones whose retribution with Allah is worse than that (which you deem bad)? They are those whom Allah has subjected to His curse and to His wrath; and He has turned some of them into apes and swine, those who worshipped Taghut (Satan, the Rebel). Those are worse in their situation, and far more astray from the straight path."
       },
       {
         "ayet_no" : 61,
         "arbi" : "وَاِذَا جَاۗءُوْكُمْ قَالُوْٓا اٰمَنَّا وَقَدْ دَّخَلُوْا بِالْكُفْرِ وَهُمْ قَدْ خَرَجُوْا بِهٖ ۭ وَاللّٰهُ اَعْلَمُ بِمَا كَانُوْا يَكْتُمُوْنَ",
         "Urdu" : "اور جب یہ آتے ہیں تمہارے پاس تو کہتے ہیں ہم ایمان لائے حالانکہ یقینا وہ داخل ہوئے کفر کیساتھ اور وہ یقینا نکلے اسی کفر کے ساتھ، اور اللہ تعالی خوب جاننے والا ہے اس کو جو وہ چھپاتے ہیں ۔",
         "English" : "When they come to you, they say, :We believe , while with disbelief they came in, and with the same (disbelief) they went out. Allah knows best what they used to conceal."
       },
       {
         "ayet_no" : 62,
         "arbi" : "وَتَرٰى كَثِيْرًا مِّنْهُمْ يُسَارِعُوْنَ فِي الْاِثْمِ وَالْعُدْوَانِ وَاَكْلِهِمُ السُّحْتَ ۭ لَبِئْسَ مَا كَانُوْا يَعْمَلُوْنَ",
         "Urdu" : "اور آپ دیکھیں گے ان میں سے اکثر کو کہ وہ جلدی کرتے ہیں گناہ اور زیادتی کے کاموں میں اور اپنے حرام کھانے میں یقینا براہے جو وہ کرتے ہیں",
         "English" : "You will see many of them rushing towards sin and aggression, and (towards) devouring what is unlawful. Evil indeed is what they have been doing."
       },
       {
         "ayet_no" : 63,
         "arbi" : "لَوْلَا يَنْھٰىهُمُ الرَّبّٰنِيُّوْنَ وَالْاَحْبَارُ عَنْ قَوْلِهِمُ الْاِثْمَ وَاَكْلِهِمُ السُّحْتَ ۭلَبِئْسَ مَا كَانُوْا يَصْنَعُوْنَ",
         "Urdu" : "کیوں نہیں منع کرتے انہیں (انکے) مشائخ اور علماء ان کے گناہ کی بات کرنے سے اور ان کے حرام کھانے سے البتہ براہے جو وہ کر رہے ہیں",
         "English" : "Why do the Men of Allah and the Men of Knowledge not forbid them from saying what is sinful and devouring what is unlawful? Evil indeed is what they have been working."
       },
       {
         "ayet_no" : 64,
         "arbi" : "وَقَالَتِ الْيَھُوْدُ يَدُاللّٰهِ مَغْلُوْلَةٌ  ۭغُلَّتْ اَيْدِيْهِمْ وَلُعِنُوْا بِمَا قَالُوْا  ۘبَلْ يَدٰهُ مَبْسُوْطَتٰنِ ۙ يُنْفِقُ كَيْفَ يَشَاۗءُ ۭ وَلَيَزِيْدَنَّ كَثِيْرًا مِّنْهُمْ مَّآ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ طُغْيَانًا وَّكُفْرًا ۭ وَاَلْقَيْنَا بَيْنَهُمُ الْعَدَاوَةَ وَالْبَغْضَاۗءَ اِلٰي يَوْمِ الْقِيٰمَةِ ۭكُلَّمَآ اَوْقَدُوْا نَارًا لِّـلْحَرْبِ اَطْفَاَهَا اللّٰهُ ۙوَيَسْعَوْنَ فِي الْاَرْضِ فَسَادًا  ۭوَاللّٰهُ لَا يُحِبُّ الْمُفْسِدِيْنَ",
         "Urdu" : "اور یہودیوں نے کہا اللہ کا ہاتھ تنگ ہےحالانکہ تنگ تو ان کے اپنے ہاتھ ہیں اور لعنت کی گئی ان پر اس وجہ سے جو انہوں نے کہا بلکہ اس کے دنوں ہاتھ کشادہ ہیں وہ خرچ کرتا ہے جس طرح وہ چاہتا ہے اور البتہ وہ ضرور بڑھائے گا ان میں سے اکثر کو یہ کلام جو اتارا گیا آپ کی طرف آپکے رب کی طرف سے، سرکشی اور کفر میں اور ہم نے ڈال دی ان کے درمیان عداوت اور کینہ قیامت کے دن تک، جب بھی یہ جلاتے ہیں آگ جنگ کیلئے تو اللہ اسے بجھادیتا ہے اور دوڑے پھرتے ہیں زمین میں فساد مچانے کے لیے اور اللہ نہیں پسند کرتا فساد کرنے والوں کو",
         "English" : "The Jews said, :Allah‘s hand is fettered. Fettered are their own hands, and cursed are they for what they said. In fact, His hands are outspread. He spends as He wills. What has been sent down to you from your Lord shall certainly increase many of them in rebellion and disbelief. We have put enmity and hatred amongst them lasting to the Day of Doom. Whenever they lit the flame of war, Allah puts it out. They run about on the earth spreading mischief, and Allah does not like the mischief-makers."
       },
       {
         "ayet_no" : 65,
         "arbi" : "وَلَوْ اَنَّ اَهْلَ الْكِتٰبِ اٰمَنُوْا وَاتَّقَوْا لَكَفَّرْنَا عَنْهُمْ سَيِّاٰتِهِمْ وَلَاَدْخَلْنٰهُمْ جَنّٰتِ النَّعِيْمِ",
         "Urdu" : "اور اگر بیشک وہ اہل کتاب ایمان لے آتے اور تقوی اختیار کرتے (تو) ضرور ہم دور کردیتے ان سے انکے گناہ اور ضرور ہم داخل کرتے انہیں نعمتوں والے باغات میں",
         "English" : "If the People of the Book had believed and feared Allah, We would have written off their evil deeds and would have surely admitted them to the Gardens of Bliss."
       },
       {
         "ayet_no" : 66,
         "arbi" : "وَلَوْ اَنَّهُمْ اَقَامُوا التَّوْرٰىةَ وَالْاِنْجِيْلَ وَمَآ اُنْزِلَ اِلَيْهِمْ مِّنْ رَّبِّهِمْ لَاَكَلُوْا مِنْ فَوْقِهِمْ وَمِنْ تَحْتِ اَرْجُلِهِمْ  ۭمِنْهُمْ اُمَّةٌ مُّقْتَصِدَةٌ ۭ وَكَثِيْرٌ مِّنْهُمْ سَاۗءَ مَا يَعْمَلُوْنَ",
         "Urdu" : "اور اگر بیشک وہ قائم رکھتے تورات اور انجیل کو اور جو نازل کیا گیا ان کی طرف ان کے رب کی طرف سے ضرور وہ کھاتے (اللہ کا رزق) اپنے اوپر سے اور اپنے پاؤ ں کے نیچے سے، ان میں سے ایک گروہ میانہ رو ہے اور بہت سے ان میں ایسے ہیں کہ براہے جو وہ عمل کرتے ہیں",
         "English" : "If they had upheld the Torah and the Injil and what had been sent down to them from their Lord, they would surely have had plenty to eat from above them and from beneath them. Among them are moderate people. As for most of them, evil is what they do."
       },
       {
         "ayet_no" : 67,
         "arbi" : "يٰٓاَيُّھَا الرَّسُوْلُ بَلِّــغْ مَآ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ ۭوَاِنْ لَّمْ تَفْعَلْ فَمَا بَلَّغْتَ رِسَالَتَهٗ ۭوَاللّٰهُ يَعْصِمُكَ مِنَ النَّاسِ ۭاِنَّ اللّٰهَ لَا يَهْدِي الْقَوْمَ الْكٰفِرِيْنَ",
         "Urdu" : "اے رسول! (لوگوں کو) پہنچا دو جو نازل کیا گیا ہے آپ کی طرف آپ کے رب کی طرف سے اور اگر آپ نے ایسا نہ کیا تو نہ پہنچایا آپ نے اس کا پیغام اور اللہ آپ کو محفوظ رکھے گا لوگوں کے شر سے بیشک اللہ نہیں ہدایت دیتا کافر قوم کو(زبردستی)",
         "English" : "O Messenger, convey all that has been sent down to you from your Lord. If you do not, then you shall not have conveyed His message (at all). Allah shall protect you from the people. Surely, Allah does not lead the disbelieving people to the right path."
       },
       {
         "ayet_no" : 68,
         "arbi" : "قُلْ يٰٓاَهْلَ الْكِتٰبِ لَسْتُمْ عَلٰي شَيْءٍ حَتّٰي تُقِيْمُوا التَّوْرٰىةَ وَالْاِنْجِيْلَ وَمَآ اُنْزِلَ اِلَيْكُمْ مِّنْ رَّبِّكُمْ ۭوَلَيَزِيْدَنَّ كَثِيْرًا مِّنْهُمْ مَّآ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ طُغْيَانًا وَّكُفْرًا  ۚ فَلَا تَاْسَ عَلَي الْقَوْمِ الْكٰفِرِيْنَ",
         "Urdu" : "آپ کہہ دیں اے اہل کتاب! تم نہیں ہو کسی چیز (دین) پر یہاں تک کہ تم قائم نہ رکھو تورات اور انجیل کو اور جو نازل کیا گیا تمہاری طرف تمہارے رب کی طرف سے اور البتہ ضرور بڑھائے گا ان میں سے اکثر کو یہ قران جو نازل کیا گیا ہے آپ کی طرف آپ کے رب کی طرف سے، سرکشی اور کفر میں پس نہ تو افسوس کر کافر قوم پر ۔",
         "English" : "Say, :O people of the Book, you have nothing to stand on, unless you uphold the Torah and the Injil and what has been sent down to you from your Lord. What has been sent down to you from your Lord will certainly make many of them more persistent in rebellion and disbelief. So, do not grieve over the disbelieving people."
       },
       {
         "ayet_no" : 69,
         "arbi" : "اِنَّ الَّذِيْنَ اٰمَنُوْا وَالَّذِيْنَ هَادُوْا وَالصّٰبِـُٔــوْنَ وَالنَّصٰرٰى مَنْ اٰمَنَ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِ وَعَمِلَ صَالِحًا فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُوْنَ",
         "Urdu" : "بیشک جو لوگ ایمان لائے اور جو یہودی ہوئے اور ستارہ پرست اور نصاری ہیں ان سب میں سے جو ایمان لایا اللہ پر اور آخرت کے دن پر اور نیک عمل کیے تو نہیں ہوگا ان پر کوئی خوف اور نہ وہ غمگین ہوں گے ۔",
         "English" : "Surely, those who believe, and those who are Jews, and the Sabians, and the Christians - whoever believes in Allah and the Last Day, and acts righteously, shall have no fear, nor shall such people grieve."
       },
       {
         "ayet_no" : 70,
         "arbi" : "لَقَدْ اَخَذْنَا مِيْثَاقَ بَنِيْٓ اِسْرَاۗءِيْلَ وَاَرْسَلْنَآ اِلَيْهِمْ رُسُلًا  ۭكُلَّمَا جَاۗءَهُمْ رَسُوْلٌۢ بِمَا لَا تَهْوٰٓى اَنْفُسُهُمْ ۙ فَرِيْقًا كَذَّبُوْا وَفَرِيْقًا يَّقْتُلُوْنَ",
         "Urdu" : "البتہ تحقیق ہم نے لیا بنی اسرائیل سے پختہ عہد اور ہم نے بھیجے ان کی طرف رسول جب بھی آیا ان کے پاس کوئی رسول وہ کچھ لے کر جو نہیں چاہتے تھے ان کے نفس (تو نبیوں کے ایک گروہ کو انہوں نے جھٹلایا اور ایک گروہ کو قتل کرتے رہے ۔",
         "English" : "Certainly We took a pledge from the children of Isra‘il and sent Messengers to them. Whenever a Messenger went to them with what did not meet their desires, they cried lie to some, and killed others."
       },
       {
         "ayet_no" : 71,
         "arbi" : "وَحَسِبُوْٓا اَلَّا تَكُوْنَ فِتْنَةٌ فَعَمُوْا وَصَمُّوْا ثُمَّ تَابَ اللّٰهُ عَلَيْهِمْ ثُمَّ عَمُوْا وَصَمُّوْا كَثِيْرٌ مِّنْهُمْ ۭ وَاللّٰهُ بَصِيْرٌۢ بِمَا يَعْمَلُوْنَ",
         "Urdu" : "اور وہ سمجھے کہ نہ تو ہوگی اس سے کوئی آزمائش تو وہ اندھے ہوگئے اور بہرے بن گئے پھر مہربانی کی اللہ نے ان پر پھر (دوبارہ) اندھے اور بہرے بن گئے ان میں سے بہت سے اور اللہ خوب دیکھنے والا ہے اس کو جو وہ کرتے ہیں ۔",
         "English" : "They thought that no harm would follow. Therefore, they became blind and deaf. Then, Allah accepted their repentance, but again they turned blind and deaf, many of them. Allah is watchful of what they do."
       },
       {
         "ayet_no" : 72,
         "arbi" : "لَقَدْ كَفَرَ الَّذِيْنَ قَالُوْٓا اِنَّ اللّٰهَ هُوَ الْمَسِيْحُ ابْنُ مَرْيَمَ  ۭوَقَالَ الْمَسِيْحُ يٰبَنِيْٓ اِسْرَاۗءِيْلَ اعْبُدُوا اللّٰهَ رَبِّيْ وَرَبَّكُمْ ۭاِنَّهٗ مَنْ يُّشْرِكْ بِاللّٰهِ فَقَدْ حَرَّمَ اللّٰهُ عَلَيْهِ الْجَنَّةَ وَمَاْوٰىهُ النَّارُ  ۭوَمَا لِلظّٰلِمِيْنَ مِنْ اَنْصَارٍ",
         "Urdu" : "البتہ یقینا کفر کیا ان لوگوں نے جنہوں نے کہا بیشک مسیح بن مریم ہی اللہ ہے حالانکہ مسیح نے خود کہا تھا اے بنی اسرائیل اللہ کی عبادت کرو جو میرا رب اور تمہارا رب ہے یہ یقینی بات ہے کہ جو شریک بنائے گا اللہ کا تو یقینا اللہ حرام کردے گا اس پر جنت کو اور اس کا ٹھکانہ آگ ہے اور نہیں ہےظالموں کا کوئی مددگار",
         "English" : "Surely, disbelievers are those who say, :Allah is the MasiH, son of Maryam while the MasiH had said, :O children of Isra‘il , worship Allah, my Lord and your Lord. In fact, whoever ascribes any partner to Allah, Allah has prohibited for him the Jannah (the Paradise), and his shelter is the Fire, and there will be no supporters for the unjust."
       },
       {
         "ayet_no" : 73,
         "arbi" : "لَقَدْ كَفَرَ الَّذِيْنَ قَالُوْٓا اِنَّ اللّٰهَ ثَالِثُ ثَلٰثَةٍ ۘوَمَا مِنْ اِلٰهٍ اِلَّآ اِلٰهٌ وَّاحِدٌ ۭوَاِنْ لَّمْ يَنْتَھُوْا عَمَّا يَقُوْلُوْنَ لَيَمَسَّنَّ الَّذِيْنَ كَفَرُوْا مِنْهُمْ عَذَابٌ اَلِيْمٌ",
         "Urdu" : "البتہ یقینا کفر کیا جنہوں نے کہا بیشک اللہ تین میں تیسرا ہے حالانکہ نہیں ہے کوئی معبود مگر صرف ایک معبود اور اگر نہ وہ باز آئے ان باتوں سے جو وہ کہتے ہیں البتہ ضرور چھوئے گا ان لوگوں کو جنہوں نے کفر کیا ان میں سے دردناک عذاب",
         "English" : "Surely, disbelievers are those who say, :Allah is the third of the three while there is no god but One God. If they do not desist from what they say, a painful punishment shall certainly befall such disbelievers."
       },
       {
         "ayet_no" : 74,
         "arbi" : "اَفَلَا يَتُوْبُوْنَ اِلَى اللّٰهِ وَيَسْتَغْفِرُوْنَهٗ  ۭوَاللّٰهُ غَفُوْرٌ رَّحِيْمٌ",
         "Urdu" : "تو کیا یہ رجوع نہیں کرتے اللہ کی طرف اور نہیں بخشش مانگتے اس سے حالانکہ اللہ بخشنے والا مہربان ہے",
         "English" : "Why then do they not turn to Allah in repentance and seek His forgiveness, while Allah is most forgiving, very merciful ?"
       },
       {
         "ayet_no" : 75,
         "arbi" : "مَا الْمَسِيْحُ ابْنُ مَرْيَمَ اِلَّا رَسُوْلٌ ۚ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ ۭوَاُمُّهٗ صِدِّيْقَةٌ ۭكَانَا يَاْكُلٰنِ الطَّعَامَ ۭاُنْظُرْ كَيْفَ نُبَيِّنُ لَهُمُ الْاٰيٰتِ ثُمَّ انْظُرْ اَنّٰى يُؤْفَكُوْنَ",
         "Urdu" : "نہیں ہیں مسیح بن مریم مگر ایک رسول یقینا گزر چکے ہیں اس سے پہلے بہت سے رسول اور اس کی ماں صدیقہ تھی تھے وہ دونوں کھانا کھاتے، (اے نبی) دیکھ کیسے ہم بیان کرتے ہیں انکے لیے واضح دلائل پھر دیکھ (ان دلائل کے باوجود) کیسے پلٹائے جارہے ہیں ۔",
         "English" : "The Masih, son of Maryam, is no more than a Messenger. There have been messengers before him. His mother was very truthful. Both of them used to eat food. Look how We explain signs to them, then see how far they are turned away."
       },
       {
         "ayet_no" : 76,
         "arbi" : "قُلْ اَتَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ مَا لَا يَمْلِكُ لَكُمْ ضَرًّا وَّلَا نَفْعًا ۭوَاللّٰهُ هُوَ السَّمِيْعُ الْعَلِيْمُ",
         "Urdu" : "اے نبی کہہ دیں کیا تم عبادت کرتے ہو اللہ کے علاوہ کی جو نہ اختیار رکھتا ہے تمہارے نقصان کا اور نہ نفع کا اور اللہ ہی خوب سننے والا، جاننے والا ہے ۔",
         "English" : "Say, :Do you worship, besides Allah, what has no power to do you harm or bring you benefit? Allah is the All-Hearing, the All-Knowing."
       },
       {
         "ayet_no" : 77,
         "arbi" : "قُلْ يٰٓاَهْلَ الْكِتٰبِ لَا تَغْلُوْا فِيْ دِيْنِكُمْ غَيْرَ الْحَقِّ وَلَا تَتَّبِعُوْٓا اَهْوَاۗءَ قَوْمٍ قَدْ ضَلُّوْا مِنْ قَبْلُ وَاَضَلُّوْا كَثِيْرًا وَّضَلُّوْا عَنْ سَوَاۗءِ السَّبِيْلِ",
         "Urdu" : "اے نبی) کہہ دیں اے اہل کتاب! حد سے مت بڑھو اپنے دین میں ناحق (بات کہہ کر) اور نہ پیروی کرو (ایسی) قوم کی خواہشات کی جو یقینا پہلے سے گمراہ ہیں اور انہوں نے گمراہ کیا بہت لوگوں کواور وہ بھٹک گئے سیدھے راستے سے",
         "English" : "Say, O people of the Book, be not excessive in your religion unjustly, and do not follow the desires of a people who have already gone astray, misled many and lost the right path."
       },
       {
         "ayet_no" : 78,
         "arbi" : "لُعِنَ الَّذِيْنَ كَفَرُوْا مِنْۢ بَنِيْٓ اِسْرَاۗءِيْلَ عَلٰي لِسَانِ دَاوٗدَ وَعِيْسَى ابْنِ مَرْيَمَ  ۭذٰلِكَ بِمَا عَصَوْا وَّكَانُوْا يَعْتَدُوْنَ",
         "Urdu" : "لعنت کی گئی ان لوگوں پر جنہوں نے کفر کیا بنی اسرائیل میں سے داود اور عیسی بن مریم کی زبان پر یہ اس وجہ سے جو انہوں نے نافرمانی کی اور تھے حد سے تجاوز کرتے ۔",
         "English" : "On those who disbelieve from among the children of Isra‘il , a curse was pronounced by Dawud and lsa,, Son of Maryam. All this because they disobeyed and used to cross the limits"
       },
       {
         "ayet_no" : 79,
         "arbi" : "كَانُوْا لَا يَتَنَاهَوْنَ عَنْ مُّنْكَرٍ فَعَلُوْهُ ۭلَبِئْسَ مَا كَانُوْا يَفْعَلُوْنَ",
         "Urdu" : "وہ نہیں منع کرتے تھے اس برائی سے کہ وہ خود کرتے تھے اسے یقینا برا تھا جو وہ کرتے تھے",
         "English" : "They did not forbid each other from any evil they committed. Evil indeed is what they have been doing."
       },
       {
         "ayet_no" : 80,
         "arbi" : "تَرٰى كَثِيْرًا مِّنْهُمْ يَتَوَلَّوْنَ الَّذِيْنَ كَفَرُوْا  ۭلَبِئْسَ مَا قَدَّمَتْ لَهُمْ اَنْفُسُهُمْ اَنْ سَخِـــطَ اللّٰهُ عَلَيْهِمْ وَفِي الْعَذَابِ هُمْ خٰلِدُوْنَ",
         "Urdu" : "آپ دیکھے گے ان میں سے اکثر کو کہ وہ دوستی لگاتے ہیں ان لوگوں سے جنہوں نے کفر کیا البتہ براہے جو آگے بھیجا اپنے لیے ان کے نفسوں نے(وہ یہ کہ) اللہ ناراض ہوا ان پر اور عذاب میں وہ ہمیشہ مبتلا رہنے والے ہیں ۔",
         "English" : "You see many of them take the infidels (the pagans) for friends. Indeed, evil is what they have sent ahead for themselves, for Allah is angry with them, and they are to remain in torment for ever."
       },
       {
         "ayet_no" : 81,
         "arbi" : "وَلَوْ كَانُوْا يُؤْمِنُوْنَ بِاللّٰهِ وَالنَّبِيِّ وَمَآ اُنْزِلَ اِلَيْهِ مَا اتَّخَذُوْهُمْ اَوْلِيَاۗءَ وَلٰكِنَّ كَثِيْرًا مِّنْهُمْ فٰسِقُوْنَ",
         "Urdu" : "اور اگر وہ ایمان لائے ہوتے اللہ پر اور نبی محمد صلی اللہ علیہ وسلم پراور جو نازل کیا گیا اس کی طرف تو نہ بناتے ان کافروں کو دوست اور لیکن ان میں سے اکثر نافرمان ہیں",
         "English" : "If they believed in Allah, in the prophet, and in what had been sent down to him, they would have not taken them (the pagans) for friends, but many of them are sinners."
       },
       {
         "ayet_no" : 82,
         "arbi" : "لَتَجِدَنَّ اَشَدَّ النَّاسِ عَدَاوَةً لِّلَّذِيْنَ اٰمَنُوا الْيَھُوْدَ وَالَّذِيْنَ اَشْرَكُوْا ۚ وَلَتَجِدَنَّ اَقْرَبَهُمْ مَّوَدَّةً لِّلَّذِيْنَ اٰمَنُوا الَّذِيْنَ قَالُوْٓا اِنَّا نَصٰرٰى ۭذٰلِكَ بِاَنَّ مِنْهُمْ قِسِّيْسِيْنَ وَرُهْبَانًا وَّاَنَّهُمْ لَا يَسْتَكْبِرُوْنَ",
         "Urdu" : "البتہ ضرور پائیں گے آپ(دوسرے) لوگوں سے زیادہ سخت دشمنی میں ان لوگوں کے ساتھ جو ایمان لائے ہیں یہویوں کو اور ان لوگوں کو جنہوں نے شرک کیا اور یقینا ضرور پائیں گے آپ ان لوگوں میں سے زیادہ قریب محبت میں ان لوگوں کے ساتھ جو ایمان لائے ان لوگوں کو جنہوں نے کہا کہ بیشک ہم نصاری ہیں یہ اس لیے کہ بیشک ان میں سے کچھ عالم ہیں اور عبادت گزار بھی اور بیشک وہ تکبر نہیں کرتے ۔",
         "English" : "And you will certainly find that the people most hostile against the believers are the Jews and the ones who ascribe partners to Allah. You will certainly find that the closest of them in friendship with the believers are those who say, :We are Christians. That is because among them there are priests and monks,46 and because they are not arrogant."
       },
       {
         "ayet_no" : 83,
         "arbi" : "وَاِذَا سَمِعُوْا مَآ اُنْزِلَ اِلَى الرَّسُوْلِ تَرٰٓي اَعْيُنَهُمْ تَفِيْضُ مِنَ الدَّمْعِ مِمَّا عَرَفُوْا مِنَ الْحَـقِّ ۚ يَقُوْلُوْنَ رَبَّنَآ اٰمَنَّا فَاكْتُبْنَا مَعَ الشّٰهِدِيْنَ",
         "Urdu" : "اور جب وہ سنتے ہیں اسے جو نازل کیا گیا رسول کی طرف آپ دیکھتے ہیں ان کی انکھوں کو (کہ) بہتی ہیں انسؤ وں سے (اس وجہ) سے جو انہوں نے پہچانا حق کو وہ کہتے ہیں اے ہمارے رب! ہم ایمان لائے ہیں پس تو لکھ لے ہمیں گواہی دینے والوں کے ساتھ ۔",
         "English" : "When they hear what has been sent down to the Messenger, you will see their eyes overflowing with tears because of the truth they have recognized. They say, :Our Lord, we have come to believe. So, record us along with those who bear witness."
       },
       {
         "ayet_no" : 84,
         "arbi" : "وَمَا لَنَا لَا نُؤْمِنُ بِاللّٰهِ وَمَا جَاۗءَنَا مِنَ الْحَقِّ ۙ وَنَطْمَعُ اَنْ يُّدْخِلَنَا رَبُّنَا مَعَ الْقَوْمِ الصّٰلِحِيْنَ",
         "Urdu" : "اور کیا ہے ہم کو (کہ)ہم ایمان نہ لائیں اللہ پر اور (اس پر) جو آیا ہے ہمارے پاس حق سے اور ہم امید رکھتے ہیں کہ داخل کرے گا ہمیں ہمارا رب نیک لوگوں کے ساتھ(جنت میں)",
         "English" : "What excuse do we have if we do not believe in Allah and in the truth that has come to us, while we hope that our Lord will admit us to the company of the righteous people?"
       },
       {
         "ayet_no" : 85,
         "arbi" : "فَاَثَابَهُمُ اللّٰهُ بِمَا قَالُوْا جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْھٰرُ خٰلِدِيْنَ فِيْهَا ۭوَذٰلِكَ جَزَاۗءُ الْمُحْسِنِيْنَ",
         "Urdu" : "تو ثواب دیا ان کو اللہ نے اس کے بدلے جو انہوں نے کہا باغات کا (کہ)چلتی ہیں ان کے نیچے سے نہریں وہ ہمیشہ رہنے والے ہیں ان میں اور یہ بدلہ ہے نیکی کرنیوالوں کا ۔",
         "English" : "So, because of what they said, Allah has awarded them gardens beneath which rivers flow, wherein they will live forever. That is the reward of those who are good in their deeds."
       },
       {
         "ayet_no" : 86,
         "arbi" : "وَالَّذِيْنَ كَفَرُوْا وَكَذَّبُوْا بِاٰيٰتِنَآ اُولٰۗىِٕكَ اَصْحٰبُ الْجَــحِيْمِ",
         "Urdu" : "اور وہ لوگ جنہوں نے کفر کیا اور جھٹلایا ہماری آیات کو وہ لوگ اہل دوزخ ہیں ۔",
         "English" : "But those who disbelieved and denied Our signs, they are the people of the Fire."
       },
       {
         "ayet_no" : 87,
         "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوْا لَا تُحَرِّمُوْا طَيِّبٰتِ مَآ اَحَلَّ اللّٰهُ لَكُمْ وَلَا تَعْتَدُوْا ۭاِنَّ اللّٰهَ لَا يُحِبُّ الْمُعْتَدِيْنَ",
         "Urdu" : "اے وہ لوگو! جو ایمان لائے ہو مت حرام ٹھہراؤ (ان) پاکیزہ چیزوں کو جو حلال کی ہیں اللہ نے تمہارے لیے اور مت تم حد سے بڑھو، بیشک اللہ نہیں پسند کرتا حد سے بڑھنے والوں کو",
         "English" : "O you who believe, do not hold as unlawful the good things that Allah has made lawful for you, and do not transgress. Verily, Allah does not like the transgressors."
       },
       {
         "ayet_no" : 88,
         "arbi" : "وَكُلُوْا مِمَّا رَزَقَكُمُ اللّٰهُ حَلٰلًا طَيِّبًا  ۠وَّاتَّقُوا اللّٰهَ الَّذِيْٓ اَنْتُمْ بِهٖ مُؤْمِنُوْنَ",
         "Urdu" : "حلال (جو) پاکیزہ ہے، اور اللہ سے ڈرو جو (کہ) تم اس پر ایمان لانے والے ہو ۔",
         "English" : "Eat from what Allah has provided you as good and lawful, and fear Allah in whom you believe."
       },
       {
         "ayet_no" : 89,
         "arbi" : "لَا يُؤَاخِذُكُمُ اللّٰهُ بِاللَّغْوِ فِيْٓ اَيْمَانِكُمْ وَلٰكِنْ يُّؤَاخِذُكُمْ بِمَا عَقَّدْتُّمُ الْاَيْمَانَ ۚ فَكَفَّارَتُهٗٓ اِطْعَامُ عَشَرَةِ مَسٰكِيْنَ مِنْ اَوْسَطِ مَا تُطْعِمُوْنَ اَهْلِيْكُمْ اَوْ كِسْوَتُهُمْ اَوْ تَحْرِيْرُ رَقَبَةٍ ۭ فَمَنْ لَّمْ يَجِدْ فَصِيَامُ ثَلٰثَةِ اَيَّامٍ ۭذٰلِكَ كَفَّارَةُ اَيْمَانِكُمْ اِذَا حَلَفْتُمْ ۭ وَاحْفَظُوْٓا اَيْمَانَكُمْ ۭ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَكُمْ اٰيٰتِهِ لَعَلَّكُمْ تَشْكُرُوْنَ",
         "Urdu" : "نہیں مواخذہ فرمائے گا اللہ تمہارا لغو(قسموں) کا تمہاری قسموں میں اور لیکن وہ مواخذہ فرمائے گا تمہارا ان پر جو تم نے پختہ (قصدا)قسمیں کھائیں تو اس کا کفارہ ہے دس مسکینوں کو کھانا کھلانا اوسط (درجے)کا جو تم کھلاتے ہو اپنے گھروالوں کو یا کپڑے پہنانا ہے ان کو یا گردن آزاد کرنا ہے پس جو نہ پائے تو روزے رکھنا ہے تین دن یہ کفارہ ہے تمہاری قسموں کا جب تم قسمیں کھاؤ اور حفاظت کیا کرواپنی قسموں کی اسی طرح کھول کر بیان کرتا ہے اللہ تمہارے لیےاپنی آیات تاکہ تم شکر گزار بنو ۔",
         "English" : "Allah does not hold you accountable for your laghw (ineffectual) oaths, but He does hold you accountable for the oath with which you have bound yourself. Its expiation is to feed ten poor persons at an average of what you feed your family with, or to clothe them, or to free a slave. However, if someone cannot afford, he has to fast for three days. That is expiation for the oaths that you have sworn. Take care of your oaths. That is how Allah makes His signs clear to you, so that you may be grateful."
       },
       {
         "ayet_no" : 90,
         "arbi" : "يٰٓاَيُّھَاالَّذِيْنَ اٰمَنُوْٓا اِنَّمَا الْخَمْرُ وَالْمَيْسِرُ وَالْاَنْصَابُ وَالْاَزْلَامُ رِجْسٌ مِّنْ عَمَلِ الشَّيْطٰنِ فَاجْتَنِبُوْهُ لَعَلَّكُمْ تُفْلِحُوْنَ",
         "Urdu" : "اے وہ لوگو جو ایمان لائے ہو درحقیقت شراب اور جوا اور بت اور قرعہ کے تیر(سب) ناپاک (اور) شیطان کے رعمل سے ہیں پس بچو ان سے تاکہ تم فلاح پاجاؤ ۔",
         "English" : "O you who believe! Wine, gambling, altars and divining arrows are filth, made up by Satan. Therefore, refrain from it, so that you may be successful."
       },
       {
         "ayet_no" : 91,
         "arbi" : "اِنَّمَا يُرِيْدُ الشَّيْطٰنُ اَنْ يُّوْقِعَ بَيْنَكُمُ الْعَدَاوَةَ وَالْبَغْضَاۗءَ فِي الْخَمْرِ وَالْمَيْسِرِ وَيَصُدَّكُمْ عَنْ ذِكْرِ اللّٰهِ وَعَنِ الصَّلٰوةِ ۚ فَهَلْ اَنْتُمْ مُّنْتَهُوْنَ",
         "Urdu" : "درحقیقت شیطان تو چاہتا ہے کہ وہ ڈال دے تمہارے درمیان دشمنی اور بغض شراب اور جوئے میں (ڈال کر) اور وہ روک دے تمہیں اللہ کے ذکر سے اور نماز سے تو کیا تم (ان چیزوں سے) باز انے والے ہو ؟",
         "English" : "Satan wishes only to plant enmity and malice between you through wine and gambling, and to prevent you from the remembrance of Allah and from Salah. Would you, then, abstain?"
       },
       {
         "ayet_no" : 92,
         "arbi" : "وَاَطِيْعُوا اللّٰهَ وَاَطِيْعُوا الرَّسُوْلَ وَاحْذَرُوْا   ۚ فَاِنْ تَوَلَّيْتُمْ فَاعْلَمُوْٓا اَنَّمَا عَلٰي رَسُوْلِنَا الْبَلٰغُ الْمُبِيْنُ",
         "Urdu" : "اور اطاعت کرو اللہ کی اور اطاعت کرو رسول کی اور بچو (جوئے اور شراب وغیرہ سے) پھر اگر منہ موڑا تم نے تو جان لو درحقیقت ہمارے رسول پر پہنچادینا ہے واضح طور پر",
         "English" : "Obey Allah, obey the Messenger, and be heedful. If you still turn back, be assured that the duty of Our Messenger is only to convey the Message clearly."
       },
       {
         "ayet_no" : 93,
         "arbi" : "لَيْسَ عَلَي الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ جُنَاحٌ فِيْمَا طَعِمُوْٓا اِذَا مَا اتَّقَوْا وَّاٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ ثُمَّ اتَّقَوْا وَّاٰمَنُوْا ثُمَّ اتَّقَوْا وَّاَحْسَنُوْا ۭ وَاللّٰهُ يُحِبُّ الْمُحْسِنِيْنَ",
         "Urdu" : "نہیں ہے ان لوگوں پر جو ایمان لائے اور انہوں نے نیک اعمال کئے کوئی گناہ (اس بارے) میں جو وہ کھاچکے جبکہ وہ بچے رہے شرک سے اور وہ ایمان لائے اور نیک اعمال کرتے رہے پھر وہ بچے رہے (حرام چیزوں سے) اور ایمن پر قائم رہے پھر انہوں نے تقوی اختیار کیا اور نیک کام کیے اور اللہ محبت رکھتا ہے نیکی کرنیوالوں سے ۔",
         "English" : "There is no sin, for those who believe and do good deeds, in what they might have partaken earlier, if they fear Allah, and believe, and do good deeds; and again fear Allah, and believe, and still again fear Allah and do good deeds. Allah loves those who are good in their deeds."
       },
       {
         "ayet_no" : 94,
         "arbi" : "يٰٓاَيُّھَاالَّذِيْنَ اٰمَنُوْا لَيَبْلُوَنَّكُمُ اللّٰهُ بِشَيْءٍ مِّنَ الصَّيْدِ تَـنَالُهٗٓ اَيْدِيْكُمْ وَرِمَاحُكُمْ لِيَعْلَمَ اللّٰهُ مَنْ يَّخَافُهٗ بِالْغَيْبِ ۚ فَمَنِ اعْتَدٰي بَعْدَ ذٰلِكَ فَلَهٗ عَذَابٌ اَلِيْمٌ",
         "Urdu" : "اے وہ لوگو! جو ایمان لائے ہو۔ ضرور بالضرور آزمائے گا تمہیں اللہ کسی چیز سے شکار (میں) سے (کہ) پاسکیں گے اسے تمہارے ہاتھ اور تمھارے نیزے تاکہ معلوم کرے اللہ (کہ) کون ڈرتا ہے اس سے غائبانہ پس جو زیادتی کرے اس کے بعد تو اس کے لیے دردناک عذاب ہے ۔",
         "English" : "O you who believe, Allah shall certainly test you with some of the game coming in the range of your hands and spears, so that Allah may know those who fear Him, even though He is Unseen. Whoever transgresses the limit after all this, for him there is a painful punishment."
       },
       {
         "ayet_no" : 95,
         "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوْا لَا تَقْتُلُوا الصَّيْدَ وَاَنْتُمْ حُرُمٌ ۭ وَمَنْ قَتَلَهٗ مِنْكُمْ مُّتَعَمِّدًا فَجَــزَاۗءٌ مِّثْلُ مَا قَتَلَ مِنَ النَّعَمِ يَحْكُمُ بِهٖ ذَوَا عَدْلٍ مِّنْكُمْ هَدْيًۢا بٰلِــغَ الْكَعْبَةِ اَوْ كَفَّارَةٌ طَعَامُ مَسٰكِيْنَ اَوْ عَدْلُ ذٰلِكَ صِيَامًا لِّيَذُوْقَ وَبَالَ اَمْرِهٖ ۭعَفَا اللّٰهُ عَمَّا سَلَفَ ۭ وَمَنْ عَادَ فَيَنْتَقِمُ اللّٰهُ مِنْهُ ۭ وَاللّٰهُ عَزِيْزٌ ذُو انْتِقَامٍ",
         "Urdu" : "اے وہ لوگو! جو ایمان لائے ہو، نہ مارو شکار اس حال میں کہ تم احرام میں ہو اور جو مارڈالے گا اسے تم میں سے جان بوجھ کر تو بدلہ دینا ہے اس جیسا جو اس نے مارڈالا ہے چوپایوں میں سے فیصلہ کریں اس کا دو عدل والے تم میں سے، قربانی ہے پہنچنے والی کعبہ کو یا کفارہ ہے مسکینوں کو کھانا کھلانا یا اس کے برابر روزے رکھنا ہے۔ تاکہ وہ چکھے اپنے کیے کی سزا (کا مزہ) معاف کردیا ہے اللہ نے اس کو جو پہلے گزر چکا اور جو دوبارہ کرے گا تو انتقام لے گا اللہ اس سے اور اللہ غالب ہے انتقام لینے والا ہے",
         "English" : "O you who believe, do not kill game when you are in IHram (state of consecration for Hajj or _Umrah). If someone from among you kills it deliberately, then compensation (will be required) from cattle equal to what one has killed, according to the judgement of two just men from among you, as an offering due to reach the Ka‘bah, or an expiation, that is, to feed the poor, or its equal in fasts, so that he may taste the punishment of what he did. Allah has forgiven what has passed, but whoever does it again, Allah shall subject him to retribution. Allah is Mighty, Lord of Retribution."
       },
       {
         "ayet_no" : 96,
         "arbi" : "اُحِلَّ لَكُمْ صَيْدُ الْبَحْرِ وَطَعَامُهٗ مَتَاعًا لَّكُمْ وَلِلسَّيَّارَةِ ۚ وَحُرِّمَ عَلَيْكُمْ صَيْدُ الْبَرِّ مَا دُمْتُمْ حُرُمًا ۭ وَاتَّقُوا اللّٰهَ الَّذِيْٓ اِلَيْهِ تُحْشَرُوْنَ",
         "Urdu" : "حلال کیا گیا ہے تمہارے لیے سمندر کا شکار (احرام کی حالت میں) اور اس کا کھانا (بھی) اور حرام کیا گیا ہے تم پر خشکی کا شکار جب تک تم رہو احرام کی حالت میں اور ڈرتے رہو اللہ سے جو (کہ) اسی کی طرف تم اکٹھے کئے جاؤ گے ۔",
         "English" : "Made lawful for you is the game of the sea and eating thereof, as a benefit for you and for travellers. But the game of the land has been made unlawful for you as long as you are in the state of IHram. Fear Allah (the One) towards Whom you are to be brought together."
       },
       {
         "ayet_no" : 97,
         "arbi" : "جَعَلَ اللّٰهُ الْكَعْبَةَ الْبَيْتَ الْحَرَامَ قِــيٰمًا لِّلنَّاسِ وَالشَّهْرَ الْحَرَامَ وَالْهَدْيَ وَالْقَلَاۗىِٕدَ ۭذٰلِكَ لِتَعْلَمُوْٓا اَنَّ اللّٰهَ يَعْلَمُ مَا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ وَاَنَّ اللّٰهَ بِكُلِّ شَيْءٍ عَلِيْمٌ",
         "Urdu" : "بنایا ہے اللہ نے کعبہ کو (جو) حرمت والا گھر ہے قائم رہنے کا باعث لوگوں کیلئے اور حرمت والے مہینوں کو اور قربانی کو اور پٹے والے جانوروں کو یہ (اس لیے) تاکہ تم جان لو کہ بیشک اللہ جانتا ہے جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے اور بیشک اللہ ہر چیز کو خوب جاننے والا ہے ۔",
         "English" : "Allah has made the Ka‘bah, the Sacred House, a source of stability for people, and also the sacred month and the sacrificial animal and the garlands. All this is because you may learn that Allah knows what is in the heavens and what is in the earth. Allah is All-Knowing in respect of everything."
       },
       {
         "ayet_no" : 98,
         "arbi" : "اِعْلَمُوْٓا اَنَّ اللّٰهَ شَدِيْدُ الْعِقَابِ وَاَنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ",
         "Urdu" : "جان لو کہ بیشک اللہ سخت عذاب (دینے والا) ہے اور (یہ) کہ بیشک خوب بخشنے والا بڑا مہربان ہے ۔",
         "English" : "Be sure that Allah is severe in punishment and that Allah is Very-Forgiving, Very-Merciful."
       },
       {
         "ayet_no" : 99,
         "arbi" : "مَا عَلَي الرَّسُوْلِ اِلَّا الْبَلٰغُ ۭوَاللّٰهُ يَعْلَمُ مَا تُبْدُوْنَ وَمَا تَكْتُمُوْنَ",
         "Urdu" : "نہیں ہے رسول پر مگر پہنچا دینا اور اللہ جانتا ہے جو تم ظاہر کرتے ہو اور جو تم (سینوں میں) چھپاتے ہو ۔",
         "English" : "The duty of Our Messenger is only to convey the Message. Allah knows what you disclose and what you conceal."
       },
       {
         "ayet_no" : 100,
         "arbi" : "قُلْ لَّا يَسْتَوِي الْخَبِيْثُ وَالطَّيِّبُ وَلَوْ اَعْجَبَكَ كَثْرَةُ الْخَبِيْثِ ۚ فَاتَّقُوا اللّٰهَ يٰٓاُولِي الْاَلْبَابِ لَعَلَّكُمْ تُفْلِحُوْنَ",
         "Urdu" : "کہہ دو نہیں برابر ہوسکتیں ناپاک اور پاک (چیزیں) اور اگرچہ بھلی لگے آپ کو ناپاک کی کثرت تو ڈرتے رہو اللہ سے اے عقل والو! تاکہ تم فلاح پا جاؤ ۔",
         "English" : "Say, :The evil and the good are not equal, even though the abundance of (what is) evil may attract you. So, fear Allah, O people of understanding, so that you may be successful."
       },
       {
         "ayet_no" : 101,
         "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوْا لَا تَسْــــَٔـلُوْا عَنْ اَشْيَاۗءَ اِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ ۚ وَاِنْ تَسْــــَٔـلُوْا عَنْهَا حِيْنَ يُنَزَّلُ الْقُرْاٰنُ تُبْدَ لَكُمْ ۭعَفَا اللّٰهُ عَنْهَا ۭ وَاللّٰهُ غَفُوْرٌ حَلِيْمٌ",
         "Urdu" : "اے وہ لوگو! جو ایمان لائے ہو مت پوچھو (ایسی) چیزوں کے بارے میں اگر وہ ظاہر کردی جائیں تمہارے لیے بری لگیں تمہیں اور اگر تم پوچھوگے ان کے بارے میں ایسے وقت جب قران اتارا جا رہا ہو(تو) وہ ظاہر کردی جائیں گی تمہارے لیے معاف کردیا ہے اللہ نے اس سے (جو اب تک ہوچکا) اور اللہ بخشنے والا بردبار ہے ۔",
         "English" : "O you who believe, do not ask about things which, if disclosed, would displease you. If you ask about them while the Qur‘an is being revealed, they will be disclosed to you. Allah has pardoned you for it. Allah is Most-Forgiving, Forbearing."
       },
       {
         "ayet_no" : 102,
         "arbi" : "قَدْ سَاَلَهَا قَوْمٌ مِّنْ قَبْلِكُمْ ثُمَّ اَصْبَحُوْا بِهَا كٰفِرِيْنَ",
         "Urdu" : "یقینا سوال کیا ان کا ایک قوم نے تم سے پہلے پھر ہوگئے ان کا انکار کرنے والے ۔",
         "English" : "People before you asked such questions, and then, as a result, became disbelievers."
       },
       {
         "ayet_no" : 103,
         "arbi" : "مَا جَعَلَ اللّٰهُ مِنْۢ بَحِيْرَةٍ وَّلَا سَاۗىِٕبَةٍ وَّلَا وَصِيْلَةٍ وَّلَا حَامٍ ۙ وَّلٰكِنَّ الَّذِيْنَ كَفَرُوْا يَفْتَرُوْنَ عَلَي اللّٰهِ الْكَذِبَ ۭ وَاَكْثَرُهُمْ لَا يَعْقِلُوْنَ",
         "Urdu" : "نہیں بنایا اللہ نے (کوئی چیز) بحیرہ کو اور نہ سائبہ کو اور نہ وصیلہ کو اور نہ حام کو اور لیکن وہ لوگ جنہوں نے کفر کیا وہ باندھتے ہیں اللہ پر جھوٹ، اور ان میں سے اکثر عقل نہیں رکھتے ۔",
         "English" : "Allah has made no BaHirah, no Sa‘ibah, no WaSilah and no Hami (names of animals dedicated to idols on different grounds). But those who disbelieve coin a lie against Allah, and most of them do not understand."
       },
       {
         "ayet_no" : 104,
         "arbi" : "وَاِذَا قِيْلَ لَهُمْ تَعَالَوْا اِلٰى مَآ اَنْزَلَ اللّٰهُ وَاِلَى الرَّسُوْلِ قَالُوْا حَسْبُنَا مَا وَجَدْنَا عَلَيْهِ اٰبَاۗءَنَا ۭ اَوَلَوْ كَانَ اٰبَاۗؤُهُمْ لَا يَعْلَمُوْنَ شَـيْــــًٔـا وَّلَا يَهْتَدُوْنَ",
         "Urdu" : "When it is said to them, :Come to what Allah has sent down, and to the Messenger; they say, :Sufficient for us is that on which we have found our forefathers. Is it so, even though their forefathers knew nothing, and had no guidance either?",
         "English" : "اور جب کہا جائے ان سے کہ آؤ اس کی طرف جو اللہ نے اتارا ہے اور رسول کی طرف (تو) کہتے ہیں کافی ہے ہمیں (وہی) جو (کہ) پایا ہم نے اس پر اپنے باپ دادا کو اور کیا اگرچہ ہوں ان کے باپ دادا کچھ نہ جانتے اور نہ وہ راہ راست پر ہوں ۔"
       },
       {
         "ayet_no" : 105,
         "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوْا عَلَيْكُمْ اَنْفُسَكُمْ ۚلَا يَضُرُّكُمْ مَنْ ضَلَّ اِذَا اهْتَدَيْتُمْ ۭ اِلَى اللّٰهِ مَرْجِعُكُمْ جَمِيْعًا فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُوْنَ",
         "Urdu" : "اے وہ لوگو! جو ایمان لائے ہو لازم ہے تم پر اپنے نفسوں (کی فکر کرنا) نہیں نقصان پہنچائے گا تمہیں جو گمراہ ہوجائے جبکہ تم ہدایت پر رہو۔اللہ کی طرف لوٹنا ہے تم سب کا پھر وہ خبر دے گا تمہیں اس کی جو تم تھے کیا کرتے ۔",
         "English" : "O you who believe, take care of your own selves. The one who has gone astray cannot harm you, if you are on the right path. To Allah all of you have to return. Then He will tell you what you have been doing."
       },
       {
         "ayet_no" : 106,
         "arbi" : "يٰٓاَيُّھَاالَّذِيْنَ اٰمَنُوْا شَهَادَةُ بَيْنِكُمْ اِذَا حَضَرَ اَحَدَكُمُ الْمَوْتُ حِيْنَ الْوَصِيَّةِ اثْنٰنِ ذَوَا عَدْلٍ مِّنْكُمْ اَوْ اٰخَرٰنِ مِنْ غَيْرِكُمْ اِنْ اَنْتُمْ ضَرَبْتُمْ فِي الْاَرْضِ فَاَصَابَتْكُمْ مُّصِيْبَةُ الْمَوْتِ ۭ تَحْبِسُوْنَهُمَا مِنْۢ بَعْدِ الصَّلٰوةِ فَيُقْسِمٰنِ بِاللّٰهِ اِنِ ارْتَبْتُمْ لَا نَشْتَرِيْ بِهٖ ثَـمَنًا وَّلَوْ كَانَ ذَا قُرْبٰى ۙ وَلَا نَكْتُمُ شَهَادَةَ  ۙاللّٰهِ اِنَّآ اِذًا لَّمِنَ الْاٰثِمِيْنَ",
         "Urdu" : "اے وہ لوگو جو ایمان لائے ہو! گواہی (کا اصول) تمہارے درمیان (یہ ہے کہ) جب حاضر ہونے لگے تم میں سے کسی ایک پر موت (تو گواہ بنالے) وصیت کے وقت دو (مردوں)کو دو عدل والے (جو) تم (مسلمانوں )میں سے (معتبر)ہوں یا دوسرے دو ہوں تمہارے علاوہ (غیرمسلموں) میں سے اگر تم سفر پر نکلے ہو زمین میں تو پہنچے تمہیں موت کی مصیبت (تو) تم روکو ان دونوں کو نماز کے بعد پس وہ دونوں قسمیں کھائیں اللہ کی (یہ اس صورت میں ہوگا) اگر تمہیں شک ہو (وہ دونوں کہیں) نہیں ہم بدلے میں لیں گے اس (قسم) کے کوئی قیمت اور اگرچہ وہ ہو قرابت والا اور نہیں ہم چھپائیں گے اللہ کی گواہی کو (اگر ایسا کریں تو) بیشک ہم تب ضرور گناہگاروں میں سے ہونگے",
         "English" : "O you who believe, when death draws near one of you, that is, at the time of making a will, the evidence (recognized) between you shall be of two witnesses from among you, or of two others not from you, if you are travelling on the earth and the trauma of death visits you. (Then) you shall detain them after the prayer, if you have some doubt, and they shall swear by Allah, :We shall not take a price for it, even if there be a relative; and we shall not conceal the evidence (as due) of Allah, otherwise we should certainly be among the sinners."
       },
       {
         "ayet_no" : 107,
         "arbi" : "فَاِنْ عُثِرَ عَلٰٓي اَنَّهُمَا اسْتَحَقَّآ اِثْمًا فَاٰخَرٰنِ يَقُوْمٰنِ مَقَامَهُمَا مِنَ الَّذِيْنَ اسْتَحَقَّ عَلَيْهِمُ الْاَوْلَيٰنِ فَيُقْسِمٰنِ بِاللّٰهِ لَشَهَادَتُنَآ اَحَقُّ مِنْ شَهَادَتِهِمَا وَمَا اعْتَدَيْنَآ ڮ اِنَّآ اِذًا لَّمِنَ الظّٰلِمِيْنَ",
         "Urdu" : "پھر اگر معلوم ہوجائے کہ بیشک وہ دونوں مستحق ہوئے ہیں گناہ کے جھوٹ بول کر تو دوسرے دو کھڑے ہوں ان دونوں کی جگہ ان لوگوں میں سے جن کی حق تلفی ہوئی جن کی، دونوں قریبی ہوں (میت کے) تو وہ دونوں قسمیں کھائیں اللہ کی (کہ) یقینا ہماری گواہی زیادہ سچی ہے ان دونوں کی گواہی سے اور نہیں ہم نے کوئی زیادتی کی، بیشک ہم تب ضرور ظالموں میں سے (ہوجائیں گے)",
         "English" : "Then, if it is discovered that the two had rendered themselves liable to a sin, then, in their place shall stand two others, closest of those whose right has been taken away, and they shall swear by Allah, :Our evidence is more truthful than their evidence, and we have not transgressed; otherwise we should be among the unjust."
       },
       {
         "ayet_no" : 108,
         "arbi" : "ذٰلِكَ اَدْنٰٓي اَنْ يَّاْتُوْا بِالشَّهَادَةِ عَلٰي وَجْهِهَآ اَوْ يَخَافُوْٓا اَنْ تُرَدَّ اَيْمَانٌۢ بَعْدَ اَيْمَانِهِمْ ۭوَاتَّقُوا اللّٰهَ وَاسْمَعُوْا  ۭ وَاللّٰهُ لَا يَهْدِي الْقَوْمَ الْفٰسِقِيْنَ",
         "Urdu" : "یہ زیادہ قریب کہ یہ لوگ لائیں گواہی کو اس کے صحیح رخ پر (ٹھیک ٹھیک)یا وہ ڈریں (اس بات سے)کہ رد کردی جائیں گی (ہماری) قسمیں ان کی قسموں کے بعد اور تم الہ سے ڈرو اور سنو! اللہ تعالی (زبردستی) ہدایت نہیں دیتا نافرمان قوم کو ۔",
         "English" : "Thus, it is more likely that the former people (i.e. the executors of the bequest) will bear witness in its proper way, or they will fear that oaths will be taken in rebuttal of their oaths. Fear Allah and listen. Allah does not lead sinning people to the right path."
       },
       {
         "ayet_no" : 109,
         "arbi" : "يَوْمَ يَجْمَعُ اللّٰهُ الرُّسُلَ فَيَقُوْلُ مَاذَآ اُجِبْتُمْ ۭ قَالُوْا لَا عِلْمَ لَنَا ۭاِنَّكَ اَنْتَ عَلَّامُ الْغُيُوْبِ",
         "Urdu" : "جس دن اکٹھا کرے گا اللہ سب رسولوں کو پھر پوچھے گا (ان سے) کیا جواب دیا گیا تمہیں؟ وہ کہیں گے نہیں کچھ علم ہمیں، بیشک تو (ہی) خوب جاننے والا ہے غیب کی باتوں کا ۔",
         "English" : "(Be mindful of) the day when Allah will assemble the messengers and will say to them, :How were you responded to? They will say, :We have no knowledge. Surely You alone have the full knowledge of all that is unseen."
       },
       {
         "ayet_no" : 110,
         "arbi" : "اِذْ قَالَ اللّٰهُ يٰعِيْسَى ابْنَ مَرْيَمَ اذْكُرْ نِعْمَتِيْ عَلَيْكَ وَعَلٰي وَالِدَتِكَ  ۘ اِذْ اَيَّدْتُّكَ بِرُوْحِ الْقُدُسِ  ۣ تُكَلِّمُ النَّاسَ فِي الْمَهْدِ وَكَهْلًا  ۚ وَاِذْ عَلَّمْتُكَ الْكِتٰبَ وَالْحِكْمَةَ وَالتَّوْرٰىةَ وَالْاِنْجِيْلَ ۚ وَاِذْ تَخْلُقُ مِنَ الطِّيْنِ كَهَيْئَةِ الطَّيْرِ بِاِذْنِيْ فَتَنْفُخُ فِيْهَا فَتَكُوْنُ طَيْرًۢا بِاِذْنِيْ وَتُبْرِئُ الْاَكْـمَهَ وَالْاَبْرَصَ بِاِذْنِيْ  ۚ وَاِذْ تُخْرِجُ الْمَوْتٰى بِاِذْنِيْ   ۚ وَاِذْ كَفَفْتُ بَنِيْٓ اِسْرَاۗءِيْلَ عَنْكَ اِذْ جِئْتَهُمْ بِالْبَيِّنٰتِ فَقَالَ الَّذِيْنَ كَفَرُوْا مِنْهُمْ اِنْ هٰذَآ اِلَّا سِحْرٌ مُّبِيْنٌ",
         "Urdu" : "جب اللہ فرمائے گا اے عیسی بن مریم! یاد کرو میری نعمت کو (جو) تجھ پر (کی)اور تیری والدہ پر(کی) جب میں مدد کی تمہاری روح القدس (جبریل) کے ذریعے تم کلام کرتے تھے لوگوں سے گود میں اور ادھیڑ عمر (میں یکساں) اور جب میں نے سکھائی تمہیں کتاب اور حکمت اور تورات اور انجیل اور جب تو بناتاتھا مٹی سے پرندے جیسی صورت میرے حکم سے، پھر تو پھونک مارتا تھا اس میں تو وہ ہوجاتا پرندہ (سچ مچ) میرے حکم سے اور تو درست کردیتاتھا مادرزاد اندھے اور کوڑھی کو میرے حکم سے اور جب تو نکال کھڑا کرتا تھا مردوں کو (زندہ کرکے) قبرسے میرئے حکم سے اور جب میں نے روک دیا بنی اسرائیل کے ہاتھوں کو تم سے جب تو آیا ان کے پاس کھلی نشانیوں کے ساتھ تو کہا ان لوگوں نے جنہوں نے کفر کیا ان میں سے نہیں یہ مگر واضح جادو ۔",
         "English" : "(Call to mind the time) when Allah will say, :O lsa,, son of Maryam, remember My blessing upon you and upon your mother; when I supported you with the Holy Spirit. You spoke to people while you were still in the cradle and when you grew to middle age. I taught you the Book and the Wisdom, the Torah and the Injil. You created from clay something in the shape of a bird, then you blew on it, and it became a bird by My leave. You cured those born blind and lepers by My leave. You raised the dead by My leave. I kept the children of Isra‘il away from you when you came to them with clear signs, and the disbelievers among them said, :This is nothing but a clear magic."
       },
       {
         "ayet_no" : 111,
         "arbi" : "وَاِذْ اَوْحَيْتُ اِلَى الْحَوَارِيّٖنَ اَنْ اٰمِنُوْا بِيْ وَبِرَسُوْلِيْ ۚ قَالُوْٓا اٰمَنَّا وَاشْهَدْ بِاَنَّنَا مُسْلِمُوْنَ",
         "Urdu" : "اور (یاد کرو) جب میں نے حکم بھیجا حواریوں کی طرف کہ ایمان لاؤ مجھ پر اور میرے رسول پر انہوں نے کہا ہم ایمان لائے اور آپ گواہ رہیں کہ بیشک ہم فرمانبردار ہیں ۔",
         "English" : "When I enjoined upon the disciples (of lsa, ), :Believe in Me and in My Messenger, they said, :We believed. Bear witness that we are the submitting ones."
       },
       {
         "ayet_no" : 112,
         "arbi" : "اِذْ قَالَ الْحَوَارِيُّوْنَ يٰعِيْسَى ابْنَ مَرْيَمَ هَلْ يَسْتَطِيْعُ رَبُّكَ اَنْ يُّنَزِّلَ عَلَيْنَا مَاۗىِٕدَةً مِّنَ السَّمَاۗءِ  ۭ قَالَ اتَّقُوا اللّٰهَ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
         "Urdu" : "(اور یاد کرو) جب کہا حواریوں نے اے اعیسی بن مریم کیا ایسا کرسکتا ہے تیرا رب کہ اتارے ہم پر کھانے کا ایک دسترخوان آسمان سے اس نے کہا اللہ سے ڈرو اگر ہو تم ایمان لانیوالے",
         "English" : "When the disciples said, :O lsa,, son of Maryam, can your Lord send down to us a repast from the heavens? He said, :Fear Allah if you are believers."
       },
       {
         "ayet_no" : 113,
         "arbi" : "قَالُوْا نُرِيْدُ اَنْ نَّاْكُلَ مِنْهَا وَتَطْمَىِٕنَّ قُلُوْبُنَا وَنَعْلَمَ اَنْ قَدْ صَدَقْتَنَا وَنَكُوْنَ عَلَيْهَا مِنَ الشّٰهِدِيْنَ",
         "Urdu" : "انہوں نے کہا ہم چاہتے ہیں کہ ہم کھائیں اس سے اور مطمئن ہوجائیں ہمارے دل اور ہم جان لیں کہ یقینا تونے سچ کہا ہے ہمیں اور ہم ہوجائیں اس نشانی پر گواہی دینے والوں میں سے",
         "English" : "They said, :We wish that we eat from it, and our hearts be satisfied, and we may know for sure that you have told us the truth, and we may become witnesses to it."
       },
       {
         "ayet_no" : 114,
         "arbi" : "قَالَ عِيْسَى ابْنُ مَرْيَمَ اللّٰهُمَّ رَبَّنَآ اَنْزِلْ عَلَيْنَا مَاۗىِٕدَةً مِّنَ السَّمَاۗءِ تَكُوْنُ لَنَا عِيْدًا لِّاَوَّلِنَا وَاٰخِرِنَا وَاٰيَةً مِّنْكَ ۚ وَارْزُقْنَا وَاَنْتَ خَيْرُ الرّٰزِقِيْنَ",
         "Urdu" : "کہا عیسی بن مریم نے (دعا کرتے ہوئے ) اے اللہ اے ہمارے رب اتار ہم پر ایک دسترخوان آسمان سے وہ ہوجائے ہمارے لیے عید ہمارے پہلوں کے لیے اور ہمارے پچھلوں (کے لیے) اور نشانی ہو تیری طرف سے اور رزق دے ہمیں اور تو بہترہے رزق دینے والوں سے",
         "English" : "lsa, son of Maryam said, :O Allah, our Lord, send down to us a repast from heaven which may be a happy occasion for us, for all our generations present and future, and a sign from You, and give us provisions. You are the best Giver of Provisions."
       },
       {
         "ayet_no" : 115,
         "arbi" : "قَالَ اللّٰهُ اِنِّىْ مُنَزِّلُهَا عَلَيْكُمْ ۚ فَمَنْ يَّكْفُرْ بَعْدُ مِنْكُمْ فَاِنِّىْٓ اُعَذِّبُهٗ عَذَابًا لَّآ اُعَذِّبُهٗٓ اَحَدًا مِّنَ الْعٰلَمِيْنَ",
         "Urdu" : "اللہ نے فرمایا بیشک میں نازل کرنے والا ہوں اسے تم پر، پھر جو کفر کرے گا اس کے بعد تم میں سے تو ضرور میں عذاب دوں گا اسے (ایسا)عذاب (کہ) نہیں دونگا میں وہ عذاب کسی ایک کو جہان والوں میں سے ۔",
         "English" : "Allah said, :I am going to send it down to you; but whoever among you disbelieves after that, I shall give him such a punishment as I shall not give to anyone else in all the worlds."
       },
       {
         "ayet_no" : 116,
         "arbi" : "وَاِذْ قَالَ اللّٰهُ يٰعِيْسَى ابْنَ مَرْيَمَ ءَاَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُوْنِيْ وَاُمِّيَ اِلٰــهَيْنِ مِنْ دُوْنِ اللّٰهِ ۭ قَالَ سُبْحٰنَكَ مَا يَكُوْنُ لِيْٓ اَنْ اَقُوْلَ مَا لَيْسَ لِيْ ۤ بِحَقٍّ  ڲ اِنْ كُنْتُ قُلْتُهٗ فَقَدْ عَلِمْتَهٗ  ۭ تَعْلَمُ مَا فِيْ نَفْسِيْ وَلَآ اَعْلَمُ مَا فِيْ نَفْسِكَ ۭاِنَّكَ اَنْتَ عَلَّامُ الْغُيُوْبِ",
         "Urdu" : "اور جب کہے گا اللہ تعالی اے عیسی بن مریم!کیا تونے کہا تھا لوگوں سے(کہ) بنالو مجھے اور میری والدہ دونوں کو معبود اللہ کے سوا؟وہ کہیں گے پاک ہے تو نہیں ہے(مناسب)میرے لیے کہ میں کہتا (وہ بات جس کا مجھے کچھ حق حاصل نہیں اگر میں نے کہی ہوگی یہ بات تو یقینا تو جانتا ہوگا اسے، تو جانتا ہے جو میرے نفس میں ہے اور میں نہیں جانتا جو تیرے نفس میں ہے بیشک تو خوب جاننے والا ہے غیب کی باتوں کو ۔",
         "English" : "And when Allah said, :O lsa,, son of Maryam, did you say to the people: _Take me and my mother as gods beside Allah? He said, :Pure are You, it does not behoove me to say what is not right for me. Had I said it, You would have known it. You know what is in my heart, and I do not know what is in Your‘s. You alone have full knowledge of all that is unseen."
       },
       {
         "ayet_no" : 117,
         "arbi" : "مَا قُلْتُ لَهُمْ اِلَّا مَآ اَمَرْتَنِيْ بِهٖٓ اَنِ اعْبُدُوا اللّٰهَ رَبِّيْ وَرَبَّكُمْ ۚ وَكُنْتُ عَلَيْهِمْ شَهِيْدًا مَّا دُمْتُ فِيْهِمْ ۚ فَلَمَّا تَوَفَّيْتَنِيْ كُنْتَ اَنْتَ الرَّقِيْبَ عَلَيْهِمْ ۭوَاَنْتَ عَلٰي كُلِّ شَيْءٍ شَهِيْدٌ",
         "Urdu" : "نہیں میں نے کہا ان سے مگر(وہی)جو(کہ)تونے حکم دیا مجھےاس کا یہ کہ عبادت کرو اللہ کی (جو) میرا رب ہے اور تمہارا رب ہے اور تھا میں ان پر گواہ (خبر رکھنے والا) جب تک میں رہا ان میں، پھر جب تونے اٹھالیا مجھے (تو)تو ہی تھا نگران ان پر اور تو ہرچیز پر خبردار ہے",
         "English" : "I have not said to them anything but what You have ordered me to say, that is, _Worship Allah, my Lord and your Lord‘ and I was a witness over them as long as I was with them. But when You recalled me, You were the One watching over them. You are a witness over everything."
       },
       {
         "ayet_no" : 118,
         "arbi" : "اِنْ تُعَذِّبْهُمْ فَاِنَّهُمْ عِبَادُكَ ۚ وَاِنْ تَغْفِرْ لَهُمْ فَاِنَّكَ اَنْتَ الْعَزِيْزُ الْحَكِيْمُ",
         "Urdu" : "اگر تو عذاب دے ان کو تو بیشک وہ تیرے بندے ہیں اور اگر تو بخش دے ان کو تو بیشک تو ہی غالب (اور) حکمت والا ہے",
         "English" : "If You punish them, they are Your slaves after all, but if You forgive them, You are the Mighty, the Wise."
       },
       {
         "ayet_no" : 119,
         "arbi" : "قَالَ اللّٰهُ هٰذَا يَوْمُ يَنْفَعُ الصّٰدِقِيْنَ صِدْقُهُمْ ۭ لَهُمْ جَنّٰتٌ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْھٰرُ خٰلِدِيْنَ فِيْهَآ اَبَدًا ۭ رَضِيَ اللّٰهُ عَنْهُمْ وَرَضُوْا عَنْهُ ۭ ذٰلِكَ الْفَوْزُ الْعَظِيْمُ",
         "Urdu" : "اللہ فرمائے گا کہ یہ وہ دن ہے کہ فائدہ دے گی سچوں کو ان کی سچائی ، انکے لیے باغات ہیں کہ چلتی ہیں ان کے نیچے سے نہریں ہمیشہ رہیں گے ان میں ہمیشہ ہمیشہ راضی ہوا اللہ تعالی ان سے اور وہ راضی ہوئے اس سے، یہی بڑی کامیابی ہے ۔",
         "English" : "Allah will say, :This is a day on which the truth of the truthful shall benefit them. For them there are gardens beneath which rivers flow, where they will live forever. Allah is well-pleased with them and they are well-pleased with Him. That is the great achievement."
       },
       {
         "ayet_no" : 120,
         "arbi" : "لِلّٰهِ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ وَمَا فِيْهِنَّ  ۭ وَهُوَ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
         "Urdu" : "اللہ ہی کے لیے بادشاہی ہے آسمانوں اور زمین کی اور جو کچھ ان (کے درمیان) میں ہے، اور وہ ہر چیز پر قدرت رکھنے والا ہے ۔",
         "English" : "To Allah belongs the kingdom of the heavens and the earth and of whatever lies therein, and He is powerful over everything."
       }
     ]
  }
]