[
  {
    "surah_no" : 64,
    "total_ayah" : 18,
    "name" : "Surah e AL-Taghabun",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "يُسَبِّحُ لِلّٰهِ مَا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ ۚ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ ۡ وَهُوَ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
        "Urdu" : "اللہ ہی کی پاکی بیان کر رہا ہے وہ سب کچھ جو کہ آسمانوں میں ہے اور وہ سب کچھ بھی جو کہ زمین میں ہے اسی کے لئے ہے بادشاہی اور اسی کے لئے ہے ہر تعریف اور وہی ہے جسے ہرچیز پر پوری قدرت ہے",
        "English" : "All that is in the heavens and all that is in the earth proclaim Allah‘s purity. To Him belongs the kingdom, and for Him is all praise, and He is powerful over every thing."
      },
      {
        "ayet_no" : 2,
        "arbi" : "هُوَ الَّذِيْ خَلَقَكُمْ فَمِنْكُمْ كَافِرٌ وَّمِنْكُمْ مُّؤْمِنٌ ۭ وَاللّٰهُ بِمَا تَعْمَلُوْنَ بَصِيْرٌ",
        "Urdu" : "وہ وہی ہے جس نے پیدا فرمایا (اپنی قدرت کا ملہ سے) تم سب کو (اے لوگو!) پھر تم میں سے کچھ تو کافر ہیں اور کچھ مومن اور اللہ پوری طرح دیکھتا ہے ان تمام کاموں کو جو تم لوگ کرتے ہو ف۲",
        "English" : "He is the One who created you, then some of you are disbelievers, and some of you are believers. And Allah is Watchful of what you do."
      },
      {
        "ayet_no" : 3,
        "arbi" : "خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ بِالْحَقِّ وَصَوَّرَكُمْ فَاَحْسَنَ صُوَرَكُمْ ۚ وَاِلَيْهِ الْمَصِيْرُ",
        "Urdu" : "اسی نے پیدا فرمایا آسمانوں اور زمین کی اس عظیم الشان کائنات کو حق کے ساتھ اور اس نے صورت گری فرمائی تم سب کی سو کیا ہی عمدہ صورتیں بنائیں اس نے تمہاری اور اسی کی طرف لوٹنا ہے (سب کو اور ہر حال میں)",
        "English" : "He has created the heavens and the earth rightly, and shaped your figures, and made your figures good, and to Him is the final return."
      },
      {
        "ayet_no" : 4,
        "arbi" : "يَعْلَمُ مَا فِي السَّمٰوٰتِ وَالْاَرْضِ وَيَعْلَمُ مَا تُسِرُّوْنَ وَمَا تُعْلِنُوْنَ ۭ وَاللّٰهُ عَلِيْمٌۢ بِذَاتِ الصُّدُوْرِ",
        "Urdu" : "وہ جانتا ہے وہ سب کچھ جو کہ آسمانوں اور زمین میں ہے اور (اسی طرح) وہ جانتا ہے وہ سب کچھ جو کہ تم لوگ چھپا کر کرتے ہو اور وہ سب کچھ بھی جو کہ تم اعلانیہ کرتے ہو اور اللہ پوری طرح جانتا ہے دلوں کی باتوں تک کو",
        "English" : "He knows all that is in the heavens and the earth, and He knows whatever you conceal and whatever you reveal. Allah is fully aware of what lies in the hearts."
      },
      {
        "ayet_no" : 5,
        "arbi" : "اَلَمْ يَاْتِكُمْ نَبَؤُا الَّذِيْنَ كَفَرُوْا مِنْ قَبْلُ ۡ فَذَاقُوْا وَبَالَ اَمْرِهِمْ وَلَهُمْ عَذَابٌ اَلِيْمٌ",
        "Urdu" : "کیا تم لوگوں کو خبر نہیں پہنچی ان لوگوں کی جنہوں نے کفر کیا تم سے پہلے پھر چکھنا پڑا ان کو وبال اپنے کئے کا (اسی دنیا میں) اور ان کے لئے ایک بڑا ہی دردناک عذاب ہے (آخرت میں)",
        "English" : "Did the news of those people not come to you who disbelieved earlier, and tasted (in this world) the evil consequence of their conduct, and for them (in the Hereafter) there is a painful punishment ?"
      },
      {
        "ayet_no" : 6,
        "arbi" : "ذٰلِكَ بِاَنَّهٗ كَانَتْ تَّاْتِيْهِمْ رُسُلُهُمْ بِالْبَيِّنٰتِ فَقَالُوْٓا اَبَشَرٌ يَّهْدُوْنَنَا ۡ فَكَفَرُوْا وَتَوَلَّوْا وَّاسْتَغْنَى اللّٰهُ ۭ وَاللّٰهُ غَنِيٌّ حَمِيْدٌ",
        "Urdu" : "یہ سب کچھ اس لئے کہ ان کے پاس آئے ان کے رسول کھلے دلائل کے ساتھ مگر (اس سب کے باوجود) ان لوگوں نے یہی کہا کہ کیا انسان ہمیں ہدایت دینگے؟ اس طرح انہوں نے کفر ہی کو اپنایا اور روگردانی ہی کی اور اللہ نے بھیاپنی بےنیازی کا معاملہ فرمایا اور اللہ تو ہے ہی (ہر طرح سے اور ہر کسی سے) بےنیاز اور ہر تعریف کا سزاوار (و حق دار)",
        "English" : "That is because their messengers used to bring them clear proofs, but they said, :Shall some mortals give us guidance ? Thus they disbelieved and turned away, and Allah did not care. Allah is All-Independent, Ever-Praised."
      },
      {
        "ayet_no" : 7,
        "arbi" : "زَعَمَ الَّذِيْنَ كَفَرُوْٓا اَنْ لَّنْ يُّبْعَثُوْا   ۭ قُلْ بَلٰى وَرَبِّيْ لَتُبْعَثُنَّ ثُمَّ لَتُـنَبَّؤُنَّ بِمَا عَمِلْتُمْ   ۭ وَذٰلِكَ عَلَي اللّٰهِ يَسِيْرٌ",
        "Urdu" : "کافر لوگوں نے بڑے دعوے سے کہا کہ ان کو ہرگز دوبارہ نہیں اٹھایا جائے گا (سو ان سے) کہو کہ کیوں نہیں؟ میرے رب کی قسم تم سب ضرور بالضرور دوبارہ اٹھائے جاؤ گے پھر تم کو ضرور بتا دئیے جائیں گے وہ سارے کام جو تم لوگ کرتے رہے تھے اور یہ اللہ کے لئے بہت آسان ہے ف۱",
        "English" : "The disbelievers claim that they will never be raised again (after death) . Say, :Why not ? By my Lord, you will be raised again, and then you will be told about what you did. That is so easy for Allah."
      },
      {
        "ayet_no" : 8,
        "arbi" : "فَاٰمِنُوْا بِاللّٰهِ وَرَسُوْلِهٖ وَالنُّوْرِ الَّذِيْٓ اَنْزَلْنَا ۭ وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرٌ",
        "Urdu" : "پس تم ایمان لے آؤ اللہ پر اس کے رسول پر اور اس نور پر جسکو ہم نے اب اتارا ہے اور اللہ کو پوری خبر ہے ان سب کاموں کی جو تم لوگ کرتے ہو",
        "English" : "So, believe in Allah and His Messenger, and in the light We have sent down. And Allah is fully aware of what you do."
      },
      {
        "ayet_no" : 9,
        "arbi" : "يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الْجَمْعِ ذٰلِكَ يَوْمُ التَّغَابُنِ ۭوَمَنْ يُّؤْمِنْۢ بِاللّٰهِ وَيَعْمَلْ صَالِحًا يُّكَفِّرْ عَنْهُ سَـيِّاٰتِهٖ وَيُدْخِلْهُ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَآ اَبَدًا     ۭ ذٰلِكَ الْفَوْزُ الْعَظِيْمُ",
        "Urdu" : "اور (ہمیشہ یاد رکھو اس عظیم الشان اور ہولناک دن کو) جس دن کہ وہ جمع کر دے گا تم سب کو (ایک ہی آواز سے) اجتماع کے اس دن وہ دن ہوگا ہار جیت کے کھلنے کا دن اور (اس روز فیصلہ اس طرح ہوگا کہ) جو کوئی ایمان لایا ہوگا (سچے دل سے) اور اس نے کام بھی کئے ہوں گے نیک تو اللہ مٹا دے گا اس سے اس کی برائیوں کو اور اس کو داخل فرما دے گا (اپنے کرم سے) ایسی عظیم الشان جنتوں میں جن کے نیچے سے بہہ رہی ہوں گی (طرح طرح کی عظیم الشان) نہریں جن میں ہمیشہ رہیں گے ایسے (خوش نصیب) لوگ یہی ہے بڑی کامیابی",
        "English" : "(Be mindful of) the day when He will gather you for the Day of Gathering. That will be the Day of loss and gain. Whoever believes in Allah, and does righteously, He will write off his evil deeds, and will admit him to gardens beneath which rivers flow, where they will live forever. That is the great achievement."
      },
      {
        "ayet_no" : 10,
        "arbi" : "وَالَّذِيْنَ كَفَرُوْا وَكَذَّبُوْا بِاٰيٰتِنَآ اُولٰۗىِٕكَ اَصْحٰبُ النَّارِ خٰلِدِيْنَ فِيْهَا ۭ وَبِئْسَ الْمَصِيْرُ",
        "Urdu" : "اور اس کے برعکس جنہوں نے (زندگی بھر) کفر ہی کیا ہوگا اور انہوں نے جھٹلایا ہوگا ہماری آیتوں کو تو ایسے لوگ دوزخی ہوں گے جس میں انہیں ہمیشہ رہنا ہوگا اور بڑا ہی برا ٹھکانا ہے وہ ف۲",
        "English" : "As for those who disbelieve and reject Our signs, they are the people of the Fire. And it is an evil place to return."
      },
      {
        "ayet_no" : 11,
        "arbi" : "مَآ اَصَابَ مِنْ مُّصِيْبَةٍ اِلَّا بِاِذْنِ اللّٰهِ   ۭ وَمَنْ يُّؤْمِنْۢ بِاللّٰهِ يَهْدِ قَلْبَهٗ   ۭ وَاللّٰهُ بِكُلِّ شَيْءٍ عَلِيْمٌ",
        "Urdu" : "نہیں پہنچتی کوئی مصیبت مگر اللہ ہی کے اذن (و حکم) سے اور جو کوئی (سچے دل سے) ایمان رکھتا ہوگا اللہ پر تو اللہ ہدایت (کے نور) سے نواز دے گا اس کے دل کو اور اللہ ہرچیز کو پوری طرح جانتا ہے",
        "English" : "No calamity befalls (one) , but with the leave of Allah. And whoever believes in Allah, He guides his heart. Allah is All-Knowing about every thing."
      },
      {
        "ayet_no" : 12,
        "arbi" : "وَاَطِيْعُوا اللّٰهَ وَاَطِيْعُوا الرَّسُوْلَ ۚ فَاِنْ تَوَلَّيْتُمْ فَاِنَّمَا عَلٰي رَسُوْلِنَا الْبَلٰغُ الْمُبِيْنُ",
        "Urdu" : "اور فرمانبرداری کرو تم سب لوگ اللہ کی اور اس کے رسول کی پھر اگر تم نے روگردانی ہی کی تو ہمارے رسول (کا کوئی نقصان نہیں کیونکہ ان) کے ذمے تو بس پہنچا دینا ہے کھول کر",
        "English" : "Obey Allah, and obey the Messenger. But if you turn away, then Our Messenger has only to convey the message clearly."
      },
      {
        "ayet_no" : 13,
        "arbi" : "اَللّٰهُ لَآ اِلٰهَ اِلَّا هُوَ   ۭ وَعَلَي اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُوْنَ",
        "Urdu" : "اللہ وہ ہے جس کے سوا کوئی معبود نہیں اور اللہ ہی پر بھروسہ کرنا چاہیے ایمان والوں کو",
        "English" : "Allah is such that there is no god but He. And in Allah alone the believers must place their trust."
      },
      {
        "ayet_no" : 14,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِنَّ مِنْ اَزْوَاجِكُمْ وَاَوْلَادِكُمْ عَدُوًّا لَّكُمْ فَاحْذَرُوْهُمْ ۚ وَاِنْ تَعْفُوْا وَتَصْفَحُوْا وَتَغْفِرُوْا فَاِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ",
        "Urdu" : "اے وہ لوگوں جو ایمان لائے ہو یقینا تمہاری بیویوں اور تمہاری اولادوں میں سے کچھ تمہارے دشمن ہیں پس تم ان سے بچ کر رہا کرو اور اگر تم معاف کر دیا کرو درگزر سے کام لیا کرو اور بخش دیا کرو تو (تمہارے لئے بھی بخشش کی امید ہوسکتی ہے کیونکہ) اللہ تعالیٰ یقینا بڑا ہی بخشنے والا انتہائی مہربان ہے",
        "English" : "O you who believe, among your wives and your children there are some enemies for you, so beware of them. And if you forgive and overlook and pardon, then Allah is Most-Forgiving, Very-Merciful."
      },
      {
        "ayet_no" : 15,
        "arbi" : "اِنَّمَآ اَمْوَالُكُمْ وَاَوْلَادُكُمْ فِتْنَةٌ   ۭوَاللّٰهُ عِنْدَهٗٓ اَجْرٌ عَظِيْمٌ",
        "Urdu" : "سوائے اس کے نہیں کہ تمہارے مال اور تمہاری اولادیں تو محض آزمائش کا سامان ہیں اور اللہ ہی ہے جس کے پاس بڑا عظیم الشان اجر ہے",
        "English" : "Your riches and your children are but a trial. As for Allah, with Him is a great reward."
      },
      {
        "ayet_no" : 16,
        "arbi" : "فَاتَّقُوا اللّٰهَ مَا اسْتَطَعْتُمْ وَاسْمَعُوْا وَاَطِيْعُوْا وَاَنْفِقُوْا خَيْرًا لِّاَنْفُسِكُمْ ۭ وَمَنْ يُّوْقَ شُحَّ نَفْسِهٖ فَاُولٰۗىِٕكَ هُمُ الْمُفْلِحُوْنَ",
        "Urdu" : "پس تم لوگ ڈرتے رہا کرو اللہ سے جتنا کہ تم سے ہو سکے اور تم سنتے اور مانتے رہا کرو اور خرچ بھی کیا کرو (کہ یہ سب کچھ) خود تمہارے ہی لئے بہتر ہے اور جو کوئی بچا لیا گیا اپنے نفس کی تنگی سے تو ایسے ہی لوگ ہیں فلاح پانے والے",
        "English" : "So, observe taqwa (total obedience to Allah in awe of Him) as far as you can, and listen and obey, and spend (in Allah‘s way) , it being good for you. And those who are saved from the greed of their hearts are the successful."
      },
      {
        "ayet_no" : 17,
        "arbi" : "اِنْ تُقْرِضُوا اللّٰهَ قَرْضًا حَسَنًا يُّضٰعِفْهُ لَكُمْ وَيَغْفِرْ لَكُمْ  ۭ وَاللّٰهُ شَكُوْرٌ حَلِيْمٌ",
        "Urdu" : "اگر تم قرض دو گے اللہ (پاک) کو اچھا قرض (اے ایمان والو) تو وہ تمہیں (کئی گنا) بڑھا کر دے گا اور تمہاری بخشش بھی فرمائے گا اور اللہ تو بڑا ہی قدرداں انتہائی بردبار ہے",
        "English" : "If ye lend Unto Allah a goodly loan, He will multiply it Unto you and will forgive you; and Allah is Appreciator, Forbearing."
      },
      {
        "ayet_no" : 18,
        "arbi" : "عٰلِمُ الْغَيْبِ وَالشَّهَادَةِ الْعَزِيْزُ الْحَكِيْمُ",
        "Urdu" : "(ایک برابر) جاننے والا نہاں و عیاں کا بڑا ہی زبردست نہایت ہی حکمت والا",
        "English" : "Knower of the unseen and the seen, the Mighty, the Wise."
      }
    ]
  }
]