[
  {
    "surah_no" : 47,
    "total_ayah" : 38,
    "name" : "Surah e Muhammad (S.A.W)'{P.B.U.H}",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "اَلَّذِيْنَ كَفَرُوْا وَصَدُّوْا عَنْ سَبِيْلِ اللّٰهِ اَضَلَّ اَعْمَالَهُمْ",
        "Urdu" : "جن لوگوں نے کفر کیا اور روکا (دوسروں کو) اللہ کی راہ سے اللہ نے اکارت کر دیا ان کے اعمال کو ف۱",
        "English" : "Those who disbelieved, and prevented (others) from Allah‘s way, He (Allah) has rendered their deeds vain."
      },
      {
        "ayet_no" : 2,
        "arbi" : "وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ وَاٰمَنُوْا بِمَا نُزِّلَ عَلٰي مُحَمَّدٍ وَّهُوَ الْحَقُّ مِنْ رَّبِّهِمْ ۙكَفَّرَ عَنْهُمْ سَيِّاٰتِهِمْ وَاَصْلَحَ بَالَهُمْ",
        "Urdu" : "اور اس کے برعکس جو لوگ (صدقِ دل) سے ایمان لائے اور (اس کے مطابق) انہوں نے کام بھی نیک کئے اور (خاص طور پر) وہ ایمان لائے اس (دین حق) پر جسے اتارا گیا ہے محمد پر اور وہی حق ہے ان کے رب کی جانب سے تو اللہ نے مٹا دیں ان سے ان کی برائیاں اور اس نے درست کر دیا ان کے حال کو ف۲",
        "English" : "And those who believe and work righteous works and believe in that which hath been revealed Unto Muhammad -and it is the truth from their Lord- He shall expiate their misdeeds from them and shall make good their state."
      },
      {
        "ayet_no" : 3,
        "arbi" : "ذٰلِكَ بِاَنَّ الَّذِيْنَ كَفَرُوا اتَّبَعُوا الْبَاطِلَ وَاَنَّ الَّذِيْنَ اٰمَنُوا اتَّبَعُوا الْحَقَّ مِنْ رَّبِّهِمْ ۭ كَذٰلِكَ يَضْرِبُ اللّٰهُ لِلنَّاسِ اَمْثَالَهُمْ",
        "Urdu" : "یہ سب اس لئے کہ جن لوگوں نے کفر کیا انہوں نے (حق کی بجائے) باطل کی پیروی کی اور جو ایمان لائے انہوں نے پیروی کی اس حق کی جو (ان کے پاس) ان کے رب کی جانب سے آیا اللہ اسی طرح (کھول کر) بیان کرتا ہے لوگوں کے لئے ان کی مثالیں",
        "English" : "That is because the disbelievers have followed falsehood, while the believers have followed the truth (that has come) from their Lord. This is how Allah explains their (respective) situations to the people."
      },
      {
        "ayet_no" : 4,
        "arbi" : "فَاِذَا لَقِيْتُمُ الَّذِيْنَ كَفَرُوْا فَضَرْبَ الرِّقَابِ ۭ حَتّىٰٓ اِذَآ اَثْخَنْتُمُوْهُمْ فَشُدُّوا الْوَثَاقَ ڎ فَاِمَّا مَنًّـۢا بَعْدُ وَاِمَّا فِدَاۗءً حَتّٰى تَضَعَ الْحَرْبُ اَوْزَارَهَاڃ ذٰ۩لِكَ ړ وَلَوْ يَشَاۗءُ اللّٰهُ لَانْتَـصَرَ مِنْهُمْ وَلٰكِنْ لِّيَبْلُوَا۟ بَعْضَكُمْ بِبَعْـضٍ ۭ وَالَّذِيْنَ قُتِلُوْا فِيْ سَبِيْلِ اللّٰهِ فَلَنْ يُّضِلَّ اَعْمَالَهُمْ",
        "Urdu" : "پس جب کفار سے تمہارا مقابلہ ہو تو تم ان کی گردنیں مارو یہاں تک کہ جب تم ان کو کچل کر رکھ دو تو پھر مضبوط باندھ لو (قیدیوں کو) پھر اس کے بعد (تمہاری مرضی) یا تو تم احسان کر کے ان کو یونہی چھوڑ دو یا فدیہ لے لو یہاں تک کہ لڑائی ڈال دے اپنے ہتھیار یہ ہے تمہارے کرنے کا کام اور اگر اللہ چاہتا تو ان سے خود ہی نبٹ لیتا مگر (اس نے جہاد فرض کیا) تاکہ وہ تم لوگوں کو آزمائے ایک دوسرے کے ذریعے اور جو لوگ مارے گئے اللہ کی راہ میں تو اللہ کبھی ضائع نہیں فرمائے گا ان کے اعمال کو",
        "English" : "So, when you encounter those who disbelieve, then (aim at) smiting the necks, until when you have broken their strength thoroughly, then tie fast the bond, (by making them captives). Then choose (to release them) either (as) a favour (shown to them,), or (after receiving) ransom, until the war throws down its load of arms. That (is Our command.) If Allah willed, He would have (Himself) subjected them to retribution, but (Allah ordered you to fight,) so that He may test some of you through some others. And those who are killed in Allah‘s way, He will never let their deeds go to waste."
      },
      {
        "ayet_no" : 5,
        "arbi" : "سَيَهْدِيْهِمْ وَيُصْلِحُ بَالَهُمْ",
        "Urdu" : "وہ جلد ہی پہنچا دے گا ان کو (ان کے مقصود تک) اور درست فرما دے گا ان کی حالت کو",
        "English" : "He will guide them and set right their state."
      },
      {
        "ayet_no" : 6,
        "arbi" : "وَيُدْخِلُهُمُ الْجَــنَّةَ عَرَّفَهَا لَهُمْ",
        "Urdu" : "اور وہ ان کو داخل فرما دے گا (اپنے کرم سے) اس جنت میں جس کی پہچان وہ انہیں کرا چکا ہے",
        "English" : "And He shall make them enter the Garden; He shall have made it known,Unto them."
      },
      {
        "ayet_no" : 7,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِنْ تَنْصُرُوا اللّٰهَ يَنْصُرْكُمْ وَيُثَبِّتْ اَقْدَامَكُمْ",
        "Urdu" : "اے وہ لوگوں جو ایمان لائے ہو اگر تم مدد کرو گے اللہ کی تو وہ (قادر مطلق) تمہاری مدد فرمائے گا اور وہ جما دے گا تمہارے قدموں کو",
        "English" : "O you who believe! If you help (in the cause of)Allah, He will help you, and make your foothold firm."
      },
      {
        "ayet_no" : 8,
        "arbi" : "وَالَّذِيْنَ كَفَرُوْا فَتَعْسًا لَّهُمْ وَاَضَلَّ اَعْمَالَهُمْ",
        "Urdu" : "اور جو لوگ اڑے رہے اپنے کفر (وباطل) پر تو ان کے لئے بڑی تباہی ہے اور اللہ نے اکارت کر دیا ان کے اعمال کو",
        "English" : "And those who disbelieve, downfall shall be theirs, and He shall send astray their Works."
      },
      {
        "ayet_no" : 9,
        "arbi" : "ذٰلِكَ بِاَنَّهُمْ كَرِهُوْا مَآ اَنْزَلَ اللّٰهُ فَاَحْبَطَ اَعْمَالَهُمْ",
        "Urdu" : "یہ اس لئے کہ انہوں نے نا پسند کیا اس (دین حق) کو جس کو نازل فرمایا اللہ نے (خود ان کی بہتری و بھلائی کے لئے) اس کے نتیجے میں اللہ نے اکارت فرما دیا ان کے اعمال کو",
        "English" : "That is because they hate what Allah has sent down; therefore Allah has nullified their deeds."
      },
      {
        "ayet_no" : 10,
        "arbi" : "اَفَلَمْ يَسِيْرُوْا فِي الْاَرْضِ فَيَنْظُرُوْا كَيْفَ كَانَ عَاقِبَةُ الَّذِيْنَ مِنْ قَبْلِهِمْ ۭ دَمَّرَ اللّٰهُ عَلَيْهِمْ ۡ وَلِلْكٰفِرِيْنَ اَمْثَالُهَا",
        "Urdu" : "تو کیا ان لوگوں نے خود چل پھر کر دیکھا نہیں (اللہ کی عبرتوں بھری) اس زمین میں کہ کیسا ہوا (مآل و) انجام ان لوگوں کا جو گزر چکے ہیں ان سے پہلے اللہ نے ڈال دیا ان پر (ان کے کئے کرائے کی بناء پر) تباہی کو اور کافروں کے لئے ایسے ہی عذاب (و نتائج) مقرر ہیں ف۱",
        "English" : "Have they not travelled then on the earth so that they might see how hath been the end of those before them! Allah annihilated them. And for the infidels theirs shall be the like fate therefore."
      },
      {
        "ayet_no" : 11,
        "arbi" : "ذٰلِكَ بِاَنَّ اللّٰهَ مَوْلَى الَّذِيْنَ اٰمَنُوْا وَاَنَّ الْكٰفِرِيْنَ لَا مَوْلٰى لَهُمْ",
        "Urdu" : "یہ اس لئے کہ اللہ حامی ہے ان لوگوں کا جو ایمان لائے اور جو کافر ہیں ان کا کوئی بھی حامی نہیں ف۲",
        "English" : "That is because Allah is the supporter of those who believe. As for the disbelievers, there is no supporter for them."
      },
      {
        "ayet_no" : 12,
        "arbi" : "اِنَّ اللّٰهَ يُدْخِلُ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ ۭ وَالَّذِيْنَ كَفَرُوْا يَتَمَتَّعُوْنَ وَيَاْكُلُوْنَ كَمَا تَاْكُلُ الْاَنْعَامُ وَالنَّارُ مَثْوًى لَّهُمْ",
        "Urdu" : "بیشک اللہ داخل فرمائے گا (اپنے کرم سے) ان لوگوں کو جو ایمان لائے اور انہوں نے کام بھی نیک کئے ایسی عظیم الشان جنتوں میں جن کے نیچے بہہ رہی ہوں گی طرح طرح کی عظیم الشان نہریں اور جو لوگ اڑے ہوئے ہیں اپنے کفر (و باطل) پر وہ عیش کر رہے ہیں (اس دنیا میں) اور کھاتے ہیں جیسے چوپائے کھاتے ہیں مگر (واضح رہے کہ) ان کا آخری ٹھکانہ (دوزخ کی دہکتی بھڑکتی) وہ ہولناک آگ ہے ف۳",
        "English" : "Surely, Allah will admit those who believe and do good deeds to the gardens beneath which rivers flow. As for those who disbelieve, they enjoy (the worldly life), and eat as cattle eat, and the Fire is the final abode for them."
      },
      {
        "ayet_no" : 13,
        "arbi" : "وَكَاَيِّنْ مِّنْ قَرْيَةٍ هِىَ اَشَدُّ قُوَّةً مِّنْ قَرْيَتِكَ الَّتِيْٓ اَخْرَجَتْكَ ۚ اَهْلَكْنٰهُمْ فَلَا نَاصِرَ لَهُمْ",
        "Urdu" : "اور کتنی ہی بستیاں ایسی ہوئی ہیں جو قوت میں کہیں بڑھ کر سخت (اور زیادہ) تھیں آپ کی اس بستی سے جس (کے باشندوں) نے نکال دیا آپ کو اپنے یہاں سے ہم نے ان کو ہلاک کر دیا (سو ایسی افتاد پڑنے پر) ان کے لئے کوئی بھی مددگار نہ تھا",
        "English" : "How many a town, stronger in might than your town that has expelled you, have We destroyed! Then, there was none to help them."
      },
      {
        "ayet_no" : 14,
        "arbi" : "اَفَمَنْ كَانَ عَلٰي بَيِّنَةٍ مِّنْ رَّبِّهٖ كَمَنْ زُيِّنَ لَهٗ سُوْۗءُ عَمَلِهٖ وَاتَّبَعُوْٓا اَهْوَاۗءَهُمْ",
        "Urdu" : "تو کیا وہ شخص جو اپنے رب کی طرف سے ایک کھلی نشانی پر ہو ان لوگوں کی طرح ہو سکتا ہے جن کے لئے خوشنما بنا دیا گیا ہو ان کے برے عمل کو ف ۱ اور (اس کے نتیجے میں) وہ (مست اور بےفکر ہو کر) چلے جا رہے ہوں اپنی خواہشات کے پیچھے",
        "English" : "Then, can one who holds on to a clear proof from his Lord be like those for whom their evil deeds are beautified, and who followed their desires ?"
      },
      {
        "ayet_no" : 15,
        "arbi" : "مَثَلُ الْجَنَّةِ الَّتِيْ وُعِدَ الْمُتَّقُوْنَ ۭ فِيْهَآ اَنْهٰرٌ مِّنْ مَّاۗءٍ غَيْرِ اٰسِنٍ ۚ وَاَنْهٰرٌ مِّنْ لَّبَنٍ لَّمْ يَتَغَيَّرْ طَعْمُهٗ ۚ وَاَنْهٰرٌ مِّنْ خَمْرٍ لَّذَّةٍ لِّلشّٰرِبِيْنَ ڬ وَاَنْهٰرٌ مِّنْ عَسَلٍ مُّصَفًّى ۭ وَلَهُمْ فِيْهَا مِنْ كُلِّ الثَّمَرٰتِ وَمَغْفِرَةٌ مِّنْ رَّبِّهِمْ ۭ كَمَنْ هُوَ خَالِدٌ فِي النَّارِ وَسُقُوْا مَاۗءً حَمِيْمًا فَقَطَّعَ اَمْعَاۗءَهُمْ",
        "Urdu" : "شان اس جنت کی جس کا وعدہ پرہیزگار لوگوں سے کیا گیا ہے یہ ہے کہ اس میں نہریں ہوں گی ایسے پانی کی جو کبھی خراب نہ ہو اور نہریں ہوں گی ایسے دودھ کی جس کا مزہ کبھی تبدیل نہ ہو اور نہریں ہوں گی ایسی شراب کی جو سراسر لذت ہوگی پینے والوں کے لئے اور نہریں ہوں گی ایسے شہد کی جس کو صاف کر دیا گیا ہوگا (ہر طرح کی آلائش سے) اور ان کے لئے وہاں ہر طرح کے پھل ہوں گے اور ان کے رب کی طرف سے عظیم الشان بخشش بھی کیا ایسے لوگ ان جیسے ہو سکتے ہیں جن کو ہمیشہ رہنا ہوگا (دوزخ کی دہکتی بھڑکتی) اس ہولناک آگ میں اور ان کو پلایا جائے گا ایسا کھولتا ہوا پانی جو کاٹ کاٹ کر رکھ دے گا ان کی انتڑیوں کو ؟",
        "English" : "(Here is) a description of the Paradise that is promised for the God-fearing! In it there are rivers of water, never spoiling, and rivers of milk the taste of which would not go bad, and rivers of wine, delicious to the drinkers, and rivers of honey, fully purified. And for them there are all sorts of fruits, and forgiveness from their Lord. Are they like those who will live in Fire forever, and will be given boiling water to drink, and it will tear their bowels into pieces ?"
      },
      {
        "ayet_no" : 16,
        "arbi" : "وَمِنْهُمْ مَّنْ يَّسْتَمِعُ اِلَيْكَ ۚ حَتّىٰٓ اِذَا خَرَجُوْا مِنْ عِنْدِكَ قَالُوْا لِلَّذِيْنَ اُوْتُوا الْعِلْمَ مَاذَا قَالَ اٰنِفًا ۣاُولٰۗىِٕكَ الَّذِيْنَ طَبَعَ اللّٰهُ عَلٰي قُلُوْبِهِمْ وَاتَّبَعُوْٓا اَهْوَاۗءَهُمْ",
        "Urdu" : "اور ان لوگوں میں سے کچھ ایسے ہیں جو کان لگا کر سنتے ہیں آپ کی بات کو یہاں تک کہ جب وہ آپ کے پاس سے نکل کر جاتے ہیں تو ان لوگوں سے جنہیں علم دیا گیا ہے پوچھتے ہیں کہ ان صاحب نے ابھی کیا کہا؟ یہ وہ لوگ ہیں جن کے دلوں پر ٹھپہ لگا دیا اللہ نے (ان کیاپنی بدنیتی کی وجہ سے) اور یہ پیچھے لگ گئےاپنی خواہشات کے ف۲",
        "English" : "Among them there are ones who (pretend to) give ear to you, until when they go out from your presence, they say to those who have been given knowledge, :What did he say just now? Those are the ones on whose hearts Allah has put a seal, and they have followed their desires."
      },
      {
        "ayet_no" : 17,
        "arbi" : "وَالَّذِيْنَ اهْتَدَوْا زَادَهُمْ هُدًى وَّاٰتٰىهُمْ تَقْوٰىهُمْ",
        "Urdu" : "اور جو لوگ سرفراز ہوگئے (نور حق) و ہدایت سے اللہ ان کو نوازے گا مزید (نور حق و) ہدایت سے اور اللہ ان کو عطا فرمائے گا ان (کے درجے) کا تقویٰ (و پرہیزگاری)",
        "English" : "As for those who have adopted right path, Allah improves them in guidance, and gives them their piety."
      },
      {
        "ayet_no" : 18,
        "arbi" : "فَهَلْ يَنْظُرُوْنَ اِلَّا السَّاعَةَ اَنْ تَاْتِيَهُمْ بَغْتَةً ۚ فَقَدْ جَاۗءَ اَشْرَاطُهَا ۚ فَاَنّٰى لَهُمْ اِذَا جَاۗءَتْهُمْ ذِكْرٰىهُمْ",
        "Urdu" : "تو کیا اب یہ لوگ (قیامت کی) اس ہولناک گھڑی ہی کے متنظر ہیں کہ وہ ان پر اچانک ٹوٹ پڑے؟ سو اس کی نشانیاں تو آہی چکی ہیں پھر جب وہ خود آپہنچے گی تو پھر ان کو کیا فائدہ اس وقت کے ان کے سمجھنے کا ؟ ف۱",
        "English" : "They are waiting for nothing but for the Hour (of Doom) that it should come upon them suddenly. So, its signs have already come. Then, once it will come upon them, how would they have an opportunity to accept the advice (already) given to them ?"
      },
      {
        "ayet_no" : 19,
        "arbi" : "فَاعْلَمْ اَنَّهٗ لَآ اِلٰهَ اِلَّا اللّٰهُ وَاسْتَغْفِرْ لِذَنْۢبِكَ وَلِلْمُؤْمِنِيْنَ وَالْمُؤْمِنٰتِ ۭ وَاللّٰهُ يَعْلَمُ مُتَقَلَّبَكُمْ وَمَثْوٰىكُمْ",
        "Urdu" : "پس آپ یقین جان رکھو کہ اللہ کے سوا کوئی معبود نہیں اور معافی مانگو اپنے گناہ کے لئے اور ایماندار مردوں اور عورتوں کے لئے بھی اللہ جانتا ہے تم لوگوں کے چلنے پھرنے کو بھی اور تمہارے رہنے سہنے کو بھی ف۲",
        "English" : "So, be assured that there is no god but Allah, and seek forgiveness for your fault, and for (the faults of) the believing men and believing women. And Allah knows your moving from place to place and your permanent abode."
      },
      {
        "ayet_no" : 20,
        "arbi" : "وَيَقُوْلُ الَّذِيْنَ اٰمَنُوْا لَوْلَا نُزِّلَتْ سُوْرَةٌ ۚ فَاِذَآ اُنْزِلَتْ سُوْرَةٌ مُّحْكَمَةٌ وَّذُكِرَ فِيْهَا الْقِتَالُ ۙ رَاَيْتَ الَّذِيْنَ فِيْ قُلُوْبِهِمْ مَّرَضٌ يَّنْظُرُوْنَ اِلَيْكَ نَظَرَ الْمَغْشِيِّ عَلَيْهِ مِنَ الْمَوْتِ ۭ فَاَوْلٰى لَهُمْ",
        "Urdu" : "اور کہتے وہ لوگ جو ایمان لائے کہ کیوں نہیں اتاری جاتی کوئی سورت؟ پھر پر جب اتاری جاتی ہے کوئی ایسی محکم سورت جس میں ذکر ہوتا ہے (جہاد و) قتال کا تو آپ دیکھیں گے ان لوگوں کو جن کے دلوں میں بیماری ہوتی ہے کہ وہ آپ کی طرف ایسے دیکھتے ہیں جیسے کسی پر چھا رہی ہو بےہوشی موت کی سو بڑی خرابی (اور ہلاکت) ہے ایسے لوگوں کے لئے",
        "English" : "And the believers say, :Why has a (new) Surah not been revealed? Then, once an operative Surah is sent down, and fighting (in Allah‘s way) is mentioned in it, you notice those who have disease in their hearts, looking to you like one who is faint because of death. So, destruction is very close to them."
      },
      {
        "ayet_no" : 21,
        "arbi" : "طَاعَةٌ وَّقَوْلٌ مَّعْرُوْفٌ ۣ فَاِذَا عَزَمَ الْاَمْرُ    ۣ فَلَوْ صَدَقُوا اللّٰهَ لَكَانَ خَيْرًا لَّهُمْ",
        "Urdu" : "فرمانبرداری اور بھلی بات کرنا (خود انہی کے لئے بہتر ہے) پھر جب معاملہ طے پا گیا تو اگر یہ لوگ سچے ہوتے اللہ کے ساتھ تو یہ خود انہی کے لئے بہتر ہوتا",
        "English" : "The (reality of their) obedience and (truthfulness of their) speech is fully known (as being mere deception). So, had they been truthful to Allah when the matter had become serious, it would have been much better for them."
      },
      {
        "ayet_no" : 22,
        "arbi" : "فَهَلْ عَسَيْتُمْ اِنْ تَوَلَّيْتُمْ اَنْ تُفْسِدُوْا فِي الْاَرْضِ وَتُـقَطِّعُوْٓا اَرْحَامَكُمْ",
        "Urdu" : "پھر کیا تم لوگوں سے اس کے سوا کوئی اور توقع کی جاسکتی ہے کہ اگر تم پھر گئے (راہ حق و صواب سے) تو تم (خرابی اور) فساد مچاؤ (ہماری) اس زمین میں اور کاٹ ڈالو آ پس کے رشتوں (ناطوں) کو",
        "English" : "So, (O hypocrites,) do you not apprehend that, in case you turn away (from Jihad ), you will spread disorder in the land and will sever your ties of kinship ?"
      },
      {
        "ayet_no" : 23,
        "arbi" : "اُولٰۗىِٕكَ الَّذِيْنَ لَعَنَهُمُ اللّٰهُ فَاَصَمَّهُمْ وَاَعْمٰٓى اَبْصَارَهُمْ",
        "Urdu" : "یہ وہ لوگ ہیں جن پر لعنت (و پھٹکار) کر دی اللہ نے سو اس نے بہرہ کر دیا ان کے کانوں کو اور اندھا کر دیا ان کی انکھوں کو",
        "English" : "Those are the ones whom Allah has cursed; so He has made them deaf, and made their eyes blind."
      },
      {
        "ayet_no" : 24,
        "arbi" : "اَفَلَا يَتَدَبَّرُوْنَ الْقُرْاٰنَ اَمْ عَلٰي قُلُوْبٍ اَقْفَالُهَا",
        "Urdu" : "کیا یہ لوگ غور نہیں کرتے اس قران (عظیم) میں؟ یا (ان کے) دلوں پر ان کے تالے پڑے ہوئے ہیں",
        "English" : "Then, do they not give serious thought to the Qur‘an, or do they have locks on their hearts ?"
      },
      {
        "ayet_no" : 25,
        "arbi" : "اِنَّ الَّذِيْنَ ارْتَدُّوْا عَلٰٓي اَدْبَارِهِمْ مِّنْۢ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَى ۙ الشَّيْطٰنُ سَوَّلَ لَهُمْ ۭ وَاَمْلٰى لَهُمْ",
        "Urdu" : "بیشک جو لوگ پھر گئے (راہِ حق و ہدایت سے) پیٹھ دے کر اس کے بعد کہ پوری طرح واضح ہوگئی تھی ان کے لئے (راہ حق و) ہدایت تو یقینا ان کو فریب میں مبتلا کر دیا شیطان نے اور اس نے پھانس دیا ان کو امیدوں کے ایک جال میں ف۱",
        "English" : "Surely those who turn back after the guidance has appeared to them clearly, it is Satan who has tempted them and involved them in far-fetched fancies."
      },
      {
        "ayet_no" : 26,
        "arbi" : "ذٰلِكَ بِاَنَّهُمْ قَالُوْا لِلَّذِيْنَ كَرِهُوْا مَا نَزَّلَ اللّٰهُ سَنُطِيْعُكُمْ فِيْ بَعْضِ الْاَمْرِ ښ وَاللّٰهُ يَعْلَمُ اِسْرَارَهُمْ",
        "Urdu" : "یہ اس وجہ سے ہوا کہ انہوں نے کہا ان لوگوں سے جو کہ نا پسند کرتے ہیں اس (حق و ہدایت) کو جس کو اللہ نے نازل فرمایا ہے کہ ہم تمہاری بات بخوشی مان لیں گے بعض معاملات میں اور اللہ خوب جانتا ہے ان کی ان راز داریوں (اور خفیہ باتوں) کو",
        "English" : "That is because they say to those who hate that which Allah has revealed, :We will obey you in some respects. And Allah knows their secret talk."
      },
      {
        "ayet_no" : 27,
        "arbi" : "فَكَيْفَ اِذَا تَوَفَّتْهُمُ الْمَلٰۗىِٕكَةُ يَضْرِبُوْنَ وُجُوْهَهُمْ وَاَدْبَارَهُمْ",
        "Urdu" : "پھر کیا حال ہوگا ان کا اس وقت جبکہ فرشتے ان کی جان قبض کریں گے اور وہ مار رہے ہوں گے ان کے مونہوں اور ان کی پیٹھوں پر ؟ ف۲",
        "English" : "So, how (miserable) will they be when the angels will exact their souls, smiting their faces and their backs ?"
      },
      {
        "ayet_no" : 28,
        "arbi" : "ذٰلِكَ بِاَنَّهُمُ اتَّبَعُوْا مَآ اَسْخَـــطَ اللّٰهَ وَكَرِهُوْا رِضْوَانَهٗ فَاَحْبَــطَ اَعْمَالَهُمْ",
        "Urdu" : "یہ اس وجہ سے ہوا کہ انہوں نے پیروی کی اس طریقے کی جو اللہ کی ناراضگی کا باعث تھا اور انہوں نے پسند نہ کیا اس کی رضا (کے راستے) کو جس کے باعث اس نے اکارت کر دیا ان کے سب اعمال کو",
        "English" : "That is because they followed that which has angered Allah, and they disliked His pleasure; therefore He has nullified their deeds."
      },
      {
        "ayet_no" : 29,
        "arbi" : "اَمْ حَسِبَ الَّذِيْنَ فِيْ قُلُوْبِهِمْ مَّرَضٌ اَنْ لَّنْ يُّخْرِجَ اللّٰهُ اَضْغَانَهُمْ",
        "Urdu" : "کیا ان لوگوں نے جن کے دلوں میں روگ ہے (نفاق کا) یہ سمجھ رکھا ہے کہ اللہ ظاہر نہیں کرے گا ان کے دلوں کے کھوٹ ؟",
        "English" : "Do those having malady in their hearts think that Allah will never expose their grudges (against Islam) ?"
      },
      {
        "ayet_no" : 30,
        "arbi" : "وَلَوْ نَشَاۗءُ لَاَرَيْنٰكَهُمْ فَلَعَرَفْتَهُمْ بِسِيْمٰهُمْ ۭ وَلَتَعْرِفَنَّهُمْ فِيْ لَحْنِ الْـقَوْلِ ۭ وَاللّٰهُ يَعْلَمُ اَعْمَالَكُمْ",
        "Urdu" : "حالانکہ ہم اگر چاہیں تو یہ لوگ آپ کو اس طرح دکھا دیں کہ آپ ان کو ان کی صورت سے ہی پوری طرح پہچان لیں اور ان کے طرزِ کلام سے تو آپ صلی اللہ علیہ وسلم ان کو اب بھی ضرور (اور بخوبی) پہچان لیں گے اور اللہ خوب جانتا ہے تم سب لوگوں کے تمام اعمال کو",
        "English" : "Had We willed, We would have shown them to you (by identifying each one of them,) so as you would definitely recognize them by their features. However, you will recognize them by the tone of (their) speech. And Allah knows (all) your deeds."
      },
      {
        "ayet_no" : 31,
        "arbi" : "وَلَنَبْلُوَنَّكُمْ حَتّٰى نَعْلَمَ الْمُجٰهِدِيْنَ مِنْكُمْ وَالصّٰبِرِيْنَ ۙ وَنَبْلُوَا۟ اَخْبَارَكُمْ",
        "Urdu" : "اور ہم ضرور بالضرور آزمائش کریں گے تم سب کی تاکہ ہم دیکھ لیں تم میں سے جہاد کرنے والوں کو بھی اور ان کو بھی جو ثابت قدم رہنے والے ہیں اور تاکہ ہم آزمائش کریں تمہاری خبروں (اور حالتوں) کی",
        "English" : "And We will certainly test you until We know those of you who carry out Jihad (struggle in Allah‘s way) and observe patience, and until We check your episodes."
      },
      {
        "ayet_no" : 32,
        "arbi" : "اِنَّ الَّذِيْنَ كَفَرُوْا وَصَدُّوْا عَنْ سَبِيْلِ اللّٰهِ وَشَاۗقُّوا الرَّسُوْلَ مِنْۢ بَعْدِ مَا تَـبَيَّنَ لَهُمُ الْهُدٰى ۙ لَنْ يَّضُرُّوا اللّٰهَ شَـيْــــًٔا ۭ وَسَيُحْبِطُ اَعْمَالَهُمْ",
        "Urdu" : "بیشک جن لوگوں نے کفر کیا اور (دوسروں کو) روکا اللہ کی راہ سے اور انہوں نے مخالفت کی اللہ کے رسول کی اس کے بعد کہ راہ (حق و) ہدایت ان کے لئے پوری طرح واضح ہو چکی تو وہ یقینا اللہ کا کچھ بھی نقصان نہیں کریں گے اور اللہ اکارت کر دے گا ان کے سب اعمال کو",
        "English" : "Those who disbelieve and prevent (others) from Allah‘s way, and oppose the Messenger, after the Guidance has appeared to them clearly, shall never bring harm to Allah in the least, and He will render their deeds vain."
      },
      {
        "ayet_no" : 33,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اَطِيْعُوا اللّٰهَ وَاَطِيْعُوا الرَّسُوْلَ وَلَا تُبْطِلُوْٓا اَعْمَالَكُمْ",
        "Urdu" : "اے وہ لوگوں جو ایمان لائے ہو حکم مانو تم اللہ کا اور حکم مانو اس کے رسول کا اور مت برباد کرو اپنے اعمال کو ف۱",
        "English" : "O you who believe, obey Allah and obey the Messenger, and do not nullify your deeds."
      },
      {
        "ayet_no" : 34,
        "arbi" : "اِنَّ الَّذِيْنَ كَفَرُوْا وَصَدُّوْا عَنْ سَبِيْلِ اللّٰهِ ثُمَّ مَاتُوْا وَهُمْ كُفَّارٌ فَلَنْ يَّغْفِرَ اللّٰهُ لَهُمْ",
        "Urdu" : "بیشک جن لوگوں نے کفر کیا اور انہوں نے روکا (دوسروں کو) اللہ کی راہ سے پھر (وہ اپنے کفر ہی پر اڑے رہے یہاں تک کہ) وہ مرے بھی کفر ہی کی حالت میں تو یقینا اللہ ان کی کبھی بھی بخشش نہیں فرمائے گا",
        "English" : "Those who disbelieved and prevented (others) from Allah‘s way, then died as disbelievers, Allah will never forgive them."
      },
      {
        "ayet_no" : 35,
        "arbi" : "فَلَا تَهِنُوْا وَتَدْعُوْٓا اِلَى السَّلْمِ ڰ وَاَنْتُمُ الْاَعْلَوْنَ ڰ وَاللّٰهُ مَعَكُمْ وَلَنْ يَّتِرَكُمْ اَعْمَالَكُمْ",
        "Urdu" : "پس (اے مسلمانو !) نہ تو تم سستی دکھاؤ اور نہ ہی صلح کی درخواست کرو کیونکہ غالب بہرحال تم ہی ہو اور اللہ تمہارے ساتھ ہے اور وہ تمہارے اعمال (کے ثواب) میں ہرگز کوئی کمی نہیں فرمائے گا",
        "English" : "So, do not lose heart, and do not appeal for peace; you will be the uppermost, and Allah is with you; and He will never deprive you of your deeds."
      },
      {
        "ayet_no" : 36,
        "arbi" : "اِنَّمَا الْحَيٰوةُ الدُّنْيَا لَعِبٌ وَّلَهْوٌ ۭ وَاِنْ تُؤْمِنُوْا وَتَتَّقُوْا يُؤْتِكُمْ اُجُوْرَكُمْ وَلَا يَسْـَٔــلْكُمْ اَمْوَالَكُمْ",
        "Urdu" : "دنیا کی زندگی تو اس کے سوا کچھ نہیں کہ ایک کھیل اور تماشا ہے اور اگر تم لوگ قائم رہے اپنے ایمان (و یقین) پر اور تم نے اپنائے رکھا تقوی (و پرہیزگاری) کو تو اللہ تم کو تمہارے اجر (پورے پورے) عطا فرمائے گا اور تم سے تمہارے مال نہیں مانگے گا ف۲",
        "English" : "The worldly life is but play and pastime. If you believe and be God-fearing, He will give you your rewards, and will not ask you your riches."
      },
      {
        "ayet_no" : 37,
        "arbi" : "اِنْ يَّسْـَٔــلْكُمُوْهَا فَيُحْفِكُمْ تَبْخَلُوْا وَيُخْرِجْ اَضْغَانَكُمْ",
        "Urdu" : "اگر وہ تم سے کہیں تمہارے مال مانگ لیتا اور سب کے سب تم سے طلب کر لیتا تو تم بخل کرے لگتے اور اس طرح وہ نکال باہر کرتا تمہارے (دلوں کے کھوٹ اور) ناگواریوں کو",
        "English" : "If He were to ask you of it, and press you (to spend all your wealth), you would show miserliness, and He would expose your disgusts."
      },
      {
        "ayet_no" : 38,
        "arbi" : "هٰٓاَنْتُمْ هٰٓؤُلَاۗءِ تُدْعَوْنَ لِتُنْفِقُوْا فِيْ سَبِيْلِ اللّٰهِ ۚ فَمِنْكُمْ مَّنْ يَّبْخَلُ ۚ وَمَنْ يَّبْخَلْ فَاِنَّمَا يَبْخَلُ عَنْ نَّفْسِهٖ ۭ وَاللّٰهُ الْغَنِيُّ وَاَنْتُمُ الْفُقَرَاۗءُ ۚ وَاِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ ۙ ثُمَّ لَا يَكُوْنُوْٓا اَمْثَالَكُمْ",
        "Urdu" : "ہاں تو تم وہی ہو کہ تمہیں دعوت دی جا رہی ہے کہ تم خرچ کرو اللہ کی راہ میں (تاکہ خود تمہارا بھلا ہو) تو تم میں سے کچھ بخل سے کام لیتے ہیں حالانکہ جو کوئی بخل کرتا ہے وہ دراصل اپنے آپ ہی سے بخل کرتا ہے کیونکہ اللہ بےنیاز ہے (ہر کسی سے اور ہر اعتبار سے) اور تم ہی سب اس کے محتاج ہو اور اگر تم منہ موڑو گے تو وہ تمہاری جگہ کسی اور قوم کو لے آئے گا پھر وہ تم جیسے نہ ہوں گے ف۱",
        "English" : "Yes, you are such that you are called upon to spend in Allah‘s way, but some of you withhold in miserliness_ and he who withholds in miserliness withholds against himself_ and Allah is the Need-Free, and you are the needy. And if you turn away, He will replace you by some other people, then they will not be like you."
      }
    ]
  }
]