[
  {
    "surah_no" : 48,
    "total_ayah" : 29,
    "name" : "Surah e AL-Fatah",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "اِنَّا فَتَحْنَا لَكَ فَتْحًا مُّبِيْنًا",
        "Urdu" : "بیشک ہم نے عطا کر دی آپ کو (اے پیغمبر !) ایک عظیم الشان کھلی فتح ف۲",
        "English" : "Verily We! a victory We have given thee, a manifest victory."
      },
      {
        "ayet_no" : 2,
        "arbi" : "لِّيَغْفِرَ لَكَ اللّٰهُ مَا تَقَدَّمَ مِنْ ذَنْۢبِكَ وَمَا تَاَخَّرَ وَيُتِمَّ نِعْمَتَهٗ عَلَيْكَ وَيَهْدِيَكَ صِرَاطًا مُّسْتَـقِيْمًا",
        "Urdu" : "تاکہ اللہ معاف فرما دے آپ کی اگلی پچھلی سب خطائیں اور تاکہ وہ تکمیل فرما دے آپ پر اپنے انعام کی اور ڈال دے آپ کو سیدھی راہ پر",
        "English" : "That Allah may forgive thee that which hath preceded of thy fault and that which may come later, and may accomplish the more His favour on thee, and may keep thee guided on the straight path."
      },
      {
        "ayet_no" : 3,
        "arbi" : "وَّيَنْصُرَكَ اللّٰهُ نَــصْرًا عَزِيْزًا",
        "Urdu" : "اور تاکہ اللہ مدد فرمائے آپ کی بڑی ہی زبردست مدد",
        "English" : "And that Allah may help you with strong help."
      },
      {
        "ayet_no" : 4,
        "arbi" : "هُوَ الَّذِيْٓ اَنْزَلَ السَّكِيْنَةَ فِيْ قُلُوْبِ الْمُؤْمِنِيْنَ لِيَزْدَادُوْٓا اِيْمَانًا مَّعَ اِيْمَانِهِمْ ۭ وَلِلّٰهِ جُنُوْدُ السَّمٰوٰتِ وَالْاَرْضِ ۭ وَكَانَ اللّٰهُ عَلِــيْمًا حَكِـيْمًا",
        "Urdu" : "وہ (اللہ) وہی ہے جس نے سکینت (و اطمینان کی کیفیت) نازل فرمائی ایمان والوں کے دلوں میں تاکہ اور بڑھ جائے ان کا ایمان ان کے (پہلے) ایمان کے ساتھ اور اللہ ہی کے لئے ہیں لشکر آسمانوں اور زمین کے اور اللہ بڑا ہی علم والا نہایت ہی حکمت والا ہے",
        "English" : "He it is Who sent down tranquillity into the hearts of the believers that they might increase belief Unto their belief. And Allah's are the hosts of the heavens and the earth and Allah is ever Knowing, Wise."
      },
      {
        "ayet_no" : 5,
        "arbi" : "لِّيُدْخِلَ الْمُؤْمِنِيْنَ وَالْمُؤْمِنٰتِ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَا وَيُكَفِّرَ عَنْهُمْ سَيِّاٰتِهِمْ ۭ وَكَانَ ذٰلِكَ عِنْدَ اللّٰهِ فَوْزًا عَظِيْمًا",
        "Urdu" : "تاکہ وہ داخل فرما دے (اپنے کرم سے) ایماندار مردوں اور ایماندار عورتوں کو ایسی عظیم الشان جنتوں میں جن کے نیچے سے بہہ رہی ہوں گی (طرح طرح کی اور بےمثل) نہریں جن میں ان کو ہمیشہ رہنا نصیب ہوگا اور تاکہ اللہ مٹا دے ان سے ان کی برائیاں اور یہ اللہ کے نزدیک بہت بڑی (اور حقیقی) کامیابی ہے",
        "English" : "He hath ordained war in order that He may cause the believing men and the believing women enter Gardens whereunder rivers flow, as abiders therein, and that He may expiate from them their misdeeds. And that is with Allah ever an achievement mighty."
      },
      {
        "ayet_no" : 6,
        "arbi" : "وَّيُعَذِّبَ الْمُنٰفِقِيْنَ وَالْمُنٰفِقٰتِ وَالْمُشْرِكِيْنَ وَالْمُشْرِكٰتِ الظَّاۗنِّيْنَ بِاللّٰهِ ظَنَّ السَّوْءِ ۭ عَلَيْهِمْ دَاۗىِٕرَةُ السَّوْءِ ۚ وَغَضِبَ اللّٰهُ عَلَيْهِمْ وَلَعَنَهُمْ وَاَعَدَّ لَهُمْ جَهَنَّمَ ۭ وَسَاۗءَتْ مَصِيْرًا",
        "Urdu" : "اور تاکہ اللہ عذاب دے ان منافق مردوں اور منافق عورتوں اور مشرک مردوں اور مشرک عورتوں کو جو کہ گمان کرتے ہیں اللہ کے بارے میں برے گمان (حالانکہ) خود انہی پر ہے برائی کا پھیر اللہ کا غضب ہوا ان پر اور اس کی لعنت (و پھٹکار) اور اس نے تیار کر رکھا ہے ان کے لئے دوزخ (کا عذاب) اور بڑا ہی برا ٹھکانا ہے وہ دوزخ",
        "English" : "And so that He may punish the hypocrites, men and women, and the mushriks (polytheists), men and women, who think evil thoughts about Allah. Bound for them there is a vicious circle, and Allah has become angry with them, and He has prepared Jahannam (Hell) for them, and it is an evil destination."
      },
      {
        "ayet_no" : 7,
        "arbi" : "وَلِلّٰهِ جُنُوْدُ السَّمٰوٰتِ وَالْاَرْضِ ۭ وَكَانَ اللّٰهُ عَزِيْزًا حَكِيْمًا",
        "Urdu" : "اور اللہ ہی کے لئے ہیں لشکر آسمانوں اور زمین کے اور اللہ بڑا ہی زبردست نہایت ہی حکمت والا ہے ف۱",
        "English" : "To Allah belong the forces of the heavens and the earth, and Allah is All-Mighty, All-Wise."
      },
      {
        "ayet_no" : 8,
        "arbi" : "اِنَّآ اَرْسَلْنٰكَ شَاهِدًا وَّمُبَشِّرًا وَّنَذِيْرًا",
        "Urdu" : "اور بیشک ہم ہی نے بھیجا آپ کو (اے پیغمبر !) گواہی دینے والا خوشخبری سنانے والا اور خبردار کرنے والا بنا کر",
        "English" : "Verily We! We have sent thee as a witness and a bearer of glad tidings and a warner."
      },
      {
        "ayet_no" : 9,
        "arbi" : "لِّتُؤْمِنُوْا بِاللّٰهِ وَرَسُوْلِهٖ وَتُعَزِّرُوْهُ وَتُوَقِّرُوْهُ ۭ وَتُسَـبِّحُوْهُ بُكْرَةً وَّاَصِيْلًا",
        "Urdu" : "تاکہ تم (اے لوگوں !) ایمان لاؤ اللہ پر اور اس کے رسول پر اور تاکہ تم تعظیم (و توقیر) کرو اس کی اور تسبیح کرو اس کی صبح و شام (یعنی ہمہ وقت) ف۲",
        "English" : "So that you (O people,) believe in Allah and His Messenger, and support him and revere him, and pronounce His (Allah‘s) purity morning and evening."
      },
      {
        "ayet_no" : 10,
        "arbi" : "اِنَّ الَّذِيْنَ يُبَايِعُوْنَكَ اِنَّمَا يُبَايِعُوْنَ اللّٰهَ ۭ يَدُ اللّٰهِ فَوْقَ اَيْدِيْهِمْ ۚ فَمَنْ نَّكَثَ فَاِنَّمَا يَنْكُثُ عَلٰي نَفْسِهٖ ۚ وَمَنْ اَوْفٰى بِمَا عٰهَدَ عَلَيْهُ اللّٰهَ فَسَيُؤْتِيْهِ اَجْرًا عَظِيْمًا",
        "Urdu" : "بیشک جو لوگ بیعت کر رہے تھے آپ کے ہاتھ پر (اے پیغمبر !) تو وہ درحقیقت بیعت کر رہے تھے اللہ سے اللہ کا ہاتھ ان کے ہاتھوں کے اوپر تھا سو جس نے (اس کے بعد) توڑ لیا اپنے عہد کو تو اس کا وبال خود اس کیاپنی ہی جان پر ہوگا اور جو کوئی پورا کرے گا اپنے اس عہد کو جو اس نے اللہ سے باندھا ہے تو عنقریب ہی اللہ اس کو نوازے گا ایک بہت بڑے اجر سے",
        "English" : "Those who pledge allegiance with you (by placing their hands in your hand)__ they, in fact, pledge allegiance with Allah. Allah‘s hand is over their hands. Then, whoever breaks his pledge breaks it to his own detriment, and whoever fulfils the covenant he has made with Allah, He will give him a great reward."
      },
      {
        "ayet_no" : 11,
        "arbi" : "سَيَقُوْلُ لَكَ الْمُخَلَّفُوْنَ مِنَ الْاَعْرَابِ شَغَلَتْنَآ اَمْوَالُنَا وَاَهْلُوْنَا فَاسْتَغْفِرْ لَنَا ۚ يَقُوْلُوْنَ بِاَلْسِنَتِهِمْ مَّا لَيْسَ فِيْ قُلُوْبِهِمْ ۭ قُلْ فَمَنْ يَّمْلِكُ لَكُمْ مِّنَ اللّٰهِ شَـيْـــــًٔا اِنْ اَرَادَ بِكُمْ ضَرًّا اَوْ اَرَادَ بِكُمْ نَفْعًا   ۭ بَلْ كَانَ اللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرًا",
        "Urdu" : "عنقریب کہیں گے آپ سے (اے پیغمبر !) وہ بدوی (اور دیہاتی) لوگ جن کو پیچھے چھوڑ دیا گیا تھا (ان کیاپنی پست ہمتی اور سوء اختیار کی بناء پر) کہ ہمیں مشغول کر دیا تھا ہمارے مالوں اور بال بچوں (کی فکر اور انکی ضروریات) نے پس آپ بخشش کی دعاء فرما دیں ہمارے لئے یہ لوگاپنی زبانوں سے وہ کچھ کہتے ہیں جو ان کے دلوں میں نہیں (ان سے) کہو کہ اچھا تو پھر کون ہے جو تمہارے بارے میں اللہ کے فیصلے کو روک دینے کا کچھ بھی اختیار رکھتا ہو؟ اگر وہ تمہیں کوئی نقصان پہنچانا چاہے یا نفع بخشنا چاہے (اور تمہارا حال اللہ سے مخفی نہیں) بلکہ اللہ کو پوری خبر ہے تمہارے ان سب کاموں کی جو تم لوگ کرتے رہے ہو",
        "English" : "Those of the Bedouins who remained behind will say to you, :Our possessions and our families kept us busy, (hence we could not accompany you in your journey to Hudaibiyah). So, pray to Allah for our forgiveness. They say with their tongues what is not in their hearts. Say, :Then, who has power to help you in any thing against Allah, if He intends to do you harm, or intends to do you good? Rather, Allah is fully aware of what you do."
      },
      {
        "ayet_no" : 12,
        "arbi" : "بَلْ ظَنَنْتُمْ اَنْ لَّنْ يَّنْقَلِبَ الرَّسُوْلُ وَالْمُؤْمِنُوْنَ اِلٰٓى اَهْلِيْهِمْ اَبَدًا وَّزُيِّنَ ذٰلِكَ فِيْ قُلُوْبِكُمْ وَظَنَنْتُمْ ظَنَّ السَّوْءِ ښ وَكُنْتُمْ قَوْمًۢا بُوْرًا",
        "Urdu" : "(اصل وجہ یہ نہیں جو تم بیان کر رہے ہو) بلکہ تم لوگوں نے تو یہ سمجھ رکھا تھا کہ رسول اور دوسرے مسلمان تو اپنے گھر والوں کی طرف کبھی کسی طرح لوٹ کر آہی نہیں سکیں گے اور یہ خیال تمہارے دلوں کو لبھا رہا تھا اور تم نے بڑے برے گمان قائم رکھے تھے اور تم تو تھے ہی برباد ہونے والے لوگ ف۱",
        "English" : "But you thought that the Messenger and the believers would never ever return to their families, and it seemed good to your hearts, and you thought an evil thought and became a people who are ruined (by their selfishness)."
      },
      {
        "ayet_no" : 13,
        "arbi" : "وَمَنْ لَّمْ يُؤْمِنْۢ بِاللّٰهِ وَرَسُوْلِهٖ فَاِنَّآ اَعْتَدْنَا لِلْكٰفِرِيْنَ سَعِيْرًا",
        "Urdu" : "اور جو کوئی (صدق دل سے) ایمان نہیں لایا اللہ اور اس کے رسول پر تو یقینا (وہ اپنا ہی نقصان کرے گا کہ بیشک) ہم نے تیار کر رکھی ہے کافروں کے لئے ایک بڑی ہی ہولناک دہکتی بھڑکتی آگ",
        "English" : "If one does not believe in Allah and His Messenger, then We have prepared a blazing fire for the disbelievers."
      },
      {
        "ayet_no" : 14,
        "arbi" : "وَلِلّٰهِ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ ۭ يَغْفِرُ لِمَنْ يَّشَاۗءُ وَيُعَذِّبُ مَنْ يَّشَاۗءُ ۭ وَكَانَ اللّٰهُ غَفُوْرًا رَّحِيْمًا",
        "Urdu" : "اور اللہ ہی کے لئے ہے بادشاہی آسمانوں اور زمین کی وہ جسے چاہے معاف فرما دے اور جسے چاہے سزا دے اور اللہ بڑا ہی بخشنے والا نہایت مہربان ہے",
        "English" : "To Allah belongs the kingdom of the heavens and the earth. He forgives whomsoever He wills, and punishes whomsoever He wills. And Allah is Most-Forgiving, Very-Merciful."
      },
      {
        "ayet_no" : 15,
        "arbi" : "سَيَقُوْلُ الْمُخَلَّفُوْنَ اِذَا انْــطَلَقْتُمْ اِلٰى مَغَانِمَ لِتَاْخُذُوْهَا ذَرُوْنَا نَتَّبِعْكُمْ ۚ يُرِيْدُوْنَ اَنْ يُّبَدِّلُوْا كَلٰمَ اللّٰهِ ۭ قُلْ لَّنْ تَتَّبِعُوْنَا كَذٰلِكُمْ قَالَ اللّٰهُ مِنْ قَبْلُ ۚ فَسَيَقُوْلُوْنَ بَلْ تَحْسُدُوْنَنَا   ۭ بَلْ كَانُوْا لَا يَفْقَهُوْنَ اِلَّا قَلِيْلًا",
        "Urdu" : "عنقریب کہیں گے تم سے (اے مسلمانو !) وہ لوگ جن کو پیچھے چھوڑ دیا گیا تھا (اس سفرِ خیر و برکت سے ان کے اپنے سوءِ اختیار کی بناء پر) جب تم نکلو گے اموالِ غنیمت لینے کے لئے کہ ہمیں بھی اپنے ساتھ چلنے دو یہ لوگ یہ چاہیں گے کہ بدل دیں اللہ کے کلام (اور اس کے وعدوں) کو (اس وقت ان سے) کہنا کہ تم لوگ ہرگز ہمارے ساتھ نہیں چل سکتے اللہ تعالیٰ نے پہلے سے ہی یوں فرما دیا ہے اس پر وہ کہیں گے کہ نہیں بلکہ تم لوگ ہم پر حسد کرتے ہو نہیں بلکہ اصل حقیقت یہ ہے کہ یہ لوگ خود ہی (صحیح بات کو) سمجھتے نہیں مگر بہت ہی کم",
        "English" : "Those who remained behind will say, when you will proceed to the spoils (of war) to receive them, :Let us follow you. They wish to change the words of Allah. Say, :You shall not follow us. Allah had said like this beforehand. Then they will say, :No, but you are jealous of us. On the contrary, they do not understand (the reality) but a little."
      },
      {
        "ayet_no" : 16,
        "arbi" : "قُلْ لِّـلْمُخَلَّفِيْنَ مِنَ الْاَعْرَابِ سَـتُدْعَوْنَ اِلٰى قَوْمٍ اُولِيْ بَاْسٍ شَدِيْدٍ تُقَاتِلُوْنَهُمْ اَوْ يُسْلِمُوْنَ ۚ فَاِنْ تُطِيْعُوْا يُؤْتِكُمُ اللّٰهُ اَجْرًا حَسَـنًا ۚ وَاِنْ تَتَوَلَّوْا كَمَا تَوَلَّيْتُمْ مِّنْ قَبْلُ يُعَذِّبْكُمْ عَذَابًا اَلِـــيْمًا",
        "Urdu" : "کہو ان بدؤں سے جن کو پیچھے چھوڑ دیا گیا ہے کہ عنقریب ہی تمہیں بلایا جائے گا ایسے لوگوں سے لڑنے کے لئے جو بڑے سخت زور آور ہیں تم ان سے لڑو گے یا وہ اطاعت قبول کرلیں پس (اس وقت) اگر تم نے حکم مان لیا تو اللہ تمہیں نوازے گا ایک بڑے ہی عمدہ اجر سے اور اگر اس وقت بھی تم پھر گئے جیسا کہ اس سے پہلے (حدیبیہ وغیرہ میں) پھر گئے تھے تو وہ تمہیں ڈالے گا ایک بڑے ہی دردناک عذاب میں",
        "English" : "Say to those of the Bedouins who remained behind, :You will be called against a people possessed of strong fighting power; you will have to fight them until they submit. So if you obey, Allah will give you a good reward, and if you turn away, as you had turned away earlier, He will punish you with a painful punishment."
      },
      {
        "ayet_no" : 17,
        "arbi" : "لَيْسَ عَلَي الْاَعْمٰى حَرَجٌ وَّلَا عَلَي الْاَعْرَجِ حَرَجٌ وَّلَا عَلَي الْمَرِيْضِ حَرَجٌ ۭ وَمَنْ يُّطِعِ اللّٰهَ وَرَسُوْلَهٗ يُدْخِلْهُ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ ۚ وَمَنْ يَّتَوَلَّ يُعَذِّبْهُ عَذَابًا اَلِـــيْمًا",
        "Urdu" : "نہ اندھے پر کوئی گناہ ہے نہ لنگڑے پر اور نہ ہی بیمار پر اور جو کوئی (صدق دل سے) کہا مانے گا اللہ کا اور اس کے رسول کا تو اللہ اس کو داخل فرمائے گا (اپنے کرم سے) ایسی عظیم الشان جنتوں میں جن کے نیچے سے بہہ رہی ہوں گی طرح طرح کی (عظیم الشان) نہریں اور جس نے منہ موڑا (حق و ہدایت کی طرف سے) تو وہ اس کو ڈالے گا ایک بڑے ہی (ہولناک اور) دردناک عذاب میں",
        "English" : "There is no blame on the blind, nor is there any blame on the lame, nor is there any blame on the sick. Whoever obeys Allah and His Messenger, He will admit him to the gardens beneath which rivers flow. But whoever turns away, He will punish him with a painful punishment."
      },
      {
        "ayet_no" : 18,
        "arbi" : "لَقَدْ رَضِيَ اللّٰهُ عَنِ الْمُؤْمِنِيْنَ اِذْ يُبَايِعُوْنَكَ تَحْتَ الشَّجَرَةِ فَعَلِمَ مَا فِيْ قُلُوْبِهِمْ فَاَنْزَلَ السَّكِيْنَةَ عَلَيْهِمْ وَاَثَابَهُمْ فَتْحًا قَرِيْبًا",
        "Urdu" : "بلاشبہ اللہ راضی ہوگیا ان (خوش نصیب) ایمانداروں سے جو بیعت کر رہے تھے آپ صلی اللہ علیہ وسلم سے (اے پیغمبر !) اس درخت کے نیچے سو اللہ نے جان لیا جو کچھ (صدق و اخلاص) ان کے دلوں میں تھا اور اس نے نازل فرما دی ان پر سکون (و اطمینان) کی کیفیت اور اس نے نواز دیا ان کو اس کے (صلہ و) عوض میں قریب ہی ملنے والی ایک عظیم الشان فتح (و کامرانی) سے ف۱",
        "English" : "Allah was pleased with the believers when they were pledging allegiance with you (by placing their hands in your hands) under the tree, and He knew what was in their hearts, so He sent down tranquility upon them, and rewarded them with a victory, near at hand,"
      },
      {
        "ayet_no" : 19,
        "arbi" : "وَّمَغَانِمَ كَثِيْرَةً يَّاْخُذُوْنَهَا  ۭ وَكَانَ اللّٰهُ عَزِيْزًا حَكِيْمًا",
        "Urdu" : "اور دوسری بہت سی ان غنیمتوں سے جو کہ (وہ عنقریب ہی) حاصل کریں گے اور اللہ بڑا ہی زبردست نہایت ہی حکمت والا ہے",
        "English" : "And many spoils that they would receive. And Allah is Mighty, Wise."
      },
      {
        "ayet_no" : 20,
        "arbi" : "وَعَدَكُمُ اللّٰهُ مَغَانِمَ كَثِيْرَةً تَاْخُذُوْنَهَا فَعَجَّلَ لَكُمْ هٰذِهٖ وَكَفَّ اَيْدِيَ النَّاسِ عَنْكُمْ ۚ وَلِتَكُوْنَ اٰيَةً لِّــلْمُؤْمِنِيْنَ وَيَهْدِيَكُمْ صِرَاطًا مُّسْتَقِيْمًا",
        "Urdu" : "اللہ نے وعدہ فرمایا لیا تم سے (اے مسلمانو !) بہت سی غنیمتوں کا جن کو تم لوگ (آسانی اور سہولت سے) حاصل کرو گے مگر یہ اس نے تم کو فوری عطا فرما دی اور اسی نے روک دیا (اپنے کرم سے) لوگوں کے ہاتھوں کو تم سے (تاکہ تم محفوظ رہو ان کے شر سے) اور تاکہ یہ ایک نشانی ہو ایمان والوں کے لئے اور تاکہ وہ ڈال دے تم سب کو سیدھی راہ پر ف۱",
        "English" : "Allah had promised you many spoils that you would receive, so He gave these to you sooner, and stopped the hands of the people from (harming) you. And (He did this) so that it becomes a sign for believers, and so that He guides you to the right path."
      },
      {
        "ayet_no" : 21,
        "arbi" : "وَّاُخْرٰى لَمْ تَقْدِرُوْا عَلَيْهَا قَدْ اَحَاطَ اللّٰهُ بِهَا ۭ وَكَانَ اللّٰهُ عَلٰي كُلِّ شَيْءٍ قَدِيْرًا",
        "Urdu" : "اور اس کے علاوہ اللہ نے تم سے اور بھی ایسی غنیمتوں کا وعدہ فرما دیا ہے جن پر تمہیں ابھی تک قدرت حاصل نہیں مگر اللہ نے اپنے احاطہ قدرت میں لے رکھا ہے ان سب کو اور اللہ ہرچیز پر پوری قدرت رکھتا ہے ف۲",
        "English" : "And (there is) another (victory) that has not come within your power as yet, (but) Allah has encompassed it. And Allah is Powerful over every thing."
      },
      {
        "ayet_no" : 22,
        "arbi" : "وَلَوْ قٰتَلَكُمُ الَّذِيْنَ كَفَرُوْا لَوَلَّوُا الْاَدْبَارَ ثُمَّ لَا يَجِدُوْنَ وَلِيًّا وَّلَا نَصِيْرًا",
        "Urdu" : "اور اگر (اس حال میں بھی) تم سے لڑائی ہو جاتی ان کافروں کی تو بھی یقینا انہوں نے بھاگنا تھا پیٹھ دے کر پھر یہ (اپنے لئے) نہ کوئی یار پا سکتے نہ مددگار",
        "English" : "And had those who disbelieve fought against you, surely they would have turned their backs, and then they would have found no patron nor helper."
      },
      {
        "ayet_no" : 23,
        "arbi" : "سُـنَّةَ اللّٰهِ الَّتِيْ قَدْ خَلَتْ مِنْ قَبْلُ ښ وَلَنْ تَجِدَ لِسُـنَّةِ اللّٰهِ تَبْدِيْلًا",
        "Urdu" : "",
        "English" : "That has been the Way of Allah already with those who passed away before. And you will not find any change in the Way of Allah."
      },
      {
        "ayet_no" : 24,
        "arbi" : "وَهُوَ الَّذِيْ كَفَّ اَيْدِيَهُمْ عَنْكُمْ وَاَيْدِيَكُمْ عَنْهُمْ بِبَطْنِ مَكَّةَ مِنْۢ بَعْدِ اَنْ اَظْفَرَكُمْ عَلَيْهِمْ ۭ وَكَانَ اللّٰهُ بِمَا تَعْمَلُوْنَ بَصِيْرًا",
        "Urdu" : "اور وہ (قادرِ مطلق) وہی ہے جس نے روک دیا ان کے ہاتھوں کو تم سے اور تمہارے ہاتھوں کو ان سے مکہ کی وادی میں اس کے بعد کہ اللہ نے تم کو ان پر کامیابی عطا فرما دی تھی اور اللہ پوری طرح دیکھتا ہے ان تمام کاموں کو جو تم لوگ کر رہے ہو",
        "English" : "And He is the One who restrained their hands from you and your hands from them in the valley of Makkah after He had let you prevail over them, and Allah is watchful over what you do."
      },
      {
        "ayet_no" : 25,
        "arbi" : "هُمُ الَّذِيْنَ كَفَرُوْا وَصَدُّوْكُمْ عَنِ الْمَسْجِدِ الْحَرَامِ وَالْهَدْيَ مَعْكُوْفًا اَنْ يَّبْلُغَ مَحِلَّهٗ ۭ وَلَوْلَا رِجَالٌ مُّؤْمِنُوْنَ وَنِسَاۗءٌ مُّؤْمِنٰتٌ لَّمْ تَعْلَمُوْهُمْ اَنْ تَـــطَــــُٔوْهُمْ فَتُصِيْبَكُمْ مِّنْهُمْ مَّعَرَّةٌۢ بِغَيْرِ عِلْمٍ ۚ لِيُدْخِلَ اللّٰهُ فِيْ رَحْمَتِهٖ مَنْ يَّشَاۗءُ ۚ لَوْ تَزَيَّلُوْا لَعَذَّبْنَا الَّذِيْنَ كَفَرُوْا مِنْهُمْ عَذَابًا اَلِـــيْمًا",
        "Urdu" : "یہ وہی لوگ ہیں جو اڑے ہوئے ہیں اپنے کفر (و باطل) پر اور انہوں نے تم کو روکا مسجد حرام سے اور قربانی کے جانوروں کو ان کی قربانی کی جگہ پہنچنے سے اور اگر نہ ہوتے (مکہ میں) کچھ ایسے ایماندار مرد اور ایماندار عورتیں جن کو تم نہیں جانتے تھے اور اس بات کا خدشہ نہ ہوتا کہ تم ان کو روند ڈالو گے انجانے میں جس کے نتیجے میں تم پر حرف آتا (سو اگر ایسے نہ ہوتا تو ان کا قصہ چکا دیا جاتا مگر ایسے نہیں کیا کہ) تاکہ اللہ داخل فرمائےاپنی رحمت میں جس کو چاہے اگر یہ لوگ الگ ہوگئے ہوتے (اہل مکہ سے) تو ہم ضرور ایک دردناک عذاب دے دیتے اہل مکہ میں سے ان لوگوں کو جو اڑے ہوئے تھے اپنے کفر (و باطل) پر",
        "English" : "They are those who disbelieved and prevented you from the Sacred Mosque (Al-Masjid-ul-Haram ), and (prevented) the sacrificial animals that were detained from reaching their due place. And (Allah would have allowed you to fight,) had there not been believing men and believing women whom you did not know that you might have trampled them, and thus a painful situation might have arisen for you because of them unknowingly; (This situation was avoided) so that Allah may admit to His mercy whom He wills. And if they (the believing men and women) had moved (from Makkah), We would surely have punished those of them who disbelieved with a painful punishment."
      },
      {
        "ayet_no" : 26,
        "arbi" : "اِذْ جَعَلَ الَّذِيْنَ كَفَرُوْا فِيْ قُلُوْبِهِمُ الْحَمِيَّةَ حَمِيَّةَ الْجَاهِلِيَّةِ فَاَنْزَلَ اللّٰهُ سَكِيْنَتَهٗ عَلٰي رَسُوْلِهٖ وَعَلَي الْمُؤْمِنِيْنَ وَاَلْزَمَهُمْ كَلِمَةَ التَّقْوٰى وَكَانُوْٓا اَحَقَّ بِهَا وَاَهْلَهَا ۭ وَكَانَ اللّٰهُ بِكُلِّ شَيْءٍ عَلِــيْمًا",
        "Urdu" : "(اور اسی بناء پر اس وقت) جب کہ بٹھا دی ان کافروں نے اپنے دلوں میں جاہلیت کی آڑ تو اللہ نے (اپنے فضل و کرم سے) اتار دیا اپنا سکون و اطمینان اپنے رسول اور (صدق دل سے) ایمان لانے والوں پر اور اس نے پابند کر دیا ان کو (اس نازک موقع پر) تقوی (و پرہیزگاری) کی بات کا اور وہی سب سے زیادہ اس کے حقدار بھی تھے اور اس کے اہل (اور لائق) بھی اور اللہ تو ہرچیز کو پوری طرح جانتا ہے",
        "English" : "When the disbelievers developed in their hearts indignation, the indignation of ignorance; then Allah sent down tranquility from Himself upon His Messenger and upon the believers, and made them stick to the word of piety, and they were very much entitled to it and competent for it. And Allah is All-Knowing about every thing."
      },
      {
        "ayet_no" : 27,
        "arbi" : "لَقَدْ صَدَقَ اللّٰهُ رَسُوْلَهُ الرُّءْيَا بِالْحَقِّ ۚ لَتَدْخُلُنَّ الْمَسْجِدَ الْحَرَامَ اِنْ شَاۗءَ اللّٰهُ اٰمِنِيْنَ ۙ مُحَلِّقِيْنَ رُءُوْسَكُمْ وَمُقَصِّرِيْنَ ۙ لَا تَخَافُوْنَ ۭ فَعَلِمَ مَا لَمْ تَعْلَمُوْا فَجَعَلَ مِنْ دُوْنِ ذٰلِكَ فَتْحًا قَرِيْبًا",
        "Urdu" : "بلاشبہ اللہ نے سچا خواب دکھایا اپنے رسول کو جو کہ ٹھیک ٹھیک حق کے مطابق تھا تم لوگ ضرور بالضرور داخل ہوؤ گے مسجد حرام میں پورے امن و امان کے ساتھ تم میں سے کچھ اپنے سروں کو منڈوائے ہوں گے اور کچھ اپنے بالوں کو چھوٹا کرائے ہوں گے تمہیں کسی کا خوف نہ ہوگا سو اللہ جانتا تھا ان تمام باتوں کو جن کو تم نہیں جانتے تھے سو (اسی بناء پر) اس نے تمہیں اس سے پہلے ہی نواز دیا ایک قریبی فتح سے",
        "English" : "Indeed, Allah has made true to His Messenger the dream (shown) with truth: You will definitely enter the Sacred Mosque insha‘allah (if Allah wills,) peacefully, with your heads shaved, and your hairs cut short, having no fear. So He knew what you did not know, and He assigned before that a victory, near at hand."
      },
      {
        "ayet_no" : 28,
        "arbi" : "هُوَ الَّذِيْٓ اَرْسَلَ رَسُوْلَهٗ بِالْهُدٰى وَدِيْنِ الْحَقِّ لِيُظْهِرَهٗ عَلَي الدِّيْنِ كُلِّهٖ ۭ وَكَفٰى بِاللّٰهِ شَهِيْدًا",
        "Urdu" : "وہ (وحدہ لاشریک) وہی ہے جس نے بھیجا اپنے رسول کو ہدایت (کی دولت) اور دین حق (کی نعمت) کے ساتھ تاکہ وہ غالب کر دے اس (دین حق) کو تمام دینوں پر اور کافی ہے اللہ گواہی دینے کو (حق اور حقیقت کے لئے) ف۱",
        "English" : "He is the One who has sent His Messenger with Guidance and the religion of truth, so that He makes it prevail over all religions. And enough is Allah for being a witness (to His promise)."
      },
      {
        "ayet_no" : 29,
        "arbi" : "مُحَمَّدٌ رَّسُوْلُ اللّٰهِ ۭ وَالَّذِيْنَ مَعَهٗٓ اَشِدَّاۗءُ عَلَي الْكُفَّارِ رُحَمَاۗءُ بَيْنَهُمْ تَرٰىهُمْ رُكَّعًا سُجَّدًا يَّبْتَغُوْنَ فَضْلًا مِّنَ اللّٰهِ وَرِضْوَانًا ۡ سِيْمَاهُمْ فِيْ وُجُوْهِهِمْ مِّنْ اَثَرِ السُّجُوْدِ ۭ ذٰلِكَ مَثَلُهُمْ فِي التَّوْرٰىةِ ٻوَمَثَلُهُمْ فِي الْاِنْجِيْلِ ۾ كَزَرْعٍ اَخْرَجَ شَطْــــَٔهٗ فَاٰزَرَهٗ فَاسْتَغْلَــظَ فَاسْتَوٰى عَلٰي سُوْقِهٖ يُعْجِبُ الزُّرَّاعَ لِيَغِيْظَ بِهِمُ الْكُفَّارَ ۭ وَعَدَ اللّٰهُ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ مِنْهُمْ مَّغْفِرَةً وَّاَجْرًا عَظِيْمًا",
        "Urdu" : "محمد اللہ کے رسول ہیں اور جو لوگ آپ کے ساتھ ہیں وہ کافروں کے مقابلے میں بڑے سخت اور آ پس میں انتہائی مہربان ہیں تم انہیں دیکھو گے تو ان کو رکوع و سجود کرنے والے اور (ہر حال میں) اللہ کا فضل اور اس کی خوشنودی کی تلاش کرتے پاؤ گے ان کی نشانی (چمک رہی ہوگی) ان کے چہروں میں سجدوں کے اثرات کی بناء پر یہ ہے ان کی صفت تورات میں اور ان کی صفت انجیل میں مثل اس کھیت کے جس نےاپنی سوئی نکالی پھر اس نے اس کو قوت دی جس سے وہ موٹی ہوگئی پھر وہ سیدھی کھڑی ہوگئی اپنے تنے پر جو خوشی کا سامان بنتی ہے کاشتکاروں کے لئے تاکہ وہ جلائے ان کے ذریعے کافروں (کے دلوں) کو وعدہ فرمایا ہے اللہ نے ان میں سے ان (خوش نصیبوں) سے جو (صدق دل سے) ایمان لائے اور (اس کے مطابق) انہوں نے کام بھی نیک کئے عظیم الشان بخشش اور بہت بڑے اجر و (ثواب) کا ف۲",
        "English" : "Muhammad is the messenger of Allah, and those who are with him are hard on the disbelievers, compassionate among themselves; you will see them bowing down in Ruku_, prostrating themselves in Sajdah, seeking grace from Allah, and (His) good pleasure; their distinguishing feature is on their faces from the effect of Sajdah (prostration). This is their description in Torah; and their description in Injil is: like a sown crop that brings forth its shoot, then makes it strong, then it grows thick and stands straight on its stem, looking good to the farmers, so that He may enrage the disbelievers through them. Allah has promised forgiveness and a huge reward to those of them who believe and do good deeds."
      }
    ]
  }
]