[
  {
    "surah_no" : 46,
    "total_ayah" : 35,
    "name" : "Surah e Ahkaf",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "حٰـمۗ",
        "Urdu" : "حٰم",
        "English" : "Ha. Mim. [These letters are one of the miracles of the Quran, and none but Allah (Alone) knows their meanings]."
      },
      {
        "ayet_no" : 2,
        "arbi" : "تَنْزِيْلُ الْكِتٰبِ مِنَ اللّٰهِ الْعَزِيْزِ الْحَكِيْمِ",
        "Urdu" : "یہ سراسر اتاری گئی کتاب ہے اللہ کی طرف سے جو کہ بڑا ہی زبردست نہایت ہی حکمت والا ہے",
        "English" : "This is revelation of the book from Allah, the All-Mighty, the All-Wise."
      },
      {
        "ayet_no" : 3,
        "arbi" : "مَا خَلَقْنَا السَّمٰوٰتِ وَالْاَرْضَ وَمَا بَيْنَهُمَآ اِلَّا بِالْحَـقِّ وَاَجَلٍ مُّسَمًّى ۭ وَالَّذِيْنَ كَفَرُوْا عَمَّآ اُنْذِرُوْا مُعْرِضُوْنَ",
        "Urdu" : "ہم نے نہیں پیدا کیا آسمانوں اور زمین کو اور ان دونوں کے درمیان کی کائنات کو مگر حق کے ساتھ اور ایک مقرر وقت کے لئے ف۱ مگر جو لوگ اڑے ہوئے ہیں اپنے کفر (و باطل) پر وہ اس حقیقت سے منہ موڑے ہوئے ہیں جس سے انہیں خبردار کیا گیا ہے",
        "English" : "We did not create the heavens and the earth but with true purpose and for a specified term. But those who disbelieve are averse to what they are warned of."
      },
      {
        "ayet_no" : 4,
        "arbi" : "قُلْ اَرَءَيْتُمْ مَّا تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ اَرُوْنِيْ مَاذَا خَلَقُوْا مِنَ الْاَرْضِ اَمْ لَــهُمْ شِرْكٌ فِي السَّمٰوٰتِ ۭ اِيْتُوْنِيْ بِكِتٰبٍ مِّنْ قَبْلِ ھٰذَآ اَوْ اَثٰرَةٍ مِّنْ عِلْمٍ اِنْ كُنْتُمْ صٰدِقِيْنَ",
        "Urdu" : "(ان سے) کہو کہ کیا تم نے ان چیزوں کو کبھی انکھیں کھول کر دیکھا بھی جن کو تم لوگ (پوجتے) پکارتے ہو اللہ کے سوا مجھے دکھاؤ تو سہی کہ انہوں نے کیا پیدا کیا زمین میں سے یا ان کا کیا حصہ ہے آسمانوں میں؟ دکھاؤ مجھے (اپنی تائید میں) اس سے پہلے کی کوئی کتاب یا کسی علم کا کوئی بقیہ اگر تم لوگ سچے ہو (اپنے قول و قرار میں)",
        "English" : "Say, :Tell me about those whom you invoke instead of Allah, (and) show me what they have created from the earth; Or have they a share in (the creation of) the heavens? Bring to me a book (revealed) before this one, or a trace of knowledge, if you are truthful."
      },
      {
        "ayet_no" : 5,
        "arbi" : "وَمَنْ اَضَلُّ مِمَّنْ يَّدْعُوْا مِنْ دُوْنِ اللّٰهِ مَنْ لَّا يَسْتَجِيْبُ لَهٗٓ اِلٰى يَوْمِ الْقِيٰمَةِ وَهُمْ عَنْ دُعَاۗىِٕهِمْ غٰفِلُوْنَ",
        "Urdu" : "اور اس شخص سے بڑھ کر گمراہ اور کون ہو سکتا ہے جو اللہ کے سوا ایسوں کو (پوجے) پکارے جو قیامت تک اس کی پکار کا کوئی جواب نہ دے سکیں اور وہ ان لوگوں کی دعا (و پکار) سے بالکل بےخبر ہوں",
        "English" : "And who is more astray than he who call beside Allah, Unto such as will answer it not till the Day of Resurrection and who are of their call unaware."
      },
      {
        "ayet_no" : 6,
        "arbi" : "وَاِذَا حُشِرَ النَّاسُ كَانُوْا لَهُمْ اَعْدَاۗءً وَّكَانُوْا بِعِبَادَتِهِمْ كٰفِرِيْنَ",
        "Urdu" : "اور جب اکٹھا کیا جائے گا سب لوگوں کو (قیامت کے اس ہولناک دن میں) تو یہ اپنے پکارنے والوں کے دشمن بن جائیں گے اور ان کی عبادت کے بھی منکر ہو جائیں گے",
        "English" : "And when people will be assembled (on the Day of Judgment), they will be enemies to them, and will refuse even their having worshipped them."
      },
      {
        "ayet_no" : 7,
        "arbi" : "وَاِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُنَا بَيِّنٰتٍ قَالَ الَّذِيْنَ كَفَرُوْا لِلْحَقِّ لَمَّا جَاۗءَهُمْ ۙ ھٰذَا سِحْرٌ مُّبِيْنٌ",
        "Urdu" : "اور جب ان لوگوں کو پڑھ کر سنائی جاتی ہیں ہماری کھلی کھلی (اور صاف و واضح) آیتیں تو کافر لوگ (پوری ڈھٹائی سے) حق کے بارے میں کہتے ہیں جب کہ وہ ان کے پاس آچکا ہوتا ہے کہ یہ تو ایک جادو ہے کھلا ہوا ف۱",
        "English" : "When Our verses are recited to them in all their clarity, the disbelievers say about the truth when it comes to them, :This is an open magic."
      },
      {
        "ayet_no" : 8,
        "arbi" : "اَمْ يَقُوْلُوْنَ افْتَرٰىهُ ۭ قُلْ اِنِ افْتَرَيْتُهٗ فَلَا تَمْلِكُوْنَ لِيْ مِنَ اللّٰهِ شَيْـــــًٔا ۭ هُوَ اَعْلَمُ بِمَا تُفِيْضُوْنَ فِيْهِ ۭ كَفٰى بِهٖ شَهِيْدًۢا بَيْنِيْ وَبَيْنَكُمْ ۭ وَهُوَ الْغَفُوْرُ الرَّحِيْمُ",
        "Urdu" : "کیا یہ لوگ کہتے ہیں کہ آپ نے اس (قران) کو خود ہی گھڑ لیا ہے؟ تو (ان سے) کہہ دو کہ اچھا تو اگر میں نے اسے خود گھڑ لیا ہے تو تم مجھے اللہ سے بچانے کی کچھ بھی طاقت نہیں رکھتے وہ تو خوب جانتا ہے ان سب باتوں کو جو تم لوگ اس کے بارے میں بناتے ہو کافی ہے وہ (وحدہ لاشریک) گواہی دینے کو میرے اور تمہارے درمیان اور وہی ہے نہایت درگزر کرنے والا انتہائی مہربان",
        "English" : "Is it that they say, :He has forged it (the Qur‘an) ? Say, :If I have forged it, then you do not have any power to help me against Allah. He is well aware of what you are engaged in. He is enough as a witness between me and you, and He is the Most-Forgiving, the Very-Merciful."
      },
      {
        "ayet_no" : 9,
        "arbi" : "قُلْ مَا كُنْتُ بِدْعًا مِّنَ الرُّسُلِ وَمَآ اَدْرِيْ مَا يُفْعَلُ بِيْ وَلَا بِكُمْ ۭ اِنْ اَتَّبِــعُ اِلَّا مَا يُوْحٰٓى اِلَيَّ وَمَآ اَنَا اِلَّا نَذِيْرٌ مُّبِيْنٌ",
        "Urdu" : "(ان سے) کہو کہ میں کوئی انوکھا رسول نہیں ہوں اور میں نہیں جانتا کہ کیا کیا جائے گا میرے ساتھ اور تمہارے ساتھ میں تو بس پیروی کرتا ہوں اس وحی کی جو بھیجی جاتی ہے میری طرف اور میرا کام تو خبردار کر دینا ہے کھول کر (حق اور حقیقت کو)",
        "English" : "Say, :I am not something unprecedented among the messengers, and I do not know what will be done to me or to you. I do not follow anything but what is revealed to me, and I am only a clear warner."
      },
      {
        "ayet_no" : 10,
        "arbi" : "قُلْ اَرَءَيْتُمْ اِنْ كَانَ مِنْ عِنْدِ اللّٰهِ وَكَفَرْتُمْ بِهٖ وَشَهِدَ شَاهِدٌ مِّنْۢ بَنِيْٓ اِسْرَاۗءِيْلَ عَلٰي مِثْلِهٖ فَاٰمَنَ وَاسْـتَكْبَرْتُمْ ۭ اِنَّ اللّٰهَ لَا يَهْدِي الْــقَوْمَ الظّٰلِمِيْنَ",
        "Urdu" : "(ان سے) کہو کہ کیا تم لوگوں نے کبھی اس امر پر بھی غور کیا کہ اگر یہ (کلام) اللہ کی طرف سے ہو اور تم اس کا انکار کرو جب کہ بنی اسرائیل کا ایک گواہ اس جیسے کلام پر گواہی دے چکا ہو سو وہ اس پر ایمان لایا ہو مگر تماپنی بڑائی کے گھمنڈ میں (اس سے منہ موڑے) ہی رہے (تو پھر تمہارا انجام آخر کیا ہوگا؟) بیشک اللہ ہدایت (کی دولت) سے نہیں نوازتا ایسے ظالموں کو ف۲",
        "English" : "Say, :Tell me, If it (the Qur‘an) is from Allah and you reject it, and a witness from the children of Isra‘il testifies about something similar to it and comes to believe (in it), while you persist in your arrogance, (then, how unjust you are!) Surely, Allah does not give guidance to the unjust people."
      },
      {
        "ayet_no" : 11,
        "arbi" : "وَقَالَ الَّذِيْنَ كَفَرُوْا لِلَّذِيْنَ اٰمَنُوْا لَوْ كَانَ خَيْرًا مَّا سَبَقُوْنَآ اِلَيْهِ ۭ وَاِذْ لَمْ يَهْتَدُوْا بِهٖ فَسَيَقُوْلُوْنَ ھٰذَآ اِفْكٌ قَدِيْمٌ",
        "Urdu" : "اور کافر لوگ ایمان والوں کے بارے میں کہتے ہیں کہ اگر یہ دین سچا ہوتا تو یہ لوگ ہم سے اس معاملے میں سبقت نہ لے جاتے اور جب یہ لوگ اس سے ہدایت نہیں پا سکے تو اب انہوں نے یہی کہنا ہے کہ یہ تو ایک پرانا جھوٹ ہے",
        "English" : "The disbelievers say about the believers, :Had it (Islamic faith) been a good thing, these (weak and poor) people would not have preceded us (in proceeding) towards it. Since they did not accept guidance through it (the Qur‘an), they will say, :This is a classical lie."
      },
      {
        "ayet_no" : 12,
        "arbi" : "وَمِنْ قَبْلِهٖ كِتٰبُ مُوْسٰٓى اِمَامًا وَّرَحْمَةً ۭ وَھٰذَا كِتٰبٌ مُّصَدِّقٌ لِّسَانًا عَرَبِيًّا لِّيُنْذِرَ الَّذِيْنَ ظَلَمُوْا     ڰ وَبُشْرٰى لِلْمُحْسِـنِيْنَ",
        "Urdu" : "حالانکہ اس سے پہلے موسیٰ کی کتاب بھی آچکی ہے ایک عظیم الشان امام (و پیشوا) کے طور پر سراسر رحمت بن کر اور یہ کتاب بھی جو اس کی تصدیق کرنے والی ہے عربی زبان میں تاکہ یہ خبردار کرے ان لوگوں کو جو کمر بستہ ہیں ظلم پر اور خوشخبری سنائے (دارین کی فوز و فلاح کی) ان لوگوں کو جو نیکوکار ہیں",
        "English" : "And before this there was the Book of Musa, a guide and a mercy. And this is a Book confirming (it) in Arabic tongue, so that it may warn the wrongdoers and give good news to those who are good in their deeds."
      },
      {
        "ayet_no" : 13,
        "arbi" : "اِنَّ الَّذِيْنَ قَالُوْا رَبُّنَا اللّٰهُ ثُمَّ اسْـتَـقَامُوْا فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُوْنَ",
        "Urdu" : "بلاشبہ جن لوگوں نے (صدق دل سے) کہا کہ ہمارا رب اللہ ہے پھر وہ اس پر ڈٹ گئے تو ان پر نہ کوئی خوف ہوگا اور نہ ہی وہ غمگین ہوں گے",
        "English" : "Surely, those who say, :Our Lord is Allah and then stay firm, they will have no fear, nor shall they grieve."
      },
      {
        "ayet_no" : 14,
        "arbi" : "اُولٰۗىِٕكَ اَصْحٰبُ الْجَنَّةِ خٰلِدِيْنَ فِيْهَا   ۚ جَزَاۗءًۢ بِمَا كَانُوْا يَعْمَلُوْنَ",
        "Urdu" : "ایسے لوگ جنتی ہیں وہ ہمیشہ اسی میں رہیں گے اپنے ان اعمال کے بدلے میں جو وہ (دنیا میں) کرتے رہے تھے",
        "English" : "Those are the people of Paradise, who will live there for ever as a reward for what they used to do."
      },
      {
        "ayet_no" : 15,
        "arbi" : "وَوَصَّيْنَا الْاِنْسَانَ بِوَالِدَيْهِ اِحْسٰـنًا ۭ حَمَلَتْهُ اُمُّهٗ كُرْهًا وَّوَضَعَتْهُ كُرْهًا ۭ وَحَمْلُهٗ وَفِصٰلُهٗ ثَلٰثُوْنَ شَهْرًا ۭحَتّىٰٓ اِذَا بَلَغَ اَشُدَّهٗ وَبَلَـغَ اَرْبَعِيْنَ سَـنَةً ۙ قَالَ رَبِّ اَوْزِعْنِيْٓ اَنْ اَشْكُرَ نِعْمَتَكَ الَّتِيْٓ اَنْعَمْتَ عَلَيَّ وَعَلٰي وَالِدَيَّ وَاَنْ اَعْمَلَ صَالِحًا تَرْضٰىهُ وَاَصْلِحْ لِيْ فِيْ ذُرِّيَّتِيْ ڝ اِنِّىْ تُبْتُ اِلَيْكَ وَاِنِّىْ مِنَ الْمُسْلِمِيْنَ",
        "Urdu" : "اور ہم نے تاکید کر دی انسان کو کہ وہ حسن سلوک کا معاملہ کرتا رہے اپنے ماں باپ کے ساتھ اس کی ماں نے اس کو پیٹ میں رکھا (مشقت پر) مشقت اٹھا کر اور اس کو جنا تو بھی (مشقت پر) مشقت اٹھا کر اور اس کے حمل اور اس کے دودھ چھڑانے کی مدت تیس مہینے ہے (پھر وہ برابر نشوونما پاتا رہا) یہاں تک کہ جب وہاپنی (جوانی کی) بھرپور قوتوں کو پہنچ گیا اور چالیس سال کا ہوگیا تو اس نے کہا اے میرے رب مجھے توفیق دے کہ میں شکر ادا کر سکوں تیری ان نعمتوں کا جو تو نے (محض اپنے کرم سے) مجھ پر اور میرے ماں باپ پر فرمائی ہیں اور (اس کی بھی توفیق نصیب فرما کہ) میں ہمیشہ ایسے نیک عمل کروں جو تجھے پسند ہوں اور میرے (سکھ اور چین کے) لئے میری اولاد کو بھی نیک بنا دے میں (صدق دل سے) توبہ کرتا ہوں جناب کے حضور اور میں یقینا فرمانبرداروں میں سے ہوں ف۱",
        "English" : "And We have enjoined upon man to do good to his parents. His mother carried him with difficulty and delivered him with difficulty. And his carrying and his weaning is (in) thirty months, until when he attains his maturity and reaches forty years, he says, :My Lord, grant me that I offer gratitude for the favour You have bestowed upon me and upon my parents, and that I do righteous deeds that You like. And set righteousness, for my sake, in my progeny. Of course, I repent to you, and truly I am one of those who submit to You."
      },
      {
        "ayet_no" : 16,
        "arbi" : "اُولٰۗىِٕكَ الَّذِيْنَ نَتَقَبَّلُ عَنْهُمْ اَحْسَنَ مَا عَمِلُوْا وَنَتَجَاوَزُ عَنْ سَـيِّاٰتِهِمْ فِيْٓ اَصْحٰبِ الْجَــنَّةِ ۭ وَعْدَ الصِّدْقِ الَّذِيْ كَانُوْا يُوْعَدُوْنَ",
        "Urdu" : "یہ وہ لوگ ہیں جن کے نیک کاموں کو ہم قبول کرلیں گے اور ان کی برائیوں سے ہم درگزر کر دیں گے یہ جنتی لوگوں میں سے ہوں گے اس سچے وعدے کے مطابق جو ان سے (دنیا میں) کیا جاتا رہا ہے",
        "English" : "Such are the people from whom We accept the best of what they did, and overlook their evil deeds, (so as they will be) among the people of Paradise according to the true promise that was made to them."
      },
      {
        "ayet_no" : 17,
        "arbi" : "وَالَّذِيْ قَالَ لِوَالِدَيْهِ اُفٍّ لَّكُمَآ اَتَعِدٰنِنِيْٓ اَنْ اُخْرَجَ وَقَدْ خَلَتِ الْقُرُوْنُ مِنْ قَبْلِيْ ۚ وَهُمَا يَسْتَغِيْثٰنِ اللّٰهَ وَيْلَكَ اٰمِنْ ڰ اِنَّ وَعْدَ اللّٰهِ حَقٌّ ښ فَيَقُوْلُ مَا ھٰذَآ اِلَّآ اَسَاطِيْرُ الْاَوَّلِيْنَ",
        "Urdu" : "اور (اس کے برعکس) جس نے اپنے ماں باپ سے کہا کہ تف ہے تم پر کیا تم مجھے اس بات کا ڈراوا دیتے ہو کہ مجھے (مرنے کے بعد قبر سے) نکالا جائے گا؟ حالانکہ مجھ سے پہلے کتنی ہی نسلیں گزر چکی ہیں (اور ان میں سے کوئی اب تک نہیں اٹھا) جب کہ وہ دونوں اس کو اللہ کی دوہائی دے کر کہتے ہیں کہ ارے کم بخت مان جا یقینا اللہ کا وعدہ سچا ہے مگر وہ پھر بھی کہتا ہے کہ یہ تو بس کہانیاں ہیں پہلے لوگوں کی ف۱",
        "English" : "And (Contrary to this is the case of) the one who said to his parents, :Fie upon you both! Do you promise to me that I shall be brought out (from the grave), while generations have passed before me? And they (the parents) were crying for Allah‘s help, (and saying to their son,) :Woe to you. Accept the true faith. Allah‘s promise is certainly true. Then he says, :This is nothing but the tales of the ancients."
      },
      {
        "ayet_no" : 18,
        "arbi" : "اُولٰۗىِٕكَ الَّذِيْنَ حَقَّ عَلَيْهِمُ الْقَوْلُ فِيْٓ اُمَمٍ قَدْ خَلَتْ مِنْ قَبْلِهِمْ مِّنَ الْجِنِّ وَالْاِنْسِ ۭ اِنَّهُمْ كَانُوْا خٰسِرِيْنَ",
        "Urdu" : "یہ وہ لوگ ہیں جن پر پکی ہوگئی ہماری بات (کہ انہوں نے عذاب پانا ہے انہی جیسے) جنوں اور انسانوں کے ان مختلف گروہوں میں جو گزر چکے ہیں ان سے پہلے بلاشبہ یہ سب خسارہ اٹھانے والے ہیں ف۲",
        "English" : "Such are the people on whom the word (of punishment) has come true along with the communities of the Jinn and the humans that have passed before them. Surely they were losers."
      },
      {
        "ayet_no" : 19,
        "arbi" : "وَلِكُلٍّ دَرَجٰتٌ مِّمَّا عَمِلُوْا ۚ وَلِيُوَفِّيَهُمْ اَعْمَالَهُمْ وَهُمْ لَا يُظْلَمُوْنَ",
        "Urdu" : "اور ہر ایک کے لئے درجے ہیں ان کے ان اعمال کے مطابق جو وہ کرتے رہے (تاکہ اللہ کا وعدہ پورا ہو) اور تاکہ وہ پورا بدلہ دے ان کو ان کے اعمال کا اور ان پر کوئی ظلم نہیں کیا جائے گا",
        "English" : "For each (of these two groups) there are (different) ranks because of what they did, and so that He may repay them in full for their deeds; and they will not be wronged."
      },
      {
        "ayet_no" : 20,
        "arbi" : "وَيَوْمَ يُعْرَضُ الَّذِيْنَ كَفَرُوْا عَلَي النَّارِ ۭ اَذْهَبْتُمْ طَيِّبٰتِكُمْ فِيْ حَيَاتِكُمُ الدُّنْيَا وَاسْتَمْتَعْتُمْ بِهَا ۚ فَالْيَوْمَ تُجْـزَوْنَ عَذَابَ الْهُوْنِ بِمَا كُنْتُمْ تَسْـتَكْبِرُوْنَ فِي الْاَرْضِ بِغَيْرِ الْحَقِّ وَبِمَا كُنْتُمْ تَفْسُقُوْنَ",
        "Urdu" : "اور جس دن پیش کیا جائے گا کافروں کو (دوزخ) کی اس ہولناک آگ پر (تو ان سے کہا جائے گا کہ) تم لوگ حاصل کر چکے اپنے حصے کی نعمتیںاپنی دنیاوی زندگی میں اور تم ان کے مزے وہیں لوٹ چکے سو اب تم کو ذلت کا عذاب ہی دیا جائے گا اس وجہ سے کہ تم لوگاپنی بڑائی کے گھمنڈ میں مبتلا تھے ہماری زمین میں ناحق طور پر اور اس وجہ سے کہ تم لوگ حدوں سے نکل جایا کرتے تھے",
        "English" : "And the day the disbelievers will be presented before the Fire, (it will be said to them,) :You have consumed your good things in your worldly life, and have enjoyed them. So, you will be punished today with the torment of humiliation for the arrogance you used to show on earth with no right (to do so), and for the sins you used to commit."
      },
      {
        "ayet_no" : 21,
        "arbi" : "وَاذْكُرْ اَخَا عَادٍ ۭ اِذْ اَنْذَرَ قَوْمَهٗ بِالْاَحْقَافِ وَقَدْ خَلَتِ النُّذُرُ مِنْۢ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهٖٓ اَلَّا تَعْبُدُوْٓا اِلَّا اللّٰهَ ۭ اِنِّىْٓ اَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيْمٍ",
        "Urdu" : "اور ان کو ذرا عاد کے بھائی (ہود) کا قصہ بھی سنا دو ف ۱جب کہ انہوں نے ڈرایا (اور خبردار کیا)اپنی قوم کو احقاف میں اور ایسے ہی خبردار کرنے والے اس سے پہلے بھی گزر چکے تھے اور اس کے بعد بھی آتے رہے کہ تم لوگ اللہ کے سوا کسی کی بندگی مت کرو مجھے تمہارے بارے میں سخت اندیشہ ہے ایک بہت بڑے (اور) ہولناک دن کے عذاب سے",
        "English" : "And recall the brother of (the nation of) 'Aad, when he warned his people at the long, curved sand dunes__ while many warners have passed before him and after him (with the same message)__saying, :Do not worship anyone except Allah. Surely I fear for you the punishment of a terrible day."
      },
      {
        "ayet_no" : 22,
        "arbi" : "قَالُوْٓا اَجِئْتَـنَا لِتَاْفِكَنَا عَنْ اٰلِهَتِنَا ۚ فَاْتِنَا بِمَا تَعِدُنَآ اِنْ كُنْتَ مِنَ الصّٰدِقِيْنَ",
        "Urdu" : "انہوں نے کہا کیا تم ہمارے پاس اسی لئے آئے ہو کہ ہمیں پھیر دو ہمارے معبودوں سے ؟ پس لے آؤ ہم پر وہ عذاب جس سے تم ہمیں ڈرا رہے ہو اگر تم سچے لوگوں میں سے ہو",
        "English" : "They said, :Have you come to make us deviate from our gods? So bring us that with which you are threatening us, if you are truthful."
      },
      {
        "ayet_no" : 23,
        "arbi" : "قَالَ اِنَّمَا الْعِلْمُ عِنْدَ اللّٰهِ ڮ وَاُبَلِّغُكُمْ مَّآ اُرْسِلْتُ بِهٖ وَلٰكِنِّىْٓ اَرٰىكُمْ قَوْمًا تَجْـهَلُوْنَ",
        "Urdu" : "ہود نے کہا کہ اس کا علم تو حقیقت میں اللہ ہی کے پاس ہے میں تو صرف وہ پیغام تمہیں پہنچا رہا ہوں جسے دے کر مجھے بھیجا گیا ہے مگر میں تمہیں دیکھ رہا ہوں کہ تم لوگ تو نری جہالت سے کام لے رہے ہو",
        "English" : "He said, :The knowledge is with Allah alone, and I am conveying to you what I am sent with, but I see you are a people who act ignorantly."
      },
      {
        "ayet_no" : 24,
        "arbi" : "فَلَمَّا رَاَوْهُ عَارِضًا مُّسْتَقْبِلَ اَوْدِيَــتِهِمْ ۙ قَالُوْا ھٰذَا عَارِضٌ مُّمْطِرُنَا ۭ بَلْ هُوَ مَا اسْـتَعْــجَلْتُمْ بِهٖ ۭرِيْحٌ فِيْهَا عَذَابٌ اَلِيْمٌ",
        "Urdu" : "آخرکار جب انہوں نے دیکھا اس (عذاب) کو ایک ایسے بادل کی شکل میں جو بڑھا چلا آرہا تھا ان کی وادیوں کی طرف تو وہ کہنے لگے کہ یہ تو ایک بادل ہے جو ہم پر برسنے آرہا ہے (ارشاد ہوا کہ نہیں) بلکہ یہ تو وہی عذاب ہے جس کے لئے تم لوگ جلدی مچا رہے تھے یہ تو ہوا کا ایک طوفان ہے جس میں ایک بڑا دردناک عذاب ہے",
        "English" : "So when they saw that (torment) advancing on their valleys like a cloud, they said: ‘This is the cloud that is going to rain upon us.’ (No, not so;) this (cloud) is rather that (torment) which you were restlessly seeking to hasten. (This) is the storm in."
      },
      {
        "ayet_no" : 25,
        "arbi" : "تُدَمِّرُ كُلَّ شَيْءٍۢ بِاَمْرِ رَبِّهَا فَاَصْبَحُوْا لَا يُرٰٓى اِلَّا مَسٰكِنُهُمْ ۭ كَذٰلِكَ نَجْزِي الْقَوْمَ الْمُجْرِمِيْنَ",
        "Urdu" : "جو تباہ کر کے رکھ دے گی ہرچیز کو اپنے رب کے حکم (و ارشاد) سے چنانچہ اس کے نتیجے میں ان کا حال یہ ہوگیا کہ ان کے گھروں (کے کھنڈرات) کے سوا کچھ دکھائی نہ دیتا تھا اسی طرح ہم بدلہ دیتے ہیں مجرم لوگوں کو ف۲",
        "English" : "That will destroy every thing with the command of its Lord! So they became such that nothing remained to be seen except their dwelling places. This is how We punish the guilty people."
      },
      {
        "ayet_no" : 26,
        "arbi" : "وَلَقَدْ مَكَّنّٰهُمْ فِيْمَآ اِنْ مَّكَّنّٰكُمْ فِيْهِ وَجَعَلْنَا لَهُمْ سَمْعًا وَّاَبْصَارًا وَّاَفْـــِٕدَةً     ڮ فَمَآ اَغْنٰى عَنْهُمْ سَمْعُهُمْ وَلَآ اَبْصَارُهُمْ وَلَآ اَفْــِٕدَتُهُمْ مِّنْ شَيْءٍ اِذْ كَانُوْا يَجْـحَدُوْنَ ۙبِاٰيٰتِ اللّٰهِ وَحَاقَ بِهِمْ مَّا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ",
        "Urdu" : "اور ہم نے ان لوگوں کو ان باتوں میں قدرت دی تھی جن میں تم کو نہیں دی (اے دور حاضر کے بدمست لوگوں !) اور ان کو ہم نے کان بھی عطا کئے تھے اور انکھیں اور دل بھی مگر نہ ان کے کان ان کے کچھ کام آسکے نہ ان کی انکھیں اور نہ دل کیونکہ وہ (جان بوجھ کر) انکار کرتے تھے اللہ کی آیتوں کا اور گھیر کر رہی ان کو وہی چیز جس کا وہ مذاق اڑایا کرتے تھے ف۱",
        "English" : "And indeed We had established them in a powerful position in which We did not establish you (O people of Makkah), and had given to them ears and eyes and hearts, but neither their ears benefited them in the least, nor their eyes, nor their hearts, as they used to reject Allah‘s signs; and they were encircled by what they used to ridicule."
      },
      {
        "ayet_no" : 27,
        "arbi" : "وَلَقَدْ اَهْلَكْنَا مَا حَوْلَكُمْ مِّنَ الْقُرٰى وَصَرَّفْنَا الْاٰيٰتِ لَعَلَّهُمْ يَرْجِعُوْنَ",
        "Urdu" : "اور بلاشبہ ہم تمہارے گرد و بیش کی اور بھی بہت سی بستیوں کو ہلاک کر چکے ہیں اور ہم نے (ان کے لئے بھی)اپنی آیتیں طرح طرح سے بیان کیں تاکہ وہ باز آجائیں",
        "English" : "And We have (also) destroyed (other) towns around you, while We had given to them a variety of signs, so that they might return (from disbelief)."
      },
      {
        "ayet_no" : 28,
        "arbi" : "فَلَوْلَا نَــصَرَهُمُ الَّذِيْنَ اتَّخَذُوْا مِنْ دُوْنِ اللّٰهِ قُرْبَانًا اٰلِهَةً ۭ بَلْ ضَلُّوْا عَنْهُمْ ۚ وَذٰلِكَ اِفْكُهُمْ وَمَا كَانُوْا يَفْتَرُوْنَ",
        "Urdu" : "پھر (عذاب انے پر) کیوں نہ ان کی کوئی مدد کر سکیں وہ ہستیاں جن کو انہوں نے اللہ کے سوا قرب حاصل کرنے کے لئے اپنا معبود بنا رکھا تھا؟ بلکہ (اس وقت) ان سے کھو گئیں (اور گم ہو کر رہ گئیں) وہ سب کی سب اور یہ تھا نتیجہ (و انجام) ان کے اس جھوٹ کا (جو یہ لوگ بولا کرتے تھے) اور ان کے ان ڈھکوسلوں کا جو یہ گھڑا کرتے تھے",
        "English" : "So, why is it that they were not helped by those whom they had taken as gods beside Allah in order to attain closeness (to Him)? Instead, they vanished from them. That was, in fact, their falsity and a thing they used to fabricate."
      },
      {
        "ayet_no" : 29,
        "arbi" : "وَاِذْ صَرَفْنَآ اِلَيْكَ نَفَرًا مِّنَ الْجِنِّ يَسْتَمِعُوْنَ الْقُرْاٰنَ ۚ فَلَمَّا حَضَرُوْهُ قَالُوْٓا اَنْصِتُوْا ۚ فَلَمَّا قُضِيَ وَلَّوْا اِلٰى قَوْمِهِمْ مُّنْذِرِيْنَ",
        "Urdu" : "اور (ان سے اس کا بھی تذکرہ کیجئے کہ) جب ہم نے پھیر دیا آپ کی طرف (اے پیغمبر !) جنوں کے ایک گروہ کو جو کان لگا کر سن رہے تھے اس قران (عظیم) کو سو جب وہ وہاں پہنچ گئے تو آ پس میں کہنے لگے کہ خاموش رہو پھر جب قران پڑھا جا چکا تو وہ وا پس لوٹےاپنی قوم کی طرف خبردار کرنے والے بن کر",
        "English" : "And (recall) when We directed a group of Jinns towards you, listening to the Qur‘an. So, when they attended it, they said (to each other), :Keep quiet. Then once it was over, they went back to their people as warners."
      },
      {
        "ayet_no" : 30,
        "arbi" : "قَالُوْا يٰقَوْمَنَآ اِنَّا سَمِعْنَا كِتٰبًا اُنْزِلَ مِنْۢ بَعْدِ مُوْسٰى مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ يَهْدِيْٓ اِلَى الْحَـقِّ وَاِلٰى طَرِيْقٍ مُّسْـتَقِيْمٍ",
        "Urdu" : "(اور ان سے) کہا کہ اے ہماری قوم کے لوگوں ہم ایک ایسی عظیم الشان کتاب سن کر آئے ہیں جس کو اتارا گیا ہے موسیٰ کے بعد جو تصدیق کرنے والی ہے ان تمام کتابوں کی جو آچکی ہیں اس سے پہلے یہ (کتاب عظیم) راہنمائی کرتی ہے حق اور سیدھے راستے کی",
        "English" : "They said, :O our people, we have heard a book sent down after Musa, 8 confirming what was before it, which guides to the truth and to a straight path."
      },
      {
        "ayet_no" : 31,
        "arbi" : "يٰقَوْمَنَآ اَجِيْبُوْا دَاعِيَ اللّٰهِ وَاٰمِنُوْا بِهٖ يَغْفِرْ لَكُمْ مِّنْ ذُنُوْبِكُمْ وَيُجِرْكُمْ مِّنْ عَذَابٍ اَلِيْمٍ",
        "Urdu" : "اے ہماری قوم کے لوگوں تم قبول کر لو اللہ کی طرف بلانے والے کی دعوت کو اور (صدقِ دل) سے ایمان لے آؤ اس پر اللہ معاف فرما دے گا تمہارے گناہوں کو اور بچا دے گا تم کو ایک بڑے ہی دردناک عذاب سے",
        "English" : "O our people, respond to Allah‘s herald, and believe in him, and (once you do that,) Allah will forgive your sins for you, and will save you from a painful punishment."
      },
      {
        "ayet_no" : 32,
        "arbi" : "وَمَنْ لَّا يُجِبْ دَاعِيَ اللّٰهِ فَلَيْسَ بِمُعْجِزٍ فِي الْاَرْضِ وَلَيْسَ لَهٗ مِنْ دُوْنِهٖٓ اَوْلِيَاۗءُ ۭ اُولٰۗىِٕكَ فِيْ ضَلٰـلٍ مُّبِيْنٍ",
        "Urdu" : "اور جو کوئی بات نہیں مانے گا اللہ کے داعی کی تو وہ (اپنا ہی نقصان کرے گا کہ وہ) ایسا نہیں کہ نکل جائے اس کی گرفت (و پکڑ) سے نہ زمین میں (کہیں چھپ کر) اور نہ ہی اس کے کوئی مددگار ہو سکتے ہیں (جو اسے بچا سکیں) ایسے لوگ پڑے ہیں (صاف اور) کھلی گمراہی میں",
        "English" : "The one who does not respond to Allah‘s herald is not (able) to frustrate (Allah by escaping) in the land, and for him there are no supporters besides Him. Such people are in open error."
      },
      {
        "ayet_no" : 33,
        "arbi" : "اَوَلَمْ يَرَوْا اَنَّ اللّٰهَ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ وَلَمْ يَعْيَ بِخَلْقِهِنَّ بِقٰدِرٍ عَلٰٓي اَنْ يُّـحْيِۦ الْمَوْتٰى ۭ بَلٰٓي اِنَّهٗ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
        "Urdu" : "کیا ان لوگوں نے کبھی اس امر میں غور نہیں کیا کہ جس اللہ نے پیدا فرمایا آسمانوں اور زمین کو اور اس کو ان کے پیدا کرنے سے کوئی تکان نہیں ہوئی وہ اس پر قادر ہے کہ زندہ کر دے مردوں کو؟ (ہاں) کیوں نہیں بلاشبہ وہ ہرچیز پر (پوری) پوری قدرت رکھتا ہے",
        "English" : "Have they not seen that Allah who has created the heavens and the earth, and was not wearied by their creation, does have power to give life to the dead? Yes of course, He is powerful to do every thing."
      },
      {
        "ayet_no" : 34,
        "arbi" : "وَيَوْمَ يُعْرَضُ الَّذِيْنَ كَفَرُوْا عَلَي النَّارِ ۭاَلَيْسَ ھٰذَا بِالْحَقِّ ۭ قَالُوْا بَلٰي وَرَبِّنَا ۭ قَالَ فَذُوْقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْفُرُوْنَ",
        "Urdu" : "(اور یاد کرو اے لوگوں قیامت کے اس ہولناک دن کو کہ) جس دن پیش کیا جائے گا کافروں کو (دوزخ کی) اس ہولناک آگ پر (اور ان سے کہا جائے گا کہ) کیا یہ حق نہیں ہے؟ تو وہ کہیں گے ہاں قسم ہے ہمارے رب کی (یہ قطعی طور پر حق ہے) حکم ہوگا کہ اچھا تو اب چکھتے رہو تم لوگ مزہ اس عذاب کا اپنے اس کفر کی پاداش میں جو تم کرتے رہے تھے (دنیا میں)",
        "English" : "The day the disbelievers will be presented to the Fire, (it will be said to them,) :Is this not true ? They will say, :Yes of course, Our Lord! He will say, :Then taste the punishment, for you used to disbelieve."
      },
      {
        "ayet_no" : 35,
        "arbi" : "فَاصْبِرْ كَمَا صَبَرَ اُولُوا الْعَزْمِ مِنَ الرُّسُلِ وَلَا تَسْتَعْجِلْ لَّهُمْ ۭ كَاَنَّهُمْ يَوْمَ يَرَوْنَ مَا يُوْعَدُوْنَ ۙ لَمْ يَلْبَثُوْٓا اِلَّا سَاعَةً مِّنْ نَّهَارٍ ۭ بَلٰــغٌ ۚ فَهَلْ يُهْلَكُ اِلَّا الْقَوْمُ الْفٰسِقُوْنَ",
        "Urdu" : "پس آپ صبر ہی سے کام لیتے رہیں (اے پیغمبر !) جس طرح کہ صبر سے کام لیا ہمارے دوسرے اولوالعزم رسولوں نے اور جلدی نہیں کرنا ان (لوگوں کے عذاب کے) لئے جس دن یہ خود دیکھ لیں گے اس چیز کو جس سے ان کو ڈرایا جا رہا ہے تو ان کو یوں لگے گا کہ جیسے یہ دنیا میں دن کی ایک گھڑی بھر سے زیادہ نہیں رہے تھے یہ ایک عظیم الشان پیغام ہے جو پہنچا دیا گیا سو اب کیا اور کوئی ہلاک ہوگا سوائے نافرمان لوگوں سے ؟",
        "English" : "So, (O prophet,) observe patience, as the resolute messengers observed patience, and be not in haste about them. The Day they will see what they are promised, (it will be) as if they did not stay (in the world) more than an hour in a single day. This is a message. So, none will be destroyed except the sinners."
      }
    ]
  }
]