[
  {
    "surah_no" : 66,
    "total_ayah" : 12,
    "name" : "Surah e AL-Tehrim",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "يٰٓاَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَآ اَحَلَّ اللّٰهُ لَكَ ۚ تَبْتَغِيْ مَرْضَاتَ اَزْوَاجِكَ    ۭ وَاللّٰهُ غَفُوْرٌ رَّحِيْمٌ",
        "Urdu" : "اے نبی آپ کیوں حرام کرتے ہیں (اپنے اوپر) ایسی چیز کو جس کو اللہ نے حلال فرمایا ہے آپ کے لئےاپنی بیویوں کی رضا (و خوشنودی) چاہتے ہوئے اور اللہ بہرحال بڑا ہی بخشنے والا انتہائی مہربان ہے",
        "English" : "O Prophet, why do you ban (on your self) something that Allah has made lawful for you, seeking to please your wives? And Allah is Most-Forgiving, Very-Merciful."
      },
      {
        "ayet_no" : 2,
        "arbi" : "قَدْ فَرَضَ اللّٰهُ لَكُمْ تَحِلَّةَ اَيْمَانِكُمْ ۚ وَاللّٰهُ مَوْلٰىكُمْ ۚ وَهُوَ الْعَلِيْمُ الْحَكِيْمُ",
        "Urdu" : "بیشک اللہ نے مقرر فرما دیا (اپنے کرم سے) تمہارے لئے تمہاری قسموں کی پابندی سے نکلنے کا طریقہ اور اللہ ہی کارساز ہے تم سب کا اور وہی ہے سب کچھ جانتا نہایت حکمت والا ف۱",
        "English" : "Allah has prescribed (the way of) absolution from your oaths. And Allah is your protector, and He is the All- Knowing, the All-Wise."
      },
      {
        "ayet_no" : 3,
        "arbi" : "وَاِذْ اَسَرَّ النَّبِيُّ اِلٰى بَعْضِ اَزْوَاجِهٖ حَدِيْثًا  ۚ فَلَمَّا نَبَّاَتْ بِهٖ وَاَظْهَرَهُ اللّٰهُ عَلَيْهِ عَرَّفَ بَعْضَهٗ وَاَعْرَضَ عَنْۢ بَعْضٍ ۚ فَلَمَّا نَبَّاَهَا بِهٖ قَالَتْ مَنْ اَنْۢبَاَكَ هٰذَا   ۭ قَالَ نَبَّاَنِيَ الْعَلِيْمُ الْخَبِيْرُ",
        "Urdu" : "اور (وہ وقت بھی یاد کرنے کے لائق ہے کہ) جب پیغمبر نےاپنی ایک بیوی سے ایک بات راز میں کہی پھر جب وہ اس بات کی خبر (دوسری بی بی کو) کر بیٹھیں اور اللہ نے اس کو ظاہر فرما دیا اپنے پیغمبر پر تو پیغمبر نے اس کا کچھ حصہ تو جتلا دیا اور کچھ سے چشم پوشی فرما لی سو جب پیغمبر نے ان کو وہ بات جتلائی تو وہ کہنے لگیں کہ آپ کو اس کی خبر کس نے دی؟ تو آپ صلی اللہ علیہ وسلم نے جواب میں فرمایا کہ مجھے اس ذات نے خبر دی ہے جو (سب کچھ) جاننے والی (ہر شئ سے) پوری طرح باخبر ہے",
        "English" : "And (remember) when the Prophet told one of his wives something in secret. So, when she disclosed it (to another wife) , and Allah made it known to him, he told (the disclosing wife) part of it, and avoided another part. So when he informed her about it, she said, :Who told you about this? He said, :I was told of it by the All-Knowing, the All-Aware."
      },
      {
        "ayet_no" : 4,
        "arbi" : "اِنْ تَتُوْبَآ اِلَى اللّٰهِ فَقَدْ صَغَتْ قُلُوْبُكُمَا ۚ وَاِنْ تَظٰهَرَا عَلَيْهِ فَاِنَّ اللّٰهَ هُوَ مَوْلٰىهُ وَجِبْرِيْلُ وَصَالِحُ الْمُؤْمِنِيْنَ ۚ وَالْمَلٰۗىِٕكَةُ بَعْدَ ذٰلِكَ ظَهِيْرٌ",
        "Urdu" : "اب اگر تم دونوں نے توبہ کر لی اللہ کی بارگاہ میں تو یقینا (یہ خود تمہارے ہی لئے بہتر ہوگا کہ) تمہارے دل کچھ مائل ہوگئے ہیں اور اگر تم نے پیغمبر کے خلاف ایک دوسرے کی مدد جاری رکھی تو (اس میں ان کا کوئی نقصان نہیں کیونکہ) ان کا تو یقینا اللہ بھی مددگار ہے جبرائیل بھی اور نیک بخت ایمان والے بھی اور اس کے بعد فرشتے بھی (آپ کے) حامی ہیں ف۲",
        "English" : "(O two wives of the Prophet,) If both of you repent to Allah, then (your conduct calls for it, because) your hearts have departed from the correct way. And if you back each other against him (the Prophet) , then Allah is his supporter, and Jibra‘il (Gabriel) and righteous believers, and after all that, angels are his helpers."
      },
      {
        "ayet_no" : 5,
        "arbi" : "عَسٰى رَبُّهٗٓ اِنْ طَلَّقَكُنَّ اَنْ يُّبْدِلَهٗٓ اَزْوَاجًا خَيْرًا مِّنْكُنَّ مُسْلِمٰتٍ مُّؤْمِنٰتٍ قٰنِتٰتٍ تٰۗىِٕبٰتٍ عٰبِدٰتٍ سٰۗىِٕحٰتٍ ثَيِّبٰتٍ وَّاَبْكَارًا",
        "Urdu" : "بعید نہیں کہ اگر پیغمبر تم سب بیویوں کو طلاق دے دے تو ان کا رب تمہارے بدلے میں ان کو تم سے ایسی اچھی بیویاں دے دے جو اسلام والی ایمان والی فرمانبرداری کرنے والی توبہ کرنے والی عبادت گذار اور روزہ دار ہوں خواہ شوہر دیدہ ہوں یا کنواری",
        "English" : "It is hoped that, if he divorces you, Allah will give him in your place wives better than you, submissive to Allah, believing, devout, penitent, steadfast in worship, fasting, previously married and virgins."
      },
      {
        "ayet_no" : 6,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا قُوْٓا اَنْفُسَكُمْ وَاَهْلِيْكُمْ نَارًا وَّقُوْدُهَا النَّاسُ وَالْحِجَارَةُ عَلَيْهَا مَلٰۗىِٕكَةٌ غِلَاظٌ شِدَادٌ لَّا يَعْصُوْنَ اللّٰهَ مَآ اَمَرَهُمْ وَيَفْعَلُوْنَ مَا يُؤْمَرُوْنَ",
        "Urdu" : "اے وہ لوگو! جو ایمان لائے ہو تم بچاؤ اپنے آپ کو بھی اور اپنے گھر والوں کو بھی ایک ایسی ہولناک آگ سے جس کا ایندھن انسان اور پتھر ہوں گے اس پر مقرر ہوں گے ایسے فرشتے جو بڑے تندخو اور نہایت سخت گیر ہوں گے جو کبھی نافرمانی نہیں کرتے اللہ کے کسی حکم کی اور وہ پوری طرح بجا لاتے ہیں ان اوامر کو جو (ان کے مالک کی طرف سے) ان کو دیئے جاتے ہیں",
        "English" : "O you who believe, save yourselves and your families from a fire, the fuel of which is human beings and stones, appointed on which are angels, stern and severe, who do not disobey Allah in what He orders them, and do whatever they are ordered to do."
      },
      {
        "ayet_no" : 7,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ كَفَرُوْا لَا تَعْتَذِرُوا الْيَوْمَ ۭ اِنَّمَا تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُوْنَ",
        "Urdu" : "(اور اس وقت کافروں سے کہا جائے گا کہ) اے وہ لوگوں (جو زندگی بھر) کفر ہی کی راہ پر چلتے رہے ہو اب عذر (بہانے) مت پیش کرو تمہیں تو تمہارے انہی کاموں کا بدلہ دیا جا رہا ہے جو تم لوگ خود کرتے رہے تھے",
        "English" : "O you who disbelieve, do not make excuses today. You will only be recompensed for what you have been doing."
      },
      {
        "ayet_no" : 8,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا تُوْبُوْٓا اِلَى اللّٰهِ تَوْبَةً نَّصُوْحًا ۭعَسٰى رَبُّكُمْ اَنْ يُّكَفِّرَ عَنْكُمْ سَيِّاٰتِكُمْ وَيُدْخِلَكُمْ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ ۙ يَوْمَ لَا يُخْزِي اللّٰهُ النَّبِيَّ وَالَّذِيْنَ اٰمَنُوْا مَعَهٗ ۚ نُوْرُهُمْ يَسْعٰى بَيْنَ اَيْدِيْهِمْ وَبِاَيْمَانِهِمْ يَقُوْلُوْنَ رَبَّنَآ اَتْمِمْ لَنَا نُوْرَنَا وَاغْفِرْ لَنَا ۚ اِنَّكَ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
        "Urdu" : "اے وہ لوگوں جو ایمان لائے ہو توبہ کرو اللہ کے حضور سچی (اور خالص) توبہ بعید نہیں کہ تمہارا رب دور کر دے تم سے تمہاری برائیاں اور (ان کی میل کچیل) اور وہ داخل فرما دے تم کو ایسی عظیم الشان جنتوں میں جن کے نیچے سے بہہ رہی ہوں گی طرح طرح کی (عظیم الشان) نہریں (اور یہ سب کچھ اس روز ہوگا) جس دن کہ اللہ رسوا نہیں فرمائے گا اپنے پیغمبر کو اور ان لوگوں کو جو ایمان لائے ہوں گے ان کے ساتھ (اور ان کی شان اس روز یہ ہوگی کہ) انکا نور دوڑ رہا ہوگا ان کے آگے اور ان کے دائیں اور وہ کہہ رہے ہوں گے اے ہمارے رب پورا (اور مکمل) فرما دے ہمارے لئے ہمارے نور کو اور ہماری بخشش فرما دے (اپنے کرم سے) بیشک تجھے (اے ہمارے مالک!) ہرچیز پر پوری قدرت ہے",
        "English" : "O you who believe, turn to Allah with a faithful repentance. It is hoped from your Lord that he will write off your faults, and will admit you to the gardens beneath which rivers flow, on the Day when Allah will not disgrace the Prophet and those who believed with him. Their light will run before them and to their right hands. They will say, :Our Lord, perfect for us our light, and forgive us. Indeed you are powerful over every thing."
      },
      {
        "ayet_no" : 9,
        "arbi" : "يٰٓاَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَالْمُنٰفِقِيْنَ وَاغْلُظْ عَلَيْهِمْ ۭ وَمَاْوٰىهُمْ جَهَنَّمُ    ۭ وَبِئْسَ الْمَصِيْرُ",
        "Urdu" : "اے پیغمبر جہاد کرو کھلے کافروں سے بھی اور منافقوں سے بھی اور سختی سے کام لو ان کے معاملے میں ان سب کا ٹھکانا جہنم ہے اور بڑا ہی برا ٹھکانا ہے وہ",
        "English" : "O Prophet, carry out Jihad (struggle) against the disbelievers and the hypocrites, and be harsh with them. Their final abode is Jahannam (Hell) , and it is an evil end."
      },
      {
        "ayet_no" : 10,
        "arbi" : "ضَرَبَ اللّٰهُ مَثَلًا لِّلَّذِيْنَ كَفَرُوا امْرَاَتَ نُوْحٍ وَّامْرَاَتَ لُوْطٍ ۭ كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَخَانَتٰهُمَا فَلَمْ يُغْنِيَا عَنْهُمَا مِنَ اللّٰهِ شَيْــــًٔا وَّقِيْلَ ادْخُلَا النَّارَ مَعَ الدّٰخِلِيْنَ",
        "Urdu" : "اللہ نے مثال بیان فرمائی کافروں (کی عبرت) کے لئے نوح اور لوط کی بیویوں کی یہ دونوں ہمارے دو نیک بندوں کے نکاح میں تھیں مگر انہوں نے ان دونوں سے خیانت (اور بددیانتی) کا ارتکاب کیا تو وہ دونوں بھی (اتنے بڑے مرتبے پر فائز ہونے کے باوجود) اللہ کے مقابلے میں ان کے کچھ بھی کام نہ آسکے اور (ان دونوں عورتوں سے) کہہ دیا گیا کہ تم دونوں بھی داخل ہو جاؤ دوزخ میں دوسرے داخل ہونے والوں کے ساتھ",
        "English" : "Allah has cited for the disbelievers the example of the wife of NuH and the wife of LuT. Both were married with two of Our righteous servants, but betrayed them. So they could not benefit them against Allah at all, and it was said, :Enter the Fire along with those who enter."
      },
      {
        "ayet_no" : 11,
        "arbi" : "وَضَرَبَ اللّٰهُ مَثَلًا لِّلَّذِيْنَ اٰمَنُوا امْرَاَتَ فِرْعَوْنَ    ۘاِذْ قَالَتْ رَبِّ ابْنِ لِيْ عِنْدَكَ بَيْتًا فِي الْجَنَّةِ وَنَجِّــنِيْ مِنْ فِرْعَوْنَ وَعَمَلِهٖ وَنَجِّــنِيْ مِنَ الْقَوْمِ الظّٰلِمِيْنَ",
        "Urdu" : "اور اللہ نے ایمان والوں (کی تسکین و تسلی) کے لئے مثال بیان فرمائی فرعون کی بیوی کی جب کہ انہوں نے (اپنے رب کے حضور) عرض کیا کہ اے میرے رب! بنادے میرے لئے اپنے پاس ایک گھر جنت میں اور بچا لے مجھے فرعون اور اس کے عمل سے اور بچالے مجھے (اپنے کرم سے) ان ظالم لوگوں (کے ظلم وستم) سے",
        "English" : "And Allah has cited for the believers the example of the wife of Fir‘aun (Pharaoh) , when she said, :My Lord, build for me, near You, a house in the Paradise, and deliver me from Fir‘aun and his deeds, and deliver me from the unjust people."
      },
      {
        "ayet_no" : 12,
        "arbi" : "وَمَرْيَمَ ابْنَتَ عِمْرٰنَ الَّتِيْٓ اَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيْهِ مِنْ رُّوْحِنَا وَصَدَّقَتْ بِكَلِمٰتِ رَبِّهَا وَكُتُبِهٖ وَكَانَتْ مِنَ الْقٰنِتِيْنَ",
        "Urdu" : "نیز (مثال بیان فرمائی ایمان والوں کی تسکین و تسلی کے لئے) عمران کی بیٹی مریم کی جس نے محفوظ رکھااپنی (عزت و) ناموس کو پھر ہم نے پھونک دیا ان (کے گریبان) میںاپنی روح میں سے اور اس نے تصدیق کی اپنے رب کی باتوں کی اور اس کی (نازل کردہ) کتابوں کی اور وہ تھی فرمانبردار لوگوں میں سے ف۱",
        "English" : "And (Allah has also cited the example of) Maryam, daughter of 'lmran who guarded her chastity, so We breathed into her Our spirit, and she testified to the truth of the words of her Lord and His books, and she was one of the devout."
      }
    ]
  }
]