[
  {
    "surah_no" : 22,
    "total_ayah" : 78,
    "name" : "Surah e Hajj",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "يٰٓاَيُّهَا النَّاسُ اتَّقُوْا رَبَّكُمْ ۚ اِنَّ زَلْزَلَةَ السَّاعَةِ شَيْءٌ عَظِيْمٌ",
        "Urdu" : "اے لوگوں بچو تم اپنے رب کے عذاب اور اس کی خوف وپکڑ سے بیشک قیامت کی اس گھڑی کا زلزلہ ایک بری ہی ہولناک چیز ہے ف۳",
        "English" : "Mankind! fear your Lord; verily the quake of the Hour shall be a thing mighty."
      },
      {
        "ayet_no" : 2,
        "arbi" : "يَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّآ اَرْضَعَتْ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَتَرَى النَّاسَ سُكٰرٰي وَمَا هُمْ بِسُكٰرٰي وَلٰكِنَّ عَذَابَ اللّٰهِ شَدِيْدٌ",
        "Urdu" : "جس روز تم لوگ اس کو دیکھو گے تو حال یہ ہوگا کہ مارے دہشت وخوف کے بھول جائے گی ہر دودھ پلانے والی اپنے دودھ پیتے بچے کو اور گرا دے گی ہر حمل والی اپنے حمل کو اور لوگ تمہیں نشے کی حالت میں نظر آئیں گے حالانکہ وہ نشے میں نہیں ہوں گے مگر اللہ کا عذاب بڑا ہی سخت ہوگا ف٤",
        "English" : "On the day when ye behold it, every nursing mother will forget her nursling and every pregnant one will be delivered of her burden, and thou (Muhammad) wilt see mankind as drunken, yet they will not be drunken, but the Doom of Allah will be strong (upon them)."
      },
      {
        "ayet_no" : 3,
        "arbi" : "وَمِنَ النَّاسِ مَنْ يُّجَادِلُ فِي اللّٰهِ بِغَيْرِ عِلْمٍ وَّيَتَّبِـعُ كُلَّ شَيْطٰنٍ مَّرِيْدٍ",
        "Urdu" : "اور کچھ لوگ ایسے ہیں جو جھگڑا کرتے ہیں اللہ پاک کی ذات وصفات کے بارے میں اور وہ پیچھے ہو لیتے ہیں ہر ایسے سرکش شیطان کے (جو پکارے ان کو اپنے باطل کی طرف اور) ف۱",
        "English" : "And of mankind is he who dispute respecting Allah without knowledge, and follow any Satan froward."
      },
      {
        "ayet_no" : 4,
        "arbi" : "كُتِبَ عَلَيْهِ اَنَّهٗ مَنْ تَوَلَّاهُ فَاَنَّهٗ يُضِلُّهٗ وَيَهْدِيْهِ اِلٰى عَذَابِ السَّعِيْرِ",
        "Urdu" : "جس کے بارے میں یہ لکھ اور طے کر دیا گیا ہے کہ جس نے اس کو دوست بنایا تو وہ تباہ ہوگیا کہ یقینا وہ اس کو گمراہ کر کے چھوڑے گا اور وہ اس کو ڈال دے گا دوزخ کی دہکتی بھڑکتی آگ کے عذاب کی راہ پر",
        "English" : "Against whom it is prescribed, that: whosoever befriend him, him he shall lead astray and shall guide him on to the torment of the Flame."
      },
      {
        "ayet_no" : 5,
        "arbi" : "يٰٓاَيُّهَا النَّاسُ اِنْ كُنْتُمْ فِيْ رَيْبٍ مِّنَ الْبَعْثِ فَاِنَّا خَلَقْنٰكُمْ مِّنْ تُرَابٍ ثُمَّ مِنْ نُّطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ ثُمَّ مِنْ مُّضْغَةٍ مُّخَلَّقَةٍ وَّغَيْرِ مُخَلَّقَةٍ لِّنُبَيِّنَ لَكُمْ ۭ وَنُقِرُّ فِي الْاَرْحَامِ مَا نَشَاۗءُ اِلٰٓى اَجَلٍ مُّسَمًّى ثُمَّ نُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوْٓا اَشُدَّكُمْ ۚ وَمِنْكُمْ مَّنْ يُّتَوَفّٰى وَمِنْكُمْ مَّنْ يُّرَدُّ اِلٰٓى اَرْذَلِ الْعُمُرِ لِكَيْلَا يَعْلَمَ مِنْۢ بَعْدِ عِلْمٍ شَيْــــًٔا ۭ وَتَرَى الْاَرْضَ هَامِدَةً فَاِذَآ اَنْزَلْنَا عَلَيْهَا الْمَاۗءَ اهْتَزَّتْ وَرَبَتْ وَاَنْۢبَتَتْ مِنْ كُلِّ زَوْجٍۢ بَهِيْجٍ",
        "Urdu" : "اے لوگوں اگر تمہیں کسی طرح کا کوئی شک ہو اپنے دوبارہ جی اٹھنے کے بارے میں تو تم خوداپنی پیدائش وپرورش سے متعلق ہی ہماری قدرت کاملہ کے مظاہر میں غور کر لو کہ ہم نے تمہیں کس عجیب وغریب اور پُر حکمت طریقے سے پیدا کیا مٹی کے اس بےحس اور بےجان مادے سے پھر نطفے سے پھر ایک جمے ہوئے خون سے پھر گوشت کی بوٹی سے جو شکل والی بھی ہوتی ہے اور بیشکل بھی اور ہم نے تمہاری پیدائش سے متعلق یہ اہم تغیرات تمہیں بتا بھی دئیے تاکہ ہم کھول کر بیان کردیں تمہارے لئے تمہاری حقیقت اور اس سے متعلقاپنی قدرت کے مظاہر کو اور ہم جس کو چاہتے ہیں ٹھہرا دیتے ہیں رحموں کے اندر ایک خاص مدت تک ف۲ پھر ہم نکال لاتے ہیں تم کو تمہاری ماؤں کے پیٹوں سے ایک بچے کی شکل میں پھر نہایت مناسب وعمدہ طریقے سے ہم تمہاری پرورش کرتے ہیں تاکہ تم پہنچ جاؤاپنی جوانی کی بھرپور قوتوں کو اور تم میں سے کسی کو پہلے ہی وا پس اٹھالیا جاتا ہے اور کسی کو لوٹا دیا جاتا ہے اس کی گھٹیا اور بدترین عمر کی طرف جس کا اثر ونتیجہ یہ ہوتا ہے کہ وہ سب کچھ جاننے کے بعد کچھ بھی نہیں جان رہا ہوتا ف۳ اور تم اپنے پیش یا افتادہ اس زمین ہی میں غور کرلو کہ ایک وقت تم اس کو بالکل ویران اور خشک پڑی ہوئی دیکھتے ہو پھر جب ہم اس پر مینہ برسا دیتے ہیں تو یکایک اس میں زندگی کی حرکت پیدا ہوتی ہے اور یہ ایک خاص انداز سے ابھرتی ہے اور یہ اگانا شروع کر دیتی ہے ہر قسم کی خوش منظر نباتات",
        "English" : "O mankind, if you are in doubt about Resurrection, then (recall that) We created you from dust, then from a drop of semen, then from a clot, then from a piece of flesh, either shaped or unshaped, so that We manifest (Our power) to you. We retain in the wombs whatever We will to a specified term. Then We bring you out as babies, then (We nourish you) so that you reach your maturity. And among you there is one who dies, and among you there is one who is carried to the worst part of the age, so that he knows nothing even after having knowledge. And you see the land dry. Then once We send down water on it, it stirs and swells and puts forth every pleasant pair (of vegetation)."
      },
      {
        "ayet_no" : 6,
        "arbi" : "ذٰلِكَ بِاَنَّ اللّٰهَ هُوَ الْحَقُّ وَاَنَّهٗ يُـحْيِ الْمَوْتٰى وَاَنَّهٗ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
        "Urdu" : "یہ سب کچھ اس بناء پر ہے کہ اللہ ہی حق ہے اور وہی زندہ کرتا ہے مردوں کو اور بیشک وہی ہے جو ہرچیز پر پوری قدرت رکھتا ہے ۔ ف۱",
        "English" : "That, because Allah! He is The Truth, and He quicken the dead, and verily He is over everything Potent."
      },
      {
        "ayet_no" : 7,
        "arbi" : "وَّاَنَّ السَّاعَةَ اٰتِيَةٌ لَّا رَيْبَ فِيْهَا ۙ وَاَنَّ اللّٰهَ يَبْعَثُ مَنْ فِي الْقُبُوْرِ",
        "Urdu" : "اور بیشک قیامت کی اس ہولناک گھڑی نے بہرحال آکر رہنا ہے اس میں کسی قسم کے شک کی کوئی گنجائش نہیں اور بیشک اللہ تعالیٰ ان سب لوگوں کو ضرور دوبارہ اٹھائے گا جو قبروں میں جا چکے ہیں",
        "English" : "And because the Hour is coming- there is no doubt thereof--and because Allah will raise up those who are in the graves."
      },
      {
        "ayet_no" : 8,
        "arbi" : "وَمِنَ النَّاسِ مَنْ يُّجَادِلُ فِي اللّٰهِ بِغَيْرِ عِلْمٍ وَّلَا هُدًى وَّلَا كِتٰبٍ مُّنِيْرٍ",
        "Urdu" : "اور کچھ لوگ ایسے ہیں جو جھگڑا کرتے ہیں اللہ کی ذات وصفات کے بارے میں بغیر کسی علم کے اور بدون کسی دلیل اور روشن کتاب کے",
        "English" : "And of mankind is he who dispute respecting Allah without knowledge or guidance or a Book luminous."
      },
      {
        "ayet_no" : 9,
        "arbi" : "ثَانِيَ عِطْفِهٖ لِيُضِلَّ عَنْ سَبِيْلِ اللّٰهِ ۭ لَهٗ فِي الدُّنْيَا خِزْيٌ وَّنُذِيْقُهٗ يَوْمَ الْقِيٰمَةِ عَذَابَ الْحَرِيْقِ",
        "Urdu" : "تکبر سے گردن اکڑائے ہوئے تاکہ اس طرح یہ دوسروں کو بھی بہکا سکیں اللہ کی راہ سے ایسے لوگوں کیلئے دنیا میں رسوائی ہے اور قیامت کے دن ہم ان کو مزہ چکھائیں گے دوزخ کی دہکتی بھڑکتی آگ کے عذاب کا ف۲",
        "English" : "Bending his neck, that he may lead astray from the way of Allah; his shall be humiliation in the world, and We shall make him taste on the Day of Judgment the torment of Burning."
      },
      {
        "ayet_no" : 10,
        "arbi" : "ذٰلِكَ بِمَا قَدَّمَتْ يَدٰكَ وَاَنَّ اللّٰهَ لَيْسَ بِظَلَّامٍ لِّـلْعَبِيْدِ",
        "Urdu" : "اور ان کی مزید تذلیل کے لئے ان سے کہا جائے گا کہ یہ نتیجہ و بدلہ ہے تمہارے ان کاموں کا جو تم لوگوں نے خود اپنے ہاتھوں آگے بھیجے تھےاپنی آخرت کے لئے ورنہ اللہ کبھی ظلم نہیں کرتا اپنے بندوں پر",
        "English" : "That is because of what your hands have sent forth, and verily, Allah is not unjust to (His) slaves."
      },
      {
        "ayet_no" : 11,
        "arbi" : "وَمِنَ النَّاسِ مَنْ يَّعْبُدُ اللّٰهَ عَلٰي حَرْفٍ ۚ فَاِنْ اَصَابَهٗ خَيْرُۨ اطْـمَاَنَّ بِهٖ ۚ وَاِنْ اَصَابَتْهُ فِتْنَةُۨ انْقَلَبَ عَلٰي وَجْهِهٖ ڗ خَسِرَ الدُّنْيَا وَالْاٰخِرَةَ ۭ ذٰلِكَ هُوَ الْخُسْرَانُ الْمُبِيْنُ",
        "Urdu" : "اور کچھ لوگ ایسے ہیں جو اللہ کی بندگی کرتے ہیں ایک کنارے پر رہ کر پھر اگر ان کو کوئی دنیاوی فائدہ مل گیا تو مطمئن ہوگئے اور اگر کوئی آزمائش آگئی تو یہ منہ اٹھا کر چل دئیے اس طرح وہاپنی دنیا بھی کھو بیٹھتے ہیں اور آخرت بھی اور دنیا وآخرت دونوں کا یہ خسارہ ہی کھلا ہوا خسارہ ہے ف۳",
        "English" : "And among men there is one who worships Allah (standing) on the verge: so if some good thing happens to him, he is satisfied with it, and if a trial befalls him, he turns his face back. He loses both this world and the Hereafter. That is the manifest loss."
      },
      {
        "ayet_no" : 12,
        "arbi" : "يَدْعُوْا مِنْ دُوْنِ اللّٰهِ مَا لَا يَضُرُّهٗ وَمَا لَا يَنْفَعُهٗ  ۭ ذٰلِكَ هُوَ الضَّلٰلُ الْبَعِيْدُ",
        "Urdu" : "ایسا شخص اللہ کے سوا ایسی فرضی وہمی اور بےحقیقت چیزوں کو پکارتا ہے جو اس کو نہ کوئی نقصان دے سکیں اور نہ نفع پہنچا سکیں یہی ہے انتہا درجے کی گمراہی ف٤",
        "English" : "He prays to someone, instead of Allah, who can neither harm him nor benefit him. That is the error that takes him too far from the right path."
      },
      {
        "ayet_no" : 13,
        "arbi" : "يَدْعُوْا لَمَنْ ضَرُّهٗٓ اَقْرَبُ مِنْ نَّفْعِهٖ ۭ لَبِئْسَ الْمَوْلٰى وَلَبِئْسَ الْعَشِيْرُ",
        "Urdu" : "یہ پکارتا ہے ان خود ساختہ وفرضی ہستیوں اور بناوٹی و وہمی سرکاروں کو جن کا نقصان یقینی طور پر ان کے نفع سے زیادہ قریب ہے یقینا بڑا ہی برا ہے ایسا کار ساز بھی اور برا ہی برا ہے ایسا ساتھی بھی ف۱",
        "English" : "He calls unto him whose harm is nearer than his profit; certainly, and evil Maula (patron) and certainly an evil friend!"
      },
      {
        "ayet_no" : 14,
        "arbi" : "اِنَّ اللّٰهَ يُدْخِلُ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ  ۭ اِنَّ اللّٰهَ يَفْعَلُ مَا يُرِيْدُ",
        "Urdu" : "اس کے برعکس جو لوگ صدق دل سے ایمان لائے اور انہوں نے کام بھی نیک کئے ان کو اللہ تعالیٰ یقینی طور پر اپنے کرم سے داخل فرمائے گا ایسی عظیم الشان جنتوں میں جن کے نیچے سے بہہ رہی ہوں گی طرح طرح کی عظیم الشان وبے مثل نہریں بیشک اللہ کرتا ہے جو چاہتا ہے",
        "English" : "Surely, Allah will admit those who believe and do good deeds into gardens beneath which rivers flow. Surely Allah does what He intends."
      },
      {
        "ayet_no" : 15,
        "arbi" : "مَنْ كَانَ يَظُنُّ اَنْ لَّنْ يَّنْصُرَهُ اللّٰهُ فِي الدُّنْيَا وَالْاٰخِرَةِ فَلْيَمْدُدْ بِسَبَبٍ اِلَى السَّمَاۗءِ ثُمَّ لْيَقْطَعْ فَلْيَنْظُرْ هَلْ يُذْهِبَنَّ كَيْدُهٗ مَا يَغِيْظُ",
        "Urdu" : "جو کوئی یہ گمان رکھتا ہو کہ اللہ اس کی کوئی مدد نہیں فرمائے گا دنیا وآخرت میں تو اس کو چاہیے کہ وہ ایک رسی تان لے آسمان کی طرف پھر وہ کاٹ ڈالے سلسلہ وحی کو پھر دیکھ لے کہ کیا اس کی تدبیر رد کر سکتی ہے اس چیز کو جو اس کو غصہ دلاتی ہے ؟",
        "English" : "If someone thinks that Allah will never help him (the prophet) in this world and in the Hereafter, he should stretch a rope to the sky, then cut (Allah‘s communication) off (from the prophet) and see whether his effort can really remove what irritates (him)."
      },
      {
        "ayet_no" : 16,
        "arbi" : "وَكَذٰلِكَ اَنْزَلْنٰهُ اٰيٰتٍۢ بَيِّنٰتٍ ۙ وَّاَنَّ اللّٰهَ يَهْدِيْ مَنْ يُّرِيْدُ",
        "Urdu" : "اور اسی طرح اتارا ہے ہم نے اس قران کو کھلے اور روشن دلائل کی صورت میں اور بیشک اللہ ہی نوازتا ہے ہدایت کی دولت سے جس کو چاہتا ہے ف۲",
        "English" : "And Thus We have sent it down as evidences, and verily Allah guide whomsoever He intend."
      },
      {
        "ayet_no" : 17,
        "arbi" : "اِنَّ الَّذِيْنَ اٰمَنُوْا وَالَّذِيْنَ هَادُوْا وَالصّٰبِــِٕــيْنَ وَالنَّصٰرٰي وَالْمَجُوْسَ وَالَّذِيْنَ اَشْرَكُـوْٓا ڰ اِنَّ اللّٰهَ يَفْصِلُ بَيْنَهُمْ يَوْمَ الْقِيٰمَةِ ۭ اِنَّ اللّٰهَ عَلٰي كُلِّ شَيْءٍ شَهِيْدٌ",
        "Urdu" : "بیشک جو لوگ ایمان لائے اور جو یہودی بن گئے اور ستارہ پرست اور نصرانی اور مجوسی اور وہ لوگ جنہوں نے شرک کیا بیشک اللہ تعالیٰ ان سب کے درمیان فیصلہ فرما دے گا قیامت کے دن عملاً اور آخری طور پر بیشک اللہ ہرچیز پر پوری طرح مطلع ہے کیا ف۳",
        "English" : "As for those who believe and the Jews and the Sabians and the Christians and the Magicians and those who ascribe partners to Allah, Allah will judge between them on the Day of Judgment. Surely Allah is witness to every thing."
      },
      {
        "ayet_no" : 18,
        "arbi" : "اَلَمْ تَرَ اَنَّ اللّٰهَ يَسْجُدُ لَهٗ مَنْ فِي السَّمٰوٰتِ وَمَنْ فِي الْاَرْضِ وَالشَّمْسُ وَالْقَمَرُ وَالنُّجُوْمُ وَالْجِبَالُ وَالشَّجَرُ وَالدَّوَاۗبُّ وَكَثِيْرٌ مِّنَ النَّاسِ  ۭ وَكَثِيْرٌ حَقَّ عَلَيْهِ الْعَذَابُ  ۭ وَمَنْ يُّهِنِ اللّٰهُ فَمَا لَهٗ مِنْ مُّكْرِمٍ  ۭ اِنَّ اللّٰهَ يَفْعَلُ مَا يَشَاۗءُ",
        "Urdu" : "تم دیکھتے نہیں ہو کہ اللہ ہی کے حضور سجدہ ریز ہیں وہ سب جو کہ آسمانوں میں ہیں اور وہ سب بھی جو کہ زمین میں ہیں اور سورج وچاند اور ستارے و پہاڑ اور درخت اور جانور ف٤ اور بہت سے انسان بھی ف۱ اور بہت سے ایسے ہیں جن پر پکا ہوچکا ہے اللہ کا عذاب ف۲ اور حقیقت یہ ہے کہ جسے اللہ ذلیل کر دے اسے کوئی عزت نہیں دے سکتابلا شبہ اللہ جو چاہتا ہے کرتا ہے ۔",
        "English" : "Have you not seen that to Allah prostrate all those in the skies and all those on the earth, and the sun, the moon, the stars, the mountains, the trees, the animals and many from mankind? And there are many on whom punishment has become due. And the one whom Allah puts to disgrace, there is none to give him respect. Surely Allah does what He wills."
      },
      {
        "ayet_no" : 19,
        "arbi" : "ھٰذٰنِ خَصْمٰنِ اخْتَصَمُوْا فِيْ رَبِّهِمْ ۡ فَالَّذِيْنَ كَفَرُوْا قُطِّعَتْ لَهُمْ ثِيَابٌ مِّنْ نَّارٍ ۭ يُصَبُّ مِنْ فَوْقِ رُءُوْسِهِمُ الْحَمِيْمُ",
        "Urdu" : "ایمان وکفر والے یہ دو فریق ہیں جن کے درمیان جھگڑا ہے ان کے رب کے بارے میں سو ان میں جو اڑے ہوئے ہیں اپنے کفر وباطل پر ان کے لئے کپڑے کاٹے جا چکے ہیں آگ کے ان کے مجرمانہ قد کاٹھ کے مطابق اور مزید برآں ان کی خبر گیری کے لئے ان کے سروں کے اوپر سے ان پر ڈالا جائے گا ایسا کھولتا ہوا پانی",
        "English" : "These two opponents (believers and disbelievers) dispute with each other about their Lord; then as for those who disbelieve, garments of fire will be cut out for them, boiling water will be poured down over their heads."
      },
      {
        "ayet_no" : 20,
        "arbi" : "يُصْهَرُ بِهٖ مَا فِيْ بُطُوْنِهِمْ وَالْجُلُوْدُ",
        "Urdu" : "جس سے پگھل پگھل جائے گا وہ سب کچھ جو ان کے پیٹوں کے اندر ہوگا",
        "English" : "Molten thereby shall be that which is in their bellies and also their skins."
      },
      {
        "ayet_no" : 21,
        "arbi" : "وَلَهُمْ مَّقَامِعُ مِنْ حَدِيْدٍ",
        "Urdu" : "اور ان کی کھالیں بھی اور مزید خبر لینے کو ان کے لئے گرز ہوں گے لوہے کے",
        "English" : "And for them shall be maces of iron."
      },
      {
        "ayet_no" : 22,
        "arbi" : "كُلَّمَآ اَرَادُوْٓا اَنْ يَّخْرُجُوْا مِنْهَا مِنْ غَمٍّ اُعِيْدُوْا فِيْهَا  ۤ وَذُوْقُوْا عَذَابَ الْحَرِيْقِ",
        "Urdu" : "شدت غم کی بنا پر جب وہ وہاں سے نکلنا چاہیں گے تو انھیں وا پس اسی میں دھکیل دیا جائے گا اور مزید تذلیل وتوبیخ کے طور پر ان سے کہا جائے گا کہ اب مزہ چکھتے رہو تم لوگ اس بھڑکتی آگ کے عذاب کا",
        "English" : "Every time they seek to get away therefrom, from anguish, they will be driven back therein, and (it will be) said to them: (Taste the torment of burning!)"
      },
      {
        "ayet_no" : 23,
        "arbi" : "اِنَّ اللّٰهَ يُدْخِلُ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ يُحَلَّوْنَ فِيْهَا مِنْ اَسَاوِرَ مِنْ ذَهَبٍ وَّلُؤْلُؤًا ۭ وَلِبَاسُهُمْ فِيْهَا حَرِيْرٌ",
        "Urdu" : "بیشک اللہ تعالیٰ داخل فرما دے گا اپنے کرم سے ان لوگوں کو جو صدق دل سے ایمان لائے ہوں گے اور انہوں نے کام بھی نیک کئے ہوں گے ایسے عظیم الشان جنتوں میں جن کے نیچے سے بہہ رہی ہوں گی طرح طرح کی عظیم الشان اور بےمثل نہریں وہاں ان کو آراستہ کیا جائے گا سونے کے گنگنوں اور موتیوں سے اور ان کے لباس وہاں پر ریشم کے ہوں گے",
        "English" : "Surely Allah will admit those who believe and do good deeds to gardens beneath which rivers flow. They will be adorned therein with bracelets of gold and with pearls, and their dress therein will be (of) silk."
      },
      {
        "ayet_no" : 24,
        "arbi" : "وَهُدُوْٓا اِلَى الطَّيِّبِ مِنَ الْقَوْلِ ښ وَهُدُوْٓا اِلٰى صِرَاطِ الْحَمِيْدِ",
        "Urdu" : "اور ان کو یہ سب کچھ اس لئے ملے گا کہ دنیا میں انھیں ہدایت وتوفیق مل گئی تھی پاکیزہ قول کو قبول کرنے کی اور انھیں ہدایت وتوفیق مل گئی تھی خدائے ستودہ صفات کے راستے کو اپنانے کی",
        "English" : "Guided they were to the good word (of faith) and guided they were to the path of (Allah,) the Praised One."
      },
      {
        "ayet_no" : 25,
        "arbi" : "اِنَّ الَّذِيْنَ كَفَرُوْا وَيَصُدُّوْنَ عَنْ سَبِيْلِ اللّٰهِ وَالْمَسْجِدِ الْحَرَامِ الَّذِيْ جَعَلْنٰهُ لِلنَّاسِ سَوَاۗءَۨ الْعَاكِفُ فِيْهِ وَالْبَادِ ۭ وَمَنْ يُّرِدْ فِيْهِ بِاِلْحَادٍۢ بِظُلْمٍ نُّذِقْهُ مِنْ عَذَابٍ اَلِيْمٍ",
        "Urdu" : "اس کے برعکس جو لوگ اڑے رہے تھے اپنے کفر وباطل پر، اور جو روکتے ہیں اللہ کے راستے سے اور اس مسجد حرام سے جس کو ہم نے اس شان کا بنایا کہ اس میں ایک برابر ہیں وہاں کا رہنے والا اور باہر سے انے والا دونوں تو ایسے لوگ یقینا اپنے کئے کا بدلہ پا کر رہیں گے ف۱ اور مسجد حرام تو ایسی بےمثال عظمت کی جگہ ہے کہ جو کوئی اس میں کسی بےدینی کے کام کا ارادہ بھی کرے گا ظلم وزیادتی کے ساتھ تو ہم اس کو مزہ چکھائیں گے دردناک عذاب کا ۔",
        "English" : "Surely (We will punish) those who disbelieve and prevent (people) from the way of Allah and from Al-Masjid-ul-Haram (the Sacred Mosque), which We have made for all men, where residents and visitors are all equal. And whoever intends therein to commit deviation with injustice, We will make him taste a painful punishment."
      },
      {
        "ayet_no" : 26,
        "arbi" : "وَاِذْ بَوَّاْنَا لِاِبْرٰهِيْمَ مَكَانَ الْبَيْتِ اَنْ لَّا تُشْرِكْ بِيْ شَيْـــــًٔا وَّطَهِّرْ بَيْتِيَ لِلطَّاۗىِٕفِيْنَ وَالْقَاۗىِٕمِيْنَ وَالرُّكَّعِ السُّجُوْدِ",
        "Urdu" : "اور وہ بھی یاد کرنے کے لائق ہے کہ جب ہم نے ابراہیم علیہ السلام کو اس گھر یعنی خانہ کعبہ کی نشاندہی کر دی تھی اس کے حکم کے ساتھ کہ میرے ساتھ کسی بھی چیز کو شریک نہیں ٹھہرانا اور پاک رکھنا میرے گھر کو اس کے گرد طواف کرنے والوں قیام کرنے والوں اور رکوع وسجود کی عبادات بجا لانے والوں کے لئے",
        "English" : "And (remember) when We prepared for Abraham the place of the (holy) House, saying: Ascribe thou no thing as partner unto Me, and purify My House for those who make the round (thereof) and those who stand and those who bow and make prostration."
      },
      {
        "ayet_no" : 27,
        "arbi" : "وَاَذِّنْ فِي النَّاسِ بِالْحَجِّ يَاْتُوْكَ رِجَالًا وَّعَلٰي كُلِّ ضَامِرٍ يَّاْتِيْنَ مِنْ كُلِّ فَجٍّ عَمِيْقٍ",
        "Urdu" : "اور اعلان کردو لوگوں کے درمیان حج کا، کہ اسکے نتیجے میں وہ تمہارے پاس چلے آئیں گے پیدل بھی اور طرح طرح کی ان پتلی دبلی اونٹنیوں اور دوسری قسما قسم کی سواریوں پر بھی جو چلی آئیں گی ہر دور دراز مقام سے ف۲",
        "English" : "And proclaim thou among mankind the pilgrimage; they shall come unto thee on foot and on any lean mount, coming from every deep defile."
      },
      {
        "ayet_no" : 28,
        "arbi" : "لِّيَشْهَدُوْا مَنَافِعَ لَهُمْ وَيَذْكُرُوا اسْمَ اللّٰهِ فِيْٓ اَيَّامٍ مَّعْلُوْمٰتٍ عَلٰي مَا رَزَقَهُمْ مِّنْۢ بَهِيْمَةِ الْاَنْعَامِ  ۚ فَكُلُوْا مِنْهَا وَاَطْعِمُوا الْبَاۗىِٕسَ الْفَقِيْرَ",
        "Urdu" : "اور یہ لوگ وہاں اس لئے آئیں گے تاکہ یہ آ موجود ہوں طرح طرح کے اپنے ان فائدوں کے لئے جو ان کے لئے وہاں رکھے گئے ہیں اور تاکہ یہ اللہ کا نام لیں چند مقررہ دنوں ان چوپایوں پر جو کہ اس نے اپنے فضل وکرم سے ان کو عطاء فرمائے ہیں پس کھاؤ تم لوگ ان کے گوشت میں سے خود بھی اور کھلاؤ ان میں سے تنگ حال محتاجوں کو بھی",
        "English" : "So that they witness benefits for them, and recite Allah‘s name in specified days, over the provision He gave them from the cattle. :So, eat thereof and feed the distressed, the poor."
      },
      {
        "ayet_no" : 29,
        "arbi" : "ثُمَّ لْيَقْضُوْا تَفَثَهُمْ وَلْيُوْفُوْا نُذُوْرَهُمْ وَلْيَطَّوَّفُوْا بِالْبَيْتِ الْعَتِيْقِ",
        "Urdu" : "پھر قربانی کے بعد لوگوں کو چاہیے کہ وہ دور کریں اپنا میل کچیل، اور طواف کریں رحمتوں اور برکتوں بھرے اس قدیم گھر کا یہ بات جو کہ حج کے بعض احکام سے متعلق ہو چکی",
        "English" : "Then, they must remove their dirt, and fulfill their vows, and make Tawaf of the Ancient House."
      },
      {
        "ayet_no" : 30,
        "arbi" : "ذٰلِكَ  ۤ وَمَنْ يُّعَظِّمْ حُرُمٰتِ اللّٰهِ فَهُوَ خَيْرٌ لَّهٗ عِنْدَ رَبِّهٖ  ۭ وَاُحِلَّتْ لَكُمُ الْاَنْعَامُ اِلَّا مَا يُتْلٰى عَلَيْكُمْ فَاجْتَنِبُوا الرِّجْسَ مِنَ الْاَوْثَانِ وَاجْتَنِبُوْا قَوْلَ الزُّوْرِ",
        "Urdu" : "اور اب مزید سنو کہ جو کوئی تعظیم وتکریم کرے گا اللہ کی قائم کردہ حدوں کی تو وہ خود اسی کے لئے بہتر ہوگا اس کے رب کے یہاں ف۱ اور حلال قرار دے دئیے گئے تمہارے لئے سب چوپائے جو اس نے اپنے کرم سے تمہیں بخشے ہیں سوائے ان چند ایک کے جو تمہیں پڑھ کر سنائے جاتے ہیں پس تم لوگ بچو اور دور رہو بتوں کی گندگی سے اور بچو جھوٹی بات سے ف۲",
        "English" : "Thus it is. And whosoever suspect the sacred ordinances of Allah, it shall be better for him with his Lord. And allowed unto you are the cattle, save that which hath been rehearsed unto you; so avoid the pollution of the idols, and avoid the word of falsehood."
      },
      {
        "ayet_no" : 31,
        "arbi" : "حُنَفَاۗءَ لِلّٰهِ غَيْرَ مُشْرِكِيْنَ بِهٖ ۭ وَمَنْ يُّشْرِكْ بِاللّٰهِ فَكَاَنَّمَا خَرَّ مِنَ السَّمَاۗءِ فَتَخْطَفُهُ الطَّيْرُ اَوْ تَهْوِيْ بِهِ الرِّيْحُ فِيْ مَكَانٍ سَحِيْقٍ",
        "Urdu" : "اس طور پر کہ تم خاص اللہ کے ہو کر رہو اس کے ساتھ کسی کو شریک نہ ٹھہراؤ کہ شرک بغاوت اور ناقابل معافی جرم ہے اور جس نے شرک کیا اللہ کے ساتھ تو وہ گویا گرگیا آسمان کی بلندیوں سے اور اس کو بوٹی بوٹی کرکے اچک لیا پرندوں نے یا اس کو پھینک دیا ہوا نے کسی ایسی دور دراز جگہ میں جہاں اس کے چیتھڑے اڑ جائیں",
        "English" : "Standing upright for (the obedience of) Allah, not ascribing any partner to Him. Whoever ascribes a partner to Allah, it is as if he falls down from the sky, and either the birds snatch him, or the wind drives him away to a far off place."
      },
      {
        "ayet_no" : 32,
        "arbi" : "ذٰلِكَ  ۤ وَمَنْ يُّعَظِّمْ شَعَاۗىِٕرَ اللّٰهِ فَاِنَّهَا مِنْ تَقْوَي الْقُلُوْبِ",
        "Urdu" : "یہ بات بھی بطور ایک قاعدہ کلیہ کے ہوچکی اور مزید سنو کہ جس نے تعظیم وتکریم کی اللہ کے مقررہ کردہ شعائر اور اس کی قائم فرمودہ یادگاروں کی تو یقینا یہ بات دلوں کے تقوی میں سے ہے ۔",
        "English" : "Having said that, if one observes the sanctity of the symbols of Allah, then such things emanate from the piety of the hearts."
      },
      {
        "ayet_no" : 33,
        "arbi" : "لَكُمْ فِيْهَا مَنَافِعُ اِلٰٓى اَجَلٍ مُّسَمًّى ثُمَّ مَحِلُّهَآ اِلَى الْبَيْتِ الْعَتِيْقِ",
        "Urdu" : "تمہارے لئے قربانی کے ان جانوروں میں طرح طرح کے فائدے ہیں ایک مقرر وقت تک پھر ان کے قربان کرنے کی جگہ اس قدیم گھر کے پاس ہے ف۳",
        "English" : "For you in them are benefits for a term appointed, and thereafter the destination is toward the ancient House."
      },
      {
        "ayet_no" : 34,
        "arbi" : "وَلِكُلِّ اُمَّةٍ جَعَلْنَا مَنْسَكًا لِّيَذْكُرُوا اسْمَ اللّٰهِ عَلٰي مَا رَزَقَهُمْ مِّنْۢ بَهِيْمَةِ الْاَنْعَامِ  ۭ فَاِلٰـهُكُمْ اِلٰهٌ وَّاحِدٌ فَلَهٗٓ اَسْلِمُوْا  ۭ وَبَشِّرِ الْمُخْبِتِيْنَ",
        "Urdu" : "اور ہم نے ہر امت کے لئے قربانی کا ایک خاص طریقہ مقرر کیا ہے تاکہ وہ لوگ چوپایوں کی قسم کے ان مخصوص جانوروں کی قربانی کے موقع پر اللہ کا نام لیں جو اس نے ان کو بخشنے ہیں پس معبود تم سب کا اے لوگوں ایک ہی معبود ہے یعنی اللہ تعالیٰ پس تم سب دل وجان سے جھک جاؤ اسی وحدہ لا شریک کے حضور اور خوشخبری سنا دو اے پیغمبر! ان عاجزی کرنے والوں کو",
        "English" : "For every Ummah (religious community) We prescribed the act of sacrifice, so that they recite Allah‘s name over the provision He gave them from the cattle. So, your God is One God. Therefore, to Him alone you must submit. And give good news to those who turn to Him with humbleness -"
      },
      {
        "ayet_no" : 35,
        "arbi" : "الَّذِيْنَ اِذَا ذُكِرَ اللّٰهُ وَجِلَتْ قُلُوْبُهُمْ وَالصّٰبِرِيْنَ عَلٰي مَآ اَصَابَهُمْ وَالْمُقِيْمِي الصَّلٰوةِ ۙ وَمِمَّا رَزَقْنٰهُمْ يُنْفِقُوْنَ",
        "Urdu" : "جن کا حال یہ ہے کہ جب ان کے سامنے اللہ کا ذکر کیا جائے تو کانپ اٹھیں ان کے دل اور جو صبر وتسلیم سے کام لیتے ہیں ہر اس مصیبت پر جو ان پر پہنچتی ہے اور جو قائم رکھنے والے ہیں نماز کو اور جو کچھ ہم نے ان کو دیا ہوتا ہے اس میں سے وہ خرچ کرتے ہیں ف۱",
        "English" : "Those whose hearts are filled with awe when Allah is remembered, and who observe patience against whatever befalls them, and who are steadfast in Salah, and who spend (in the way of Allah) out of what We have given to them."
      },
      {
        "ayet_no" : 36,
        "arbi" : "وَالْبُدْنَ جَعَلْنٰهَا لَكُمْ مِّنْ شَعَاۗىِٕرِ اللّٰهِ لَكُمْ فِيْهَا خَيْرٌ  ڰ فَاذْكُرُوا اسْمَ اللّٰهِ عَلَيْهَا صَوَاۗفَّ  ۚ فَاِذَا وَجَبَتْ جُنُوْبُهَا فَكُلُوْا مِنْهَا وَاَطْعِمُوا الْقَانِعَ وَالْمُعْتَرَّ  ۭ كَذٰلِكَ سَخَّرْنٰهَا لَكُمْ لَعَلَّكُمْ تَشْكُرُوْنَ",
        "Urdu" : "اور قربانی کے اونٹوں کو ہم نے تمہارے لئے اللہ کی نشانیوں میں سے بنایا ہے تمہارے لئے ان میں بہت بڑی بھلائی ہے پس تم انھیں ذبح یعنی نحر کرتے وقت ان پر اللہ کا نام لو ان کو کھڑا کرکے پھر ذبح یعنی نحر کے بعد جب وہ گر جائیں اور ٹھنڈے ہوجائیں تو تم ان میں سے خود بھی کھاؤ اور ان کو بھی کھلاؤ جو قناعت کرنے والے ہوتے ہیں اور ان کو بھی جو سوال کے ذریعےاپنی حاجت پیش کرتے ہیں اسی طرح ہم نے ان جانوروں کو تمہارے قابو میں کر دیا تاکہ تم شکر ادا کرو اپنے خالق ومالک کا",
        "English" : "The big animals of sacrifice (like camels and cows) are made by Us among the symbols of Allah for you, in which there is much good for your benefit. So recite the name of Allah over them as they are lined up (for sacrifice). Then, once their flanks fall down (after slaughter), eat of them and feed the one who is content and the one who wishes to receive. Thus We have made them (the animals) subjugated to you, so that you may be grateful."
      },
      {
        "ayet_no" : 37,
        "arbi" : "لَنْ يَّنَالَ اللّٰهَ لُحُوْمُهَا وَلَا دِمَاۗؤُهَا وَلٰكِنْ يَّنَالُهُ التَّقْوٰي مِنْكُمْ ۭ كَذٰلِكَ سَخَّرَهَا لَكُمْ لِتُكَبِّرُوا اللّٰهَ عَلٰي مَا هَدٰىكُمْ ۭ وَبَشِّرِ الْمُحْسِنِيْنَ",
        "Urdu" : "اور یاد رکھو کہ اللہ کو نہ تو ان جانوروں کے گوشت پہنچتے ہیں اور نہ ہی ان کے خون بلکہ اس کے یہاں تو صرف تمہاری پرہیزگاری اور اخلاص نیت کی پونجی ہی پہنچتی ہے اسی طرح اس نے اپنے فضل وکرم سے ان کو تمہارے لئے مسخر کر دیا تاکہ تم لوگ اللہ کی بڑائی کرو اپنے قول وفعل سے کہ اس نے نوازا ہے تم کو حق و ہدایت کی عظیم الشان دولت سے اور خوشخبری سنا دو اے پیغمبر! نیکوکاروں کو ف۲",
        "English" : "Their flesh reach not Allah nor their blood: but it is Piety from you that reach Him. Thus He hath subjected them to you, that ye may magnify Allah for He hath guided you; and bear thou glad tidings unto the well doers."
      },
      {
        "ayet_no" : 38,
        "arbi" : "اِنَّ اللّٰهَ يُدٰفِعُ عَنِ الَّذِيْنَ اٰمَنُوْا  ۭ اِنَّ اللّٰهَ لَا يُحِبُّ كُلَّ خَوَّانٍ كَفُوْرٍ",
        "Urdu" : "بیشک اللہ تعالیٰ مدافعت کرتا ہے ان لوگوں سے جو ایمان لائے بیشک اللہ تعالیٰ پسند نہیں فرماتا کسی بھی دغا باز ناشکرے کو",
        "English" : "Surely, Allah defends those who believe. Allah does not love any treacherous, ungrateful."
      },
      {
        "ayet_no" : 39,
        "arbi" : "اُذِنَ لِلَّذِيْنَ يُقٰتَلُوْنَ بِاَنَّهُمْ ظُلِمُوْا ۭ وَاِنَّ اللّٰهَ عَلٰي نَصْرِهِمْ لَقَدِيْرُۨ",
        "Urdu" : "جہاد کی اجازت دے دی گئی ان ستم رسیدہ لوگوں کو جن کے خلاف جنگ کی جا رہی ہے اس وجہ سے کہ ان پر ظلم کیا گیا اور بیشک اللہ ان کی مدد پر بہرحال پوری قدرت رکھتا ہے",
        "English" : "Permission (to fight) is given to those against whom fighting is launched, because they have been wronged, and Allah is powerful to give them victory."
      },
      {
        "ayet_no" : 40,
        "arbi" : "الَّذِيْنَ اُخْرِجُوْا مِنْ دِيَارِهِمْ بِغَيْرِ حَقٍّ اِلَّآ اَنْ يَّقُوْلُوْا رَبُّنَا اللّٰهُ  ۭ وَلَوْلَا دَفْعُ اللّٰهِ النَّاسَ بَعْضَهُمْ بِبَعْضٍ لَّهُدِّمَتْ صَوَامِعُ وَبِيَعٌ وَّصَلَوٰتٌ وَّمَسٰجِدُ يُذْكَرُ فِيْهَا اسْمُ اللّٰهِ كَثِيْرًا  ۭوَلَيَنْصُرَنَّ اللّٰهُ مَنْ يَّنْصُرُهٗ ۭ اِنَّ اللّٰهَ لَقَوِيٌّ عَزِيْزٌ",
        "Urdu" : "جن کو نکال باہر کیا گیا ان کے گھروں سے بغیر کسی حق کے ان کا کوئی جرم وقصور نہیں سوائے اس کے کہ وہ کہتے ہیں کہ ہمارا رب اللہ ہے ف۱ اور اگر اللہ تعالیٰاپنی قدرت وعنایت سے لوگوں کو ایک دوسرے سے ہٹاتا اور اس طرح ان کا زور توڑتا نہ رہتا تو مسمار کر دی جاتیں تمام خانقاہیں گرجے، کینسے، اور وہ مسجدیں جن میں بکثرت نام لیا جاتا ہے اللہ وحدہ لا شریک کا ف۲ اور یقینا اللہ مدد فرماتا ہے اس کی جو مدد کرتا ہے اس کے دین کی بلاشبہ اللہ تعالیٰ بڑا ہی قوت والا نہایت ہی زبردست ہے ف۳",
        "English" : "(They are) the ones who were expelled from their homes without any just reason, except that they say :Our Lord is Allah. Had Allah not been repelling some people by means of some others, the monasteries, the churches, the synagogues and the mosques where Allah‘s name is abundantly recited would have been demolished. Allah will definitely help those who help Him (by defending the religion prescribed by Him.) Surely Allah is Powerful, Mighty."
      },
      {
        "ayet_no" : 41,
        "arbi" : "اَلَّذِيْنَ اِنْ مَّكَّنّٰهُمْ فِي الْاَرْضِ اَقَامُوا الصَّلٰوةَ وَاٰتَوُا الزَّكٰوةَ وَاَمَرُوْا بِالْمَعْرُوْفِ وَنَهَوْا عَنِ الْمُنْكَرِ ۭ وَلِلّٰهِ عَاقِبَةُ الْاُمُوْرِ",
        "Urdu" : "یہ وہ لوگ ہیں کہ اگر ہم ان کو زمین میں اقتدار بخشیں تو یہ قائم کریں گے نماز کو اور ادا کریں گے زکوٰۃ کو اور حکم دیں گے نیکی کا اور روکیں گے برائی سے اور اللہ ہی کے اختیار میں ہے سب کاموں کا انجام",
        "English" : "Those who if We establish them in the earth, shall establish the prayer and give the poor-rate and command that which is reputable and restrain that which is disreputable and unto Allah is the end of all affairs."
      },
      {
        "ayet_no" : 42,
        "arbi" : "وَاِنْ يُّكَذِّبُوْكَ فَقَدْ كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوْحٍ وَّعَادٌ وَّثَمُوْدُ",
        "Urdu" : "اور اگر یہ لوگ آپ کو جھٹلاتے ہیں اے پیغمبر! تو یہ کوئی نئی بات نہیں بلکہ یقینا ان سے پہلے قوم نوح اور عاد وثمود بھی جھٹلاچکے ہیں اپنے اپنے پیغمبروں کو",
        "English" : "And if they belie thee, then surely there have belied before them the people of Nuh and the 'Aad and the Thamud."
      },
      {
        "ayet_no" : 43,
        "arbi" : "وَقَوْمُ اِبْرٰهِيْمَ وَقَوْمُ لُوْطٍ",
        "Urdu" : "اور قوم ابراہیم اور قوم لوط بھی",
        "English" : "And the people of Ibrahim and the people of Lut."
      },
      {
        "ayet_no" : 44,
        "arbi" : "وَّاَصْحٰبُ مَدْيَنَ ۚ وَكُذِّبَ مُوْسٰى فَاَمْلَيْتُ لِلْكٰفِرِيْنَ ثُمَّ اَخَذْتُهُمْ ۚ فَكَيْفَ كَانَ نَكِيْرِ",
        "Urdu" : "اور دین والے بھی اور موسیٰ کو بھی جھٹلایا جا چکا ہے جس پر میں نے پہلے تو ان کافروں کو مہلت دی مگر آخر جب ان کو پکڑا تو دیکھو کیسا رہا میرا عذاب ؟",
        "English" : "And the denizens of Madyan. And belied was Musa. I gave rein to the infidels; then took hold of them; so how hath been My wrath!"
      },
      {
        "ayet_no" : 45,
        "arbi" : "فَكَاَيِّنْ مِّنْ قَرْيَةٍ اَهْلَكْنٰهَا وَهِىَ ظَالِمَةٌ فَهِيَ خَاوِيَةٌ عَلٰي عُرُوْشِهَا وَبِئْرٍ مُّعَطَّلَةٍ وَّقَصْرٍ مَّشِيْدٍ",
        "Urdu" : "سو کتنی ہی بستیاں ایسی تھی جن کو ہم نے تباہ کر ڈالا جب کہ وہ اڑی رہیں اپنے ظل پر، سو دیکھو کہ اب وہ گری پڑی ہیںاپنی چھتوں پر اور کتنے ہی کنوئیں ہیں بےکار پڑے ہوئے اور کتنے ہی بلند وبالا اور مضبوط محل ہیں جو کھنڈر بنے ہوئے ہیں ف۱",
        "English" : "How many populations have We destroyed, which were given to wrong-doing ? They tumbled down on their roofs. And how many wells are lying idle and neglected, and castles lofty and well-built ?"
      },
      {
        "ayet_no" : 46,
        "arbi" : "اَفَلَمْ يَسِيْرُوْا فِي الْاَرْضِ فَتَكُوْنَ لَهُمْ قُلُوْبٌ يَّعْقِلُوْنَ بِهَآ اَوْ اٰذَانٌ يَّسْمَعُوْنَ بِهَا  ۚ فَاِنَّهَا لَا تَعْمَى الْاَبْصَارُ وَلٰكِنْ تَعْمَى الْقُلُوْبُ الَّتِيْ فِي الصُّدُوْرِ",
        "Urdu" : "تو کیا غفلت میں ڈوبے یہ لوگ چلتے پھرتے نہیں عبرتوں بھری اس زمین میں؟ کہ ان کے ایسے عبرت پذیر دل ہوتے جن سے یہ سوچتے سمھتے حق اور حقیقت کو یا ان کے ایسے کان ہوتے جن سے یہ سنتے پیغام حق وصداقت کو بات یہ ہے کہ سر کی یہ انکھیں اندھی نہیں ہوتیں بلکہ وہ دل اندھے ہو جاتے ہیں جو سینوں کے اندر ہیں",
        "English" : "Have they not, then, traveled on earth so that they should have had hearts to understand with, or ears to listen with? The fact is that it is not the eyes that turn blind, but what turns blind is the hearts contained in the chests."
      },
      {
        "ayet_no" : 47,
        "arbi" : "وَيَسْتَعْجِلُوْنَكَ بِالْعَذَابِ وَلَنْ يُّخْلِفَ اللّٰهُ وَعْدَهٗ ۭ وَاِنَّ يَوْمًا عِنْدَ رَبِّكَ كَاَلْفِ سَنَةٍ مِّمَّا تَعُدُّوْنَ",
        "Urdu" : "اور نصیحت قبول کرنے کے بجائے یہ لوگ تو آپ سے عذاب ہی کی جلدی مچائے جا رہے ہیں حالانکہ اللہ کبھی خلاف ورزی نہیں فرماتا اپنے وعدے کی اور حقیقت یہ ہے کہ تمہارے رب کے یہاں کا ایک دن اے لوگو! تمہارے شمار کے ایک ہزار برس کے برابر ہوا کرتا ہے۔ ف۲",
        "English" : "They ask you to bring the punishment sooner, while Allah will never go back on His promise. In fact, one day with your Lord is like one thousand years according to your calculation."
      },
      {
        "ayet_no" : 48,
        "arbi" : "وَكَاَيِّنْ مِّنْ قَرْيَةٍ اَمْلَيْتُ لَهَا وَهِىَ ظَالِمَةٌ ثُمَّ اَخَذْتُهَا  ۚ وَاِلَيَّ الْمَصِيْرُ",
        "Urdu" : "اور پھر سن لو کہ کتنی ہی بستیاں ایسی ہوئی ہیں جو کہ کمر بستہ تھیں اپنے ظلم پر ہمارا معاملہ ان سے یہ رہا کہ پہلے تو میں نے ان کو ڈھیل دے رکھی مگر آخرکار ان کو پکڑا اور سب کو بہرحال میرے ہی پاس لوٹ کر انا ہے",
        "English" : "And how many towns were there to whom I allowed respite, while they were wrongdoers, then I seized them. And to Me is the final return."
      },
      {
        "ayet_no" : 49,
        "arbi" : "قُلْ يٰٓاَيُّهَا النَّاسُ اِنَّمَآ اَنَا لَكُمْ نَذِيْرٌ مُّبِيْنٌ",
        "Urdu" : "ان سے صاف کہہ دو کہ اے لوگوں سوائے اس کے نہیں کہ میں تو صرف خبردار کر دینے والا ہوں تم سب کے لئے کھول کر حق اور حقیقت کو",
        "English" : "Say (O Muhammad ): (O mankind! I am (sent) to you only as a plain warner.)"
      },
      {
        "ayet_no" : 50,
        "arbi" : "فَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَهُمْ مَّغْفِرَةٌ وَّرِزْقٌ كَرِيْمٌ",
        "Urdu" : "سو جو لوگ ایمان لے آئیں گے اور وہ کام بھی نیک کریں گے تو ان کے لئے تو بخشش بھی ہے اور عزت کی روزی بھی",
        "English" : "So those who come to believe and do good deeds, for them there is forgiveness and dignified provision."
      },
      {
        "ayet_no" : 51,
        "arbi" : "وَالَّذِيْنَ سَعَوْا فِيْٓ اٰيٰتِنَا مُعٰجِزِيْنَ اُولٰۗىِٕكَ اَصْحٰبُ الْجَحِيْمِ",
        "Urdu" : "اور جو ہماری آیتوں کو نیچا دکھانے کی کوشش کریں گے وہ ساتھی اور یار ہیں دوزخ کے ف۳",
        "English" : "And those who endeavour in respect of Our signs to frustrate them- those shall be the fellows of Flaming Fire."
      },
      {
        "ayet_no" : 52,
        "arbi" : "وَمَآ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَّسُوْلٍ وَّلَا نَبِيٍّ اِلَّآ اِذَا تَـمَنّىٰٓ اَلْقَى الشَّيْطٰنُ فِيْٓ اُمْنِيَّتِهٖ ۚ فَيَنْسَخُ اللّٰهُ مَا يُلْقِي الشَّيْطٰنُ ثُمَّ يُحْكِمُ اللّٰهُ اٰيٰتِهٖ  ۭ وَاللّٰهُ عَلِيْمٌ حَكِيْمٌ",
        "Urdu" : "اور ہم نے آپ سے پہلے اے پیغمبر! جو بھی کوئی رسول یا نبی بھیجا، اس کا حال یہی رہا کہ جب اس نے تمنا کی تو شیطان نے خلل اندازی کی اس کی تمنا وآرزو میں پھر اللہ مٹا دیتا ہے اس خلل اندازی کو جو شیطان کرتا ہے اور پکا اور پختہ کر دیتا ہے وہاپنی آیتوں کو اور اللہ تو سب کچھ جاننے والا بڑا ہی حکمت والا ہے ف۱",
        "English" : "We did not send any messenger before you nor a prophet, but (he faced a situation that) when he recited (the revelation), the Satan cast (doubts in the hearts of his opponents) about what he recited. So, Allah nullifies what the Satan casts, then Allah makes His verses firm, and Allah is All-Knowing, All-Wise"
      },
      {
        "ayet_no" : 53,
        "arbi" : "لِيَجْعَلَ مَا يُلْقِي الشَّيْطٰنُ فِتْنَةً لِّلَّذِيْنَ فِيْ قُلُوْبِهِمْ مَّرَضٌ وَّالْقَاسِيَةِ قُلُوْبُهُمْ ۭ وَاِنَّ الظّٰلِمِيْنَ لَفِيْ شِقَاقٍۢ بَعِيْدٍ",
        "Urdu" : "اور اللہ ایسا اس لئے ہونے دیتا ہے تاکہ وہ شیطان کے ڈالے ہوئے وسوسوں کو فتنے اور آزمائش کا سامان بنا دے ان لوگوں کے لئے جن کے دلوں میں روگ ہوتا ہے شک اور نفاق کا نیز ان لوگوں کے لئے جن کے دل سخت ہوگئے ہوتے ہیں کفر و باطل کی سیاہی سے اور بیشک ظالم لوگ پڑے ہیں بہت دور کی مخالفت اور ہت دھرمی میں",
        "English" : "That He (Allah) may make what is thrown in by Shaitn (Satan) a trial for those in whose hearts is a disease (of hypocrisy and disbelief) and whose hearts are hardened. And certainly, the Zalimn (polytheists and wrong-doers, etc.) are in an opposition far-off (from the truth againstAllah's Messenger and the believers)."
      },
      {
        "ayet_no" : 54,
        "arbi" : "وَّلِيَعْلَمَ الَّذِيْنَ اُوْتُوا الْعِلْمَ اَنَّهُ الْحَقُّ مِنْ رَّبِّكَ فَيُؤْمِنُوْا بِهٖ فَتُخْبِتَ لَهٗ قُلُوْبُهُمْ ۭ وَاِنَّ اللّٰهَ لَهَادِ الَّذِيْنَ اٰمَنُوْٓا اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ",
        "Urdu" : "نیز یہ اس لئے کہ تاکہ جان لیں وہ لوگ جن کو علم کا نور بخشا گیا ہے کہ یہی بات قطعی طور پر حق ہے تمہارے رب کی جانب سے پھر وہ اس پر مزید پختگی سے ایمان لے آئیں اور اس کے نتیجے میں جھک جائیں ان کے دل اس حق وصدق کے آگے اور بیشک اللہ ہدایت سے سرفراز فرمانے والا ہے ان لوگوں کو جو ایمان لائے ہوں سیدھی راہ کی طرف ف۲",
        "English" : "And that those who have been vouchsafed knowledge may know that it is the truth from thy Lord and may believe therein, and so their hearts may submit thereto. And verily Allah is the Guide of those who believe unto a path straight."
      },
      {
        "ayet_no" : 55,
        "arbi" : "وَلَا يَزَالُ الَّذِيْنَ كَفَرُوْا فِيْ مِرْيَةٍ مِّنْهُ حَتّٰى تَاْتِيَهُمُ السَّاعَةُ بَغْتَةً اَوْ يَاْتِيَهُمْ عَذَابُ يَوْمٍ عَقِيْمٍ",
        "Urdu" : "رہ گئے وہ لوگ جو اڑے رہے اپنے کفر وباطل پر تو وہ اس حق کی طرف سے ہمیشہ شک کی دلدل ہی میں پڑے رہیں گے یہاں تک کہ اچانک آپہنچے ان پر قیامت کی وہ گھڑی یا آپہنچے ان پر عذاب ایک بڑے ہی منحوس دن کا",
        "English" : "Those who disbelieve will remain in doubt about it (the Qur‘an) forever, until the Hour (of Judgment) comes upon them suddenly, or there comes to them the punishment of a barren day."
      },
      {
        "ayet_no" : 56,
        "arbi" : "اَلْمُلْكُ يَوْمَىِٕذٍ لِّلّٰهِ ۭ يَحْكُمُ بَيْنَهُمْ ۭ فَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ فِيْ جَنّٰتِ النَّعِيْمِ",
        "Urdu" : "اس روز بادشاہی اللہ ہی کی ہوگی وہی فیصلہ فرمائے گا ان کے درمیان پورے عدل انصاف کے ساتھ سو جو لوگ صدق دل سے ایمان لائے ہوں گے اور انہوں نے کام بھی نیک کئے ہوں گے وہ تو نعمتوں بھری جنتوں میں ہوں گے",
        "English" : "The kingdom, on that day, is for Allah. He will judge between them. So, those who believed and did good deeds shall be in gardens of bliss."
      },
      {
        "ayet_no" : 57,
        "arbi" : "وَالَّذِيْنَ كَفَرُوْا وَكَذَّبُوْا بِاٰيٰتِنَا فَاُولٰۗىِٕكَ لَهُمْ عَذَابٌ مُّهِيْنٌ",
        "Urdu" : "مگر جنہوں نے کفر کیا ہوگا اور جھٹلایا ہوگا ہماری آیتوں کو تو ان کے لئے ایک بڑا ہی رسوا کن عذاب ہوگا ف۱",
        "English" : "And those who disbelieved and belied Our Verses (of this Quran), for them will be a humiliating torment (in Hell)."
      },
      {
        "ayet_no" : 58,
        "arbi" : "وَالَّذِيْنَ هَاجَرُوْا فِيْ سَبِيْلِ اللّٰهِ ثُمَّ قُتِلُوْٓا اَوْ مَاتُوْا لَيَرْزُقَنَّهُمُ اللّٰهُ رِزْقًا حَسَنًا  ۭ وَاِنَّ اللّٰهَ لَهُوَ خَيْرُ الرّٰزِقِيْنَ",
        "Urdu" : "اور جن لوگوں نے ہجرت کی اللہ کی راہ میں پھر وہ قتل کر دئے گئے یا خود مرگئے تو اللہ ان کو ضرور نوازے گا ایک بڑے ہی عمدہ رزق سے اور بیشک اللہ تعالیٰ ہی ہے جو سب سے بہتر روزی رساں ہے",
        "English" : "Those who left their homeland in the way of Allah, then were slain or died, Allah will certainly give them a good provision, and surely, Allah is the best provider."
      },
      {
        "ayet_no" : 59,
        "arbi" : "لَيُدْخِلَنَّهُمْ مُّدْخَلًا يَّرْضَوْنَهٗ ۭ وَاِنَّ اللّٰهَ لَعَلِيْمٌ حَلِيْمٌ",
        "Urdu" : "وہ ان کو اپنے کرم سے ضرور داخل فرمائے گا ایک ایسی عظیم الشان جگہ میں جس کو یہ لوگ دل وجان سے پسند کریں گے بیشک اللہ تعالیٰ پوری طرح جاننے والا بڑا ہی بردبار ہے ف۲",
        "English" : "He will definitely admit them to an entrance they will be pleased with, and Allah is surely All-Knowing, Forbearing."
      },
      {
        "ayet_no" : 60,
        "arbi" : "ذٰلِكَ  ۚ وَمَنْ عَاقَبَ بِمِثْلِ مَا عُوْقِبَ بِهٖ ثُمَّ بُغِيَ عَلَيْهِ لَيَنْصُرَنَّهُ اللّٰهُ  ۭ اِنَّ اللّٰهَ لَعَفُوٌّ غَفُوْرٌ",
        "Urdu" : "یہ مضمون تو ہوچکا اور اب مزید سنو کہ جو کوئی اتناہی بدلہ لے جتنی کہ اسے تکلیف پہنچائی گئی پھر اس پر زیادتی کی جائے تو اللہ تعالیٰ ضرور بالضرور اس کی مدد فرمائے گا بیشک اللہ بڑا ہی درگزر کرنے والا نہایت ہی معاف کرنے والا ہے ۔",
        "English" : "That (is so). And if one has retaliated to no greater extent than the injury he received, and is again set upon inordinately, Allah will help him: for Allah is One that blots out (sins) and forgives (again and again)."
      },
      {
        "ayet_no" : 61,
        "arbi" : "ذٰلِكَ بِاَنَّ اللّٰهَ يُوْلِجُ الَّيْلَ فِي النَّهَارِ وَيُوْلِجُ النَّهَارَ فِي الَّيْلِ وَاَنَّ اللّٰهَ سَمِيْعٌۢ بَصِيْرٌ",
        "Urdu" : "یہ اس لئے کہ اللہ ہی ہے جو رات کو داخل کرتا ہے دن میں اور دن کو داخل کرتا ہے رات میں اور بیشک اللہ ہی ہے ہر کسی کی سنتا سب کچھ دیکھتا",
        "English" : "That is because Allah makes night enter into the day and makes day enter into the night and that Allah is All-Hearing, All-Seeing."
      },
      {
        "ayet_no" : 62,
        "arbi" : "ذٰلِكَ بِاَنَّ اللّٰهَ هُوَ الْحَقُّ وَاَنَّ مَا يَدْعُوْنَ مِنْ دُوْنِهٖ هُوَ الْبَاطِلُ وَاَنَّ اللّٰهَ هُوَ الْعَلِيُّ الْكَبِيْرُ",
        "Urdu" : "یہ اس لئے کہ اللہ ہی حق ہے اور جن کو یہ لوگ پوجتے پکارتے ہیں اس کے سوا وہ سب باطل ہیں اور یقینی طور پر اللہ ہی بلند مرتبہ بڑی ہی شان والا ف۳",
        "English" : "That is because Allah is the truth and that whatever they invoke beside Him is false and that Allah is the High, the Great."
      },
      {
        "ayet_no" : 63,
        "arbi" : "اَلَمْ تَرَ اَنَّ اللّٰهَ اَنْزَلَ مِنَ السَّمَاۗءِ مَاۗءً ۡ فَتُصْبِحُ الْاَرْضُ مُخْضَرَّةً ۭ اِنَّ اللّٰهَ لَطِيْفٌ خَبِيْرٌ",
        "Urdu" : "کیا تم دیکھتے نہیں کہ اللہ تعالیٰ نےاپنی قدرت کاملہ اور رحمت شاملہ کی بناء پر کیسے حکمت بھرے نظام کے مطابق آسمان سے پانی اتارا ہے پھر اس سے ہری بھری اور سر سبز وشاداب ہو جاتی ہے خشک اور مردہ پڑی ہوئی یہ زمین بلاشبہ اللہ بڑا ہی مہربان نہایت ہی باخبر ہے ف۱",
        "English" : "Did you not see that Allah has sent down water from the sky, whereby the land becomes green? Surely, Allah is All-Kind, All-Aware."
      },
      {
        "ayet_no" : 64,
        "arbi" : "لَهٗ مَا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ  ۭ وَاِنَّ اللّٰهَ لَهُوَ الْغَنِيُّ الْحَمِيْدُ",
        "Urdu" : "اسی کا ہے وہ سب کچھ جو کہ آسمانوں میں ہے اور وہ سب کچھ بھی جو کہ زمین میں ہے بلاشبہ اللہ ہی ہے جو ہرطرح سے بےنیاز اور ہر تعریف کے لائق ہے",
        "English" : "To Him belongs all that is in the heavens and all that is in the earth, and surely Allah is the All-Independent, Ever-Praised."
      },
      {
        "ayet_no" : 65,
        "arbi" : "اَلَمْ تَرَ اَنَّ اللّٰهَ سَخَّرَ لَكُمْ مَّا فِي الْاَرْضِ وَالْفُلْكَ تَجْرِيْ فِي الْبَحْرِ بِاَمْرِهٖ ۭ وَيُمْسِكُ السَّمَاۗءَ اَنْ تَقَعَ عَلَي الْاَرْضِ اِلَّا بِاِذْنِهٖ ۭ اِنَّ اللّٰهَ بِالنَّاسِ لَرَءُوْفٌ رَّحِيْمٌ",
        "Urdu" : "پھر کیا تم نے کبھی اپنے گردو پیش پھیلی ہوئی اس حقیقت پر غور نہیں کیا کہ اللہ نے کس قدر حکمتوں بھرے نظام کے تحت تمہارے کام میں لگا رکھا ہے ان سب چیزوں کو جو کہ زمین میں ہیں اور ان دیو ہیکل جہازوں اور طرح طرح کی کشتیوں کو بھی جو کہ رواں دواں ہیں سمندر میں اس کے حکم سے اور اسی نے روک رکھا ہے آسمان کواپنی قدرت کاملہ اور حکمت بالغہ سے اس سے کہ وہ گر پڑے زمین پر مگر اسی کے اذن سے بلاشبہ اللہ پاک لوگوں پر بڑا ہی مہربان نہایت ہی رحم فرمانے والا ہے",
        "English" : "Did you not see that Allah has subjugated to you everything on the earth, and the ships that sail at sea with His command? And He holds the sky so as it cannot fall on the earth except with His permission. Surely Allah is Very-Kind to the people, Very-Merciful."
      },
      {
        "ayet_no" : 66,
        "arbi" : "وَهُوَ الَّذِيْٓ اَحْيَاكُمْ  ۡ ثُمَّ يُمِيْتُكُمْ ثُمَّ يُحْيِيْكُمْ  ۭ اِنَّ الْاِنْسَانَ لَكَفُوْرٌ",
        "Urdu" : "اور وہ اللہ وہی ہے جس نے تم سب کو زندگی بخشی پھر وہی تمہیں موت دیتا ہے اور دے گا پھر وہی تمہیں قیامت میں زندہ کرے گا پھر بھی یہ انسان اس کا ناشکرا اور نافرمان ہے؟ واقعی یہ انسان بڑا ہی ناشکرا ہے",
        "English" : "He is the One who gave life to you, then He brings death to you, then He will give you life (again). Surely, man is very ungrateful."
      },
      {
        "ayet_no" : 67,
        "arbi" : "لِكُلِّ اُمَّةٍ جَعَلْنَا مَنْسَكًا هُمْ نَاسِكُوْهُ فَلَا يُنَازِعُنَّكَ فِي الْاَمْرِ وَادْعُ اِلٰى رَبِّكَ ۭ اِنَّكَ لَعَلٰى هُدًى مُّسْتَقِيْمٍ",
        "Urdu" : "ہر امت کے لئے ہم نے عبادت کا اک طریقہ مقرر کیا ہے جس پر ان کو چلنا ہوتا ہے پس ان لوگوں کو آپ کے ساتھ اس معاملے میں کسی بھی طرح جھگڑے کا حق نہیں اور آپ بلاتے رہیں اپنے رب کی عبادت وبندگی کی طرف بلاشبہ آپ قطعی طور پر سیدھے راستے پر ہیں ف۲",
        "English" : "For every Ummah (religious community) We have appointed a way of worship they are to observe. Therefore, they should never quarrel with you in the matter. And do call (them) to your Lord. Surely, you are on straight Guidance."
      },
      {
        "ayet_no" : 68,
        "arbi" : "وَاِنْ جٰدَلُوْكَ فَقُلِ اللّٰهُ اَعْلَمُ بِمَا تَعْمَلُوْنَ",
        "Urdu" : "اور اگر وہ آپ سے جھگڑا کریں تو ان سے کہہ دو کہ اللہ کو خوب معلوم ہے وہ سب کچھ جو تم لوگ کر رہے ہو",
        "English" : "And if they dispute with you, say (to them), :Allah is the best aware of what you do."
      },
      {
        "ayet_no" : 69,
        "arbi" : "اَللّٰهُ يَحْكُمُ بَيْنَكُمْ يَوْمَ الْقِيٰمَةِ فِيْمَا كُنْتُمْ فِيْهِ تَخْتَلِفُوْنَ",
        "Urdu" : "اللہ فیصلہ فرما دے گا تم سب کے درمیان عملی اور آخری طور پر ان تمام باتوں کا جن کے بارے میں تم لوگ اختلاف کرتے رہے ہو",
        "English" : "Allah will judge between you, on the Day of Judgment, about what you used to dispute."
      },
      {
        "ayet_no" : 70,
        "arbi" : "اَلَمْ تَعْلَمْ اَنَّ اللّٰهَ يَعْلَمُ مَا فِي السَّمَاۗءِ وَالْاَرْضِ  ۭ اِنَّ ذٰلِكَ فِيْ كِتٰبٍ  ۭ اِنَّ ذٰلِكَ عَلَي اللّٰهِ يَسِيْرٌ",
        "Urdu" : "کیا تمہیں معلوم نہیں کہ اللہ تعالیٰ قطعی طور پر جانتا ہے وہ سب کچھ جو کہ آسمان و زمین اس کائنات میں ہے بیشک یہ سب کچھ ثبت ومندرج ہے ایک عظیم الشان کتاب میں بلاشبہ یہ سب کچھ اللہ کے لئے کچھ بھی مشکل نہیں ف۱",
        "English" : "Do you not know that Allah knows all that is in the sky and the earth ? Surely, that is contained in a Book. Indeed it is so easy for Allah."
      },
      {
        "ayet_no" : 71,
        "arbi" : "وَيَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ مَا لَمْ يُنَزِّلْ بِهٖ سُلْطٰنًا وَّمَا لَيْسَ لَهُمْ بِهٖ عِلْمٌ ۭ وَمَا لِلظّٰلِمِيْنَ مِنْ نَّصِيْرٍ",
        "Urdu" : "مگر اس سب کے باوجود یہ لوگ ہیں کہ پوجے اور پکارے جا رہے ہیں ایسی بےحقیقت چیزوں کو جن کے بارہ میں نہ اللہ نے کوئی سند اتاری اور نہ ہی ان لوگوں کے پاس ان کے بارہ میں کسی طرح کا کوئی علم ہے اور ایسے ظالموں کے لئے کوئی مددگار نہیں",
        "English" : "They worship, besides Allah, the objects for which He did never send down an authority (or proof) and about which they have no knowledge. And for the wrongdoers there is no helper."
      },
      {
        "ayet_no" : 72,
        "arbi" : "وَاِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُنَا بَيِّنٰتٍ تَعْرِفُ فِيْ وُجُوْهِ الَّذِيْنَ كَفَرُوا الْمُنْكَرَ  ۭ يَكَادُوْنَ يَسْطُوْنَ بِالَّذِيْنَ يَتْلُوْنَ عَلَيْهِمْ اٰيٰتِنَا  ۭ قُلْ اَفَاُنَبِّئُكُمْ بِشَرٍّ مِّنْ ذٰلِكُمْ ۭ اَلنَّارُ  ۭ وَعَدَهَا اللّٰهُ الَّذِيْنَ كَفَرُوْا  ۭ وَبِئْسَ الْمَصِيْرُ",
        "Urdu" : "اور حق واہل سے ان کے بغض وعناد کا عالم یہ ہے کہ جب ان کو پڑھ کر سنائی جاتی ہیں ہماری کھلی اور واضح آیتیں اور تم ان لوگوں کے چہروں میں ناگواری ونا پسندیدگی کے آثار ابھرتے دیکھو گے جو اڑے ہوئے اپنے کفر پر ایسا لگتا ہے کہ یہ ابھی ٹوٹ پڑیں گے ان علمبرداران حق پر جو ان کو پڑھ کو سناتے ہیں ہماری آیتیں ان سے کہو کہ کیا میں تم کو اس سے بھی بڑھ کر ایک ناگوار چیز نہ بتا دوں؟ وہ جہنم کی وہ آگ ہے جس کا اللہ نے وعدہ فرما رکھا ہے ان بدبختوں سے جواڑے ہوئے ہیں اپنے کفر وباطل پر اور بڑا ہی برا ٹھکانا ہے ف۲",
        "English" : "When Our verses are recited to them in all their clarity, you (can) recognize disgust on the faces of the disbelievers. They seem to attack those who recite to them Our verses. Say, :Shall I, then, tell you about something more disgusting than that? The Fire! Allah has promised it to those who disbelieve. And it is an evil end."
      },
      {
        "ayet_no" : 73,
        "arbi" : "يٰٓاَيُّهَا النَّاسُ ضُرِبَ مَثَلٌ فَاسْتَمِعُوْا لَهٗ ۭ اِنَّ الَّذِيْنَ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ لَنْ يَّخْلُقُوْا ذُبَابًا وَّلَوِ اجْتَمَعُوْا لَهٗ ۭ وَاِنْ يَّسْلُبْهُمُ الذُّبَابُ شَيْـــــًٔـا لَّا يَسْتَنْقِذُوْهُ مِنْهُ ۭ ضَعُفَ الطَّالِبُ وَالْمَطْلُوْبُ",
        "Urdu" : "وہ اے لوگو ایک مثال بیان کی جاتی ہے پس تم اسے کان لگا کر سنو بیشک جن ہستیوں کو تم لوگ پوجتے پکارتے ہو اللہ کے سوا وہ ایک مکھی بھی نہیں بنا سکتے اگرچہ اس کی کوشش کے لئے وہ سب اکٹھے بھی ہوجائیں اور مکھی بنانا تو دور کی بات ہے ان کا حال تو یہ ہے کہ اگر وہ مکھی ان سے کچھ چھین لے تو یہ اس کو بھی اس سے چھڑا نہیں سکتے کتنا کمزور ہے چاہنے والا اور کتنا کمزور ہے وہ جس سے مدد چاہی جاتی ہے ف۳",
        "English" : "O people, here is a parable set forth to you, so listen to it carefully: All those whom you invoke besides Allah can never create (even) a fly, even though they all join hands together for that. And if a fly snatches something away from them, they cannot release it from its possession. (Equally) feeble are the invoker and the invoked."
      },
      {
        "ayet_no" : 74,
        "arbi" : "مَا قَدَرُوا اللّٰهَ حَقَّ قَدْرِهٖ  ۭاِنَّ اللّٰهَ لَقَوِيٌّ عَزِيْزٌ",
        "Urdu" : "ان لوگوں نے اللہ کی قدر نہ کی جیسا کہ اس کی قدر کرنے کا حق تھا بیشک اللہ تعالیٰ بڑا ہی قوت والا نہایت ہی زبردست ہے ف۱",
        "English" : "They did not recognize Allah in His true esteem. Indeed Allah is Powerful, Mighty."
      },
      {
        "ayet_no" : 75,
        "arbi" : "اَللّٰهُ يَصْطَفِيْ مِنَ الْمَلٰۗىِٕكَةِ رُسُلًا وَّمِنَ النَّاسِ ۭ اِنَّ اللّٰهَ سَمِيْعٌۢ بَصِيْرٌ",
        "Urdu" : "وہاپنی پیغام رسانی کے لئےاپنی مرضی واختیار سے چنتا ہے پیغمبر فرشتوں سے بھی اور انسانوں سے بھی بلاشبہ اللہ تعالیٰ ہر کسی کی سنتا سب کچھ دیکھتا ہے وہ پوری طرح جانتا ہے",
        "English" : "Allah chooses messengers from angels and from men. Surely, Allah is All-Hearing, All-Seeing."
      },
      {
        "ayet_no" : 76,
        "arbi" : "يَعْلَمُ مَا بَيْنَ اَيْدِيْهِمْ وَمَا خَلْفَهُمْ ۭ وَاِلَى اللّٰهِ تُرْجَعُ الْاُمُوْرُ",
        "Urdu" : "وہ سب کچھ جو کہ ان لوگوں کے سامنے ہے اور وہ سب کچھ بھی جو کہ ان کے پیچھے ہے اور اللہ ہی کی طرف لوٹائے جاتے ہیں سب کام ف۲",
        "English" : "He knows what is in front of them and what is behind them, and to Allah all matters are to be returned."
      },
      {
        "ayet_no" : 77,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوا ارْكَعُوْا وَاسْجُدُوْا وَاعْبُدُوْا رَبَّكُمْ وَافْعَلُوا الْخَــيْرَ لَعَلَّكُمْ تُفْلِحُوْنَ {السجدہ}",
        "Urdu" : "اے وہ لوگوں جو ایمان لائے ہو تم رکوع اور سجدہ کرو اپنے رب کی رضا کیلئے اور اپنے رب ہی کی بندگی کرو اور نیک کام کرتے رہا کرو تاکہ تمہیں فلاح نصیب ہوسکے ف۳",
        "English" : "O you who believe, bow down in Ruku_ and bow down in Sajdah, and worship your Lord and do good deeds, so that you achieve success."
      },
      {
        "ayet_no" : 78,
        "arbi" : "وَجَاهِدُوْا فِي اللّٰهِ حَقَّ جِهَادِهٖ  ۭ هُوَ اجْتَبٰىكُمْ وَمَا جَعَلَ عَلَيْكُمْ فِي الدِّيْنِ مِنْ حَرَجٍ  ۭ مِلَّـةَ اَبِيْكُمْ اِبْرٰهِيْمَ  ۭهُوَ سَمّٰىكُمُ الْمُسْلِـمِيْنَ ڏ مِنْ قَبْلُ وَفِيْ ھٰذَا لِيَكُوْنَ الرَّسُوْلُ شَهِيْدًا عَلَيْكُمْ وَتَكُوْنُوْا شُهَدَاۗءَ عَلَي النَّاسِ ښ فَاَقِيْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَاعْتَصِمُوْا بِاللّٰهِ ۭ هُوَ مَوْلٰىكُمْ ۚ فَنِعْمَ الْمَوْلٰى وَنِعْمَ النَّصِيْرُ",
        "Urdu" : "اور اللہ کی راہ میں جہاد کرو جیسا کہ جہاد کرنے کا حق ہے اسی وحدہ لاشریک نے تم کو چنا ہےاپنی بندگی اور اپنے دین کی خدمت کے لئے اور دین کے بارے میں اس نے تم پر کوئی تنگی نہیں رکھی قائم ہو جاؤ تم لوگ اپنے باپ ابراہیم کی ملت پر اسی اللہ نے تمہارا نام مسلمان رکھا پہلے والی آسمانی کتابوں میں بھی اور اس قران میں بھی تاکہ تمہارے پیغمبر تم پر گواہ ہوں اور تم دوسرے لوگوں پر گواہ بنو پس تم لوگ نماز کی پابندی کرو اور زکوٰۃ دیتے رہو اور وابستہ ہو جاؤ اللہ کے دین سے وہی کار ساز ہے تم سب کا سو کیا ہی اچھا کارساز ہے اور کیا ہی اچھا مددگار ہے۔ ف٤",
        "English" : "Struggle for (seeking the pleasure of) Allah, a struggle that is owed to Him. He has chosen you and did not impose any hardship on you in the religion, the faith of your father Ibrahim. He (Allah) named you as Muslims earlier and also in this (Qur‘an), so that the Messenger becomes a witness to you, and you become witnesses to (other) people. So establish Salah, pay Zakah and hold fast to Allah. He is your patron. So, how excellent He is as a patron, and how excellent as a supporter!"
      }
    ]
  }
]