[
  {
    "surah_no": 2,
    "total_ayah" : 286,
    "name": "Surah e Bakrah",
    "detail": [
      {
        "arbi": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu": "",
        "English": ""
      },
      {
        "ayet_no": 1,
        "arbi": "الۗمّۗ",
        "Urdu": "الم ",
        "English": "Alif-Lm-Mm. [These letters are one of the miracles of the Quran and none but Allah (Alone) knows their meanings]."
      },
      {
        "ayet_no": 2,
        "arbi": "ذٰلِكَ الْكِتٰبُ لَا رَيْبَ فِيْه ھُدًى لِّلْمُتَّقِيْنَ",
        "Urdu": "(یہ) وہ کتاب ہے کوئی شک نہیں اس میں، پرہیز گاروں کے لیے ہدایت ہے ",
        "English": "This is the Book; in it is guidance sure, without doubt, to those who fear Allah."
      },
      {
        "ayet_no": 3,
        "arbi": "الَّذِيْنَ يُؤْمِنُوْنَ بِالْغَيْبِ وَ يُـقِيْمُوْنَ الصَّلٰوةَ وَ مِمَّا رَزَقْنٰھُمْ يُنْفِقُوْنَ    ",
        "Urdu": "وہ لوگ جو غیب پر ایمان لاتے ہیں اور وہ نماز قائم کرتے ہیں اور اس سے جو ہم نے انہیں رزق دیا ہے وہ خرچ کرتے ہیں ",
        "English": "Who believe in the Unseen, and are steadfast in Salah (prayer) , and spend out of what We have provided them."
      },
      {
        "ayet_no": 4,
        "arbi": "وَ الَّذِيْنَ يُؤْمِنُوْنَ بِمَآ اُنْزِلَ اِلَيْكَ وَمَآ اُنْزِلَ مِنْ قَبْلِكَ    ۚ   وَبِالْاٰخِرَةِ ھُمْ يُوْقِنُوْنَ   ",
        "Urdu": "اور وہ جو لوگ ایمان لاتے ہیں اس پر جو نازل کیا گیا آپ کی طرف اور جو نازل کیا گیا آپ سے پہلے اور آخرت پر وہ یقین رکھتے ہیں ",
        "English": "And who believe in that which hath been sent down unto thee and that which hath been sent down before thee and of the Hereafter they are convinced."
      },
      {
        "ayet_no": 5,
        "arbi": "اُولٰۗىِٕكَ عَلٰي ھُدًى مِّنْ رَّبِّهِمْ   ۤ   وَاُولٰۗىِٕكَ ھُمُ الْمُفْلِحُوْنَ   ",
        "Urdu": "وہی لوگ ہدایت پر ہیں اپنے رب کی طرف سے اور وہی لوگ ہی فلاح پانے والے ہیں ",
        "English": "They are on (true) guidance from their Lord, and they are the successful."
      },
      {
        "ayet_no": 6,
        "arbi": "اِنَّ الَّذِيْنَ كَفَرُوْا سَوَاۗءٌ عَلَيْهِمْ ءَاَنْذَرْتَھُمْ اَمْ لَمْ تُنْذِرْھُمْ لَا يُؤْمِنُوْنَ     ",
        "Urdu": "بے شک وہ لوگ جنہوں نے کفر کیا برابر ہے ان پر خواہ آپ ڈرائیں انہیں یا آپ انہیں نہ ڈرائیں وہ ایمان نہیں لائیں گے ",
        "English": "Verily, those who disbelieve, it is the same to them whether you (O Muhammad Peace be upon him ) warn them or do not warn them, they will not believe."
      },
      {
        "ayet_no": 7,
        "arbi": "خَتَمَ اللّٰهُ عَلٰي قُلُوْبِهِمْ وَعَلٰي سَمْعِهِمْ   ۭ   وَعَلٰٓي اَبْصَارِهِمْ غِشَاوَةٌ  وَّلَھُمْ عَذَابٌ عَظِيْمٌ    ",
        "Urdu": "مہر لگادی ہے اللہ نے ان کے دلوں پر اور ان کے کانوں پر (بھی) اور ان کی آنکھوں پر پردہ ہے اور ان کے لیے بڑا عذاب ہے ",
        "English": "Allah hath set a seal upon their hearts and upon their hearing, and over their sights is a covering; and unto them shall be a torment mighty."
      },
      {
        "ayet_no": 8,
        "arbi": "وَمِنَ النَّاسِ مَنْ يَّقُوْلُ اٰمَنَّا بِاللّٰهِ وَبِالْيَوْمِ الْاٰخِرِ وَمَا ھُمْ بِمُؤْمِنِيْنَ   ",
        "Urdu": "اور لوگوں میں سے (کچھ ایسے ہیں) جو کہتے ہیں ہم ایمان لائے اللہ پر اور آخرت کے دن پر حالانکہ وہ نہیں ہیں(دل سے) مومن ",
        "English": "And of mankind are some who say: we believe in Allah and in the Last Day: whereas they are not believers."
      },
      {
        "ayet_no": 9,
        "arbi": "يُخٰدِعُوْنَ اللّٰهَ وَالَّذِيْنَ اٰمَنُوْا    ۚ   وَمَا يَخْدَعُوْنَ اِلَّآ اَنْفُسَھُمْ وَمَا يَشْعُرُوْنَ    ",
        "Urdu": "وہ دھوکہ بازی کرتے ہیں اللہ سے اور ان لوگوں سے جو ایمان لائے اور (درا صل) وہ نہیں دھوکہ دیتے مگر اپنے آپ کو اور وہ نہیں سمجھتے ",
        "English": "They would deceive Allah and those who believe, whereas they deceive not save themselves, and they perceive not."
      },
      {
        "ayet_no": 10,
        "arbi": "فِىْ قُلُوْبِهِمْ مَّرَضٌ   ۙ   فَزَادَھُمُ اللّٰهُ مَرَضًا    ۚ   وَلَھُمْ عَذَابٌ اَلِيْمٌۢ       ڏ   بِمَا كَانُوْا يَكْذِبُوْنَ   ",
        "Urdu": "ان کے دلوں میں (نفاق کی) بیماری ہے پس اللہ نے (اور) بڑھا دیا انہیں بیماری میں اور ان کے لیے دردناک عذاب ہے اس وجہ سے جو وہ جھوٹ بولتے تھے۔ ",
        "English": "In their hearts is a disease (of doubt and hypocrisy) andAllah has increased their disease. A painful torment is theirs because they used to tell lies."
      },
      {
        "ayet_no": 11,
        "arbi": "وَاِذَا قِيْلَ لَھُمْ لَا تُفْسِدُوْا فِى الْاَ رْضِ    ۙ   قَالُوْٓا اِنَّمَا نَحْنُ مُصْلِحُوْنَ    ",
        "Urdu": "اور جب کہا جائے ان سے (کہ) تم زمین میں فساد برپامت کرو، کہتے ہیں: بیشک ہم (تو) اصلاح کرنے والے ہیں ",
        "English": "And when it is said to them: Make not mischief on the earth,( they say  We are only peacemakers. )"
      },
      {
        "ayet_no": 12,
        "arbi": "اَلَآ اِنَّھُمْ ھُمُ الْمُفْسِدُوْنَ وَلٰكِنْ لَّا يَشْعُرُوْنَ   ",
        "Urdu": "خبردار یقینا وہ لوگ ہی فساد کرنے والے ہیں اور لیکن وہ نہیں سمجھتے ",
        "English": "Verily! They are the ones who make mischief, but they perceive not."
      },
      {
        "ayet_no": 13,
        "arbi": "وَاِذَا قِيْلَ لَھُمْ اٰمِنُوْا كَمَآ اٰمَنَ النَّاسُ قَالُوْٓا اَنُؤْمِنُ كَمَآ اٰمَنَ السُّفَهَاۗءُ     ۭ   اَلَآ اِنَّھُمْ ھُمُ السُّفَهَاۗءُ وَلٰكِنْ لَّا يَعْلَمُوْنَ  ",
        "Urdu": "اور جب کہا جائے ان سے ایمان لاو جیسے (اور) لوگ ایمان لائے کہتے ہیں کیا ہم (ایسے) ایمان لائیں جیسے بیوقوف ایمان لائے خبردار بے شک وہ (خود) ہی بے وقوف ہیں اور لیکن وہ جانتے نہیں ",
        "English": "And when it is said unto them: believe as the people believe, they say: shall we believe as the foolish believe? are not they indeed the foolish? But they know not."
      },
      {
        "ayet_no": 14,
        "arbi": "وَاِذَا لَقُوا الَّذِيْنَ اٰمَنُوْا قَالُوْٓا اٰمَنَّا      ښ    وَاِذَا خَلَوْا اِلٰى شَيٰطِيْنِهِمْ   ۙ   قَالُوْٓا اِنَّا مَعَكُمْ   ۙ   اِنَّمَا نَحْنُ مُسْتَهْزِءُوْنَ   ",
        "Urdu": "اور جب ملتے ہیں (ان لوگوں سے) جو ایمان لائے کہتے ہیں ہم (بھی) ایمان لائے ہیں اور جب اکیلے ہوتے ہیں اپنے شیطانوں کے پاس (تو) کہتے ہیں بے شک ہم تمہارے ساتھ ہیں بے شک ہم مذاق کرتے ہیں ",
        "English": "And when they meet those who have believed, they say: We believe. And when they are alone with their Satans, they say: verily we are with you, we were but mocking."
      },
      {
        "ayet_no": 15,
        "arbi": "اَللّٰهُ يَسْتَهْزِئُ بِهِمْ وَيَمُدُّھُمْ فِىْ طُغْيَانِهِمْ يَعْمَھُوْنَ   ",
        "Urdu": "اللہ تعالی مذاق اڑاتا ہے ان (منافقوں) کا اور وہ ڈھیل دیے جا رہا ہے انہیں اپنی سرکشی میں وہ اندھوں کی طرح بھٹک رہے ہیں۔ ",
        "English": "It is Allah who mocks at them, and lets them go on wandering blindly in their rebellion."
      },
      {
        "ayet_no": 16,
        "arbi": "اُولٰۗىِٕكَ الَّذِيْنَ اشْتَرَوُا الضَّلٰلَةَ بِالْهُدٰى   ۠   فَمَا رَبِحَتْ تِّجَارَتُھُمْ وَمَا كَانُوْا مُهْتَدِيْنَ    ",
        "Urdu": "یہ وہ لوگ ہیں جنہوں نے خریدا گمراہی کو ہدایت کے بدلے میں پس نہ کوئی فائدہ پہنچایا ان کی تجارت نے (انہیں) اور نہ ہی وہ بنے ہدایت پانے والے ",
        "English": "These are they who purchased error for guidance, but their traffic profited not, nor have they ever become guided."
      },
      {
        "ayet_no": 17,
        "arbi": "مَثَلُھُمْ كَمَثَلِ الَّذِى اسْـتَوْقَدَ نَارًا   ۚ   فَلَمَّآ اَضَاۗءَتْ مَا حَوْلَهٗ ذَھَبَ اللّٰهُ بِنُوْرِهِمْ وَتَرَكَھُمْ فِىْ ظُلُمٰتٍ لَّا يُبْصِرُوْنَ    ",
        "Urdu": "ان کی مثال (اس شخص) کی مثال کی طرح ہے جو آگ جلائے، پس جب آگ نے روشن کردیا اس کے ماحول کو، تو لے گیا اللہ ان کی روشنی کو اور انہیں چھوڑدیا اندھیروں میں (کہ) وہ (کچھ) نہیں دیکھ پاتے۔ ",
        "English": "Their likeness is as the likeness of one who kindled a fire; then, when it lighted all around him,Allah took away their light and left them in darkness. (So) they could not see."
      },
      {
        "ayet_no": 18,
        "arbi": "ۻ       بُكْمٌ عُمْىٌ فَھُمْ لَا يَرْجِعُوْنَ  ",
        "Urdu": "وہ بہرے ہیں، گونگے ہیں، اندھے ہیں پس وہ (حق کی طرف) نہیں لوٹتے ",
        "English": "Deaf, dumb, blind; wherefore they will not return."
      },
      {
        "ayet_no": 19,
        "arbi": "اَوْ كَصَيِّبٍ مِّنَ السَّمَاۗءِ فِيْهِ ظُلُمٰتٌ وَّرَعْدٌ وَّبَرْقٌ   ۚ   يَجْعَلُوْنَ اَصَابِعَھُمْ فِىْٓ اٰذَانِهِمْ مِّنَ الصَّوَاعِقِ حَذَرَ الْمَوْتِ    ۭ   وَاللّٰهُ مُحِيْطٌۢ بِالْكٰفِرِيْنَ   ",
        "Urdu": "یا (ان کی مثال) آسمان سے بارش کی طرح ہے اس میں اندھیرے ہوں اور گرج ہو، اور بجلی ہو وہ ڈال لیتے ہیں اپنی انگلیوں کو اپنے کانوں میں کڑک (کی وجہ) سے موت کے ڈر سے اور اللہ کافروں کو گھیرے ہوئے ہے ",
        "English": "like unto a rain--laden cloud from heaven, wherein are darknesses and thunder and lightening. They so put their fingers in their ears because of the thunder-claps, guarding against death, and Allah is Encompasser of the infidels."
      },
      {
        "ayet_no": 20,
        "arbi": "يَكَادُ الْبَرْقُ يَخْطَفُ اَبْصَارَھُمْ   ۭ   كُلَّمَآ اَضَاۗءَ لَھُمْ مَّشَوْا فِيْهِ   ڎ   وَاِذَآ اَظْلَمَ عَلَيْهِمْ قَامُوْا    ۭ   وَلَوْ شَاۗءَ اللّٰهُ لَذَھَبَ بِسَمْعِهِمْ وَاَبْصَارِهِمْ   ۭ   اِنَّ اللّٰهَ عَلٰي كُلِّ شَىْءٍ قَدِيْرٌ ",
        "Urdu": "قریب ہے کہ بجلی اچک لے ان کی بصارت کو جب (بجلی) ان کے لیے روشنی کرتی ہے (تو) وہ چل پڑتے ہیں اس میں اور جب اندھیرا چھا جاتا ہے ان پر تو کھڑے ہوجاتے ہیں اور اگر اللہ چاہے (تو) البتہ لے جائے ان کی سماعت کو اور ان کی بصار ت کو بے شک اللہ تعالی ہر چیز پر قادر ہے ",
        "English": "The lightning well-nigh snatcheth away their sight; whensoever it flasheth on them, they walk therein, and when it becometh dark unto them, they stand still. And had Allah willed He would of a surety have taken away their hearing and their sights; verily Allah is over everything potent."
      },
      {
        "ayet_no": 21,
        "arbi": "يٰٓاَيُّهَا النَّاسُ اعْبُدُوْا رَبَّكُمُ الَّذِىْ خَلَقَكُمْ وَالَّذِيْنَ مِنْ قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُوْنَ   ",
        "Urdu": "اے لوگو! اپنے رب کی عبادت کرو جس نے پیدا کیا تمہیں اور ان لوگوں کو جو تم سے پہلے تھے تاکہ تم (عذاب سے) بچ جاؤ۔ ",
        "English": "O people, worship your Lord who created you and those before you, so that you may become God-fearing."
      },
      {
        "ayet_no": 22,
        "arbi": "الَّذِىْ جَعَلَ لَكُمُ الْاَرْضَ فِرَاشًا وَّالسَّمَاۗءَ بِنَاۗءً   ۠   وَّاَنْزَلَ مِنَ السَّمَاۗءِ مَاۗءً فَاَخْرَجَ بِهٖ مِنَ الثَّمَرٰتِ رِزْقًا لَّكُمْ   ۚ   فَلَا تَجْعَلُوْا لِلّٰهِ اَنْدَادًا وَّاَنْتُمْ تَعْلَمُوْنَ    ",
        "Urdu": "جس نے بنادیا تمہارے لیے زمین کو بچھونا اور آسمان کو چھت اور اتارا آسمان سے پانی پھر نکال دیا اس سے تمہارے لیے پھلوں کا رزق پس تم نہ بناؤ (دوسروں کو) اللہ کے شریک حالانکہ تم جانتے ہو ",
        "English": "Who hath made the earth for you a carpet and the heaven a structure, and sent down from heaven water, and brought forth therewith fruits as a Provision for you; wherefore set not up compeers unto Allah while ye know."
      },
      {
        "ayet_no": 23,
        "arbi": "وَاِنْ كُنْتُمْ فِىْ رَيْبٍ مِّمَّا نَزَّلْنَا عَلٰي عَبْدِنَا فَاْتُوْا بِسُوْرَةٍ مِّنْ مِّثْلِهٖ    ۠   وَادْعُوْا شُهَدَاۗءَكُمْ مِّنْ دُوْنِ اللّٰهِ اِنْ كُنْتُمْ صٰدِقِيْنَ   ",
        "Urdu": "اور اگر تم ہو شک میں اس سے جو ہم نے اتارا ہے اپنے بندے پر تو تم (بھی بنا) لاؤ کوئی سورت اس جیسی اور بلا لو اللہ کے علاوہ اپنے سب حمایتیوں کو اگر تم ہوسچے ",
        "English": "If you are in doubt about what We have revealed to Our servant, then bring a Surah similar to this, and do call your supporters other than Allah, if you are true."
      },
      {
        "ayet_no": 24,
        "arbi": "فَاِنْ لَّمْ تَفْعَلُوْا وَلَنْ تَفْعَلُوْا فَاتَّقُوا النَّارَ الَّتِىْ وَقُوْدُھَا النَّاسُ وَالْحِجَارَةُ ښ اُعِدَّتْ لِلْكٰفِرِيْنَ ",
        "Urdu": "پس اگر تم (ایسا) نہ کرسکو اور ہرگز نہ کرسکوگے تو (پھر) ڈرو (اس) آگ سے جو ایندھن ہیں اس کا لوگ اور پتھر وہ (آگ) تیار کی گئی ہے کافروں کے لے ",
        "English": "But if you do it not, and you can never do it, then fear the Fire (Hell) whose fuel is men and stones, prepared for the disbelievers."
      },
      {
        "ayet_no": 25,
        "arbi": "وَبَشِّرِ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ اَنَّ لَھُمْ جَنّٰتٍ تَجْرِىْ مِنْ تَحْتِهَا الْاَنْهٰرُ    ۭ   كُلَّمَا رُزِقُوْا مِنْهَا مِنْ ثَمَـــرَةٍ رِّزْقًا    ۙ   قَالُوْا ھٰذَا الَّذِىْ رُزِقْنَا مِنْ قَبْلُ    ۙ    وَاُتُوْا بِهٖ مُتَشَابِهًا    ۭ    وَلَھُمْ فِيْهَآ اَزْوَاجٌ مُّطَهَّرَةٌ     ڎ    وَّھُمْ فِيْهَا خٰلِدُوْنَ   ",
        "Urdu": "اور خوشخبری دے دیجئے ان لوگوں کو جو ایمان لائے اور نیک اعمال کیے کہ بیشک ان کے لیے (ایسے) باغات ہیں (کہ) بہتی ہیں ان کے نیچے سے نہریں جب بھی انہیں دیا جائے گا ان سے کسی پھل کا رزق (تو) وہ کہیں گے یہ (تو وہی ہے) جو ہمیں رزق دیا گیا اس سے پہلے (دنیا میں) اور وہ دیے جائیں گے اس سے بالکل ملتا جلتا اور ان کیلئے ان (باغات) میں پاکیزہ بیویاں ہوں گی اور وہ ان میں ہمیشہ رہنے والے ہیں ",
        "English": "And bear thou the glad tidings unto those who believe and do righteous works that verily for them shall be Gardens whereunder rivers flow. So oft as they shall be provided with a fruit therefrom they will say: this is that wherewith we were provided afore; and they shall be vouchsafed that which is consimilar; and for them shall be therein spouses purified, and therein they shall be abiders."
      },
      {
        "ayet_no": 26,
        "arbi": " اِنَّ اللّٰهَ لَا يَسْتَحْىٖٓ اَنْ يَّضْرِبَ مَثَلًا مَّا بَعُوْضَةً فَمَا فَوْقَهَا     ۭ  فَاَمَّا الَّذِيْنَ اٰمَنُوْا فَيَعْلَمُوْنَ اَنَّهُ الْحَقُّ مِنْ رَّبِّهِمْ   ۚ   وَاَمَّا الَّذِيْنَ كَفَرُوْا فَيَقُوْلُوْنَ مَاذَآ اَرَادَ اللّٰهُ بِهٰذَا مَثَلًا  ۘ يُضِلُّ بِهٖ كَثِيْرًا    ۙ وَّيَهْدِىْ بِهٖ كَثِيْرًا    ۭ   وَمَا يُضِلُّ بِهٖٓ اِلَّا الْفٰسِقِيْنَ   ",
        "Urdu": "بے شک اللہ تعالی نہیں شرماتا کہ وہ مثال بیان کرے کوئی سی مچھر کی ہو (یا) پھر اس سے بڑھ کر (کسی حقیر چیز کی ہو) پس رہے (وہ لوگ) جو ایمان لائے تو وہ جانتے ہیں کہ بیشک وہ حق ہے ان کے رب کی طرف سے اور رہے (وہ لوگ) جنہوں نے کفر کیا تو وہ کہتے ہیں: اللہ کیا چاہتا ہے اس (حقیر سی) مثال کو بیان کر کے (دراصل) وہ گمراہ رہنے دیتا ہے اس سے اکثر کو اور ہدایت دے دیتا ہے اس سے اکثر کو اور نہیں وہ گمراہ کرتا اس سے مگر فاسقوں کو ",
        "English": "Indeed, Allah does not feel shy in citing any parable, be it that of a gnat or of something above it (in meanness) . Now, as for those who believe, they know it is the truth from their Lord; while those who disbelieve say, :What could Allah have meant by this parable? By this He lets many go astray, and by this He makes many find guidance. But He does not let anyone go astray thereby except those who are sinful"
      },
      {
        "ayet_no": 27,
        "arbi": "الَّذِيْنَ يَنْقُضُوْنَ عَهْدَ اللّٰهِ مِنْۢ بَعْدِ مِيْثَاقِه   ٖ  ۠   وَ يَقْطَعُوْنَ مَآ اَمَرَ اللّٰهُ بِهٖٓ اَنْ يُّوْصَلَ وَيُفْسِدُوْنَ فِى الْاَرْضِ   ۭ   اُولٰۗىِٕكَ ھُمُ الْخٰسِرُوْنَ   ",
        "Urdu": "جو توڑتے ہیں اللہ کے عہد کو اسے مضبوط کرنے کے بعد اور وہ قطع کرتے ہیں (ان رشتوں کو) جو اللہ نے حکم دیا ہے اس کا کہ وہ جوڑے جائیں اور وہ فساد پھیلاتے ہیں زمین میں وہی لوگ ہی نقصان اٹھانے والے ہیں ",
        "English": "Who break the covenant of Allah after the ratification thereof, and sunder that which Allah hath commanded should be joined, and act corruptly on the earth. These! they are the losers."
      },
      {
        "ayet_no": 28,
        "arbi": "كَيْفَ تَكْفُرُوْنَ بِاللّٰهِ وَكُنْتُمْ اَمْوَاتًا فَاَحْيَاكُمْ   ۚ ثُمَّ يُمِيْتُكُمْ ثُمَّ يُحْيِيْكُمْ ثُمَّ اِلَيْهِ تُرْجَعُوْنَ   ",
        "Urdu": "کیسے تم انکار کرتے ہو اللہ کا حالانکہ تم تھے مردہ تو اس نے تمہیں زندہ کیا پھر وہی تمہیں موت دے گا پھر وہی تمہیں (دوبارہ) زندہ کرے گا پھر اسی کی طرف تم لوٹائےجاؤ گے۔ ",
        "English": "How is it that you deny Allah, while you were lifeless and He gave you life; then He will make you die, and then He will make you live again, and then to Him you will be returned?"
      },
      {
        "ayet_no": 29,
        "arbi": "ھُوَ الَّذِىْ خَلَقَ لَكُمْ مَّا فِى الْاَرْضِ جَمِيْعًا    ۤ  ثُمَّ اسْتَوٰٓى اِلَى السَّمَاۗءِ فَسَوّٰىھُنَّ سَبْعَ سَمٰوٰتٍ    ۭ  وَھُوَ بِكُلِّ شَىْءٍ عَلِيْمٌ     ",
        "Urdu": "وہی ہے جس نے پیدا کیا تمہارے لیے جو کچھ ہے زمین میں سارے کا سارا پھر قصد کیا آسمان کی طرف تو بنادیا انہیں سات آسمان اور وہ ہر چیز کو خوب جاننے والا ہے۔ ",
        "English": "It is He who created for you all that the earth contains; then He turned to the heavens and made them seven skies — and He is the knower of all things."
      },
      {
        "ayet_no": 30,
        "arbi": "وَاِذْ قَالَ رَبُّكَ لِلْمَلٰۗىِٕكَةِ اِنِّىْ جَاعِلٌ فِى الْاَرْضِ خَلِيْفَةً    ۭ  قَالُوْٓا اَتَجْعَلُ فِيْهَا مَنْ يُّفْسِدُ فِيْهَا وَيَسْفِكُ الدِّمَاۗءَ    ۚ  وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ   ۭ  قَالَ اِنِّىْٓ اَعْلَمُ مَا لَا تَعْلَمُوْنَ  ",
        "Urdu": "اور جب تیرے رب نے فرشتوں سے کہا: بے شک میں زمین میں ایک خلیفہ بنانے والا ہوں (تو) انہوں نے کہا: کیا تو بنائے گا اس میں (اسے) جو فساد برپا کرے گا اس میں اور خون بہائے گا اور ہم تسبیح بیان کرتے ہیں تیری تعریف کیساتھ اور ہم پاکی بیان کرتے ہیں تیری ( تو اللہ نے) فرمایا: بے شک میں(وہ کچھ) جانتا ہوں جو تم نہیں جانتے ",
        "English": "(Remember) when your Lord said to the angels, :I am going to create a deputy on the earth! They said, :Will You create there one who will spread disorder on the earth and cause bloodshed, while we proclaim Your purity, along with your praise, and sanctify Your name? He said, :Certainly, I know what you know not."
      },
      {
        "ayet_no": 31,
        "arbi": "وَعَلَّمَ اٰدَمَ الْاَسْمَاۗءَ كُلَّهَا ثُمَّ عَرَضَھُمْ عَلَي الْمَلٰۗىِٕكَةِ ۙ فَقَالَ اَنْۢبِــُٔـوْنِىْ بِاَسْمَاۗءِ ھٰٓؤُلَاۗءِ اِنْ كُنْتُمْ صٰدِقِيْنَ ",
        "Urdu": "اور اس نے آدم کو سکھا دیے وہ سب نام (جو چاہے) پھر پیش کیا ان کو فرشتوں پر پس فرمایا (اللہ نے) مجھے بتاو ان چیزوں کے نام اگر ہو تم سچے۔ ",
        "English": "And He taught ‘Adam the names, all of them; then presented them before the angels, and said, :Tell me their names, if you are right."
      },
      {
        "ayet_no": 32,
        "arbi": "قَالُوْا سُبْحٰــنَكَ لَاعِلْمَ لَنَآ اِلَّا مَا عَلَّمْتَنَا    ۭ  اِنَّكَ اَنْتَ الْعَلِيْمُ الْحَكِيْمُ   ",
        "Urdu": "(وہ) کہنے لگے : تو پاک ہے کوئی علم نہیں ہمیں مگر جو تونے ہمیں سکھایا ہے بے شک تو ہی خوب جاننے والا، حکمت والا ہے۔ ",
        "English": "They said: hallowed be Thou no knowledge is our save that which Thou hast taught us, verily Thou! Thou art the Knower, Wise."
      },
      {
        "ayet_no": 33,
        "arbi": "قَالَ يٰٓاٰدَمُ اَنْۢبِئْـھُمْ بِاَسْمَاۗىِٕهِمْ   ۚ  فَلَمَّآ اَنْۢبَاَھُمْ بِاَسْمَاۗىِٕهِمْ    ۙ  قَالَ اَلَمْ اَقُلْ لَّكُمْ اِنِّىْٓ اَعْلَمُ غَيْبَ السَّمٰوٰتِ وَالْاَرْضِ وَاَعْلَمُ مَا تُبْدُوْنَ وَمَا كُنْتُمْ تَكْتُمُوْنَ  ",
        "Urdu": ")اللہ نے)فرمایااے آدم بتادو انہیں ان کے نام تو جب اس نے بتادیے انہیں ان کے نام (تواللہ نے) فرمایا کیا نہیں میں نے کہا تھا تمہیں کہ بے شک میں ہی جانتا ہوں غیب (کی باتیں) آسمانوں اور زمین کی اور میں جانتا ہوں جو تم ظاہر کرتے ہو اور جو تم ہو چھپاتے۔ ",
        "English": "He said: O Adam! Inform them of their names, and when he had informed them of their names, He said: Did I not tell you that I know the secret of the heavens and the earth? And I know that which ye disclose and which ye hide."
      },
      {
        "ayet_no": 34,
        "arbi": "وَاِذْ قُلْنَا لِلْمَلٰۗىِٕكَةِ اسْجُدُوْا لِاٰدَمَ فَسَجَدُوْٓا اِلَّآ اِبْلِيْسَ   ۭ  اَبٰى وَاسْتَكْبَرَ       ڭ   وَكَانَ مِنَ الْكٰفِرِيْنَ  ",
        "Urdu": "اور جب ہم نے کہا فرشتوں سے کہ آدم کو سجدہ کرو تو سب نے سجدہ کیا سوائے ابلیس کے ا س نے انکار کیا اور تکبر کیا اور وہ ہوگیا کافروں میں سے۔ ",
        "English": "And when We said to the angels: :Prostrate yourselves before ‘Adam! So, they prostrated themselves, all but Iblis (Satan) . He refused, and became one of the infidels."
      },
      {
        "ayet_no": 35,
        "arbi": "وَقُلْنَا يٰٓاٰدَمُ اسْكُنْ اَنْتَ وَزَوْجُكَ الْجَنَّةَ وَكُلَامِنْهَا رَغَدًا حَيْثُ شِـئْتُمَـا       ۠  وَلَا تَـقْرَبَا ھٰذِهِ الشَّجَرَةَ فَتَكُوْنَا مِنَ الظّٰلِمِيْنَ   ",
        "Urdu": "اور ہم نے کہا: اے آدم! تم رہو اور تمہاری بیوی جنت میں اور کھاو اس سے اطمینان سے جہاں سے تم چاہواور قریب نہ جانا اس درخت کے (ورنہ) پس تم ہوجاو گے ظالموں میں سے۔ ",
        "English": "And We said, :O ‘Adam, dwell, you and your wife, in Paradise; and eat at pleasure wherever you like, but do not go near this tree, otherwise you will be (counted) among the transgressors."
      },
      {
        "ayet_no": 36,
        "arbi": "فَاَزَلَّهُمَا الشَّيْطٰنُ عَنْهَا فَاَخْرَجَهُمَا مِمَّا كَانَا فِيْهِ     ۠ وَقُلْنَا اھْبِطُوْا بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ   ۚ   وَلَكُمْ فِى الْاَرْضِ مُسْـتَقَرٌّ وَّمَتَاعٌ اِلٰى حِيْنٍ   ",
        "Urdu": "پس ورغلایا ان دونوں کو شیطان نے اس سے تو نکلوادیا ان کو اس سے جس میں وہ دونوں تھے۔اور ہم نے کہا: تم اترجاو تمہارے بعض بعض کے دشمن ہیں اور تمہارے لیے زمین میں ٹھکانا ہے اور فائدہ اٹھانا ہے ایک وقت تک ",
        "English": "Then, Satan caused them to slip from it, and brought them out of where they had been. And We said, :Go down, all of you, some of you the enemies of others; and on the earth there will be for you a dwelling place and enjoyment for a time."
      },
      {
        "ayet_no": 37,
        "arbi": "فَتَلَـقّيٰٓ اٰدَمُ مِنْ رَّبِّهٖ كَلِمٰتٍ فَتَابَ عَلَيْهِ    ۭ   اِنَّهٗ ھُوَ التَّوَّابُ الرَّحِيْمُ   ",
        "Urdu": "پھر سیکھ لیے آدم نے اپنے رب سے چند کلمات پس وہ متوجہ ہوا اس پر (یعنی توبہ قبول کرلی)بے شک وہ ہی توبہ قبول کرنے والا مہربان ہے۔ ",
        "English": "Then Adam learnt from his Lord certain Words, and He relented toward him, verily He! He is the Relentant, the Merciful."
      },
      {
        "ayet_no": 38,
        "arbi": "قُلْنَا اھْبِطُوْا مِنْهَا جَمِيْعًا    ۚ  فَاِمَّا يَاْتِيَنَّكُمْ مِّـنِّىْ ھُدًى فَمَنْ تَبِعَ ھُدَاىَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا ھُمْ يَحْزَنُوْنَ  ",
        "Urdu": "ہم نے کہا: اترجاو اس سے سب کے سب پھر جب آئے تمہارے پاس میری طرف سے ہدایت تو جس نے پیروی کی میری ہدایت کی پس نہ تو کوئی خوف ہوگا ان پر اور نہ ہی وہ غمگین ہوں گے۔ ",
        "English": "We said, :Go down from here, all of you. Then, should some guidance come to you from Me, those who follow My guidance shall have no fear, nor shall they grieve."
      },
      {
        "ayet_no": 39,
        "arbi": "وَالَّذِيْنَ كَفَرُوْا وَكَذَّبُوْا بِاٰيٰتِنَآ اُولٰۗىِٕكَ اَصْحٰبُ النَّارِ   ۚ   ھُمْ فِيْهَا خٰلِدُوْنَ   ",
        "Urdu": "اور جن لوگوں نے کفر کیا اور جھٹلایا ہماری آیات کو وہی لوگ دوزخ میں رہنے والے ہیں وہ اس میں ہمیشہ رہنے والے ہیں ",
        "English": "As for those who disbelieve, and deny Our signs, they are the people of the Fire. They shall dwell in it forever."
      },
      {
        "ayet_no": 40,
        "arbi": "يٰبَنِىْٓ اِسْرَاۗءِيْلَ اذْكُرُوْا نِعْمَتِىَ الَّتِىْٓ اَنْعَمْتُ عَلَيْكُمْ وَاَوْفُوْا بِعَهْدِىْٓ اُوْفِ بِعَهْدِكُمْ   ۚ   وَاِيَّاىَ فَارْھَبُوْنِ   ",
        "Urdu": "اے بنی اسرائیل یاد کرو میری (اس )نعمت کو جو میں نے انعام کی ہے تم پر اور پورا کرو میرے عہد کو، میں پورا کروں گا تمہارے عہد کو اور صرف مجھ ہی سے پس ڈرو۔ ",
        "English": "O Children of Isra‘il (the Israelites) , remember My blessing that I conferred upon you, and fulfill the covenant with Me, and I shall fulfill your covenant, and have awe of Me alone."
      },
      {
        "ayet_no": 41,
        "arbi": "وَاٰمِنُوْا بِمَآ اَنْزَلْتُ مُصَدِّقًا لِّمَا مَعَكُمْ وَلَا تَكُوْنُوْٓا اَوَّلَ كَافِرٍۢ بِهٖ وَلَا تَشْتَرُوْا بِاٰيٰتِىْ ثَـمَنًا قَلِيْلًا وَاِيَّاىَ فَاتَّقُوْنِ ",
        "Urdu": "اور ایمان لاو (اس کتاب) پر جو میں نے نازل کی تصدیق کرنے والی ہے اس کی جو تمہارے پاس ہے (تورات وانجیل) اور مت بنو پہلے انکار کرنے والے اس کے اور مت بیچو میری آیتوں کو تھوڑی قیمت میں اور صرف مجھ ہی سے پس تم ڈرو۔ ",
        "English": "And have faith in what I have revealed, confirming what is already with you, and do not be the first to deny it, nor take a paltry price for My verses. Fear Me alone."
      },
      {
        "ayet_no": 42,
        "arbi": "وَلَا تَلْبِسُوا الْحَقَّ بِالْبَاطِلِ وَتَكْتُمُوا الْحَــقَّ وَاَنْتُمْ تَعْلَمُوْنَ   ",
        "Urdu": "اور خلط ملط نہ کرو حق کو باطل کے ساتھ اور حق کو (نہ) چھپاو حالانکہ تم جانتے ہو۔ ",
        "English": "And confound not the truth with falsehood, nor hide the truth while ye know."
      },
      {
        "ayet_no": 43,
        "arbi": "وَاَقِيْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَارْكَعُوْا مَعَ الرّٰكِعِيْنَ  ",
        "Urdu": "اور نماز قائم کرو اور زکوة ادا کرو اور رکوع کرو رکوع کرنے والوں کے ساتھ۔ ",
        "English": "And establish prayer, and give the poor-rate, and bow down with those who bow down."
      },
      {
        "ayet_no": 44,
        "arbi": "اَتَاْمُرُوْنَ النَّاسَ بِالْبِرِّ وَتَنْسَوْنَ اَنْفُسَكُمْ وَاَنْتُمْ تَتْلُوْنَ الْكِتٰبَ    ۭ   اَفَلَاتَعْقِلُوْنَ  ",
        "Urdu": "کیا تم حکم دیتے ہو لوگوں کو نیکی کا اور تم بھول جاتے ہو اپنے آپ کو حالانکہ تم تلاوت کرتے ہو کتاب کی کیا پس تم عقل نہیں کرتے ",
        "English": "Do you enjoin righteousness upon others while you ignore your own selves, although you keep reciting the Book? Have you then no sense?"
      },
      {
        "ayet_no": 45,
        "arbi": "وَاسْتَعِيْنُوْا بِالصَّبْرِ وَالصَّلٰوةِ      ۭ   وَاِنَّهَا لَكَبِيْرَةٌ اِلَّا عَلَي الْخٰشِعِيْنَ   ",
        "Urdu": "اور مدد طلب کرو (اللہ سے) صبر اور نماز کے ذریعے اور بے شک وہ (نماز) البتہ بڑی (بوجھل) ہے مگر عاجزی کرنے والوں پر (بوجھل نہیں۔ ",
        "English": "And seek help in patience and prayer and verily it is, hard except prayer unto the meek."
      },
      {
        "ayet_no": 46,
        "arbi": "الَّذِيْنَ يَظُنُّوْنَ اَنَّھُمْ مُّلٰقُوْا رَبِّهِمْ وَاَنَّھُمْ اِلَيْهِ رٰجِعُوْنَ   ",
        "Urdu": "وہ لوگ جو یقین رکھتے ہیں کہ بے شک وہ ملنے والے ہیں اپنے رب کو اور بے شک وہ اسی کی طرف لوٹنے والے ہیں۔ ",
        "English": "Who know that verily they are going to meet their Lord, and that verily unto Him they are going to return."
      },
      {
        "ayet_no": 47,
        "arbi": "يٰبَنِىْٓ اِسْرَاۗءِيْلَ اذْكُرُوْا نِعْمَتِىَ الَّتِىْٓ اَنْعَمْتُ عَلَيْكُمْ وَاَنِّىْ فَضَّلْتُكُمْ عَلَي الْعٰلَمِيْنَ   ",
        "Urdu": "اے بنی اسرائیل یاد کرو میری (اس) نعمت کو جو میں نے انعام کی ہیں تم پر اور بیشک میں نے تم کو فضیلت دی ہے تمام جہان والوں پر۔ ",
        "English": "O Children of Israel: remember My favour wherewith I favoured you, and that verily I preferred you over the world."
      },
      {
        "ayet_no": 48,
        "arbi": "وَاتَّقُوْا يَوْمًا لَّا تَجْزِىْ نَفْسٌ عَنْ نَّفْسٍ شَـيْــــًٔـا وَّلَا يُقْبَلُ مِنْهَا شَفَاعَةٌ وَّلَا يُؤْخَذُ مِنْهَا عَدْلٌ وَّلَا ھُمْ يُنْصَرُوْنَ  ",
        "Urdu": "اور ڈرو اس دن سے (جس دن) کام نہ آئے گی کوئی جان کسی دوسری جان کے کچھ بھی اور نہ قبول کی جائے گی اس سے کوئی سفارش اور نہ ہی لیا جائے گا اس سے کوئی معاوضہ اور نہ ہی وہ مدد کیے جائیں گے۔ ",
        "English": "And fear a Day (of Judgement) when a person shall not avail another, nor will intercession be accepted from him nor will compensation be taken from him nor will they be helped."
      },
      {
        "ayet_no": 49,
        "arbi": "وَاِذْ نَجَّيْنٰكُمْ مِّنْ اٰلِ فِرْعَوْنَ يَسُوْمُوْنَكُمْ سُوْۗءَ الْعَذَابِ يُذَبِّحُوْنَ اَبْنَاۗءَكُمْ وَيَسْتَحْيُوْنَ نِسَاۗءَكُمْ    ۭ   وَفِىْ ذٰلِكُمْ بَلَاۗءٌ مِّنْ رَّبِّكُمْ عَظِيْمٌ    ",
        "Urdu": "اور جب ہم نے نجات دی تم کو آل فرعون سے (جو) تمہیں پہنچاتے تھے برا عذاب وہ ذبح کرتے تمہارے بیٹوں کو اور وہ زندہ چھوڑدیتے تھے تمہاری عورتوں کو اور اس میں آزمائش تھی تمہارے رب کی طرف سے بہت بڑی۔ ",
        "English": "And recall what time We delivered you from the house of Fir'awn imposing upon you evil torment, slaughtering your sons and letting your women live; and therein was a trial, from your Lord, Mighty."
      },
      {
        "ayet_no": 50,
        "arbi": "وَاِذْ فَرَقْنَا بِكُمُ الْبَحْرَ فَاَنْجَيْنٰكُمْ وَاَغْرَقْنَآ اٰلَ فِرْعَوْنَ وَاَنْتُمْ تَنْظُرُوْنَ   ",
        "Urdu": "اور جب ہم نے پھاڑا تمہاری وجہ سے سمندر کو پس ہم نے نجات دی تمہیں اور ہم نے غرق کردیا آل فرعون کو اور (یہ سب کچھ) تم دیکھ رہے تھے۔ ",
        "English": "And (recall) when We parted the sea for you; then We saved you, and drowned the people of Pharaoh while you were looking on!"
      },
      {
        "ayet_no": 51,
        "arbi": "وَاِذْ وٰعَدْنَا مُوْسٰٓى اَرْبَعِيْنَ لَيْلَةً ثُمَّ اتَّخَذْتُمُ الْعِجْلَ مِنْۢ بَعْدِهٖ وَاَنْتُمْ ظٰلِمُوْنَ   ",
        "Urdu": "اور جب ہم نے موسی سے وعدہ کیا چالیس راتوں کا پھر تم نے (معبود) بنا لیا بچھڑے کو اس کے بعد حالانکہ تم ظلم کرنے والے تھے۔ ",
        "English": "And when We appointed forty nights for Musa, then you took the calf (as God) thereafter, and you were unjust."
      },
      {
        "ayet_no": 52,
        "arbi": "ثُمَّ عَفَوْنَا عَنْكُمْ مِّنْۢ بَعْدِ ذٰلِكَ لَعَلَّكُمْ تَشْكُرُوْنَ  ",
        "Urdu": "پھر ہم نے معاف کردیا تم کو اس کے بعد تاکہ تم شکر گزار بن جاو۔ ",
        "English": "Yet We pardoned you, even after that, so that you may show gratitude."
      },
      {
        "ayet_no": 53,
        "arbi": "وَاِذْ اٰتَيْنَا مُوْسَى الْكِتٰبَ وَالْفُرْقَانَ لَعَلَّكُمْ تَهْتَدُوْنَ  ",
        "Urdu": "اور (وہ وقت یاد کرو) جب ہم نے دی موسی کو کتاب اور معجزے تاکہ تم ہدایت حاصل کرو۔ ",
        "English": "Then We gave Musa the Book and the Criterion (of right and wrong) , so that you may find the right path."
      },
      {
        "ayet_no": 54,
        "arbi": "وَاِذْ قَالَ مُوْسٰى لِقَوْمِهٖ يٰقَوْمِ اِنَّكُمْ ظَلَمْتُمْ اَنْفُسَكُمْ بِاتِّخَاذِكُمُ الْعِجْلَ فَتُوْبُوْٓا اِلٰى بَارِىِٕكُمْ فَاقْتُلُوْٓا اَنْفُسَكُمْ   ۭ  ذٰلِكُمْ خَيْرٌ لَّكُمْ عِنْدَ بَارِىِٕكُمْ   ۭ   فَتَابَ عَلَيْكُمْ   ۭ   اِنَّھٗ ھُوَ التَّوَّابُ الرَّحِيْمُ  ",
        "Urdu": "اور جب موسی نے کہا : اپنی قوم سے اے میری قوم: بیشک تم نے ظلم کیا ہے اپنے آپ ، بچھڑے کو معبود بنانے کے سبب تو رجوع کرو اپنے پروردگار کی طرف پس قتل کرو اپنی جانوں کو (آپس میں) یہی بہتر ہے تمہارے لیے تمہارے پروردگار کے نزدیک تو اس نے رجوع کیا تم پر (تمہاری توبہ قبول کرلی) بیشک وہ بہت توبہ قبول کرنے والا مہربان ہے۔ ",
        "English": "And recall what time Musa said unto his people: my people! verily ye have wronged your souls by your taking the calf, wherefore repent unto your Maker, and slay yourselves: that were best for you with your Maker. Then He relented toward you; verily He! He is the Relentant, the Merciful."
      },
      {
        "ayet_no": 55,
        "arbi": "وَاِذْ قُلْتُمْ يٰمُوْسٰى لَنْ نُّؤْمِنَ لَكَ حَتّٰى نَرَى اللّٰهَ جَهْرَةً فَاَخَذَتْكُمُ الصّٰعِقَةُ وَاَنْتُمْ تَنْظُرُوْنَ  ",
        "Urdu": "اور جب تم نے کہا: اے موسی! ہرگز نہ ہم ایمان لائیں گے تم پر یہاں تک کہ ہم دیکھ (نہ) لیں اللہ کو ظاہرا تو دبوچ لیا تم کو بجلی نے اور تم دیکھ رہے تھے ",
        "English": "When you said, :Musa, we will never believe you till we see Allah openly! So, the thunderbolt took you while you were looking on."
      },
      {
        "ayet_no": 56,
        "arbi": "ثُمَّ بَعَثْنٰكُمْ مِّنْۢ بَعْدِ مَوْتِكُمْ لَعَلَّكُمْ تَشْكُرُوْنَ   ",
        "Urdu": "پھر ہم نے تمہیں زندہ کیا تمہاری موت کے بعد تاکہ تم شکر گزار بن جاو۔ ",
        "English": "Then, We raised you up after your death, so that you might show gratitude."
      },
      {
        "ayet_no": 57,
        "arbi": "وَظَلَّلْنَا عَلَيْكُمُ الْغَمَامَ وَاَنْزَلْنَا عَلَيْكُمُ الْمَنَّ وَالسَّلْوٰى   ۭ   كُلُوْا مِنْ طَيِّبٰتِ مَا رَزَقْنٰكُمْ    ۭ   وَمَا ظَلَمُوْنَا وَلٰكِنْ كَانُوْٓا اَنْفُسَھُمْ يَظْلِمُوْنَ  ",
        "Urdu": "او ہم نے سایہ کیا تم پربادل کا اور ہم نےنازل کیا تم پر من اور سلوی کا، کھاو پاکیزہ چیزوں سے جو ہم نے عطا کی ہیں تمہیں اور انہوں نے ظلم نہیں کیا ہم پر اور لیکن وہ تھے اپنے آپ پر ظلم کرتے۔ ",
        "English": "And We overshadowed you with Clouds and We sent down unto you the Manna and the quails, saying: eat of the clean things, wherewith We have provided you. And they wronged Us not, but themselves they were wont to wrong."
      },
      {
        "ayet_no": 58,
        "arbi": "وَاِذْ قُلْنَا ادْخُلُوْا ھٰذِهِ الْقَرْيَةَ فَكُلُوْا مِنْهَا حَيْثُ شِئْتُمْ رَغَدًا وَّادْخُلُوا الْبَابَ سُجَّدًا وَّقُوْلُوْا حِطَّةٌ نَّغْفِرْ لَكُمْ خَطٰيٰكُمْ    ۭ  وَسَنَزِيْدُ الْمُحْسِنِيْنَ  ",
        "Urdu": "اور جب ہم نے کہا: اس بستی میں داخل ہوجاو پھر کھاو اس سے جہاں سے تم چاہو آزادی کے ساتھ اور داخل ہونا دروازے سے سجدہ کرتے ہوئے اور کہو بخش دے ہم تمہیں معاف کردیں گے تمہاری خطائیں، اور عنقریب ہم زیادہ دیں گے نیکی کرنے والوں کو۔ ",
        "English": "And recall what time We said: enter this town and eat plenteously therefrom as ye list, and enter the gate prostrating yourselves and say: forgiveness; We shall forgive you your trespasses, and anon We shall increase unto the well-doers."
      },
      {
        "ayet_no": 59,
        "arbi": "فَبَدَّلَ الَّذِيْنَ ظَلَمُوْا قَوْلًا غَيْرَ الَّذِىْ قِيْلَ لَھُمْ فَاَنْزَلْنَا عَلَي الَّذِيْنَ ظَلَمُوْا رِجْزًا مِّنَ السَّمَاۗءِ بِمَا كَانُوْا يَفْسُقُوْنَ   ",
        "Urdu": "پھر بدل ڈالا جنہوں نے ظلم کیا بات کو اس کے علاوہ سے جو ان سے کہی گئی تھی تو ہم نے نازل کیا (ان) پر جنہوں نے ظلم کیا عذاب آسمان سے اس وجہ سے جو وہ نافرمانی کیا کرتے تھے۔ ",
        "English": "Then those who did wrong changed the Word that had been told them for anot her; so We sent down upon those who did wrong a scourge from heaven, for they were wont to transgress."
      },
      {
        "ayet_no": 60,
        "arbi": "وَاِذِ اسْتَسْقٰى مُوْسٰى لِقَوْمِهٖ فَقُلْنَا اضْرِبْ بِّعَصَاكَ الْحَجَرَ    ۭ  فَانْفَجَرَتْ مِنْهُ اثْنَتَا عَشْرَةَ عَيْنًا    ۭ  قَدْ عَلِمَ كُلُّ اُنَاسٍ مَّشْرَبَھُمْ   ۭ   كُلُوْا وَاشْرَبُوْا مِنْ رِّزْقِ اللّٰهِ وَلَا تَعْثَوْا فِى الْاَرْضِ مُفْسِدِيْنَ  ",
        "Urdu": "اور جب موسی نے پانی طلب کیا اپنی قوم کے لیے تو ہم نے کہا: مارو اپنی لاٹھی کو پتھر پر تو پھوٹ پڑے اس سے بارہ چشمے تحقیق جان لیا تمام لوگوں نے اپنے گھاٹ کو (ہم نے ان سے کہا) کھاو اور پیو اللہ کے رزق سے اور مت پھرو زمین میں فسادی بن کر۔ ",
        "English": "When Musa sought water for his people, We said, :Strike the rock with your staff, And twelve springs gushed forth from it. Each group of people came to know their drinking place. :Eat and drink of what Allah has provided, and do not go about the earth spreading disorder."
      },
      {
        "ayet_no": 61,
        "arbi": "وَاِذْ قُلْتُمْ يٰمُوْسٰى لَنْ نَّصْبِرَ عَلٰي طَعَامٍ وَّاحِدٍ فَادْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنْۢبِتُ الْاَرْضُ مِنْۢ بَقْلِهَا وَقِثَّاۗىِٕهَا وَفُوْمِهَا وَعَدَسِهَا وَبَصَلِهَا   ۭ   قَالَ اَتَسْتَبْدِلُوْنَ الَّذِىْ ھُوَ اَدْنٰى بِالَّذِىْ ھُوَ خَيْرٌ   ۭ  اِھْبِطُوْا مِصْرًا فَاِنَّ لَكُمْ مَّا سَاَلْتُمْ     ۭ   وَضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ وَالْمَسْكَنَةُ     ۤ   وَبَاۗءُوْ بِغَضَبٍ مِّنَ اللّٰهِ    ۭ   ذٰلِكَ بِاَنَّھُمْ كَانُوْا يَكْفُرُوْنَ بِاٰيٰتِ اللّٰهِ وَيَقْتُلُوْنَ النَّـبِيّٖنَ بِغَيْرِ الْحَقِّ   ۭ  ذٰلِكَ بِمَا عَصَوْا وَّكَانُوْا يَعْتَدُوْنَ   ",
        "Urdu": "اور جب تم نے کہا: اے موسی! ہم ہرگز نہیں صبر کریں گے ایک ہی کھانے پر پس آپ دعا کریں ہمارے لیے اپنے رب (کہ) وہ نکالے ہمارے لیے وہ کچھ جو زمین اگاتی ہے اس کا ساگ اور اس کی ککڑی اور اس کی گندم اور اس کی مسور اور اس کا پیاز (وغیرہ)اس نے کہا: کیا تم بدلنا چاہتے ہو(اسے) جو وہ ادنی ہے اس کے بدلے جو وہ بہترہے (اچھا تو) کسی شہر میں اترجاو پس بیشک (اس میں) تمہارے لیے (وہ کچھ ہے) جو تم نے مانگا ہے اور مسلط کردی گئی ان پر ذلت اور محتاجی اور وہ لوٹے اللہ کا غضب لے کر وہ اس وجہ سے کہ وہ انکار کرتے تھے اللہ کی آیات کا اور نبیوں کو قتل کرتے تھے ناحق، اس وجہ سے جو انہوں نے نافرمانی کی اور وہ تھے حد سے تجاوزکرتے ",
        "English": "And recall what time ye said: O Musa! we shall by no means bear patiently with one food, wherefore supplicate for us unto thy Lord that He bring forth for us of that which the earth groweth, of its vegetables, and its cucumbers, and its Wheat, and its lentils, and its onions. He Said: would ye take in exchange that which is mean for that which is better! Get ye down into a City, as verily therein is for you that which ye ask for. And stuck upon them were abjection and poverty. And they drew on themselves indignation from Allah. This, because they were ever disbelieving in the signs of Allah and slaying the prophets without justice. This, because they disobeyed and were ever trespassing."
      },
      {
        "ayet_no": 62,
        "arbi": "اِنَّ الَّذِيْنَ اٰمَنُوْا وَالَّذِيْنَ ھَادُوْا وَالنَّصٰرٰى وَالصّٰبِـــِٕيْنَ مَنْ اٰمَنَ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِ وَعَمِلَ صَالِحًا فَلَھُمْ اَجْرُھُمْ عِنْدَ رَبِّهِمْ    ګ    وَلَا خَوْفٌ عَلَيْهِمْ وَلَا ھُمْ يَحْزَنُوْنَ  ",
        "Urdu": "بے شک جو لوگ ایمان لائے اور جو یہودی ابنے اور نصاری اور بے دین ہیں(ان میں سے) جو (صحیح طور پر) ایمان لایا اللہ اور آخرت کے دن پر اور نیک عمل کیا تو ان کے لیے اجر ہے ان کا ان کے رب کے پاس اور نہ ان پر کوئی خوف ہوگا اور نہ ہی وہ غمگین ہونگے۔ ",
        "English": "Verily those who believe, and those who are Judaised, and the Nazarenes, and the Sabians, - whosoever, believeth in Allah and the Last Day and worketh righteously, these! unto them shall be their hire with their Lord, no feal shall come on them nor shall they grieve."
      },
      {
        "ayet_no": 63,
        "arbi": "وَاِذْ اَخَذْنَا مِيْثَاقَكُمْ وَرَفَعْنَا فَوْقَكُمُ الطُّوْرَ   ۭ  خُذُوْا مَآ اٰتَيْنٰكُمْ بِقُوَّةٍ وَّاذْكُرُوْا مَا فِيْهِ لَعَلَّكُمْ تَتَّقُوْنَ  ",
        "Urdu": "اور جب ہم نے لیا تم سے پختہ عہد اور ہم نے اٹھایا تمہارے اوپر طور (پہاڑ(تھام لو اسے جو ہم نے دیا ہے تم کو مضبوطی سے اور یاد رکھو جو کچھ اس میں ہے تاکہ تم بچ جاو۔ ",
        "English": "And when We took the pledge from you, and raised high above you the (Mount of) Tur: :Hold fast to what We have given to you, and remember what is in it, so that you may become God-fearing."
      },
      {
        "ayet_no": 64,
        "arbi": "ثُمَّ تَوَلَّيْتُمْ مِّنْۢ بَعْدِ ذٰلِكَ    ۚ  فَلَوْلَا فَضْلُ اللّٰهِ عَلَيْكُمْ وَرَحْمَتُهٗ لَكُنْتُمْ مِّنَ الْخٰسِرِيْنَ  ",
        "Urdu": "پھر تم پھر گئے اس کے بعد پس اگر نہ ہوتا اللہ کا فضل تم پر اور اس کی رحمت تو البتہ تم ہوجاتے خسارہ پانے والوں میں سے۔ ",
        "English": "Then even after that, you turned away. So, had it not been for the grace of Allah upon you, and His mercy, you would have been among the losers."
      },
      {
        "ayet_no": 65,
        "arbi": "وَلَقَدْ عَلِمْتُمُ الَّذِيْنَ اعْتَدَوْا مِنْكُمْ فِى السَّبْتِ فَقُلْنَا لَھُمْ كُوْنُوْا قِرَدَةً خٰسِـــِٕيْنَ ",
        "Urdu": "اور البتہ تحقیق تم جان چکے ہو ان لوگوں کو جنہوں نے زیادتی کی تم میں سے ہفتے کےدن (کے بارے) میں تو ہم نے کہا ان سے (کہ) تم بنجاؤ ذلیل بندر ",
        "English": "Certainly you have knowledge of those among you who transgressed in (the matter of) the Sabbath. We said to them, :Become apes, abased."
      },
      {
        "ayet_no": 66,
        "arbi": "فَجَــعَلْنٰھَا نَكَالًا لِّمَا بَيْنَ يَدَيْهَا وَمَا خَلْفَهَا وَمَوْعِظَةً لِّلْمُتَّقِيْنَ  ",
        "Urdu": "تو ہم نے بنادیا اس (واقعہ) کو عبرت ان کے لیے جو اس (وقت) سامنے تھے اور جو ان کے بعد (آئے) اور پرہیز گاروں کے لیے نصیحت (بنادیا)۔ ",
        "English": "Thus, We made it a deterrent for those around and (those who came) after them — and a lesson for the God-fearing."
      },
      {
        "ayet_no": 67,
        "arbi": "وَاِذْ قَالَ مُوْسٰى لِقَوْمِهٖٓ اِنَّ اللّٰهَ يَاْمُرُكُمْ اَنْ تَذْبَحُوْا بَقَرَةً     ۭ  قَالُوْٓا اَتَتَّخِذُنَا ھُزُوًا    ۭ  قَالَ اَعُوْذُ بِاللّٰهِ اَنْ اَكُوْنَ مِنَ الْجٰهِلِيْنَ   ",
        "Urdu": "اور جب کہا موسی نے اپنی قوم سے بیشک اللہ تمہیں حکم دیتا ہے کہ تم ذبح کرو گائے وہ کہنے لگے کیا تو کرتا ہے ہم سے مذاق تو اس نے کہا میں پناہ مانگتا ہوں اللہ کی کہ میں ہوجاوں جاہلوں میں سے ۔ ",
        "English": " When Musa said to his people, :Allah commands you to slaughter a cow , they said, :Are you making fun of us? He said, :I seek refuge with Allah from being one of the ignorant."
      },
      {
        "ayet_no": 68,
        "arbi": "قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّنْ لَّنَا مَا هِىَ    ۭ   قَالَ اِنَّهٗ يَقُوْلُ اِنَّهَا بَقَرَةٌ لَّا فَارِضٌ وَّلَا بِكْرٌ     ۭ  عَوَانٌۢ بَيْنَ ذٰلِكَ    ۭ  فَافْعَلُوْا مَا تُـؤْمَرُوْنَ ",
        "Urdu": "وہ کہنے لگے آپ دعا کریں ہمارے لیے اپنے رب سے (کہ) وہ بتائے ہمیں (کہ) وہ کیسی ہو اس نے کہا کہ بیشک وہ فرماتا ہے بیشک وہ گائے نہ بوڑھی ہو اور نہ چھوٹی عمر کی ہو (بلکہ) جوان ہو اس کے درمیان پس تم کرو جو تمہیں حکم دیا جا رہا ہے ",
        "English": "They said: supplicate for us unto thy Lord that He make manifest unto us whatever she should be. He said: verily He saith, she should be a cow neither old nor young, but middle-aged betwixt that; do then as ye are commanded."
      },
      {
        "ayet_no": 69,
        "arbi": "قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّنْ لَّنَا مَا لَوْنُهَا    ۭ قَالَ اِنَّهٗ يَقُوْلُ اِنَّهَا بَقَرَةٌ صَفْرَاۗءُ  فَاقِعٌ لَّوْنُهَا تَسُرُّ النّٰظِرِيْنَ   ",
        "Urdu": "(وہ کہنے لگے دعا کرو ہمارے لیے اپنے رب سےکہ) وہ کھول کر بتائے ہمیں کیسا ہو اس کا رنگ اس نے کہا بے شک وہ فرماتا ہے بیشک وہ گائے ہو زرد رنگ کی گہرا ہو اس کا رنگ (جو) خوش کردے دیکھنے والوں کو۔ ",
        "English": "They said, :Pray for us to your Lord that He makes it clear to us of what colour it should be. He said: :He says that she should be a yellow cow, rich yellow in her colour that should please the onlookers."
      },
      {
        "ayet_no": 70,
        "arbi": "قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّنْ لَّنَا مَا هِىَ     ۙ   اِنَّ الْبَقَرَ تَشٰبَهَ عَلَيْنَا    ۭ  وَاِنَّآ اِنْ شَاۗءَ اللّٰهُ لَمُهْتَدُوْنَ   ",
        "Urdu": "وہ کہنے لگے دعا کرو ہمارے لیے اپنے رب سے وہ واضح کرے ہم پر (کہ) وہ کیسی ہو بیشک گائے مشتبہ ہوگئی ہے ہم پر اور بیشک ہم اگر اللہ نے چاہا تو ضرور پتہ لگا لینگے۔ ",
        "English": "They said, (Call upon your Lord for us to make plain to us what it is. Verily to us all cows are alike, And surely, ifAllah wills, we will be guided.)"
      },
      {
        "ayet_no": 71,
        "arbi": "قَالَ اِنَّهٗ يَقُوْلُ اِنَّهَا بَقَرَةٌ لَّا ذَلُوْلٌ تُثِيْرُ الْاَرْضَ وَلَا تَسْقِى الْحَرْثَ    ۚ مُسَلَّمَةٌ لَّا شِيَةَ فِيْهَا    ۭ  قَالُوا الْـــــٰٔنَ جِئْتَ بِالْحَقِّ    ۭ   فَذَبَحُوْھَا وَمَا كَادُوْا يَفْعَلُوْنَ   ",
        "Urdu": "اس نے کہا بیشک وہ فرماتا ہے کہ بیشک وہ گائے نہ محنت کرنے والی ہو کہ ہل جوتتی ہو زمین میں اور نہ پانی دیتی ہو کھیتی کو صحیح سلامت ہو نہ ہو کوئی داغ اس میں وہ کہنے لگے اب تو آیا ہے حق (بات) لے کر پھر انہوں نے ذبح کیا اسے اور نہ لگتا تھا (کہ) وہ کریں گے۔ ",
        "English": "(Moses) answered: Lo! He saith: Verily she is a cow unyoked; she plougheth not the soil nor watereth the tilth; whole and without mark. They said: Now thou bringest the truth. So they sacrificed her, though almost they did not."
      },
      {
        "ayet_no": 72,
        "arbi": "وَاِذْ قَتَلْتُمْ نَفْسًا فَادّٰرَءْتُمْ فِيْهَا      ۭ   وَاللّٰهُ مُخْرِجٌ مَّا كُنْتُمْ تَكْتُمُوْنَ  ",
        "Urdu": "اور جب تم نے قتل کیا ایک شخص کو پھر تم جھگڑنے لگے اس (بارے) میں اور اللہ (اسے) ظاہر کرنیوالا ہے جو تم چھپا رہے تھے۔ ",
        "English": "And when you killed a man, and started putting the blame for it on one another, while Allah was to bring forth what you were holding back."
      },
      {
        "ayet_no": 73,
        "arbi": "فَقُلْنَا اضْرِبُوْهُ بِبَعْضِهَا    ۭ  كَذٰلِكَ يُـحْىِ اللّٰهُ الْمَوْتٰى   ۙ   وَيُرِيْكُمْ اٰيٰتِهٖ لَعَلَّكُمْ تَعْقِلُوْنَ  ",
        "Urdu": "پھر ہم نے کہا مارو اس (مردے) کو اس کا ٹکڑا اسی طرح اللہ زندہ کرے گا مردوں کو اور وہ دکھاتا ہے تمہیں اپنی نشانیاں تاکہ تم سمجھ جاو۔ ",
        "English": "So, We said, :Strike him with a part of it. This is how Allah revives the dead; and He shows you His signs, so that you may understand."
      },
      {
        "ayet_no": 74,
        "arbi": "ثُمَّ قَسَتْ قُلُوْبُكُمْ مِّنْۢ بَعْدِ ذٰلِكَ فَهِىَ كَالْحِجَارَةِ اَوْ اَشَدُّ قَسْوَةً     ۭ  وَاِنَّ مِنَ الْحِجَارَةِ لَمَا يَتَفَجَّرُ مِنْهُ الْاَنْهٰرُ    ۭ   وَاِنَّ مِنْهَا لَمَا يَشَّقَّقُ فَيَخْرُجُ مِنْهُ الْمَاۗءُ    ۭ  وَاِنَّ مِنْهَا لَمَا يَهْبِطُ مِنْ خَشْـيَةِ اللّٰهِ    ۭ   وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعْمَلُوْنَ  ",
        "Urdu": "پھر سخت ہوگئے تمہارے دل اس کے بعد پس وہ پتھر کی طرح ہوگئے یااس سے بھی زیادہ سخت اور بیشک پتھروں میں (کچھ ایسے ہیں (کہ پھوٹ پڑتی ہیں اس سے نہریں اور بیشک ان میں سے (کچھ ایسے بھی ہیں)البتہ جو پھٹ جاتے ہیں پس نکل آتا ہے اس سے پانی اور بیشک ان میں سے (کچھ ایسے بھی ہیں) البتہ جو گر پڑتے ہیں اللہ کے ڈر سے اور نہیں ہے اللہ غافل ان (کاموں) سے جو تم کر رہے ہو۔ ",
        "English": "When, even after that, your hearts were hardened, as if they were rocks, or still worse in hardness. For surely among the rocks there are some from which rivers gush forth, and there are others that crack open and water flows from them, and there are still others that fall down in fear of Allah. And Allah is not unaware of what you do."
      },
      {
        "ayet_no": 75,
        "arbi": "اَفَتَطْمَعُوْنَ اَنْ يُّؤْمِنُوْا لَكُمْ وَقَدْ كَانَ فَرِيْقٌ مِّنْھُمْ يَسْمَعُوْنَ كَلٰمَ اللّٰهِ ثُمَّ يُحَرِّفُوْنَهٗ مِنْۢ بَعْدِ مَا عَقَلُوْهُ وَھُمْ يَعْلَمُوْنَ  ",
        "Urdu": "کیا پس تم توقع رکھتے ہو کہ وہ ایمان لے آئیں گے تمہاری (دعوت) پر حالانکہ یقینا ایک گروہ ایساہے ان میں (جو)سنتے ہیں اللہ کا کلام پھر بدل ڈالتے ہیں اسے اس کے بعد کہ سمجھ لیتے ہیں اسے حالانکہ وہ جانتے ہیں۔ ",
        "English": "( O Muslims ) do you still fancy that they will believe you, although a group of them used to hear the word of Allah, and then, having understood it, used to distort it knowingly?"
      },
      {
        "ayet_no": 76,
        "arbi": "وَاِذَا لَقُوا الَّذِيْنَ اٰمَنُوْا قَالُوْٓا اٰمَنَّا       ښ    وَاِذَا خَلَا بَعْضُھُمْ اِلٰى بَعْضٍ قَالُوْٓا اَتُحَدِّثُوْنَھُمْ بِمَا فَتَحَ اللّٰهُ عَلَيْكُمْ لِيُحَاۗجُّوْكُمْ بِهٖ عِنْدَ رَبِّكُمْ   ۭ   اَفَلَاتَعْقِلُوْنَ   ",
        "Urdu": "اور جب وہ ملتے ہیں ان لوگوں سے جو ایمان لائے کہتے ہیں ہم (بھی) ایمان لائے ہیں اور جب اکیلے ہوتے ہیں ان میں سے بعض بعض کے پاس (تو) کہتے ہیں کیا تم انہیں وہ باتیں بتاتے ہو جو کھولی ہیں اللہ نے تم پر تاکہ وہ حجت پیش کریں تمہارے خلاف اس کے ذریعے تمہارے رب کے پاس تو کیا تم عقل نہیں کرتے۔ ",
        "English": "And when they meet those who believe they say: we believe; and when some of them are alone with some others they say speak ye unto them of that which God hath opened unto you so that they may argue therewith against you before your Lord ? understand then ye not ?"
      },
      {
        "ayet_no": 77,
        "arbi": "اَوَلَا يَعْلَمُوْنَ اَنَّ اللّٰهَ يَعْلَمُ مَا يُسِرُّوْنَ وَمَا يُعْلِنُوْنَ   ",
        "Urdu": "اور کیا وہ جانتے نہیں کہ بیشک اللہ جانتا ہے جو وہ چھپاتے ہیں اور جو وہ علانیہ کرتے ہیں ",
        "English": "Know they not that Allah knoweth that which they hide and that which they make known ?"
      },
      {
        "ayet_no": 78,
        "arbi": "وَمِنْھُمْ اُمِّيُّوْنَ لَا يَعْلَمُوْنَ الْكِتٰبَ اِلَّآ اَمَانِىَّ وَاِنْ ھُمْ اِلَّا يَظُنُّوْنَ  ",
        "Urdu": "اور ان میں سے کچھ ان پڑھ ہیں وہ نہیں جانتے کتاب (تورات) کو سوائے (جھوٹی) آرزووں کے اور نہیں ہیں وہ مگر (محض) گمان کرتے۔ ",
        "English": "Among them are unlettered folk who know the Scripture not except from hearsay. They but guess."
      },
      {
        "ayet_no": 79,
        "arbi": "فَوَيْلٌ لِّلَّذِيْنَ يَكْتُبُوْنَ الْكِتٰبَ بِاَيْدِيْهِمْ   ۤ  ثُمَّ يَقُوْلُوْنَ ھٰذَا مِنْ عِنْدِ اللّٰهِ لِيَشْتَرُوْا بِهٖ ثَــمَنًا قَلِيْلًا     ۭ فَوَيْلٌ لَّھُمْ مِّمَّا كَتَبَتْ اَيْدِيْهِمْ وَوَيْلٌ لَّھُمْ مِّمَّا يَكْسِبُوْنَ   ",
        "Urdu": "پس ہلاکت ہے ان لوگوں کے لیے جو لکھتے ہیں کتاب اپنے ہاتھوں سے پھر کہتے ہیں یہ اللہ کی طرف سے ہے تاکہ وہ حاصل کریں اس کے ذریعے معمولی قیمت پس ہلاکت ہے ان کے لے (اس وجہ) سے جو لکھا انکے ہاتھوں نے اور ہلاکت ہے ان کے لیے (اس وجہ) سے جو وہ کماتے ہیں ",
        "English": "Then woe to those who write the Book with their own hands and then say, (This is from Allah ) to purchase with it a little price! Woe to them for what their hands have written and woe to them for that they earn thereby."
      },
      {
        "ayet_no": 80,
        "arbi": "وَقَالُوْا لَنْ تَمَسَّنَا النَّارُ اِلَّآ اَيَّامًا مَّعْدُوْدَةً      ۭ  قُلْ اَتَّخَذْتُمْ عِنْدَ اللّٰهِ عَهْدًا فَلَنْ يُّخْلِفَ اللّٰهُ عَهْدَهٗٓ اَمْ تَقُوْلُوْنَ عَلَي اللّٰهِ مَا لَا تَعْلَمُوْنَ ",
        "Urdu": "اور وہ کہتے ہیں ہرگز نہیں چھوئے گی ہمیں آگ مگر چند دن گنتی کے کہہ دو کیا تم نے لے رکھا ہے اللہ سے کوئی وعدہ تو ہرگز نہیں خلاف کرے گا اللہ اپنے وعدے کے یا تم اللہ کے بارے میں کہتے ہو (وہ باتیں ) جو تم نہیں جانتے۔ ",
        "English": "They say, :The fire shall not touch us for more than a few days. Say, :Have you taken a pledge from Allah, and Allah will not go against His promise ? Or, do you say about Allah what you do not know ?"
      },
      {
        "ayet_no": 81,
        "arbi": "بَلٰى مَنْ كَسَبَ سَيِّئَةً وَّاَحَاطَتْ بِهٖ خَطِيْۗــــَٔــتُهٗ فَاُولٰۗىِٕكَ اَصْحٰبُ النَّارِ  ۚ ھُمْ فِيْهَا خٰلِدُوْنَ",
        "Urdu": "ہاں کیوں نہیں جس نے برائی کمائی اور گھیرلیا اس کو اس کے گناہ نےتو وہ لوگ دوزخ والے ہیں۔ وہ اس میں ہمیشہ رہنے والے ہیں ۔",
        "English": "Yes! Whose ever earns evil and his sin has surrounded him, they are dwellers of the Fire (i.e. Hell) ; they will dwell there in forever."
      },
      {
        "ayet_no": 82,
        "arbi": "وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ اُولٰۗىِٕكَ اَصْحٰبُ الْجَنَّةِ  ۚ ھُمْ فِيْهَا خٰلِدُوْنَ",
        "Urdu": "اور وہ لوگ جو ایمان لائے اور نیک اعمال کیے (تو) وہ لوگ جنت والے ہیں وہ اس میں ہمیشہ رہنے والے ہیں ۔",
        "English": "As for those who believe, and do good deeds, they are the people of Paradise - there they will live forever."
      },
      {
        "ayet_no": 83,
        "arbi": "وَاِذْ اَخَذْنَا مِيْثَاقَ بَنِىْٓ اِسْرَاۗءِيْلَ لَا تَعْبُدُوْنَ اِلَّا اللّٰهَ ۣوَبِالْوَالِدَيْنِ اِحْسَانًا وَّذِي الْقُرْبٰى وَالْيَتٰمٰى وَالْمَسٰكِيْنِ وَقُوْلُوْا لِلنَّاسِ حُسْـنًا وَّاَقِيْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ  ۭثُمَّ تَوَلَّيْتُمْ اِلَّا قَلِيْلًا مِّنْكُمْ وَاَنْتُمْ مُّعْرِضُوْنَ",
        "Urdu": "اور جب ہم نے لیا بنی اسرائیل سے پختہ عہد (کہ) نہیں تم عبادت کروگے مگر اللہ کی اور والدین کے ساتھ حسن سلوک کرو گے اور قریبی رشتہ داروں اور یتیموں اور مساکین سے (پھی) اور لوگوں سے اچھی بات کہنا اور نماز قائم رکھنا اور زکوة دیتے رہنا پھر تم پھر گئے (اپنے قول سے) مگر تھوڑے سے تم میں سے (جو اپنے قول پر قائم ہیں اور تم ہو ہی پھر جانے والے",
        "English": "( Remember ) when We took a pledge from the children of Isra‘il (Israel) : :You shall not worship anyone other than Allah; and you shall do good to the parents, and to near of kin, and to orphans and the needy. And say to the people what is good, and be steadfast in Salah (prayer) , and pay Zakah . Then, you went back (on your word) , all but a few among you, and you are used to turning away."
      },
      {
        "ayet_no": 84,
        "arbi": "وَاِذْ اَخَذْنَا مِيْثَاقَكُمْ لَا تَسْفِكُوْنَ دِمَاۗءَكُمْ وَلَا تُخْرِجُوْنَ اَنْفُسَكُمْ مِّنْ دِيَارِكُمْ ثُمَّ اَقْــرَرْتُمْ وَاَنْتُمْ تَشْهَدُوْنَ",
        "Urdu": "اور جب ہم نے لیا تم سے پختہ عہد(کہ) تم نہ بہاو گے اپنوں کے خون اور نہ ہی تم نکالوں گے اپنے نفسوں کو اپنے گھروں سے پھر تم نے اقرار کیا (اس کا) اور تم (خود اس پر) گواہ ہو ۔",
        "English": "When We took a pledge from you: :You shall not shed the blood of one another, and you shall not drive one another out of your homes. Then you agreed, being yourselves the witnesses."
      },
      {
        "ayet_no": 85,
        "arbi": "ثُمَّ اَنْتُمْ ھٰٓؤُلَاۗءِ تَقْتُلُوْنَ اَنْفُسَكُمْ وَتُخْرِجُوْنَ فَرِيْـقًا مِّنْكُمْ مِّنْ دِيَارِھِمْ    ۡ تَظٰھَرُوْنَ عَلَيْهِمْ بِالْاِثْمِ وَالْعُدْوَانِ ۭوَاِنْ يَّاْتُوْكُمْ اُسٰرٰى تُفٰدُوْھُمْ وَھُوَ مُحَرَّمٌ عَلَيْكُمْ اِخْرَاجُهُمْ ۭاَفَتُؤْمِنُوْنَ بِبَعْضِ الْكِتٰبِ وَتَكْفُرُوْنَ بِبَعْضٍ ۚ فَمَا جَزَاۗءُ مَنْ يَّفْعَلُ ذٰلِكَ مِنْكُمْ اِلَّا خِزْيٌ فِي الْحَيٰوةِ الدُّنْيَا ۚ وَيَوْمَ الْقِيٰمَةِ يُرَدُّوْنَ اِلٰٓى اَشَدِّ الْعَذَابِ ۭ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعْمَلُوْنَ",
        "Urdu": "پھر تم وہی (لوگ) ہو کہ قتل کرتے ہو اپنے نفسوں کو اور تم نکالتے ہو ایک گروہ کو اپنے (لوگوں) میں سے ان کے گھروں (وطن) سے تم مدد کرتے ہو ایک دوسرے کی ان کے خلاف گناہ اور زیادتی کے ساتھ اور اگر وہ آئیں تمہارے پاس قیدی بن کر (تو) تم انہیں فدیہ دے کر (چھڑا لیتے ہو) حالانکہ وہ حرام ہے تم پر ان کا نکالنا کیا پس تم ایمان رکھتے ہو کتاب کے بعض (حصے)پر اور تم انکار کرتے ہو بعض کا، پس نہیں ہے سزا(اس کی) جو ایسا کرے تم میں سے مگر رسوائی دنیوی زندگی میں اور قیامت کے دن وہ لوٹائے جائیں گے سخت عذاب کی طرف اور نہیں اللہ بے خبر اس سے جو تم عمل کرتے ہو ۔",
        "English": "Yet, here you are, killing one another, and driving a group of your own people out of their homes, supporting each other against them in sin and aggression — and if they come to you as prisoners, you would ransom them, while their very expulsion was unlawful for you! Do you, then, believe in some parts of the Book, and disbelieve in others? So, what can be the punishment of those among you who do that, except disgrace in present life? And, on the Day of Judgement, they shall be turned to the most severe punishment. And Allah is not unaware of what you do."
      },
      {
        "ayet_no": 86,
        "arbi": "اُولٰۗىِٕكَ الَّذِيْنَ اشْتَرَوُا الْحَيٰوةَ الدُّنْيَا بِالْاٰخِرَةِ ۡ فَلَا يُخَفَّفُ عَنْهُمُ الْعَذَابُ وَلَا ھُمْ يُنْصَرُوْنَ",
        "Urdu": "یہی وہ لوگ ہیں جنہوں نے خرید لی دنیوی زندگی آخرت کے بدلے میں تو نہ ہلکا کیا جائے گا ان سے عذاب اور نہ ہی وہ مدد کیے جائیں گے۔",
        "English": "Those are the ones who bought the worldly life at the cost of the Hereafter. So, punishment shall not be lightened for them, nor shall they be helped."
      },
      {
        "ayet_no": 87,
        "arbi": "وَلَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ وَقَفَّيْنَا مِنْۢ بَعْدِهٖ بِالرُّسُلِ ۡ وَاٰتَيْنَا عِيْسَى ابْنَ مَرْيَمَ الْبَيِّنٰتِ وَاَيَّدْنٰهُ بِرُوْحِ الْقُدُسِ ۭ اَفَكُلَّمَا جَاۗءَكُمْ رَسُوْلٌۢ بِمَا لَا تَهْوٰٓى اَنْفُسُكُمُ اسْتَكْبَرْتُمْ ۚفَفَرِيْقًا كَذَّبْتُمْ ۡوَفَرِيْقًا تَقْتُلُوْنَ",
        "Urdu": "اور البتہ تحقیق ہم نے دی موسی کو کتاب اور ہم نے پے در پے بھیجا اس کے بعد رسولوں کو اور ہم نے دیں عیسی بن مریم کو کھلی نشانیاں اور ہم نے مدد دی اس کو روح القدس سے کیا پس جب (بھی)آیا تمہارے پاس رسول وہ (احکام) لے کر جو نہیں چاہتے تھے تمہارے نفس (تو) تم نے تکبر کیا تو (رسولوں کے )ایک گروہ کو قتل کر ڈالا ۔",
        "English": "And indeed, We gave Musa (Moses) the Book and followed him up with a succession of Messengers. And We gave 'Iesa (Jesus) , the son of Maryam (Mary) , clear signs and supported him with Rh-ul-Qudus [Jibrael (Gabriel) ]. Is it that whenever there came to you a Messenger with what you yourselves desired not, you grew arrogant? Some, you disbelieved and some, you killed."
      },
      {
        "ayet_no": 88,
        "arbi": "وَقَالُوْا قُلُوْبُنَا غُلْفٌ ۭ بَلْ لَّعَنَهُمُ اللّٰهُ بِكُفْرِھِمْ فَقَلِيْلًا مَّا يُؤْمِنُوْنَ",
        "Urdu": "وہ کہتے ہیں ہمارے دل غلاف میں ہیں بلکہ لعنت کردی ہے ان پر اللہ نے ان کے کفر کے سبب پس بہت کم ہے جو وہ ایمان لاتے ہیں ۔",
        "English": "And they said, :Our hearts are veiled. Rather, Allah has cast damnation upon them for their disbelief. So, they believe just in very little things."
      },
      {
        "ayet_no": 89,
        "arbi": "وَلَمَّا جَاۗءَھُمْ كِتٰبٌ مِّنْ عِنْدِ اللّٰهِ مُصَدِّقٌ لِّمَا مَعَھُمْ ۙ وَكَانُوْا مِنْ قَبْلُ يَسْتَفْتِحُوْنَ عَلَي الَّذِيْنَ كَفَرُوْا ښ فَلَمَّا جَاۗءَھُمْ مَّا عَرَفُوْا كَفَرُوْا بِهٖ ۡ فَلَعْنَةُ اللّٰهِ عَلَي الْكٰفِرِيْنَ",
        "Urdu": "اور جب آئی ان کے پاس کتاب (قرآن)اللہ کی طرف سے (جو)تصدیق کرنے والی ہے اس کی جو ان کے پاس ہے (تورات) اور وہ تھے اس سے قبل فتح مانگتے (ان لوگوں پر) جنہوں نے کفر کیا تو جب وہ آگیا ان کے پاس جسے انہوں نے پہچان لیا (پھر بھی) انکار کردیا اس کا پس اللہ کی لعنت ہے کافروں پر",
        "English": "And when there came to them a Book from Allah, which confirms what was with them,__ while earlier, they used to seek help against those who disbelieved, __ yet when there came to them that which they did recognize, they denied it. So the curse of Allah is upon the disbelievers."
      },
      {
        "ayet_no": 90,
        "arbi": "بِئْسَمَا اشْتَرَوْا بِهٖٓ اَنْفُسَھُمْ اَنْ يَّكْفُرُوْا بِمَآ اَنْزَلَ اللّٰهُ بَغْيًا اَنْ يُّنَزِّلَ اللّٰهُ مِنْ فَضْلِهٖ عَلٰي مَنْ يَّشَاۗءُ مِنْ عِبَادِهٖ  ۚ فَبَاۗءُوْ بِغَضَبٍ عَلٰي غَضَبٍ ۭ وَلِلْكٰفِرِيْنَ عَذَابٌ مُّهِيْنٌ",
        "Urdu": "برا ہے جو انہوں نے بیچ دیا اس کے بدلے اپنی جانوں کو (وہ) یہ کہ انکار کرتے ہیں اس کا جو اللہ نے اتارا ہے ضد میں آخر کہ نازل کر رہا ہے اللہ اپنا فضل جس پر چاہتا ہے اپنے بندوں میں سے پس وہ مستحق ہوگئے غضب پر غضب کے اور کافروں کے لیے رسوا کرنے والا عذاب ہے",
        "English": "Evil is that for which they sell their souls: that they should disbelieve in that which Allah hath revealed, grudging that Allah should reveal of His bounty unto whom He will of His slaves. They have incurred anger upon anger. For disbelievers is a shameful doom."
      },
      {
        "ayet_no": 91,
        "arbi": "وَاِذَا قِيْلَ لَھُمْ اٰمِنُوْا بِمَآ اَنْزَلَ اللّٰهُ قَالُوْا نُؤْمِنُ بِمَآ اُنْزِلَ عَلَيْنَا وَيَكْفُرُوْنَ بِمَا وَرَاۗءَهٗ ۤ وَھُوَ الْحَقُّ مُصَدِّقًا لِّمَا مَعَھُمْ ۭ قُلْ فَلِمَ تَقْتُلُوْنَ اَنْۢبِيَاۗءَ اللّٰهِ مِنْ قَبْلُ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
        "Urdu": "اور جب کہا جائے ان سے ایمان لاو اس پر جو اللہ نے اتارا ہے (قرآن) (تو) کہتے ہیں ہم ایمان لاتے ہیں اس پر جو اتارا گیا ہے ہم پر اور وہ انکار کرتے ہیں اس کا جو علاوہ ہے اس کے حالانکہ وہ (قرآن) ہی حق ہے تصدیق کرنیوالا ہے اس کی جو ان کے پاس ہے تم کہو تو کیوں قتل کرتے ہو اللہ کے نبیوں کو اس سے پہلے اگر ہو تم ایمان والے ( تو تم نے ایسا کیوں کیا ) ۔",
        "English": "When it is said to them, :Believe in what Allah has revealed, they say, :We believe in what has been revealed to us — and they deny what is beyond it, whereas that is the truth which confirms what is with them. Say, :Why then have you been slaying the prophets of Allah earlier, if you were believers ?"
      },
      {
        "ayet_no": 92,
        "arbi": "وَلَقَدْ جَاۗءَكُمْ مُّوْسٰى بِالْبَيِّنٰتِ ثُمَّ اتَّخَذْتُمُ الْعِجْلَ مِنْۢ بَعْدِهٖ وَاَنْتُمْ ظٰلِمُوْنَ",
        "Urdu": "اور البتہ آئے تمہارے پاس موسی کھلی نشانیاں لے کر پھر تم نے (معبود) بنایا بچھڑے کو اس کے بعد اور تم ہو (ہی) ظلم کرنے والے",
        "English": "And certainly Musa came to you with clear signs, then you adopted the calf (as god) after his departure (to the mount of Tur) — and you were transgressors."
      },
      {
        "ayet_no": 93,
        "arbi": "وَاِذْ اَخَذْنَا مِيْثَاقَكُمْ وَرَفَعْنَا فَوْقَكُمُ الطُّوْرَ ۭخُذُوْا مَآ اٰتَيْنٰكُمْ بِقُوَّةٍ وَّاسْمَعُوْا ۭ قَالُوْا سَمِعْنَا وَعَصَيْنَا ۤ وَاُشْرِبُوْا فِيْ قُلُوْبِهِمُ الْعِجْلَ بِكُفْرِھِمْ ۭ قُلْ بِئْسَمَا يَاْمُرُكُمْ بِهٖٓ اِيْمَانُكُمْ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
        "Urdu": "اور جب ہم نے لیا تم سے پختہ عہد اور ہم نے اٹھایا تمہارے اور طور (پہاڑ )کو(اورحکم دیا) تھام لو جو ہم نے دیا تم کو مضبوطی سے اور سنو، انہوں نے کہا ہم نے سن لیا اور نافرمانی کی اور وہ پلادئیے گئے اپنے دلوں میں بچھڑے (کی محبت) ان کے کفر کے سبب کہہ دیجئے براہے جو تمہیں حکم دیتا ہے اس کے ساتھ تمہارا ایمان اگر تم مومن ہو ۔",
        "English": "And when We took a pledge from you, and raised high the (mount of) Tur above you: :Hold fast to what We have given you, and listen ! They said, :We have heard and disobeyed. And, on account of their denial, they were soaked with love for the calf in their hearts. Say: :Evil is that which your faith enjoins upon you, if you are believers."
      },
      {
        "ayet_no": 94,
        "arbi": "قُلْ اِنْ كَانَتْ لَكُمُ الدَّارُ الْاٰخِرَةُ عِنْدَ اللّٰهِ خَالِصَةً مِّنْ دُوْنِ النَّاسِ فَتَمَنَّوُا الْمَوْتَ اِنْ كُنْتُمْ صٰدِقِيْنَ",
        "Urdu": "کہہ دیجیے اگر ہے (صرف) تمہارے لیے آخرت کا گھر اللہ کے نزدیک خاص طور پر لوگوں کے سوا تو موت کی تمنا کر لو اگر تم ہو سچے ۔",
        "English": "Say: :If the Last Abode near Allah is purely for you, to the exclusion of all people, then make a wish for death, if you are true."
      },
      {
        "ayet_no": 95,
        "arbi": "وَلَنْ يَّتَمَنَّوْهُ اَبَدًۢا بِمَا قَدَّمَتْ اَيْدِيْهِمْ ۭ وَاللّٰهُ عَلِيْمٌۢ بِالظّٰلِمِيْنَ",
        "Urdu": "اور ہرگز نہیں یہ تمنا کریں گے اس کی کبھی بھی اس وجہ سے جو آگے بھیجا ہے ان کے ہاتھوں نے اور اللہ خوب جاننے والا ہے ظالموں کو ۔",
        "English": "But they will never wish for it because of what their hands have sent ahead. Allah is All-Aware of the unjust."
      },
      {
        "ayet_no": 96,
        "arbi": "وَلَتَجِدَنَّھُمْ اَحْرَصَ النَّاسِ عَلٰي حَيٰوةٍ ڔ وَمِنَ الَّذِيْنَ اَشْرَكُــوْا ڔ يَوَدُّ اَحَدُھُمْ لَوْ يُعَمَّرُ اَلْفَ سَـنَةٍ ۚ وَمَا ھُوَ بِمُزَحْزِحِهٖ مِنَ الْعَذَابِ اَنْ يُّعَمَّرَ ۭ وَاللّٰهُ بَصِيْرٌۢ بِمَا يَعْمَلُوْنَ",
        "Urdu": "اور یقینا آپ ضرور پائیں ان (یہودیوں)کولوگوں سے زیادہ حریص زندگی پر اور ان لوگوں سے (بھی زیادہ) جنہوں نے شرک کیا چاہتا ہے ان میں سے ہر ایک کاش وہ عمر پائے ہزار سال حالانکہ وہ (عمر) نہیں بچا سکتی اسے عذاب سے کہ (اتنی) عمر اسے دے دی جائے اور اللہ دیکھنے والا ہے اس کو جو وہ عمل کرتے ہیں ۔",
        "English": "You shall surely find them the more avid, for life than all other men — even more than the polytheists. Every one of them would love that his life is prolonged for one thousand years. But it will not take him away from punishment that his life is (so) prolonged, and Allah is watchful of what they do."
      },
      {
        "ayet_no": 97,
        "arbi": "قُلْ مَنْ كَانَ عَدُوًّا لِّجِبْرِيْلَ فَاِنَّهٗ نَزَّلَهٗ عَلٰي قَلْبِكَ بِاِذْنِ اللّٰهِ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ وَھُدًى وَّبُشْرٰى لِلْمُؤْمِنِيْنَ",
        "Urdu": "کہہ دیجئے جو دشمن ہے جبریل کا (تو یہ اس کی بیوقوفی ہے) پس بیشک اس نے (تو) اسے اتارا ہے تیرے دل پر اللہ کے حکم سے تصدیق کرنے والا ہے اس کی جو اس سے پہلے (کتابیں گزری ) ہیں اور ہدایت ہے اور خوشخبری ہے مومنوں کے لیے ۔",
        "English": "Say, if someone is an enemy to Jibra‘il (Gabriel) (it can by no means degrade him for) it is he who has brought it (the Qur‘an) down upon your heart by the permission of Allah, confirming what has been before it, and a guidance and good tidings to the believers."
      },
      {
        "ayet_no": 98,
        "arbi": "مَنْ كَانَ عَدُوًّا لِّلّٰهِ وَمَلٰۗىِٕكَتِهٖ وَرُسُلِهٖ وَجِبْرِيْلَ وَمِيْكٰىلَ فَاِنَّ اللّٰهَ عَدُوٌّ لِّلْكٰفِرِيْنَ",
        "Urdu": "جو ہے دشمن اللہ کا اور اس کے فرشتوں کا اور اس کے رسولوں اور جبرائیل اور میکائیل کا تو بیشک اللہ (بھی) دشمن ہے کافروں کا ۔",
        "English": "Whoever is an enemy toAllah, His Angels, His Messengers, Jibrael (Gabriel) and Mikael (Michael) , then verily,Allah is an enemy to the disbelievers."
      },
      {
        "ayet_no": 99,
        "arbi": "وَلَقَدْ اَنْزَلْنَآ اِلَيْكَ اٰيٰتٍۢ بَيِّنٰتٍ ۚ وَمَا يَكْفُرُ بِهَآ اِلَّا الْفٰسِقُوْنَ",
        "Urdu": "اور تحقیق البتہ ہم نے نازل کیں آپ کی طرف کھلی (اور صاف) آیات اور نہیں انکار کرتے انکا مگر نافرمان ۔",
        "English": "Verily We have revealed unto thee clear tokens, and only miscreants will disbelieve in them."
      },
      {
        "ayet_no": 100,
        "arbi": "اَوَكُلَّمَا عٰھَدُوْا عَهْدًا نَّبَذَهٗ فَرِيْقٌ مِّنْھُمْ ۭ بَلْ اَكْثَرُھُمْ لَا يُؤْمِنُوْنَ",
        "Urdu": "اور کیا (ایسا نہیں ہوتا رہا کہ) جب بھی انہوں نے عہد کیا (تو) اسے پھینک دیا ایک گروہ نے ان میں سے بلکہ اکثر ان میں سے ایمان نہیں لاتے ۔",
        "English": "Would it always be that every time they enter into a pact, a group from among them should throw it aside? In fact, most of them do not believe."
      },
      {
        "ayet_no": 101,
        "arbi": "وَلَمَّا جَاۗءَھُمْ رَسُوْلٌ مِّنْ عِنْدِ اللّٰهِ مُصَدِّقٌ لِّمَا مَعَھُمْ نَبَذَ فَرِيْقٌ مِّنَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ ڎ كِتٰبَ اللّٰهِ وَرَاۗءَ ظُهُوْرِھِمْ كَاَنَّھُمْ لَا يَعْلَمُوْنَ",
        "Urdu": "اور جب آیا ان کے پاس رسول اللہ کی طرف سے تصدیق کرنیوالا ہے اس کی جو ان کے پاس ہے (تورات) ڈال دیا ایک گروہ نے ان لوگوں میں سے جو کتاب دیے گئے اللہ کی کتاب (تورات) کو اپنی پشت کے پیچھے گویا وہ (اسے) جانتے ہی نہیں ۔",
        "English": "And when a messenger from Allah came to them, confirming what was already with them, some from among the people of the Book threw the Book of Allah behind their backs, as if they did not know."
      },
      {
        "ayet_no": 102,
        "arbi": "وَاتَّبَعُوْا مَا تَتْلُوا الشَّيٰطِيْنُ عَلٰي مُلْكِ سُلَيْمٰنَ ۚ وَمَا كَفَرَ سُلَيْمٰنُ وَلٰكِنَّ الشَّيٰطِيْنَ كَفَرُوْا يُعَلِّمُوْنَ النَّاسَ السِّحْرَ ۤوَمَآ اُنْزِلَ عَلَي الْمَلَكَيْنِ بِبَابِلَ ھَارُوْتَ وَمَارُوْتَ ۭ وَمَا يُعَلِّمٰنِ مِنْ اَحَدٍ حَتّٰى يَقُوْلَآ اِنَّمَا نَحْنُ فِتْنَةٌ فَلَا تَكْفُرْ ۭ فَيَتَعَلَّمُوْنَ مِنْهُمَا مَا يُفَرِّقُوْنَ بِهٖ بَيْنَ الْمَرْءِ وَزَوْجِهٖ ۭ وَمَا ھُمْ بِضَاۗرِّيْنَ بِهٖ مِنْ اَحَدٍ اِلَّا بِاِذْنِ اللّٰهِ ۭ وَيَتَعَلَّمُوْنَ مَا يَضُرُّھُمْ وَلَا يَنْفَعُھُمْ ۭ وَلَقَدْ عَلِمُوْا لَمَنِ اشْتَرٰىھُ مَا لَهٗ فِي الْاٰخِرَةِ مِنْ خَلَاقٍ ڜ وَلَبِئْسَ مَا شَرَوْا بِهٖٓ اَنْفُسَھُمْ ۭ لَوْ كَانُوْا يَعْلَمُوْنَ",
        "Urdu": "اور وہ پیروی کرنے لگے اس کی جو شیطان پڑھتے تھے سلیمان کی بادشاہت میں حالانکہ نہیں کفر کیا سلیمان نے اور لیکن شیطانوں نے کفر کیا (کہ) وہ لوگوں کو جادو سکھاتے اور جو دو فرشتوں پر نازل کیا گیا بابل (شہر) میں ہاروت اور ماروت پر اور وہ دونوں نہ سکھاتے کسی ایک کو یہاں تک کہ وہ دونوں کہہ دیتے بیشک ہم آزمائش ہیں تو تو کفر مت کر پھر (بھی) وہ سیکھ لیتے تھے ان دونوں سے وہ جو جدائی ڈالتے اس کے ذریعے مرد کے درمیان اور اس کی بیوی کے ، حالانکہ نہیں وہ نقصان پہنچا سکنے والے اس (جادو) کے ذریعے کسی ایک کو (بھی)مگر اللہ کے حکم سے اور (وہ کچھ) سیکھتے ہیں جو انہیں نقصان دیتا ہے اور نہیں نفع دیتا انہیں اور البتہ تحقیق وہ جان چکے ہیں (کہ) البتہ جو (بھی) اس (جادو) کو خریدے (سیکھے) نہیں ہے اس کے لیے آخرت میں کوئی حصہ اور البتہ برا ہے جو انہوں نے بیچ ڈالا اس کے بدلے اپنی جانوں کو کاش وہ جانتے ہوتے ۔",
        "English": "They followed what the devils used to recite in the reign of Sulaiman (Solomon) ; and it was not Sulaiman who became an infidel, but the devils did become infidels, teaching people magic, and what had been sent down to the two angels, Harut and Marut, in Babylon. And these two did not teach anyone without first having said (to him) , :We are but a trial, so do not go infidel. Then, they used to learn from them that with which they could cause separation between a man and his wife. But they were not to bring harm through it to anyone without the will of Allah.They used to learn what harmed them and did no good to them; and they certainly knew that he who buys it has no share in the Hereafter. And, indeed, vile is the thing for which they sold themselves away. If only they knew!"
      },
      {
        "ayet_no": 103,
        "arbi": "وَلَوْ اَنَّھُمْ اٰمَنُوْا وَاتَّقَوْا لَمَثُوْبَةٌ مِّنْ عِنْدِ اللّٰهِ خَيْرٌ ۭ لَوْ كَانُوْا يَعْلَمُوْنَ",
        "Urdu": "اور اگر بیشک وہ ایمان لاتے اور تقوی اختیار کرتے البتہ وہ ثواب (جو) اللہ کی طرف سے (ملتا) (وہ کہیں) بہترتھا کاش وہ جانتے ہوتے ۔",
        "English": "And had they believed and feared, surely better had been the reward from before Allah, if they but knew!"
      },
      {
        "ayet_no": 104,
        "arbi": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَقُوْلُوْا رَاعِنَا وَقُوْلُوا انْظُرْنَا وَاسْمَعُوْا ۭ وَلِلْكٰفِرِيْنَ عَذَابٌ اَلِــيْمٌ",
        "Urdu": "اے لوگو جو ایمان لائے ہو مت کہو ”راعنا“اور کہو ”انظرنا“ (ہماری طرف متوجہ ہوں)اور (یہ بات توجہ سے) سنو اور کافروں کے لیے دردناک عذاب ہے ۔",
        "English": "O you who believe, do not say Ra'ina, but say UnZurna, and listen, as there is a grievous punishment for the unbelievers."
      },
      {
        "ayet_no": 105,
        "arbi": "مَا يَوَدُّ الَّذِيْنَ كَفَرُوْا مِنْ اَھْلِ الْكِتٰبِ وَلَا الْمُشْرِكِيْنَ اَنْ يُّنَزَّلَ عَلَيْكُمْ مِّنْ خَيْرٍ مِّنْ رَّبِّكُمْ ۭ وَاللّٰهُ يَخْتَصُّ بِرَحْمَتِهٖ مَنْ يَّشَاۗءُ ۭوَاللّٰهُ ذُو الْفَضْلِ الْعَظِيْمِ",
        "Urdu": "نہیں چاہتے وہ لوگ جنہوں نے کفر کیااہل کتاب میں سے اور نہ ہی مشرکین کہ اتاری جائے تم پر کوئی بھلائی تمہارے رب کی طرف سے اور اللہ خاص کرلیتا ہے اپنی رحمت کے ساتھ جس کو چاہتا ہے اور اللہ بڑے فضل والا ہے ۔",
        "English": "Those who disbelieve from among the people of the Book and the idolaters do not like that any good should come to you from your Lord. But Allah chooses for His grace whomsoever He wills, and Allah is the Lord of great bounty."
      },
      {
        "ayet_no": 106,
        "arbi": " مَا نَنْسَخْ مِنْ اٰيَةٍ اَوْ نُنْسِهَا نَاْتِ بِخَيْرٍ مِّنْهَآ اَوْ مِثْلِهَا ۭ اَلَمْ تَعْلَمْ اَنَّ اللّٰهَ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
        "Urdu": "جو کوئی آیت ہم منسوخ کردیتے ہیں یا ہم اسے بھلادیتے ہیں ہم لے آتے ہیں (اس کی جگہ) اس سے بہتر یا اس جیسی کیا نہیں تم جانتے بیشک اللہ ہر چیز پر قادر ہے ۔",
        "English": "Whenever We abrogate a verse or cause it to be forgotten, We bring one better than it or one equal to it. Do you not know that Allah is powerful over everything ?"
      },
      {
        "ayet_no": 107,
        "arbi": "اَلَمْ تَعْلَمْ اَنَّ اللّٰهَ لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ ۭ وَمَا لَكُمْ مِّنْ دُوْنِ اللّٰهِ مِنْ وَّلِيٍّ وَّلَا نَصِيْرٍ",
        "Urdu": "کیا نہیں تم جانتے کہ بیشک اللہ ہی کی بادشاہت ہے آسمانوں اور زمین میں اور نہیں ہے تمہارے لیے اللہ کے سوا کوئی دوست اور نہ کوئی مددگار ۔",
        "English": "Do you not know that to Allah alone belongs the kingdom of the heavens and the earth ? Other than Allah, you have neither a patron, nor a helper."
      },
      {
        "ayet_no": 108,
        "arbi": "اَمْ تُرِيْدُوْنَ اَنْ تَسْـــَٔـلُوْا رَسُوْلَكُمْ كَمَا سُىِٕلَ مُوْسٰى مِنْ قَبْلُ ۭ وَمَنْ يَّتَـبَدَّلِ الْكُفْرَ بِالْاِيْمَانِ فَقَدْ ضَلَّ سَوَاۗءَ السَّبِيْلِ",
        "Urdu": "کیا تم چاہتے ہو کہ تم سوالات (ومطالبات) کرو اپنے رسول سے جیسا کہ موسی سے سوالات کیے گئے اس سے قبل اور جو اختیار کر لے کفر ایمان کے بدلے تو تحقیق وہ بھٹک گیا سیدھے راستے سے ۔",
        "English": "Or, do you rather want to question your Prophet as Musa was questioned earlier? And whoever takes infidelity in exchange for faith has certainly missed the straight path."
      },
      {
        "ayet_no": 109,
        "arbi": "وَدَّ كَثِيْرٌ مِّنْ اَھْلِ الْكِتٰبِ لَوْ يَرُدُّوْنَكُمْ مِّنْۢ بَعْدِ اِيْمَانِكُمْ كُفَّارًا ښ حَسَدًا مِّنْ عِنْدِ اَنْفُسِهِمْ مِّنْۢ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْحَقُّ ۚ فَاعْفُوْا وَاصْفَحُوْا حَتّٰى يَاْتِيَ اللّٰهُ بِاَمْرِهٖ  ۭ اِنَّ اللّٰهَ عَلٰي كُلِّ شَيْ ءٍ قَدِيْرٌ",
        "Urdu": "چاہتے ہیں بہت سے اہل کتاب کاش وہ لوٹادیں تمہیں تمہارے ایمان لانے کے بعد کفر کی حالت میں حسد کی وجہ سے (جو) ان کے دلوں میں ہے اس کے بعد کہ واضح ہوا ان پر حق پس تم معاف کرتے رہو اور درگزر کردو یہاں تک اللہ لائے اپنا (دوسرا) حکم بیشک اللہ ہر چیز پر قادر ہے ۔",
        "English": "Many of the people of the Scripture (Jews and Christians) wish that if they could turn you away as disbelievers after you have believed, out of envy from their ownselves, even, after the truth (that Muhammad Peace be upon him isAllah's Messenger) has become manifest unto them. But forgive and overlook, tillAllah brings His Command. Verily,Allah is Able to do all things."
      },
      {
        "ayet_no": 110,
        "arbi": "وَاَقِيْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ ۭ وَمَا تُقَدِّمُوْا لِاَنْفُسِكُمْ مِّنْ خَيْرٍ تَجِدُوْهُ عِنْدَ اللّٰهِ ۭ اِنَّ اللّٰهَ بِمَا تَعْمَلُوْنَ بَصِيْرٌ",
        "Urdu": "اور نماز قائم کرو اور زکوة دیتے رہو اور جو تم آگے بھیجو گے اپنے نفسوں کے لیے بھلائی تم پاو گے اس کا (ثواب) اللہ کے پاس بیشک اللہ اس کو جو تم عمل کرتے ہو دیکھ رہا ہے ۔",
        "English": "And be steadfast in Salah (prayer) , and give Zakah. Whatever good you send forth for yourselves, you will find it with Allah. Certainly, Allah is watchful of what you do."
      },
      {
        "ayet_no": 111,
        "arbi": "وَقَالُوْا لَنْ يَّدْخُلَ الْجَنَّةَ اِلَّا مَنْ كَانَ ھُوْدًا اَوْ نَصٰرٰى ۭ تِلْكَ اَمَانِيُّھُمْ ۭ قُلْ ھَاتُوْا بُرْھَانَكُمْ اِنْ كُنْتُمْ صٰدِقِيْنَ",
        "Urdu": "اور (یہودونصاری) نے کہا ہر گز داخل نہ ہوگا جنت میں مگر وہ جو ہو یہودی یا نصرانی یہ ان کی (جھوٹی تمنائیں ہیں تم کہو لاو اپنی دلیل اگر ہو تم سچے",
        "English": "They say that no one shall ever enter Paradise unless he is a Jew, or a Christian. These are their fancies. Say, :Bring your proof, if you are truthful."
      },
      {
        "ayet_no": 112,
        "arbi": "بَلٰي ۤ مَنْ اَسْلَمَ وَجْهَهٗ لِلّٰهِ وَھُوَ مُحْسِنٌ فَلَهٗٓ اَجْرُهٗ عِنْدَ رَبِّهٖ ۠ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا ھُمْ يَحْزَنُوْنَ",
        "Urdu": "ہاں کیوں نہیں جو جھکادے اپنا چہرہ اللہ کے لیے اور وہ نیکی کرنیوالا بھی ہو تو اس کے لیے اجر ہے اس کا اس کے رب کے پاس اور نہ کوئی خوف ہوگا ان پر اور نہ ( ہی ) وہ غمگین ہوں گے ۔",
        "English": "Of course, whosoever submits his face to Allah, and is good in deeds, will have his reward with his Lord, and there shall be no fear for such people, nor shall they grieve."
      },
      {
        "ayet_no": 113,
        "arbi": "وَقَالَتِ الْيَهُوْدُ لَيْسَتِ النَّصٰرٰى عَلٰي شَيْءٍ ۠ وَّقَالَتِ النَّصٰرٰى لَيْسَتِ الْيَهُوْدُ عَلٰي شَيْءٍ ۙ وَّھُمْ يَتْلُوْنَ الْكِتٰبَ ۭ كَذٰلِكَ قَالَ الَّذِيْنَ لَا يَعْلَمُوْنَ مِثْلَ قَوْلِهِمْ ۚ فَاللّٰهُ يَحْكُمُ بَيْنَھُمْ يَوْمَ الْقِيٰمَةِ فِيْمَا كَانُوْا فِيْهِ يَخْتَلِفُوْنَ",
        "Urdu": "اور یہودیوں نے کہا نہیں ہیں نصاری کسی چیز (دین) پر اور نصاری نے کہا نہیں ہیں یہودی کسی چیز (دین پر) حالانکہ وہ کتاب کی تلاوت کرتے ہیں اسی طرح کہی ان لوگوں نے جو علم نہیں رکھتے ان جیسی بات پس اللہ فیصلہ فرمائے گا ان کے درمیان قیامت کے دن ان (باتوں) میں جو تھے اس میں وہ اختلاف کرتے ۔",
        "English": "The Jews say: :The Christians have nothing to stand on and the Christians say :The Jews have nothing to stand on while they both read the Book! Similarly, those who do not know have said like they (the Jews and the Christians) say. So, Allah will judge between them on the Day of Resurrection in what they used to dispute."
      },
      {
        "ayet_no": 114,
        "arbi": " وَمَنْ اَظْلَمُ مِمَّنْ مَّنَعَ مَسٰجِدَ اللّٰهِ اَنْ يُّذْكَرَ فِيْهَا اسْمُهٗ وَسَعٰى فِيْ خَرَابِهَا ۭاُولٰۗىِٕكَ مَا كَانَ لَھُمْ اَنْ يَّدْخُلُوْھَآ اِلَّا خَاۗىِٕفِيْنَ ڛ لَھُمْ فِي الدُّنْيَا خِزْيٌ وَّلَھُمْ فِي الْاٰخِرَةِ عَذَابٌ عَظِيْمٌ",
        "Urdu": "اور کون ہے بڑا ظالم اس سے جو روکے اللہ کی مسجدوں سے کہ ذکر کیا جائے ان میں اس کے نام کا اور وہ کوشش کرے ان کو ویران کرنے کی ایسے لوگوں کیلئے(لائق) نہیں ہے کہ وہ داخل ہوں ان (مساجد میں مگر ڈرتے ہوئے ان کے لیے دنیا میں رسوائی ہے اور ان کے لیے آخرت میں بڑا عذاب ہے ۔",
        "English": "Who is more cruel than the one who prevents the mosques of Allah from His name being recited therein, and strives for their destruction ? It was not for such men to enter them except in awe. For them there is disgrace in this world, and for them there is a mighty punishment in the other world."
      },
      {
        "ayet_no": 115,
        "arbi": "وَلِلّٰهِ الْمَشْرِقُ وَالْمَغْرِبُ ۤ فَاَيْنَـمَا تُوَلُّوْا فَثَمَّ وَجْهُ اللّٰهِ ۭ اِنَّ اللّٰهَ وَاسِعٌ عَلِيْمٌ",
        "Urdu": "اور مشرق اور مغرب اللہ کے لیے ہیں پس جدھر تم رخ کروگے تو ادھر اللہ کی ذات ہے بیشک اللہ تعالی وسعت والا بہت علم والا ہے ۔",
        "English": "To Allah belongs the East and the West. So, whichever way you turn, there is the Face of Allah. Indeed, Allah is All-Embracing, All-Knowing."
      },
      {
        "ayet_no": 116,
        "arbi": "وَقَالُوا اتَّخَذَ اللّٰهُ وَلَدًا ۙ سُبْحٰنَهٗ ۭ بَلْ لَّهٗ مَا فِي السَّمٰوٰتِ وَالْاَرْضِ ۭكُلٌّ لَّهٗ قٰنِتُوْنَ",
        "Urdu": "اور انہوں نے کہا اللہ اولاد رکھتا ہے۔ وہ (ان باتوں سے) پاک ہے بلکہ اسی کا ہے جو آسمانوں میں ہے اور زمین میں تمام اسی کے فرمانبردار ہیں ۔",
        "English": "They say: :Allah has got a son. Pure is He. Instead, to Him belongs all that there is in the heavens and the earth. All stand obedient to Him."
      },
      {
        "ayet_no": 117,
        "arbi": "بَدِيْعُ السَّمٰوٰتِ وَالْاَرْضِ ۭوَاِذَا قَضٰٓى اَمْرًا فَاِنَّمَا يَقُوْلُ لَهٗ كُنْ فَيَكُوْنُ",
        "Urdu": "(وہی) موجد ہے آسمانوں کا اور زمین کا اور جب وہ فیصلہ کرلے کسی کام کا تو بیشک کہتا ہے اسے ہوجا تو وہ ہوجاتا ہے ۔",
        "English": "The Originator of the heavens and the earth. When He decrees a matter, He only says to it : ( Be! ) - and it is."
      },
      {
        "ayet_no": 118,
        "arbi": "وَقَالَ الَّذِيْنَ لَا يَعْلَمُوْنَ لَوْلَا يُكَلِّمُنَا اللّٰهُ اَوْ تَاْتِيْنَآ اٰيَةٌ ۭ كَذٰلِكَ قَالَ الَّذِيْنَ مِنْ قَبْلِهِمْ مِّثْلَ قَوْلِهِمْ ۭ تَشَابَهَتْ قُلُوْبُھُمْ ۭ قَدْ بَيَّنَّا الْاٰيٰتِ لِقَوْمٍ يُّوْقِنُوْنَ",
        "Urdu": "اور کہا ان لوگوں نے جو نادان ہیں کیوں نہیں بات کرتا ہم سے اللہ یا (کیوں نہیں) ہمارے پاس آتی کوئی نشانی اسی طرح کہا ان لوگوں نے جو ان سے پہلے تھے ان جیسی بات، بالکل ایک جیسے ہیں ان کے دل تحقیق ہم نے بیان کردی ہیں نشانیاں ان لوگوں کے لیے (جو) یقین رکھتے ہیں ۔",
        "English": "Those who do not know say: :Why is it that Allah does not speak to us, nor does a sign come to us ? So spoke those before them as these people do. Their hearts resemble each other. We have indeed made the signs clear for the people who have certitude."
      },
      {
        "ayet_no": 119,
        "arbi": "اِنَّآ اَرْسَلْنٰكَ بِالْحَقِّ بَشِيْرًا وَّنَذِيْرًا ۙ وَّلَا تُسْـــَٔـلُ عَنْ اَصْحٰبِ الْجَحِيْمِ",
        "Urdu": "بیشک ہم نے بھیجا ہے آپ کو حق کے ساتھ خوشخبری دینے والا اور ڈڑانے والا (بناکر) اور آپ سے نہیں پوچھا جائے گا جہنم والوں کے بارے میں",
        "English": "Surely, We have sent you with the truth, as a bearer of good tidings, and a warner, and you will not be asked about the people of Hell."
      },
      {
        "ayet_no": 120,
        "arbi": "وَلَنْ تَرْضٰى عَنْكَ الْيَهُوْدُ وَلَا النَّصٰرٰى حَتّٰى تَتَّبِعَ مِلَّتَھُمْ ۭ قُلْ اِنَّ ھُدَى اللّٰهِ ھُوَ الْهُدٰى ۭ وَلَىِٕنِ اتَّبَعْتَ اَھْوَاۗءَھُمْ بَعْدَ الَّذِيْ جَاۗءَكَ مِنَ الْعِلْمِ ۙ مَا لَكَ مِنَ اللّٰهِ مِنْ وَّلِيٍّ وَّلَا نَصِيْرٍ",
        "Urdu": "اور ہرگز راضی نہ ہوں گے آپ سے یہودی اور نہ ہی نصاری یہاں تک کہ آپ پیروی (نہ) کریں ان کے دین کی کہہ دیجیے بیشک اللہ کی ہدایت ہی (اصل) ہدایت ہے اور البتہ اگر تونے پیروی کرلی ان کی خواہشات کی اس کے بعد کہ جو آگیا تیرے پاس علم (توکوئی) نہ ہوگا آپ کو اللہ سے (بچانے والا) کوئی حمایتی اور نہ کوئی مددگار ۔",
        "English": "The Jews will never be pleased with you, nor will the Christians, unless you follow their faith. Say: :Guidance of Allah is, indeed, the guidance. Were you to follow their desires despite the knowledge that has come to you, there shall be no friend for you against Allah, nor a helper."
      },
      {
        "ayet_no": 121,
        "arbi": "اَلَّذِيْنَ اٰتَيْنٰھُمُ الْكِتٰبَ يَتْلُوْنَهٗ حَقَّ تِلَاوَتِهٖ ۭ اُولٰۗىِٕكَ يُؤْمِنُوْنَ بِهٖ ۭ وَمَنْ يَّكْفُرْ بِهٖ فَاُولٰۗىِٕكَ ھُمُ الْخٰسِرُوْنَ",
        "Urdu": "وہ لوگ جنہیں ہم نے دی کتاب (تورات یا انجیل) وہ اس کی تلاوت کرتے ہیں جو اس کی تلاوت کرنے کا حق ہے وہی لوگ ایمان لاتے ہیں اس (قرآن) پر اور جو انکار کرتا ہے اس (قرآن) کا تو وہی لوگ ہی نقصان اٹھانے والے ہیں ۔",
        "English": "Those to whom We have given the Book and they recite it observing the rights of its recitation — they are the ones who believe in it. And those who disbelieve in it, they are the losers."
      },
      {
        "ayet_no": 122,
        "arbi": "يٰبَنِىْٓ اِسْرَاۗءِيْلَ اذْكُرُوْا نِعْمَتِىَ الَّتِىْٓ اَنْعَمْتُ عَلَيْكُمْ وَاَنِّىْ فَضَّلْتُكُمْ عَلَي الْعٰلَمِيْنَ",
        "Urdu": "اے بنی اسرائیل یاد کرو میری (اس) نعمت کو جو میں نے انعام کی ہے تم پر اور بیشک میں نے تم کو فضیلت دی ہے تمام جہان والوں پر ۔",
        "English": "O Children of Isra'il! remember My favour wherewith favoured you, and that I preferred you over the world."
      },
      {
        "ayet_no": 123,
        "arbi": "وَاتَّقُوْا يَوْمًا لَّا تَجْزِيْ نَفْسٌ عَنْ نَّفْسٍ شَـيْــــًٔـا وَّلَا يُقْبَلُ مِنْهَا عَدْلٌ وَّلَا تَنْفَعُهَا شَفَاعَةٌ وَّلَا ھُمْ يُنْصَرُوْنَ",
        "Urdu": "اور ڈرو اس دن سے (کہ جب) نہ کام آئیگی کوئی جان کسی (دوسری) جان کے کچھ بھی اور نہ ہی قبول کیا جائے گا اس سے کوئی بدلہ اور نہ ہی فائدہ پہنچائے گی اسے کوئی سفارش اور نہ ہی وہ مدد کیے جائیں گے ۔",
        "English": "And guard yourselves against a day when no one shall stand for anyone for anything, nor shall ransom be accepted from anyone, nor shall intercession be of benefit to him, nor shall any support be given to such people."
      },
      {
        "ayet_no": 124,
        "arbi": "وَاِذِ ابْتَلٰٓى اِبْرٰهٖمَ رَبُّهٗ بِكَلِمٰتٍ فَاَتَـمَّهُنَّ ۭ قَالَ اِنِّىْ جَاعِلُكَ لِلنَّاسِ اِمَامًا ۭ قَالَ وَمِنْ ذُرِّيَّتِىْ ۭ قَالَ لَا يَنَالُ عَهْدِي الظّٰلِمِيْنَ",
        "Urdu": "اور جب آزمایا ابراہیم کو اس کے رب نے چند باتوں سے تو اس نے پورا کردیا ان کو فرمایا (اللہ نے) بیشک میں بنانے والا ہوں تجھے لوگوں کا پیشوا انہوں نے کہا اور میری اولاد سے بھی فرمایا نہیں پہنچے گا میرا عہد (اقرار) ظالموں کو ۔",
        "English": "When his Lord put Ibrahim to a test with certain Words, and he fulfilled them, He said, :I am going to make you an Imam for the people. He said, :And from among my progeny? He replied, :My promise does not extend to the unjust."
      },
      {
        "ayet_no": 125,
        "arbi": "وَاِذْ جَعَلْنَا الْبَيْتَ مَثَابَةً لِّلنَّاسِ وَاَمْنًا ۭ وَاتَّخِذُوْا مِنْ مَّقَامِ  اِبْرٰهٖمَ مُصَلًّى ۭ وَعَهِدْنَآ اِلٰٓى اِبْرٰهٖمَ وَاِسْمٰعِيْلَ اَنْ طَهِّرَا بَيْتِىَ لِلطَّاۗىِٕفِيْنَ وَالْعٰكِفِيْنَ وَالرُّكَّعِ السُّجُوْدِ",
        "Urdu": "اور جب ہم نے بنایا بیت اللہ کو لوگوں کیلئے مرکز اور امن (کی جگہ) اور (حکم دیا کہ) تم بناو مقام ابراہیم کو نماز پڑھنے کی جگہ اور ہم نے حکم دیا ابراہیم اور اسماعیل کو کہ تم دونوں پاک کردو میرے گھر کو طواف کرنیوالوں اور اعتکاف کرنیوالوں کیلئے اور رکوع کرنیوالوں، سجدہ کرنیوالوں کے لیے ۔",
        "English": "Remember We made the House a place of assembly for men and a place of safety; and take ye the station of Abraham as a place of prayer; and We covenanted with Abraham and Isma'il, that they should sanctify My House for those who compass it round, or use it as a retreat, or bow, or prostrate themselves (therein in prayer)."
      },
      {
        "ayet_no": 126,
        "arbi": "وَاِذْ قَالَ اِبْرٰهٖمُ رَبِّ اجْعَلْ ھٰذَا بَلَدًا اٰمِنًا وَّارْزُقْ اَھْلَهٗ مِنَ الثَّمَرٰتِ مَنْ اٰمَنَ مِنْھُمْ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِ ۭ قَالَ وَمَنْ كَفَرَ فَاُمَتِّعُهٗ قَلِيْلًا ثُمَّ اَضْطَرُّهٗٓ اِلٰى عَذَابِ النَّارِ ۭ وَبِئْسَ الْمَصِيْرُ",
        "Urdu": "اور جب کہا ابراہیم نے اے میرے رب بنادے اسے امن والا شہر اور رزق دے اس کے رہنے والوں کو پھلوں سے جو ایمان لائے ان میں سے اللہ اور آخرت کے دن پر فرمایا (اللہ نے) اور جو کفر کرے تو میں فائدہ پہنچاوں گا اسے تھوڑا سا پھر میں کھینچ لاوں گااسے دوزخ کے عذاب کی طرف اور (وہ) برا ٹھکانہ ہے ۔",
        "English": "And recall what time Ibrahim said: my Lord! make this city a place of security, and provide the People thereof with fruits, - such of them as will believe in Allah and the last Day. Allah said: and whosoever will disbelieve, him also shall give enjoyment for a while; thereafter I shall drive him to the torment of the Fire, - an ill abode!"
      },
      {
        "ayet_no": 127,
        "arbi": "وَاِذْ يَرْفَعُ اِبْرٰھٖمُ الْقَوَاعِدَ مِنَ الْبَيْتِ وَاِسْمٰعِيْلُ ۭ رَبَّنَا تَقَبَّلْ مِنَّا ۭ اِنَّكَ اَنْتَ السَّمِيْعُ الْعَلِيْمُ",
        "Urdu": "اور جب بلند کر رہے تھے ابراہیم بنیادیں بیت اللہ کی اور اسماعیل بھی (اور وہ دعا کر رہے تھے) اے ہمارے رب قبول فرما ہم سے (یہ خدمت)بے شک تو ہی سننے والا جاننے والا ہے",
        "English": "When Ibrahim was raising up the foundations of the House, along with Ismai'l (Ishmael) (supplicating) : :Our Lord accept (this service) from us! Indeed, You - and You alone - are the All-Hearing, the All-Knowing!"
      },
      {
        "ayet_no": 128,
        "arbi": "رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنْ ذُرِّيَّتِنَآ اُمَّةً مُّسْلِمَةً لَّكَ ۠ وَاَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا ۚ اِنَّكَ اَنْتَ التَّوَّابُ الرَّحِيْمُ",
        "Urdu": "اے ہمارے رب اور بنا ہم دونوں کو فرمانبردار اپنا اور ہماری اولاد میں سے ایک گروہ اپنا فرمانبردار (بنا) اور ہمیں دکھا (سکھا) ہماری عبادت کے طریقے اور تو ہم پر متوجہ ہو (ہماری توبہ قبول فرما) بیشک تو ہی توبہ قبول کرنے والا مہربان ہے ۔",
        "English": "Our Lord, make us both submissive to You, and (make) of our progeny as well, a people submissive to You and show us our ways of Pilgrimage and accept our repentance. Indeed, You - and You alone - are the Most-Relenting, the Very-Merciful."
      },
      {
        "ayet_no": 129,
        "arbi": "رَبَّنَا وَابْعَثْ فِيْهِمْ رَسُوْلًا مِّنْھُمْ يَتْلُوْا عَلَيْهِمْ اٰيٰتِكَ وَيُعَلِّمُهُمُ الْكِتٰبَ وَالْحِكْمَةَ وَيُزَكِّيْهِمْ ۭ اِنَّكَ اَنْتَ الْعَزِيْزُ الْحَكِيْمُ",
        "Urdu": "اے ہمارے رب اور بھیج ان میں ایک رسول ان ہی میں سے (جو) تلاوت کرے ان پر تیری آیتیں اور وہ تعلیم دے انہیں کتاب وحکمت کی اور وہ انہیں پاک کرے بیشک تو ہی غالب حکمت والا ہے ۔",
        "English": "Our Lord! raise up unto them an apostle from among them, who shall recite unto them Thy revelations, and shall teach them the Book and wisdom, and shall cleanse them. Verily Thou! Thou art the Mighty, the Wise."
      },
      {
        "ayet_no": 130,
        "arbi": "وَمَنْ يَّرْغَبُ عَنْ مِّلَّةِ اِبْرٰھٖمَ اِلَّا مَنْ سَفِهَ نَفْسَهٗ ۭ وَلَقَدِ اصْطَفَيْنٰهُ فِي الدُّنْيَا ۚ وَاِنَّهٗ فِي الْاٰخِرَةِ لَمِنَ الصّٰلِحِيْنَ",
        "Urdu": "اور کون ہے (جو) منہ موڑے دین ابراہیم سے مگر (وہ) جو بیوقوف بنائے اپنے آپ کو اور البتہ تحقیق چن لیا ہے ہم نے اسے دنیا میں اور بیشک وہ آخرت میں یقینا نیکوں میں سے ہوگا ۔",
        "English": "Who can turn away from the faith of Ibrahim except the one who has debased himself in folly? Indeed We have chosen him in this world. And he is certainly among the righteous in the Hereafter."
      },
      {
        "ayet_no": 131,
        "arbi": "اِذْ قَالَ لَهٗ رَبُّهٗٓ اَسْلِمْ ۙ قَالَ اَسْلَمْتُ لِرَبِّ الْعٰلَمِيْنَ",
        "Urdu": "جب کہا اس کو اس کے رب نے فرمانبردار ہوجا اس نے کہا میں فرمانبردار ہوگیا تمام جہانوں کے رب کا",
        "English": "When his Lord said to him, :Submit! He said, :I submit myself to the Lord of all the worlds."
      },
      {
        "ayet_no": 132,
        "arbi": "وَوَصّٰى بِهَآ اِبْرٰھٖمُ بَنِيْهِ وَيَعْقُوْبُ ۭيٰبَنِىَّ اِنَّ اللّٰهَ اصْطَفٰى لَكُمُ الدِّيْنَ فَلَا تَمُوْتُنَّ اِلَّا وَاَنْتُمْ مُّسْلِمُوْنَ",
        "Urdu": "اور وصیت کی اس (دین) کی ابراہیم نے اپنے بیٹوں کو اور یعقوب نے (اپنے بیٹوں کو) اے میرے بیٹو! بیشک اللہ نے انتخاب کیا ہے تمہارے لیے دین تو تم ہرگز نہ مرنا مگر اس حال میں کہ تم مسلمان ہو ۔",
        "English": "And Ibrahim exhorted the same to his sons, and so did Ya'qub (Jacob) : :My sons, Allah has certainly chosen for you the Faith. So, let not death overtake you but as Muslims."
      },
      {
        "ayet_no": 133,
        "arbi": "اَمْ كُنْتُمْ شُهَدَاۗءَ اِذْ حَضَرَ يَعْقُوْبَ الْمَوْتُ ۙ اِذْ قَالَ لِبَنِيْهِ مَا تَعْبُدُوْنَ مِنْۢ بَعْدِيْ ۭ قَالُوْا نَعْبُدُ اِلٰهَكَ وَاِلٰهَ اٰبَاۗىِٕكَ اِبْرٰھٖمَ وَاِسْمٰعِيْلَ وَاِسْحٰقَ اِلٰــهًا وَّاحِدًا ښ وَّنَحْنُ لَهٗ مُسْلِمُوْنَ",
        "Urdu": "کیا تم تھے گواہ جب آئی یعقوب پر موت جب کہا انہوں نے اپنے بیٹوں سے کس کی تم عبادت کرو گے میرے بعد؟ وہ کہنے لگے ہم عبادت کریں گے تیرے معبود کی اور تیرے آباءو اجداد ابراہیم اور اسماعیل کے معبود کی اور اسحاق کے (یعنی) ایک معبود کی اور ہم اسی کے فرمانبردار ہیں ۔",
        "English": "Were you present (at the time) when death approached Ya‘qub (Jacob) when he asked his sons: ‘Whom will you worship after (my passing away) ?’ They said: ‘We shall worship your God, the God of your ancestors Ibrahim (Abraham) and Isma‘il (Ishmael) and Ishaq"
      },
      {
        "ayet_no": 134,
        "arbi": "تِلْكَ اُمَّةٌ قَدْ خَلَتْ ۚ لَهَا مَا كَسَبَتْ وَلَكُمْ مَّا كَسَبْتُمْ ۚ وَلَا تُسْـــَٔــلُوْنَ عَمَّا كَانُوْا يَعْمَلُوْنَ",
        "Urdu": "وہ ایک گروہ تھا (جو) یقینا گزر چکا ہے اس کے لیے ہے جو اس نے کمایا اور تمہارے لیے ہے جو تم نے کمایا اور نہیں تم پوچھےجاو گے اس کے بارے میں جو وہ کرتے تھے ۔",
        "English": "Those are a people who have passed away. For them is what they earned, and for you is what you earned. Nor shall you be questioned as to what they have been doing."
      },
      {
        "ayet_no": 135,
        "arbi": "وَقَالُوْا كُوْنُوْا ھُوْدًا اَوْ نَصٰرٰى تَهْتَدُوْا ۭ قُلْ بَلْ مِلَّةَ اِبْرٰھٖمَ حَنِيْفًا ۭ وَمَا كَانَ مِنَ الْمُشْرِكِيْنَ",
        "Urdu": "اور وہ کہتے ہیں ہوجاو یہودی یا نصرانی تم ہدایت پا جاؤ گے کہہ دیجیے بلکہ (ہم تو) ابراہیم کے دین پر ہیں (جو) سیدھی راہ پر تھے اور وہ نہیں تھے مشرکوں سے ۔",
        "English": "They said, :Become Jews or Christians, and you will find the right path. Say: :Instead, (we follow) the faith of Ibrahim, the upright, - and he was not one of those who associate partners with Allah."
      },
      {
        "ayet_no": 136,
        "arbi": "قُوْلُوْٓا اٰمَنَّا بِاللّٰهِ وَمَآ اُنْزِلَ اِلَيْنَا وَمَآ اُنْزِلَ اِلٰٓى اِبْرٰھٖمَ وَاِسْمٰعِيْلَ وَاِسْحٰقَ وَيَعْقُوْبَ وَالْاَسْبَاطِ وَمَآ اُوْتِيَ مُوْسٰى وَعِيْسٰى وَمَآ اُوْتِيَ النَّبِيُّوْنَ مِنْ رَّبِّهِمْ ۚ لَا نُفَرِّقُ بَيْنَ اَحَدٍ مِّنْھُمْ ڮ وَنَحْنُ لَهٗ مُسْلِمُوْنَ",
        "Urdu": "(مسلمانوں) کہو ہم ایمان لائے اللہ پر اور جو اتارا گیا ہماری طرف اور جو اتارا گیا ابراہیم اور اسماعیل اور اسحاق کی طرف اور یعقوب اور (اس کی)اولاد پر اور جو دیا گیا موسی اور عیسی کو اور جو دیاگیا نبیوں کو ان کے رب کی طرف سے نہیں ہم تفریق کرتے کسی ایک کے درمیان ان میں سے اور ہم اسی کے فرمانبردار ہیں ۔",
        "English": "Say (O, Muslims) : :We believe in Allah, and in what has been revealed to us, and in what has been revealed to Ibrahim, Ismai'l (Ishmael) , IsHaq (Isaac) , Ya'qub and his children, and in what has been given to Musa and lsa, (Jesus) and what has been given to the prophets from their Lord: We make no difference between any of them, and to Him we submit ourselves."
      },
      {
        "ayet_no": 137,
        "arbi": "فَاِنْ اٰمَنُوْا بِمِثْلِ مَآ اٰمَنْتُمْ بِهٖ فَقَدِ اھْتَدَوْا ۚ وَاِنْ تَوَلَّوْا فَاِنَّمَا ھُمْ فِيْ شِقَاقٍ ۚ فَسَيَكْفِيْكَهُمُ اللّٰهُ ۚ وَھُوَ السَّمِيْعُ الْعَلِيْمُ",
        "Urdu": "پس اگر وہ ایمان لائیں جیسے تم ایمان لائے ہو اس پر تو یقینا وہ ہدایت پا گئے اور اگر وہ انحراف کریں تو بیشک وہ (دراصل) ہٹ دھرمی میں (پڑ گئے ہیں) پس عنقریب کافی ہوگا تجھے ان سے اللہ اور وہ سننے والا جاننے والا ہے ۔",
        "English": "So, if they believe in the same way as you believe, they will have certainly found the right path, and if they turn away, then the fact is that they are in antagonism. Then Allah will suffice you against them, and He is the All-Hearing, the All-Knowing."
      },
      {
        "ayet_no": 138,
        "arbi": "صِبْغَةَ اللّٰهِ ۚ وَمَنْ اَحْسَنُ مِنَ اللّٰهِ صِبْغَةً ۡ وَّنَحْنُ لَهٗ عٰبِدُوْنَ",
        "Urdu": "اللہ کا رنگ (اپناو) اور کون زیادہ اچھا ہوسکتا ہے اللہ سے رنگ میں اور ہم اسی کی عبادت کرنے والے ہیں ۔",
        "English": "Ours is the dye of Allah! and who is better at dyeing than Allah! And we are His worshippers."
      },
      {
        "ayet_no": 139,
        "arbi": "قُلْ اَتُحَاۗجُّوْنَـــنَا فِي اللّٰهِ وَھُوَ رَبُّنَا وَرَبُّكُمْ ۚ وَلَنَآ اَعْمَالُنَا وَلَكُمْ اَعْمَالُكُمْ ۚ وَنَحْنُ لَهٗ مُخْلِصُوْنَ",
        "Urdu": "کہہ دو کیا تم جھگڑتے ہو ہم سے اللہ کے بارے میں حالانکہ وہ ہمارا بھی رب ہے اور تمہارا بھی رب ہے اور ہمارے لیے ہمارے اعمال اور تمہارے لیے تمہارے اعمال اور ہم اس کے لیے ہی خالص (عبادت) کرنیوالے ہیں ۔",
        "English": "Say: :Would you argue with us about Allah, when He is our Lord as well as your Lord? For us our deeds, and for you your deeds! And we are faithful to Him."
      },
      {
        "ayet_no": 140,
        "arbi": "اَمْ تَقُوْلُوْنَ اِنَّ اِبْرٰھٖمَ وَاِسْمٰعِيْلَ وَاِسْحٰقَ وَيَعْقُوْبَ وَالْاَسْبَاطَ كَانُوْا ھُوْدًا اَوْ نَصٰرٰى ۭ قُلْ ءَاَنْتُمْ اَعْلَمُ اَمِ اللّٰهُ ۭ وَمَنْ اَظْلَمُ مِمَّنْ كَتَمَ شَهَادَةً عِنْدَهٗ مِنَ اللّٰهِ ۭ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعْمَلُوْنَ",
        "Urdu": "کیا تم کہتے ہو بیشک ابراہیم اور اسماعیل اور اسحاق اور یعقوب اور (ان کی) اولاد تھے یہودی یا نصرانی کہہ دو کیا تم زیادہ جانتے ہو یا اللہ اور کون ہے بڑا ظالم اس سے جو چھپائے گواہی کو (جو) اس کے پاس ہو اللہ کی طرف سے اور نہیں ہے اللہ غافل اس سے جو تم عمل کرتے ہو ۔",
        "English": "Or say ye that Ibrahim and Ismai'l and Ishaq and Ya'qub, and the tribes were Jews or Nazarenes? Say thou: are ye the more knowing or is Allah? And who is more unjust than he who hideth a testimony that is with him from Allah? And Allah is not neglectful of that which ye Work."
      },
      {
        "ayet_no": 141,
        "arbi": "تِلْكَ اُمَّةٌ قَدْ خَلَتْ ۚ لَهَا مَا كَسَبَتْ وَلَكُمْ مَّا كَسَبْتُمْ ۚ وَلَا تُسْـَٔـلُوْنَ عَمَّا كَانُوْا يَعْمَلُوْنَ",
        "Urdu": "وہ ایک امت تھی یقینا وہ گزر چکی اس کے لیے ہے جو اس نے کمایا اور تمہارے لیے ہے جو تم نے کمایا اور نہیں تم پوچھے جاؤ گے اس کے بارے میں جو وہ کرتے تھے ۔",
        "English": "Those are a people who have passed away. For them is what they earned, and for you is what you earned, and you shall not be questioned about what they have been doing."
      },
      {
        "ayet_no": 142,
        "arbi": "سَيَقُوْلُ السُّفَهَاۗءُ مِنَ النَّاسِ مَا وَلّٰىهُمْ عَنْ قِبْلَتِهِمُ الَّتِىْ كَانُوْاعَلَيْهَا ۭ قُلْ لِّلّٰهِ الْمَشْرِقُ وَالْمَغْرِبُ ۭ يَهْدِيْ مَنْ يَّشَاۗءُ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ",
        "Urdu": "عنقریب کہیں گے بیوقوف لوگ کس چیز نے پھیر دیا ہے ان (مسلمانوں)کو ان کے قبلے سے جس پر وہ (پہلے )تھے کہہ دیجیے کہ اللہ ہی کے لیے مشرق اورمغرب،وہ ہدایت دیتاہے جسے چاہتاہے سیدھے راستے کی طرف ۔",
        "English": "The foolish among the people will say: :What has turned them away from their Qiblah which they used to observe? Say: :To Allah belong the East and the West. He guides whom He wills to a straight path."
      },
      {
        "ayet_no": 143,
        "arbi": "وَكَذٰلِكَ جَعَلْنٰكُمْ اُمَّةً وَّسَطًا لِّتَكُوْنُوْا شُهَدَاۗءَ عَلَي النَّاسِ وَيَكُـوْنَ الرَّسُوْلُ عَلَيْكُمْ شَهِيْدًا ۭ وَمَا جَعَلْنَا الْقِبْلَةَ الَّتِىْ كُنْتَ عَلَيْهَآ اِلَّا لِنَعْلَمَ مَنْ يَّتَّبِـــعُ الرَّسُوْلَ مِمَّنْ يَّنْقَلِبُ عَلٰي عَقِبَيْهِ ۭ وَاِنْ كَانَتْ لَكَبِيْرَةً اِلَّا عَلَي الَّذِيْنَ ھَدَى اللّٰهُ ۭ وَمَا كَانَ اللّٰهُ لِـيُضِيْعَ اِيْمَانَكُمْ ۭ اِنَّ اللّٰهَ بِالنَّاسِ لَرَءُوْفٌ رَّحِيْمٌ",
        "Urdu": "اوراسی طرح ہم نے بنایا تمہیں معتدل امت تاکہ تم بن جاؤ گواہ لوگوں پر(قیامت کے دن) اور ہوں رسول(محمد صلی اللہ علیہ وسلم) تم پرگواہ اور نہیں بنایا ہم نے اس قبلے کو جس پر آپ(پہلے)تھے مگر اس لیے کہ ہم جان لیں کون رسول کی پیروی کرتاہے (اور)کون پھر جاتاہے اپنی ایڑیوں کے بل اوراگرچہ(قبلے کی تبدیلی) یقینا گراں تھی مگر ان لوگوں پر(گراں نہیں) جنہیں ہدایت دی اللہ نے اوراللہ(ایسا) نہیں ہے کہ وہ ضائع کرے تمہارا ایمان بے شک اللہ تو لوگوں پر یقینا شفقت کرنے والا مہربان ہے ۔",
        "English": "Thus We have made you [true Muslims - real believers of Islmic Monotheism, true followers of Prophet Muhammad and his Sunnah (legal ways) ], a Wasat (just) (and the best) nation, that you be witnesses over mankind and the Messenger (Muhammad ) be a witness over you. And We made the Qiblah (prayer direction towards Jerusalem) which you used to face, only to test those who followed the Messenger (Muhammad ) from those who would turn on their heels (i.e. disobey the Messenger) . Indeed it was great (heavy) except for those whomAllah guided. AndAllah would never make your faith (prayers) to be lost (i.e. your prayers offered towards Jerusalem) . Truly,Allah is full of kindness, the Most Merciful towards mankind."
      },
      {
        "ayet_no": 144,
        "arbi": "قَدْ نَرٰى تَـقَلُّبَ وَجْهِكَ فِي السَّمَاۗءِ ۚ فَلَنُوَلِّيَنَّكَ قِبْلَةً تَرْضٰىھَا ۠فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ ۭوَحَيْثُ مَا كُنْتُمْ فَوَلُّوْا وُجُوْھَكُمْ شَطْرَهٗ ۭ وَاِنَّ الَّذِيْنَ اُوْتُوا الْكِتٰبَ لَيَعْلَمُوْنَ اَنَّهُ الْحَـقُّ مِنْ رَّبِّهِمْ ۭ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا يَعْمَلُوْنَ",
        "Urdu": "بے شک ہم دیکھ رہے ہیں بار باراٹھنا آپ کے چہرے کاآسمان میں پس البتہ ہم ضرور پھیر دیں گے آپ کو(اس)قبلہ (کی طرف) جسے آپ پسند کرتے ہیں تو پھیر لیجیے اپنارخ مسجد حرام(کعبہ) کی طرف اورجہاں(بھی )تم لوگ ہو پس پھیر لو اپنے چہروں کواسی کی جانب اوربے شک وہ لوگ جودیے گئے کتاب یقینا وہ جانتے ہیں کہ بے شک وہ ہی حق ہے ان کے رب کی طرف سے اور نہیں ہے اللہ بے خبر اس سے جویہ کررہے ہیں ۔",
        "English": "We have been seeing you turning your face to the heavens. So, We will certainly assign to you a Qiblah that you would like. Now, turn your face in the direction of the Sacred Mosque (Al-Masjid-ul-Haram) , and (O Muslims) , wherever you are, turn your faces in its direction. Even those who have been given the Book know well that it is the truth from their Lord, and Allah is not unaware of what they do."
      },
      {
        "ayet_no": 145,
        "arbi": "وَلَىِٕنْ اَتَيْتَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ بِكُلِّ اٰيَةٍ مَّا تَبِعُوْا قِبْلَتَكَ ۚ وَمَآ اَنْتَ بِتَابِــعٍ قِبْلَتَهُمْ ۚ وَمَا بَعْضُهُمْ بِتَابِــعٍ قِبْلَةَ بَعْضٍ ۭ وَلَىِٕنِ اتَّبَعْتَ اَھْوَاۗءَھُمْ مِّنْۢ بَعْدِ مَا جَاۗءَكَ مِنَ الْعِلْمِ ۙاِنَّكَ اِذًا لَّمِنَ الظّٰلِمِيْنَ",
        "Urdu": "اور البتہ اگر آپ لے آئیں ان کے پاس جو دیے گئے کتاب ہر(قسم کی)نشانی (توپھر بھی) نہیں یہ پیروی کریں گے آپ کے قبلے کی اور نہ آپ پیروی کرنے والے ہیں ان کے قبلے کی اور نہ ان میں سے کوئی پیروی کرنے والاہے کسی دوسرے کے قبلے کی اورالبتہ اگر آپ نے پیروی کی ان کی خواہشات کی اس کے بعد کہ آچکا ہے آپ کے پاس علم بے شک آپ اس صورت میں (ہوجائیں گے)یقینا ظالموں میں سے ۔",
        "English": "Even if you bring every sign to those who have been given the Book, they would not follow your Qiblah, and you are not to follow their Qiblah, nor are they to follow each other‘s Qiblah. If you were to follow their desires despite the knowledge that has come to you, you will then certainly be among the unjust."
      },
      {
        "ayet_no": 146,
        "arbi": "الَّذِيْنَ اٰتَيْنٰھُمُ الْكِتٰبَ يَعْرِفُوْنَهٗ كَمَا يَعْرِفُوْنَ اَبْنَاۗءَھُمْ ۭ وَاِنَّ فَرِيْقًا مِّنْهُمْ لَيَكْتُمُوْنَ الْحَقَّ وَھُمْ يَعْلَمُوْنَ",
        "Urdu": "وہ لوگ جنہیں ہم نے دی کتاب وہ اسے پہچانتے ہیں (قبلے کی تبدیلی یامحمدصلی اللہ علیہ وسلم کو)جیسے وہ پہچانتے ہیں اپنے بیٹوں کو اوربے شک ایک گروہ ان میں سے (ایساہے جو)البتہ حق کو چھپاتے ہیں حالانکہ وہ جانتے ہیں ۔",
        "English": "Those whom We have given the Book recognize him (the Holy Prophet) as they recognize their own sons. In fact, a group of them conceals the truth, while they know (it) ."
      },
      {
        "ayet_no": 147,
        "arbi": "اَلْحَقُّ مِنْ رَّبِّكَ فَلَا تَكُوْنَنَّ مِنَ الْمُمْتَرِيْنَ",
        "Urdu": "کہ یہی حق ہے تیرے رب کی طرف سے پس تم ہرگز نہ ہونا شک کرنے والوں میں سے ۔",
        "English": "The truth is from your Lord. So, never be among those who doubt (it) ."
      },
      {
        "ayet_no": 148,
        "arbi": "وَلِكُلٍّ وِّجْهَةٌ ھُوَ مُوَلِّيْهَا فَاسْتَبِقُوا الْخَيْرٰتِ ڲ اَيْنَ مَا تَكُوْنُوْا يَاْتِ بِكُمُ اللّٰهُ جَمِيْعًا ۭ اِنَّ اللّٰهَ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
        "Urdu": "اور ہر ایک کے لیے ایک جہت ہے کہ وہ رخ کرتاہے اس کی طرف پس تم سبقت لو بھلائی کے کاموں میں جہاں کہیں بھی تم ہوں گے لائے گا تم کواللہ اکٹھا بے شک اللہ ہرچیز پر قادر ہے ۔",
        "English": "For every one is a direction with award he turn oth; so strive to be foremost in virtues. Wheresoever ye may be, Allah will bring you together. Verily Allah is over everything Potent."
      },
      {
        "ayet_no": 149,
        "arbi": "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ ۭ وَاِنَّهٗ لَلْحَقُّ مِنْ رَّبِّكَ ۭ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعْمَلُوْنَ",
        "Urdu": "اورجہاں سے آپ نکلیں پس پھیر لیں اپنا رخ مسجد حرام(کعبہ)کی طرف اوربے شک وہ ہی یقینا حق ہے تیرے رب کی طرف سے اور نہیں اللہ بے خبر اس سے جو تم کرتے ہو ۔",
        "English": "From wherever you set out, turn your face in the direction of the Sacred Mosque (Al-Masjid-ul-Haram) . That, indeed, is the truth from your Lord, and Allah is not unaware of what you do."
      },
      {
        "ayet_no": 150,
        "arbi": "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ ۭ وَحَيْثُ مَا كُنْتُمْ فَوَلُّوْا وُجُوْھَكُمْ شَطْرَهٗ ۙ لِئَلَّا يَكُوْنَ لِلنَّاسِ عَلَيْكُمْ حُجَّــةٌ ڎ اِلَّا الَّذِيْنَ ظَلَمُوْا مِنْهُمْ ۤ فَلَا تَخْشَوْھُمْ وَاخْشَوْنِيْ ۤ وَلِاُتِمَّ نِعْمَتِىْ عَلَيْكُمْ وَلَعَلَّكُمْ تَهْتَدُوْنَ",
        "Urdu": "اورجہاں سے بھی آپ نکلیں پس پھیر لیں اپنارخ مسجد حرام(کعبہ) کی طرف اورجہاں تم ہواکرو،توپھیر لو(نماز میں) اپنے چہرے اسی(کعبہ) کی طرف تاکہ نہ ہو لوگوں کے پاس تمہارے خلاف کوئی حجت سوائے ان کے جنہوں نے بے انصافی کی ان میں سے پس تم نہ ڈرو ان سے اور ڈرو مجھ سے اورتاکہ میں پورا کردوں اپنا انعام تم پر اور(اس لیے بھی مجھ سے ڈرو) تاکہ تم ہدایت پا جاؤ",
        "English": "And from wherever you set out, turn your face in the direction of the Sacred Mosque (Al-Masjid-ul-Haram) , and (O Muslims) , wherever you are, turn your faces in its direction, so that people should have no argument against you, except for those among them who are unjust,__ do not fear them, but fear Me__, and so that I should perfect My blessings upon you, and that you may take the right path."
      },
      {
        "ayet_no": 151,
        "arbi": "كَمَآ اَرْسَلْنَا فِيْكُمْ رَسُوْلًا مِّنْكُمْ يَتْلُوْا عَلَيْكُمْ اٰيٰتِنَا وَيُزَكِّيْكُمْ وَيُعَلِّمُكُمُ الْكِتٰبَ وَالْحِكْمَةَ وَيُعَلِّمُكُمْ مَّا لَمْ تَكُوْنُوْا تَعْلَمُوْنَ",
        "Urdu": "جیسا کہ ہم نے بھیجا تم میں رسول تم ہی میں سے وہ تلاوت کرتاہے تم پر ہماری آیتوں کی اور وہ تمہیں پاک کرتاہے اوروہ تمہیں تعلیم دیتاہے کتاب وحکمت کی اوروہ سکھلاتاہے تمہیں (وہ کچھ)جو نہیں تھے تم جانتے ۔",
        "English": "As also We have sent in your midst a messenger from among you, who recites to you Our verses, and purifies you, and teaches you the Book and the wisdom, and teaches you what you did not know."
      },
      {
        "ayet_no": 152,
        "arbi": "فَاذْكُرُوْنِيْٓ اَذْكُرْكُمْ وَاشْكُرُوْا لِيْ وَلَا تَكْفُرُوْنِ",
        "Urdu": "پس تم یاد رکھو مجھے میں یاد رکھوں گا تمہیں اورتم میرا شکر اداکرو اور میری ناشکری نہ کرو ۔",
        "English": "So Remember Me, and I will remember you, and be thankful to Me, and be not ungrateful to Me."
      },
      {
        "ayet_no": 153,
        "arbi": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوا اسْتَعِيْنُوْا بِالصَّبْرِ وَالصَّلٰوةِ  ۭاِنَّ اللّٰهَ مَعَ الصّٰبِرِيْنَ",
        "Urdu": "اے وہ لوگو جو ایمان لائے ہو مدد حاصل کرو صبر سے اور نماز سے بے شک اللہ تعالی صبر کرنے والوں کے ساتھ ہے ۔",
        "English": "O you who believe, seek help through patience and prayer. Surely, Allah is with those who are patient."
      },
      {
        "ayet_no": 154,
        "arbi": "وَلَا تَـقُوْلُوْا لِمَنْ يُّقْتَلُ فِيْ سَبِيْلِ اللّٰهِ اَمْوَاتٌ ۭ بَلْ اَحْيَاۗءٌ وَّلٰكِنْ لَّا تَشْعُرُوْنَ",
        "Urdu": "اورمت کہو ان کوجو قتل کیے جائیں اللہ کی راہ میں،مردہ،بلکہ وہ زندہ ہیں اور لیکن تم شعور نہیں رکھتے ۔",
        "English": "Do not say of those who are slain in the way of Allah that they are dead. Instead, they are alive, but you do not perceive."
      },
      {
        "ayet_no": 155,
        "arbi": "وَلَنَبْلُوَنَّكُمْ بِشَيْءٍ مِّنَ الْخَوْفِ وَالْجُوْعِ وَنَقْصٍ مِّنَ الْاَمْوَالِ وَالْاَنْفُسِ وَالثَّمَرٰتِ ۭ وَبَشِّرِ الصّٰبِرِيْنَ",
        "Urdu": "اورالبتہ ضرور ہم آزمائیں گے تمہیں کچھ خوف سے اوربھوک سے اور مالوں میں اورجانوں میں کمی کرکے اورپھلوں میں (کمی کرکے)اورخوش خبری دیدیں صبر کرنے والوں کو ۔",
        "English": "Surely We will test you with a bit of fear and hunger, and loss in wealth and lives and fruits, and give good tidings to the patient."
      },
      {
        "ayet_no": 156,
        "arbi": "الَّذِيْنَ اِذَآ اَصَابَتْهُمْ مُّصِيْبَةٌ  ۙ قَالُوْٓا اِنَّا لِلّٰهِ وَاِنَّآ اِلَيْهِ رٰجِعُوْنَ",
        "Urdu": "اوروہ لوگ جب پہنچتی ہے ا نہیں کوئی مصیبت تو کہتے ہیں کہ بے شک ہم اللہ کے لیے ہیں بے شک ہم اسی کی طرف لوٹنے والے ہیں ۔",
        "English": "Who, when there afflicteth them an affliction, say: verily we are Allah's, and verily unto Him we are returners."
      },
      {
        "ayet_no": 157,
        "arbi": "اُولٰۗىِٕكَ عَلَيْهِمْ صَلَوٰتٌ مِّنْ رَّبِّهِمْ وَرَحْمَةٌ   ۣوَاُولٰۗىِٕكَ ھُمُ الْمُهْتَدُوْنَ",
        "Urdu": "وہی لوگ ہیں کہ ان پر عنایات ہیں ان کے رب کی طرف سے اور رحمت ہے اور وہی لوگ ہی ہدایت یافتہ ہیں ۔",
        "English": "Those are the ones upon whom there are blessings from their Lord, and mercy as well; and those are the ones who are on the right path."
      },
      {
        "ayet_no": 158,
        "arbi": "اِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَاۗىِٕرِاللّٰهِ ۚ فَمَنْ حَجَّ الْبَيْتَ اَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ اَنْ يَّطَّوَّفَ بِهِمَا ۭ وَمَنْ تَـطَوَّعَ خَيْرًا  ۙ فَاِنَّ اللّٰهَ شَاكِـرٌ عَلِــيْمٌ",
        "Urdu": "بے شک صفا اورمروہ اللہ کی نشانیوں میں سے ہیں پس جوحج کرے بیت اللہ کا یا عمرہ کرے توکوئی گناہ نہیں اس پر یہ کہ وہ طواف کرے ان دونوں کا اور جو خوشی سے کرے کوئی نیکی تو بے شک اللہ قدر دان،بہت علم والا ہے ۔",
        "English": "Verily Safa and Marwa are of the landmarks of Allah; so whosoever maketh a pilgrimage to the House, or performeth the Umra, in him there is no fault if he walketh in-between the twain. And whosoever voluntarily doth good, then Verily Allah is Appreciative, Knowing."
      },
      {
        "ayet_no": 159,
        "arbi": "اِنَّ الَّذِيْنَ يَكْتُمُوْنَ مَآ اَنْزَلْنَا مِنَ الْبَيِّنٰتِ وَالْهُدٰى مِنْۢ بَعْدِ مَا بَيَّنّٰهُ لِلنَّاسِ فِي الْكِتٰبِ ۙاُولٰۗىِٕكَ يَلْعَنُهُمُ اللّٰهُ وَيَلْعَنُهُمُ اللّٰعِنُوْنَ",
        "Urdu": "بے شک وہ لوگ جوچھپاتے ہیں اسے جو ہم نے نازل کیاواضح دلائل اور ہدایت کو اس کے بعد کہ ہم نے کھول کربیان کردیا اسے لوگوں کے لیے اس کتاب میں وہی لوگ ہیں (کہ)لعنت کرتاہے ان پر اللہ اورلعنت کرتے ہیں ان پر لعنت کرنے والے ۔",
        "English": "Surely, those who conceal the clear signs and the guidance We have revealed, even after We have explained them for people in the Book, upon them Allah casts damnation, and they are cursed by all those who curse."
      },
      {
        "ayet_no": 160,
        "arbi": "اِلَّا الَّذِيْنَ تَابُوْا وَاَصْلَحُوْا وَبَيَّنُوْا فَاُولٰۗىِٕكَ اَتُوْبُ عَلَيْهِمْ ۚوَاَنَا التَّوَّابُ الرَّحِيْمُ",
        "Urdu": "مگروہ لوگ جنہوں نے توبہ کرلی اوراصلاح کرلی اوربیان کردیا(جسے چھپاتے رہے)تووہی لوگ ہیں کہ میں توبہ قبول کرتاہوں ان کی اورمیں ہی توبہ قبول کرنیوالانہایت مہربان ہوں ۔",
        "English": "Save those that repent and amend, and make manifest the truth I these it is toward whom I relent. And I am the Relenting, the Merciful!"
      },
      {
        "ayet_no": 161,
        "arbi": "اِنَّ الَّذِيْنَ كَفَرُوْا وَمَاتُوْا وَھُمْ كُفَّارٌ اُولٰۗىِٕكَ عَلَيْهِمْ لَعْنَةُ اللّٰهِ وَالْمَلٰۗىِٕكَةِ وَالنَّاسِ اَجْمَعِيْنَ",
        "Urdu": "بے شک وہ لوگ جنہوں نے کفر کیا اوروہ مرے اس حال میں کہ وہ کافر تھے یہی لوگ ہیں(کہ)ان پراللہ کی لعنت ہے اورفرشتوں کی اورتمام لوگوں کی ۔",
        "English": "Verily those who disbelieve, and die while they are infidels, these it is on whom shall be the curse of Allah and the angels and mankind all."
      },
      {
        "ayet_no": 162,
        "arbi": "خٰلِدِيْنَ فِيْهَا  ۚ لَا يُخَفَّفُ عَنْهُمُ الْعَذَابُ وَلَا ھُمْ يُنْظَرُوْنَ",
        "Urdu": "وہ ہمیشہ رہیں گے اس لعنت میں نہ ہلکاکیاجائے ان سے عذاب اور نہ وہ کچھ مہلت دیے جائیں گے ۔",
        "English": "They shall be abiders therein, the torment shall not be lightened on them, nor shall they be respited."
      },
      {
        "ayet_no": 163,
        "arbi": "وَاِلٰـهُكُمْ اِلٰهٌ وَّاحِدٌ ۚ لَآ اِلٰهَ اِلَّا ھُوَ الرَّحْمٰنُ الرَّحِيْمُ",
        "Urdu": "اورتمہارامعبود ایک معبود ہے کوئی معبود نہیں مگروہ (جو)نہایت مہربان،بہت رحم والا ہے ۔",
        "English": "Your god is one God: There is no god but He, the All-Merciful, the Very-Merciful."
      },
      {
        "ayet_no": 164,
        "arbi": "اِنَّ فِيْ خَلْقِ السَّمٰوٰتِ وَالْاَرْضِ وَاخْتِلَافِ الَّيْلِ وَالنَّهَارِ وَالْفُلْكِ الَّتِىْ تَجْرِيْ فِي الْبَحْرِ بِمَا يَنْفَعُ النَّاسَ وَمَآ اَنْزَلَ اللّٰهُ مِنَ السَّمَاۗءِ مِنْ مَّاۗءٍ فَاَحْيَا بِهِ الْاَرْضَ بَعْدَ مَوْتِهَا وَبَثَّ فِيْهَا مِنْ كُلِّ دَاۗبَّةٍ ۠ وَّتَـصْرِيْفِ الرِّيٰحِ وَالسَّحَابِ الْمُسَخَّرِ بَيْنَ السَّمَاۗءِ وَالْاَرْضِ لَاٰيٰتٍ لِّقَوْمٍ يَّعْقِلُوْنَ",
        "Urdu": "بے شک آسمانوں اور زمین کے پیداکرنے میں اور رات اور دن کے آنے جانے میں اوران کشتیوں میں جو سمند ر میں چلتی ہیں (وہ چیزیں) لے کرجونفع دیتی ہیں لوگوں کو اور(اس میں)جو اللہ نے اتارا ہے آسمان سے پانی پھر زندہ(آباد)کیا اس کے ذریعے زمین کو اس کے مردہ(بنجر)ہونے کے بعد اور پھیلادی اس میں ہرطرح کی جاندار مخلوق اورہواؤں کی گردش میں اور تابع فرماں بادل میں (جو) درمیان ہے آسمان اور زمین کے(ان سب میں)یقینا نشانیاں ہیں اس قوم کے لیے جوعقل رکھتے ہیں",
        "English": "Surely, in the creation of heavens and earth, and the alternation of night and day, and the ships that sail in the sea, carrying that which benefits men, and in the water Allah sent down from the sky, then revived with it the earth after it was dead, and in every creature He has scattered on it, and in turning of winds, and in the clouds employed to serve between heaven and earth, there are signs for those who have sense."
      },
      {
        "ayet_no": 165,
        "arbi": "وَمِنَ النَّاسِ مَنْ يَّتَّخِذُ مِنْ دُوْنِ اللّٰهِ اَنْدَادًا يُّحِبُّوْنَهُمْ كَحُبِّ اللّٰهِ ۭ وَالَّذِيْنَ اٰمَنُوْٓا اَشَدُّ حُبًّا لِّلّٰهِ ۭ وَلَوْ يَرَى الَّذِيْنَ ظَلَمُوْٓا اِذْ يَرَوْنَ الْعَذَابَ ۙ اَنَّ الْقُوَّةَ لِلّٰهِ جَمِيْعًا  ۙ وَّاَنَّ اللّٰهَ شَدِيْدُ الْعَذَابِ",
        "Urdu": "اور(ان نشانیوں کے باوجود)لوگوں میں سے (کچھ ایسے ہیں )جو بناتے ہیں اللہ کے علاوہ(دوسروں کو) شریک (پھر)وہ(ایسی )محبت کرتے ہیں ان سے جیسی محبت اللہ سے کی جائے اوروہ لوگ جو ایمان لائے ہیں وہ سب سے زیادہ محبت اللہ ہی سے کرتے ہیں اور کاش(آج)سوجھ جائے(یہ بات)ان لوگوں کوجنہوں نے ظلم کیا(جواس وقت سوجھے گی)جب وہ لوگ دیکھیں گے عذاب کو کہ بے شک قوت تواللہ کے پاس ہے تمام اوریہ کہ بے شک اللہ سخت عذاب والا ہے ۔",
        "English": "Among the people there are some who set up co-gods beside Allah whom they love like the love due to Allah. But those who believe are most firm in their love for Allah. Would that the unjust people could perceive - when they see the torment (i.e. any calamity in this world) - that all power belongs to Allah alone, and that Allah is severe in punishment!"
      },
      {
        "ayet_no": 166,
        "arbi": "اِذْ تَبَرَّاَ الَّذِيْنَ اتُّبِعُوْا مِنَ الَّذِيْنَ اتَّبَعُوْا وَرَاَوُا الْعَذَابَ وَتَقَطَّعَتْ بِهِمُ الْاَسْـبَابُ",
        "Urdu": "جب بیزاری کااظہار کریں وہ لوگ جن کی پیروی کی گئی تھی ان لوگوں سے جنہوں نے پیروی کی ہوگی اوروہ دیکھیں گے عذاب کو اورمنقطع ہوجائیں گے ان کے تعلقات ۔",
        "English": "When those who were followed shall quit themselves of those who followed, and they all shall behold the torment, and sundered between them shall be the Cords."
      },
      {
        "ayet_no": 167,
        "arbi": "وَقَالَ الَّذِيْنَ اتَّبَعُوْا لَوْ اَنَّ لَنَا كَرَّةً فَنَتَبَرَّاَ مِنْهُمْ كَمَا تَبَرَّءُوْا مِنَّا ۭ كَذٰلِكَ يُرِيْهِمُ اللّٰهُ اَعْمَالَهُمْ حَسَرٰتٍ عَلَيْهِمْ ۭ وَمَا ھُمْ بِخٰرِجِيْنَ مِنَ النَّارِ",
        "Urdu": "اورکہیں وہ لوگ جنہوں نے پیروی کی ہوگی کاش کہ بے شک ہمارے لیے ہوتا دوبارہ جانا(دنیا میں)تو ہم بھی بیزاری کااظہار کرتے ان سے جیسے انہوں نے بیزاری کااظہار کیا ہم سے اس طرح دکھائے انہیں اللہ ان کے اعمال حسرتیں(اورپیشمانی)بنا کران پر حالانکہ وہ نہیں نکل سکیں گے آگ سے ۔",
        "English": "And those who had followed shall say would that for us were a return, then would we quit ourselves of them as they have quitted themselves of us. In this wise Allah will show them their works as vain regrets; and they shall not be coming forth from the Fire."
      },
      {
        "ayet_no": 168,
        "arbi": "يٰٓاَيُّهَا النَّاسُ كُلُوْا مِمَّا فِي الْاَرْضِ حَلٰلًا طَيِّبًا   ڮ وَّلَا تَتَّبِعُوْا خُطُوٰتِ الشَّيْطٰنِ ۭ اِنَّهٗ لَكُمْ عَدُوٌّ مُّبِيْنٌ",
        "Urdu": "اے لوگو کھاؤ اس سے جو زمین میں حلال(اور)پاکیزہ چیزیں ہیں اور مت پیروی کرو شیطان کے نقش قدم کی بے شک وہ تمہارا کھلا دشمن ہے ۔",
        "English": "O mankind! Eat of that which is lawful and good on the earth, and follow not the footsteps of Shaitn (Satan) . Verily, he is to you an open enemy."
      },
      {
        "ayet_no": 169,
        "arbi": "اِنَّمَا يَاْمُرُكُمْ بِالسُّوْۗءِ وَالْفَحْشَاۗءِ وَاَنْ تَقُوْلُوْا عَلَي اللّٰهِ مَا لَا تَعْلَمُوْنَ",
        "Urdu": "درحقیقت وہ حکم دیتاہے تمہیں برائی اوربے حیائی کا اوریہ کہ تم (ایسی بات)کہو اللہ کے بارے میں جس کاتم(خود) علم نہیں رکھتے ۔",
        "English": "He only commandeth you to evil and indecency, and that ye should say against Allah that which ye know not"
      },
      {
        "ayet_no": 170,
        "arbi": "وَاِذَا قِيْلَ لَهُمُ اتَّبِعُوْا مَآ اَنْزَلَ اللّٰهُ قَالُوْا بَلْ نَتَّبِــعُ مَآ اَلْفَيْنَا عَلَيْهِ اٰبَاۗءَنَا ۭ اَوَلَوْ كَانَ اٰبَاۗؤُھُمْ لَا يَعْقِلُوْنَ شَـيْــــًٔـا وَّلَا يَهْتَدُوْنَ",
        "Urdu": "اورجب کہاجائے ان سے پیروی کرو(اس چیز کی)جونازل کی ہے اللہ نے (تو)کہتے ہیں بلکہ ہم پیروی کریں گے (اس کی)جو ہم نے پایا ہے اس پراپنے آباءواجداد کوحالانکہ کیااگرچہ ہوں ان کے آباءواجداد نہ سمجھتے کچھ(بھی) اورنہ ہی سیدھے راستے پر ہوں ۔",
        "English": "When it is said to them: :Follow what Allah has sent down, they say: :Instead, we would follow that (religion) on which we have found our fathers. Is it so, even though their fathers had no understanding at all, nor had they been on the right path ?"
      },
      {
        "ayet_no": 171,
        "arbi": "وَمَثَلُ الَّذِيْنَ كَفَرُوْا كَمَثَلِ الَّذِيْ يَنْعِقُ بِمَا لَا يَسْمَعُ اِلَّا دُعَاۗءً وَّنِدَاۗءً  ۭ ۻ بُكْمٌ عُمْيٌ فَهُمْ لَا يَعْقِلُوْنَ",
        "Urdu": "اورمثال ان لوگوں کی جنہوں نے کفر کیا(اسکی)مثال کی طرح ہے جو پکارے کسی(جانور وغیرہ)کو جونہ سنتاہوسوائے پکارنے اورچلانے(کی آواز کے)(اسی طرح یہ کافر بھی)بہرے،گونگے،اندھے ہیں پس وہ نہیں سمجھتے ۔",
        "English": "The example of (calling) those who disbelieve is such as someone is shouting at an animal that hears nothing but a call and cry. They are deaf, dumb and blind, so they do not understand"
      },
      {
        "ayet_no": 172,
        "arbi": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا كُلُوْا مِنْ طَيِّبٰتِ مَا رَزَقْنٰكُمْ وَاشْكُرُوْا لِلّٰهِ اِنْ كُنْتُمْ اِيَّاهُ تَعْبُدُوْنَ",
        "Urdu": "اے وہ لوگو جوایمان لائے ہو کھاو پاکیزہ چیزوں سے جو ہم نے دی ہیں تم کو اور اللہ کاشکر اداکرو اگرہوتم اسی کی عبادت کرتے ۔",
        "English": "O you who believe, eat of the good things We have provided to you and be grateful to Allah, if it is He whom you worship (in real terms)."
      },
      {
        "ayet_no": 173,
        "arbi": "اِنَّمَا حَرَّمَ عَلَيْكُمُ الْمَيْتَةَ وَالدَّمَ وَلَحْمَ الْخِنْزِيْرِ وَمَآ اُهِلَّ بِهٖ لِغَيْرِ اللّٰهِ ۚ فَمَنِ اضْطُرَّ غَيْرَ بَاغٍ وَّلَا عَادٍ فَلَآ اِثْمَ عَلَيْهِ ۭ اِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ",
        "Urdu": "بے شک اس نے حرام کردیا ہے تم پر مردار کواور(بہتا ہوا) خون اورخنزیر کاگوشت(بھی) اوروہ جو نام پکاراگیا ہواس پر غیراللہ کا پس جو مجبور ہوجائے،نہ سرکشی کرنے والا ہو اورنہ(حد سے)تجاوز کرنے والا ہو توکوئی گناہ نہیں اس پر بے شک اللہ بخشنے والا ،بہت مہربان ہے ۔",
        "English": "He has only prohibited for you carrion, blood, the flesh of swine and that upon which a name of someone other than 'Allah‘ has been invoked. Then, whoever is compelled by necessity, neither seeking pleasure nor transgressing, there is no sin on him. Verily, Allah is Most-Forgiving, Very-Merciful."
      },
      {
        "ayet_no": 174,
        "arbi": "اِنَّ الَّذِيْنَ يَكْتُمُوْنَ مَآ اَنْزَلَ اللّٰهُ مِنَ الْكِتٰبِ وَيَشْتَرُوْنَ بِهٖ ثَـمَنًا قَلِيْلًا ۙ اُولٰۗىِٕكَ مَا يَاْكُلُوْنَ فِيْ بُطُوْنِهِمْ اِلَّا النَّارَ وَلَا يُكَلِّمُهُمُ اللّٰهُ يَوْمَ الْقِيٰمَةِ وَلَا يُزَكِّيْهِمْ ښ وَلَهُمْ عَذَابٌ اَلِيْمٌ",
        "Urdu": "بے شک جولوگ چھپاتے ہیں اسے جو اللہ نے نازل کیا ہے (اپنی )کتاب میں اوروہ لیتے ہیں اس کے بدلے میں تھوڑی قیمت یہ لوگ نہیں بھرتے اپنے پیٹوں میں مگرآگ اورنہ بات کرے گاان سے اللہ قیامت کے دن اورنہ وہ ا نہیں پاک کرے گا اوران کے لیے دردناک عذاب ہے ۔",
        "English": "Verily, those who conceal the Book Allah has revealed, and earn thereby a small price, they eat nothing into their bellies but fire, and Allah will not speak to them on the Day of Judgment, nor will He purify them, and for them there is painful punishment."
      },
      {
        "ayet_no": 175,
        "arbi": "اُولٰۗىِٕكَ الَّذِيْنَ اشْتَرَوُا الضَّلٰلَةَ بِالْهُدٰى وَالْعَذَابَ بِالْمَغْفِرَةِ  ۚفَمَآ اَصْبَرَھُمْ عَلَي النَّارِ",
        "Urdu": "یہی لوگ ہیں جنہوں نے مول لیا گمراہی کو ہدایت کے بدلے میں اورعذاب کومغفرت کے بدلے میں توکس قدر صبر کرنے والے ہیں وہ آگ  پر ۔",
        "English": "They are those who have bought the wrong way at the price of the right way, and punishment at the price of pardon. How well they endure the Fire!"
      },
      {
        "ayet_no": 176,
        "arbi": "ذٰلِكَ بِاَنَّ اللّٰهَ نَزَّلَ الْكِتٰبَ بِالْحَـقِّ ۭ وَاِنَّ الَّذِيْنَ اخْتَلَفُوْا فِي الْكِتٰبِ لَفِيْ شِقَاقٍۢ بَعِيْدٍ",
        "Urdu": "یہ سب اس وجہ سے ہوا کہ بے شک اللہ نے نازل کی کتاب حق کے ساتھ اوربے شک جن لوگوں نے اختلاف کیا کتاب میں یقینا(وہ) بدبختی میں دور (جاپہنچے) ہیں۔",
        "English": "All that is because Allah revealed the Book with the truth. Yet, those who have opted for dissension about the Book are in extreme division (among themselves)"
      },
      {
        "ayet_no": 177,
        "arbi": "لَيْسَ الْبِرَّ اَنْ تُوَلُّوْا وُجُوْھَكُمْ قِـبَلَ الْمَشْرِقِ وَالْمَغْرِبِ وَلٰكِنَّ الْبِرَّ مَنْ اٰمَنَ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِ وَالْمَلٰۗىِٕكَةِ وَالْكِتٰبِ وَالنَّبِيّٖنَ ۚ وَاٰتَى الْمَالَ عَلٰي حُبِّهٖ ذَوِي الْقُرْبٰى وَالْيَـتٰمٰى وَالْمَسٰكِيْنَ وَابْنَ السَّبِيْلِ ۙ وَالسَّاۗىِٕلِيْنَ وَفِي الرِّقَابِ ۚ وَاَقَامَ الصَّلٰوةَ وَاٰتَى الزَّكٰوةَ  ۚ وَالْمُوْفُوْنَ بِعَهْدِهِمْ اِذَا عٰھَدُوْا  ۚ وَالصّٰبِرِيْنَ فِي الْبَاْسَاۗءِ وَالضَّرَّاۗءِ وَحِيْنَ الْبَاْسِ ۭ اُولٰۗىِٕكَ الَّذِيْنَ صَدَقُوْا ۭ وَاُولٰۗىِٕكَ ھُمُ الْمُتَّقُوْنَ",
        "Urdu": "نیکی (یہی) نہیں کہ تم پھیر لو اپنے چہرے مشرق اورمغرب کی طرف(نماز میں)اور لیکن(اصل)نیکی یہ ہے کہ جو ایمان لائے اللہ پر اورآخرت کے دن اور فرشتوں پر اورکتاب(قران مجید) اور نبیوں پر اور دے(اپنا)مال اس(اللہ)کی محبت کی خاطر قریبی رشتہ داروں اوریتیموں اور مساکین کو اورمسافروں اورمانگنے والوں کو اور گردنیں (آزاد کرنے)میں اورنماز قائم کرے اورزکوة اداکرے اورپورا کرنے والے ہوں اپنے عہد کو جب(بھی)وہ عہد کریں اورصبر کرنیوالے ہوں تنگ دستی اوربیماری میں اور جنگ کے وقت(دوران) یہی لوگ سچے ہیں اوریہی لوگ ہی پرہیزگار ہیں ۔",
        "English": "Righteousness is not (merely) that you turn your faces to the East and the West; but righteousness is that one believes in Allah and the Last Day and the angels and the Book and the Prophets, and gives wealth, despite (his) love for it, to relatives, and to orphans, the helpless, the wayfarer, and to those who ask, and (spends) in (freeing) slaves and observes the Salah (prayers) and pays Zakah___and (the act of) those who fulfill their covenant when they enter into a covenant, and, of course, those who are patient in hardship and suffering and when in battle! Those are the ones who are truthful, and those are the God-fearing."
      },
      {
        "ayet_no": 178,
        "arbi": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا كُتِبَ عَلَيْكُمُ الْقِصَاصُ فِي الْقَتْلٰي ۭ اَلْحُــرُّ بِالْحُــرِّ وَالْعَبْدُ بِالْعَبْدِ وَالْاُنْـثٰى بِالْاُنْـثٰى ۭ فَمَنْ عُفِيَ لَهٗ مِنْ اَخِيْهِ شَيْءٌ فَاتِّـبَاعٌۢ بِالْمَعْرُوْفِ وَاَدَاۗءٌ اِلَيْهِ بِاِحْسَانٍ ۭ ذٰلِكَ تَخْفِيْفٌ مِّنْ رَّبِّكُمْ وَرَحْمَـةٌ ۭ فَمَنِ اعْتَدٰى بَعْدَ ذٰلِكَ فَلَهٗ عَذَابٌ اَلِيْمٌ",
        "Urdu": "اے وہ لوگو جوایمان لائے ہوفرض کردیاگیا ہے تم پر قصاص لینا مقتولین(کے بارے)میں آزاد(قاتل)کے بدلے آزاد(ہی قتل ہوگا)اورغلام(قاتل) کے بدلے غلام(ہی قتل ہوگا)اورعورت کے بدلے عورت(ہی قتل کی جائے گی)پس جو(کہ)معاف کر دیاجائے اس کواپنے بھائی کی طرف سے کچھ بھی تو(لازم ہے اس پر)پیروی کرنا دستور کے مطابق اور ادائیگی کرے اس کواچھے طریقے سے یہ(دیت کی ادائیگی)تخفیف ہے تمہارے رب کی طرف سے اورحمت ہے پس جو زیادتی کرے اس کے بعد بھی تواس کے لیے دردناک عذاب ہے ۔",
        "English": "O you who believe, QiSaS has been prescribed for you in the case of murdered people: The freeman (will be killed) for the freeman, the slave for the slave, and the female for the female. However, if one is somewhat forgiven by his brother, the recourse (of the latter) is to pursue the former (for blood money) with fairness, and the obligation (of the former) is to pay (it) to the latter in a nice way. That is a relief from your Lord, and a mercy. So, whoever transgresses after all that will have a painful punishment."
      },
      {
        "ayet_no": 179,
        "arbi": "وَلَكُمْ فِي الْقِصَاصِ حَيٰوةٌ يّـٰٓــاُولِي الْاَلْبَابِ لَعَلَّكُمْ تَتَّقُوْنَ",
        "Urdu": "اور تمہارے لیے قصاص میں زندگی ہے اے عقل والو!تاکہ تم بچ جاؤ (اللہ کے عذاب سے)",
        "English": "There is life for you in QiSaS, O people of wisdom, so that you may refrain (from killing) ."
      },
      {
        "ayet_no": 180,
        "arbi": "كُتِبَ عَلَيْكُمْ اِذَا حَضَرَ اَحَدَكُمُ الْمَوْتُ اِنْ تَرَكَ خَيْرَۨا  ښ الْوَصِيَّةُ لِلْوَالِدَيْنِ وَالْاَقْرَبِيْنَ بِالْمَعْرُوْفِ  ۚ حَقًّا عَلَي الْمُتَّقِيْنَ",
        "Urdu": "فرض کردیاگیا ہے تم پر(کہ)جب آجائے تم میں سے کسی کو موت ،اگر وہ مال چھوڑے وصیت کرنا،والدین کے لیے اوررشتہ داروں کے لیے معروف طریقے سے (یہ)حق ہے پرہیزگاروں کے ذمے ۔",
        "English": "Prescribed unto you, when death is nigh unto one of you, if he leaveth any property, is the making of a bequest for parents and kindred equitably - a duty on the God-fearing."
      },
      {
        "ayet_no": 181,
        "arbi": "فَمَنْۢ بَدَّلَهٗ بَعْدَ مَا سَمِعَهٗ فَاِنَّمَآ اِثْمُهٗ عَلَي الَّذِيْنَ يُبَدِّلُوْنَهٗ  ۭ اِنَّ اللّٰهَ سَمِيْعٌ عَلِيْمٌ",
        "Urdu": "پس جو بدل دے اسے اس کے بعد کہ اس نے اسے سن لیا توبے شک اس کا گناہ ان پر جوتبدیل کرتے ہیں اسے بے شک اللہ خوب سننے والا جاننے والا ہے ۔",
        "English": "Then, whoever changes it after he has heard it, its sin will only be on those who change it. Surely, Allah is All-hearing, All-knowing."
      },
      {
        "ayet_no": 182,
        "arbi": "فَمَنْ خَافَ مِنْ مُّوْصٍ جَنَفًا اَوْ اِثْمًـا فَاَصْلَحَ بَيْنَهُمْ فَلَآ اِثْمَ عَلَيْهِ  ۭ اِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ",
        "Urdu": "پس جوڈرے وصیت کرنے والے سے طرف داری یا کسی گناہ سے(تو) پھر وہ اصلاح کرادے ان کے درمیان تو کوئی گناہ نہیں اس پر بے شک اللہ بخشنے والا مہربان ہے۔",
        "English": "But, whoever apprehends a mistake (unintentional) or a sin (intentional) from a testator, and puts things right between them, then there is no sin on him. Surely, Allah is Forgiving, Merciful."
      },
      {
        "ayet_no": 183,
        "arbi": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَي الَّذِيْنَ مِنْ قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُوْنَ",
        "Urdu": "اے وہ لوگو جوایمان لائے ہو فرض کیے گئے ہیں تم پرروزے جیسا کہ فرض کیے گئے ان لوگوں پر جوتم سے پہلے(تھے)تاکہ تم بچ جاؤ ( گناہوں سے ) ۔",
        "English": "O you who believe, the fasts have been enjoined upon you as they were enjoined upon those before you, so that you may be God-fearing."
      },
      {
        "ayet_no": 184,
        "arbi": "اَيَّامًا مَّعْدُوْدٰتٍ ۭ فَمَنْ كَانَ مِنْكُمْ مَّرِيْضًا اَوْ عَلٰي سَفَرٍ فَعِدَّةٌ مِّنْ اَ يَّامٍ اُخَرَ ۭ وَعَلَي الَّذِيْنَ يُطِيْقُوْنَهٗ فِدْيَةٌ طَعَامُ مِسْكِيْنٍ ۭ فَمَنْ تَطَوَّعَ خَيْرًا فَهُوَ خَيْرٌ لَهٗ ۭ وَاَنْ تَصُوْمُوْا خَيْرٌ لَّكُمْ اِنْ كُنْتُمْ تَعْلَمُوْنَ",
        "Urdu": "یہ روزے)چند دن ہیں گنتی کے، پس جوہو تم میں سے بیمار یاسفر پر تو(وہ)گنتی پورے کرے دوسرے دنوں سے اوران لوگوں پر جو طاقت رکھتے ہوں اس کی(اورنہ رکھیں)فدیہ ہے ایک مسکین کاکھانا پس جو خوشی سے کرے(زیادہ)بھلائی تووہ بہتر ہے اس کے لیے اوریہ کہ تم روزہ رکھو(تو)زیادہ بہترہے تمہارے لیے اگرہوتم جانتے ۔",
        "English": "Days numbered and few; then whosoever among you is sick or journeying, for him the like number of other days. And for those who can keep it with hardship the ransom is the feeding of a and whosoever voluntarily poor man doth good, it will be better for him; and that ye fast Will be better for you, if ye only knew."
      },
      {
        "ayet_no": 185,
        "arbi": "شَهْرُ رَمَضَان الَّذِيْٓ اُنْزِلَ فِيْهِ الْقُرْاٰنُ ھُدًى لِّلنَّاسِ وَ بَيِّنٰتٍ مِّنَ الْهُدٰى وَالْفُرْقَان ۚ فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ ۭ وَمَنْ كَانَ مَرِيْضًا اَوْ عَلٰي سَفَرٍ فَعِدَّةٌ مِّنْ اَيَّامٍ اُخَرَ ۭ يُرِيْدُ اللّٰهُ بِكُمُ الْيُسْرَ وَلَا يُرِيْدُ بِكُمُ الْعُسْرَ ۡ وَلِتُكْمِلُوا الْعِدَّةَ وَلِتُكَبِّرُوا اللّٰهَ عَلٰي مَا ھَدٰىكُمْ وَلَعَلَّكُمْ تَشْكُرُوْنَ",
        "Urdu": "رمضان کا مہینہ وہ ہے جو نازل کیاگیا ہے اس میں قران(جو)ہدایت ہے لوگوں کے لیے اورروشن دلائل ہیں ہدایت کے اور(حق وباطل کے درمیان)فرق کرنے کے پس جو موجود ہو(گھر میں)تم میں سے کوئی(اس )مہینے میں تواسے چاہیے کہ وہ روزے رکھے اس(مہینے)کے اورجوبیمار ہویاسفر پرہو توگنتی پوری کرے دوسرے دنوں سے چاہتاہے اللہ تمہارے ساتھ آسانی کرنا اوروہ نہیں چاہتا تمہارے ساتھ سختی کرنا اورتاکہ تم پوراکرلو گنتی(تعداد)کو اورتاکہ تم بڑائی بیان کرو اللہ کی اس(احسان) پرجو اس نے ہدایت دی تم کو اوراس لیے بھی تاکہ تم شکر ادا کرو ۔",
        "English": "The month of Ramadan is the one in which the Qur‘an was revealed as guidance for mankind, and as clear signs that show the right way and distinguish between right and wrong. So those of you who witness the month must fast in it. But the one who is sick, or is on a journey (should fast) as much from other days (as he missed) . Allah intends (to provide) ease for you and does not intend (to create) hardship for you. All this is so that you may complete the number (of fasts as prescribed) and proclaim the Takbir of Allah for having guided you, and (so) that you may be grateful."
      },
      {
        "ayet_no": 186,
        "arbi": "وَاِذَا سَاَلَكَ عِبَادِيْ عَنِّىْ فَاِنِّىْ قَرِيْبٌ ۭ اُجِيْبُ دَعْوَةَ الدَّاعِ اِذَا دَعَانِ ۙفَلْيَسْتَجِيْبُوْا لِيْ وَلْيُؤْمِنُوْابِيْ لَعَلَّهُمْ يَرْشُدُوْنَ",
        "Urdu": "اورجب آپ سے پوچھیں میرے بندے میرے بارے میں تو(بتادیں)بے شک میں قریب ہوں میں قبول کرتاہوں دعاکرنے والے کی پکار کو جب وہ مجھے پکارے پس چاہیے کہ (سب لوگ)حکم مانیں میرا اورچاہیے کہ وہ ایمان لائیں مجھ پر تاکہ وہ راہ راست پا لیں ۔",
        "English": "When My servants ask you about Me, then (tell them that) I am near. I respond to the call of one when he prays to Me; so they should respond to Me, and have faith in Me, so that they may be on the right path."
      },
      {
        "ayet_no": 187,
        "arbi": "اُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ اِلٰى نِسَاۗىِٕكُمْ ۭ ھُنَّ لِبَاسٌ لَّكُمْ وَاَنْتُمْ لِبَاسٌ لَّهُنَّ ۭعَلِمَ اللّٰهُ اَنَّكُمْ كُنْتُمْ تَخْتَانُوْنَ اَنْفُسَكُمْ فَتَابَ عَلَيْكُمْ وَعَفَا عَنْكُمْ ۚ فَالْئٰنَ بَاشِرُوْھُنَّ وَابْتَغُوْا مَا كَتَبَ اللّٰهُ لَكُمْ ۠وَكُلُوْا وَاشْرَبُوْا حَتّٰى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الْاَبْيَضُ مِنَ الْخَيْطِ الْاَسْوَدِ مِنَ الْفَجْرِ ۠ ثُمَّ اَتِمُّوا الصِّيَامَ اِلَى الَّيْلِ ۚ وَلَا تُـبَاشِرُوْھُنَّ وَاَنْتُمْ عٰكِفُوْنَ ۙ فِي الْمَسٰجِدِ ۭ تِلْكَ حُدُوْدُ اللّٰهِ فَلَا تَقْرَبُوْھَا ۭ كَذٰلِكَ يُبَيِّنُ اللّٰهُ اٰيٰتِهٖ لِلنَّاسِ لَعَلَّهُمْ يَتَّقُوْنَ",
        "Urdu": "اورحلال کردیاگیا ہے تمہارے لیے روزوں کی رات بے حجاب ہونااپنی عورتوں(بیویوں) سے وہ لباس ہیں تمہارے لیے اورتم لباس ہوان کے لیے اللہ جان چکا ہے کہ بے شک تم خیانت کر لیتے تھے اپنے آپ سے تواس نے رجوع کیا (مہربانی) تم پر اوردرگزر کردیاتم سے پس اب تم مباشرت کرسکتے ہو ان سے اورخواہش رکھو(اس کی)جو(مقدر میں)لکھ رکھا ہے اللہ نے تمہارے لیے (لڑکا یالڑکی)اورکھاو اورپیو یہاں تک کہ نمایاں ہوجائے تمہارے لیے(صبح کی)سفید دھاری(رات کی)کالی دھاری سے فجر کو پھر تم پورا کرو روزے کو رات تک اورمت مباشرت کرو ان سے اس حال میں کہ تم اعتکاف میں ہو مساجد میں یہ اللہ کی(مقررہ کردہ)حدیں ہیں توتم قریب مت جاؤ ان کے،اسی طرح اللہ کھول کھول کر بیان کرتاہے اپنے احکام لوگوں کے لیے تاکہ وہ (خلاف ورزی سے)بچے رہیں ۔",
        "English": "It is made lawful for you, in the nights of fasts, to have sex with your women. They are apparel for you, and you are apparel for them. Allah knows that you have been betraying yourselves, so He relented towards you and pardoned you. So now you can have sexual intimacy with them and seek what Allah has destined for you and eat and drink until the white thread of the dawn becomes distinct from the black thread; then complete the fast up to the night. But do not have sexual intimacy with them while you are staying in mosques for Itikaf. These are the limits set by Allah, so do not go near them. Thus Allah manifests His signs to the people, so that they may be God-fearing."
      },
      {
        "ayet_no": 188,
        "arbi": "وَلَا تَاْكُلُوْٓا اَمْوَالَكُمْ بَيْنَكُمْ بِالْبَاطِلِ وَتُدْلُوْا بِهَآ اِلَى الْحُكَّامِ لِتَاْكُلُوْا فَرِيْقًا مِّنْ اَمْوَالِ النَّاسِ بِالْاِثْمِ وَاَنْتُمْ تَعْلَمُوْنَ",
        "Urdu": "اورتم مت کھاو اپنے مال اپنے درمیان(آپس میں)ناحق طریقے سے اور(نہ)پہنچاو ان کوحکام تک تاکہ تم کھاجاؤ ایک حصہ لوگوں کے اموال سے گناہ (یعنی ناجائز طریقے) سے حالانکہ تم جانتے ہو۔",
        "English": "Do not eat up each other‘s property by false means, nor approach with it the authorities to eat up a portion of the property of the people sinfully, while you know ( that you are unjust in doing so )."
      },
      {
        "ayet_no": 189,
        "arbi": "يَسْــَٔـلُوْنَكَ عَنِ الْاَهِلَّةِ ۭ قُلْ ھِىَ مَوَاقِيْتُ لِلنَّاسِ وَالْحَجِّ  ۭ وَلَيْسَ الْبِرُّ بِاَنْ تَاْتُوا الْبُيُوْتَ مِنْ ظُهُوْرِھَا وَلٰكِنَّ الْبِرَّ مَنِ اتَّقٰى ۚ وَاْتُوا الْبُيُوْتَ مِنْ اَبْوَابِهَا  ۠ وَاتَّقُوا اللّٰهَ لَعَلَّكُمْ تُفْلِحُوْنَ",
        "Urdu": "وہ پوچھتے ہیں آپ سے نئے چاندوں کے بارے میں آپ کہہ دیجیے یہ لوگوں کے لیے اوقات اورحج کے(تعین کاذریعہ ہیں)اور نیکی (یہ) نہیں کہ تم آؤ گھروں کوان کی پشت سے اورلیکن نیکی(اسکی)ہے جو(برائی سے) بچا رہے اور آؤ تم گھروں میں ان کے دروازوں سے اوراللہ سے ڈرتے رہو تاکہ تم فلاح پا جاؤ",
        "English": "They ask you about the new moons. Say: They are indicative of time for the people, and of the Hajj. It is not righteousness that you come into your houses from their backs, but righteousness is that one fears Allah. So come into houses through their doors; and fear Allah so that you may be successful."
      },
      {
        "ayet_no": 190,
        "arbi": "وَقَاتِلُوْا فِيْ سَبِيْلِ اللّٰهِ الَّذِيْنَ يُقَاتِلُوْنَكُمْ وَلَا تَعْتَدُوْا ۭ اِنَّ اللّٰهَ لَا يُحِبُّ الْمُعْتَدِيْنَ",
        "Urdu": "اورتم جنگ کرو اللہ کی راہ میں ان لوگوں سے جو جنگ کرتے ہیں تم سے اورنہ تم زیادتی کرو بے شک اللہ نہیں پسند فرماتا زیادتی کرنے والوں کو ۔",
        "English": "Fight in the way of Allah against those who fight you, and do not transgress. Verily, Allah does not like the transgressors."
      },
      {
        "ayet_no": 191,
        "arbi": "وَاقْتُلُوْھُمْ حَيْثُ ثَقِفْتُمُوْھُمْ وَاَخْرِجُوْھُمْ مِّنْ حَيْثُ اَخْرَجُوْكُمْ وَالْفِتْنَةُ اَشَدُّ مِنَ الْقَتْلِ ۚ وَلَا تُقٰتِلُوْھُمْ عِنْدَ الْمَسْجِدِ الْحَرَامِ حَتّٰى يُقٰتِلُوْكُمْ فِيْهِ ۚ فَاِنْ قٰتَلُوْكُمْ فَاقْتُلُوْھُمْ ۭكَذٰلِكَ جَزَاۗءُ الْكٰفِرِيْنَ",
        "Urdu": "اورا نہیں قتل کروجہاں بھی تم پاؤ ان کو اورنکال دو انہیں جہاں سے انہوں نے نکالا تمہیں (مکہ سے)اور فتنہ زیادہ برا ہے قتل سے اور مت جنگ کرو ان سے مسجد حرام کے قریب یہاں تک کہ وہ (خود)جنگ کریں تم سے اس میں پھر اگر وہ تم سے جنگ کریں توتم قتل کرو ا نہیں یہی سزا ہے کافروں کی ( قتل یااخراج ) ۔",
        "English": "Kill them wherever you find them, and drive them out from where they drove you out, as Fitnah (to create disorder) is more severe than killing. However, do not fight them near Al-Masjid-ul-Haram (the Sacred Mosque in Makkah) unless they fight you there. However, if they fight you (there) you may kill them. Such is the reward of the disbelievers."
      },
      {
        "ayet_no": 192,
        "arbi": "فَاِنِ انْتَهَوْا فَاِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ",
        "Urdu": "پھراگروہ باز آجائیں(لڑائی سے)توبے شک اللہ بخشنے والابہت مہربان ہے ۔",
        "English": "But if they desist, then indeed, Allah is Most-Forgiving, Very- Merciful."
      },
      {
        "ayet_no": 193,
        "arbi": "وَقٰتِلُوْھُمْ حَتّٰى لَا تَكُوْنَ فِتْنَةٌ وَّيَكُوْنَ الدِّيْنُ لِلّٰهِ ۭ فَاِنِ انْتَهَوْا فَلَا عُدْوَانَ اِلَّا عَلَي الظّٰلِمِيْنَ",
        "Urdu": "اورجنگ کرو ان سے یہاں تک کہ نہ (باقی)رہے کوئی فتنہ(شرک وظلم)اور ہوجائے دین اللہ کے لیے پھراگر وہ باز آجائیں توکوئی زیادتی(روا) نہیں مگر ظالموں پر۔",
        "English": "Fight them until there is no Fitnah any more, and obedience remains for Allah. But, if they desist, then aggression is not allowed except against the transgressors."
      },
      {
        "ayet_no": 194,
        "arbi": "اَلشَّهْرُ الْحَرَامُ بِالشَّهْرِ الْحَرَامِ وَالْحُرُمٰتُ قِصَاصٌ ۭ فَمَنِ اعْتَدٰى عَلَيْكُمْ فَاعْتَدُوْا عَلَيْهِ بِمِثْلِ مَا اعْتَدٰى عَلَيْكُمْ ۠ وَاتَّقُوا اللّٰهَ وَاعْلَمُوْٓا اَنَّ اللّٰهَ مَعَ الْمُتَّقِيْنَ",
        "Urdu": "ماہ حرام(کی پابندی)ہے ماہ حرام (کی پابندی)کے بدلے اورتمام حرمتوں میں برابر کابدلہ ہے پھرجوزیادتی کرے تم پرتوتم بھی زیادتی کرو اس پراس کی مثل جو(جتنی)اس نے زیادتی کی تم پراوراللہ سے ڈر جاؤ اور جان لو کہ بے شک اللہ پرہیزگاروں کے ساتھ ہے ۔",
        "English": "The holy month for the holy month, and the sanctities are subject to retribution. So when anyone commits aggression against you, be aggressive against him in the like manner as he did against you, and fear Allah, and be sure that Allah is with the God-fearing."
      },
      {
        "ayet_no": 195,
        "arbi": "وَاَنْفِقُوْا فِيْ سَبِيْلِ اللّٰهِ وَلَا تُلْقُوْا بِاَيْدِيْكُمْ اِلَى التَّهْلُكَةِ ٻوَاَحْسِنُوْا ڔ اِنَّ اللّٰهَ يُحِبُّ الْمُحْسِنِيْنَ",
        "Urdu": "اورخرچ کرو اللہ کی راہ اور(اپنے آپ کو)مت ڈالو اپنے ہاتھوں سے ہلاکت میں اوراحسان کرو،بے شک اللہ محبت رکھتاہے احسان کرنے والوں سے ۔",
        "English": "Spend in the way of Allah and do not put yourselves into destruction, and do good. Of course, Allah loves those who do good."
      },
      {
        "ayet_no": 196,
        "arbi": "وَاَتِمُّوا الْحَجَّ وَالْعُمْرَةَ لِلّٰهِ ۭ فَاِنْ اُحْصِرْتُمْ فَمَا اسْتَيْسَرَ مِنَ الْهَدْيِ ۚ وَلَا تَحْلِقُوْا رُءُوْسَكُمْ حَتّٰى يَبْلُغَ الْهَدْيُ مَحِلَّهٗ  ۭ فَمَنْ كَانَ مِنْكُمْ مَّرِيْضًا اَوْ بِهٖٓ اَذًى مِّنْ رَّاْسِهٖ فَفِدْيَةٌ مِّنْ صِيَامٍ اَوْ صَدَقَةٍ اَوْ نُسُكٍ ۚ فَاِذَآ اَمِنْتُمْ     ۪ فَمَنْ تَمَتَّعَ بِالْعُمْرَةِ اِلَى الْحَجِّ فَمَا اسْتَيْسَرَ مِنَ الْهَدْيِ ۚ فَمَنْ لَّمْ يَجِدْ فَصِيَامُ ثَلٰثَةِ اَيَّامٍ فِي الْحَجِّ وَسَبْعَةٍ اِذَا رَجَعْتُمْ   ۭتِلْكَ عَشَرَةٌ كَامِلَةٌ ۭ ذٰلِكَ لِمَنْ لَّمْ يَكُنْ اَھْلُهٗ حَاضِرِي الْمَسْجِدِ الْحَرَامِ ۭ وَاتَّقُوا اللّٰهَ وَاعْلَمُوْٓا اَنَّ اللّٰهَ شَدِيْدُ الْعِقَابِ",
        "Urdu": "اورپورا کرو حج اورعمرہ اللہ کے لیے پھراگر تم روکے جاؤ(بیماری یادشمن کی وجہ سے)توجومیسر ہو قربانی (کرلو) اور نہ منڈواؤ اپنے سریہاں تک کہ پہنچ جائے قربانی اپنی جگہ پر پس جوہوتم میں سے بیمار یااس کو تکلیف ہواس کے سر میں تو(بطور)فدیہ روزے رکھے یاصدقہ دے یاقربانی کرے پھرجب تمہیں امن نصیب ہوتو جوفائدہ اٹھائے عمرہ کرنے کاحج(کے آنے)تک توجو میسرہو قربانی(ذبح کرے) پس جو(قربانی)نہ پائے تو روزے رکھے تین دن(ایام)حج میں اورسات(دن)جب تم (گھر)لوٹو یہ مکمل دس ہوئے یہ اس کے لیے ہے جو(کہ)نہ ہوں گھروالے اس کے مسجد حرام(مکہ)کے پاس رہنے والے اوراللہ سے ڈر جاؤ اورجان لو کہ بے شک اللہ سخت سزادینے والا ہے ۔",
        "English": "And perform properly (i.e. all the ceremonies according to the ways of Prophet Muhammad ) , the Hajj and 'Umrah (i.e. the pilgrimage to Makkah) forAllah. But if you are prevented (from completing them) , sacrifice a Hady (animal, i.e. a sheep, a cow, or a camel, etc.) such as you can afford, and do not shave your heads until the Hady reaches the place of sacrifice. And whosoever of you is ill or has an ailment in his scalp (necessitating shaving) , he must pay a Fidyah (ransom) of either observing Saum (fasts) (three days) or giving Sadaqah (charity - feeding six poor persons) or offering sacrifice (one sheep) . Then if you are in safety and whosoever performs the 'Umrah in the months of Hajj, before (performing) the Hajj, (i.e. Hajj-at-Tamattu' and Al-Qirn) , he must slaughter a Hady such as he can afford, but if he cannot afford it, he should observe Saum (fasts) three days during the Hajj and seven days after his return (to his home) , making ten days in all. This is for him whose family is not present at Al-Masjid-al-Harm (i.e. non-resident of Makkah) . And fearAllah much and know thatAllah is Severe in punishment."
      },
      {
        "ayet_no": 197,
        "arbi": "اَلْحَجُّ اَشْهُرٌ مَّعْلُوْمٰتٌ ۚ فَمَنْ فَرَضَ فِيْهِنَّ الْحَجَّ فَلَا رَفَثَ وَلَا فُسُوْقَ ۙوَلَا جِدَالَ فِي الْحَجِّ ۭ وَمَا تَفْعَلُوْا مِنْ خَيْرٍ يَّعْلَمْهُ اللّٰهُ    ڼوَتَزَوَّدُوْا فَاِنَّ خَيْرَ الزَّادِ التَّقْوٰى ۡ وَاتَّقُوْنِ يٰٓاُولِي الْاَلْبَابِ",
        "Urdu": "حج کے مہینے جانے پہچانے ہیں پس جو عزم کرے ان (مہینوں)میں حج کا تو(جائز) نہیں شہوت کی باتیں اورنہ برے کام اورنہ لڑائی جھگڑا حج میں اور جوتم کروگے بھلائی کے کام جان لے گا اسے اللہ اورزاد راہ ساتھ لے لیاکرو پس بے شک بہترین زادراہ تو پرہیزگاری ہے اور مجھ سے ڈرتے رہو اے عقل والو! ۔",
        "English": "The season of Pilgrimage is the months known; wherefore whosoever ordaineth unto himself the pilgrimage therein, there is no lewdness nor wickedness nor wrangling during the pilgrimage, and whatsoever of good ye do, Allah shall know it. And take provision for the journey, for verily the best provision is abstainment; and fear Me, O men of understanding!"
      },
      {
        "ayet_no": 198,
        "arbi": "لَيْسَ عَلَيْكُمْ جُنَاحٌ اَنْ تَبْتَغُوْا فَضْلًا مِّنْ رَّبِّكُمْ ۭ فَاِذَآ اَفَضْتُمْ مِّنْ عَرَفٰتٍ فَاذْكُرُوا اللّٰهَ عِنْدَ الْمَشْعَرِ الْحَرَامِ ۠ وَاذْكُرُوْهُ كَمَا ھَدٰىكُمْ ۚ وَاِنْ كُنْتُمْ مِّنْ قَبْلِهٖ لَمِنَ الضَّاۗلِّيْنَ",
        "Urdu": "نہیں ہے تم پر کوئی گناہ یہ کہ تم تلاش کرو فضل(رزق)اپنے رب کا پھر جب تم لوٹو عرفات سے توذکر کرو اللہ کا مشعر حرام (مزدلفہ)پہنچ کر اور اس کاذکر کرو(اس طرح)جیسے اس نے ہدایت کی ہے تمہیں اوراگرچہ تم تھے اس سے قبل یقینا گمراہوں میں سے ۔",
        "English": "No fault it is in you if ye seek grace from your Lord. Then when ye hurry from Arafat, remember Allah near the sacred monument. Remember Him as He hath guided you, and ye were afore of the erring."
      },
      {
        "ayet_no": 199,
        "arbi": "ثُمَّ اَفِيْضُوْا مِنْ حَيْثُ اَفَاضَ النَّاسُ وَاسْتَغْفِرُوا اللّٰهَ  ۭاِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ",
        "Urdu": "پھر(اے قریش!وہاں سے)تم لوٹو جہاں سے لوگ لوٹتے ہیں اوراللہ سے معافی مانگو بے شک اللہ بخشنے والا مہربان ہے ۔",
        "English": "Then flow down from where the people flow, and seek forgiveness from Allah. Certainly Allah is Most-Forgiving, Very-Merciful."
      },
      {
        "ayet_no": 200,
        "arbi": "فَاِذَا قَضَيْتُمْ مَّنَاسِكَكُمْ فَاذْكُرُوا اللّٰهَ كَذِكْرِكُمْ اٰبَاۗءَكُمْ اَوْ اَشَدَّ ذِكْرًا ۭ فَمِنَ النَّاسِ مَنْ يَّقُوْلُ رَبَّنَآ اٰتِنَا فِي الدُّنْيَا وَمَا لَهٗ فِي الْاٰخِرَةِ مِنْ خَلَاقٍ",
        "Urdu": "پھر جب تم ادا کرچکو اپنے مناسک(حج) تویاد کرو اللہ کو جیسے یاد کیاکرتے تھے تم اپنے آباءواجداد کو یا اس سے بڑھ کریاد کرو تو لوگوں میں سے (کچھ ایسے ہیں)جو کہتے ہیں کہ اے ہمارے رب ہمیں دے دے دنیا میں (سب کچھ)اور نہیں ہے اس کے لیے آخرت میں کوئی حصہ ۔",
        "English": "And when ye have completed Your rites, remember Allah even as ye remember your fathers or with a stronger remembrance. Of mankind there are some who say: our Lord vouchsafe unto us in, the world. And for such there shall be no portion in the Hereafter."
      },
      {
        "ayet_no": 201,
        "arbi": "وَمِنْهُمْ مَّنْ يَّقُوْلُ رَبَّنَآ اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَّفِي الْاٰخِرَةِ حَسَـنَةً وَّقِنَا عَذَابَ النَّارِ",
        "Urdu": "اور ان میں سے کچھ( ایسے ہیں) جوکہتے ہیں اے ہمارے رب ہمیں دے دنیا میں بھلائی اورآخرت میں(بھی)بھلائی اور ہمیں بچا لے آگ کے عذاب سے ۔",
        "English": "And of mankind are some who say: our Lord! vouchsafe unto us good in the world and good in the Hereafter,and save us from the torment of the Fire."
      },
      {
        "ayet_no": 202,
        "arbi": "اُولٰۗىِٕكَ لَهُمْ نَصِيْبٌ مِّمَّا كَسَبُوْا ۭ وَاللّٰهُ سَرِيْعُ الْحِسَابِ",
        "Urdu": "یہی وہ لوگ ہیں کہ ان کے لیے حصہ ہے اس سے جوانہوں نے کمایا اوراللہ بہت جلد حساب چکادینے والا ہے ۔",
        "English": "These! for them will be a share for that which they have earned. and Allah is swift at reckoning."
      },
      {
        "ayet_no": 203,
        "arbi": "وَاذْكُرُوا اللّٰهَ فِيْٓ اَ يَّامٍ مَّعْدُوْدٰتٍ ۭ فَمَنْ تَعَـجَّلَ فِيْ يَوْمَيْنِ فَلَآ اِثْمَ عَلَيْهِ ۚ وَمَنْ تَاَخَّرَ فَلَآ اِثْمَ عَلَيْهِ ۙ لِمَنِ اتَّقٰى ۭ وَاتَّقُوا اللّٰهَ وَاعْلَمُوْٓا اَنَّكُمْ اِلَيْهِ تُحْشَرُوْنَ",
        "Urdu": "اوریاد کرو اللہ کوگنتی کے چند دنوں میں پس جو جلدی کرے دودنوں میں (اور واپس ہوجائے) توکوئی گناہ نہیں اس پر اور جو(کچھ)تاخیر کردے تو کوئی گناہ نہیں اس پر(یہ رعایت)اس کے لیے ہے جو پرہیز گاری اختیار کرے اوراللہ سے ڈرو اور جان لو کہ بے شک تم اسی کی طرف اکٹھے کیے جاؤ گے ۔",
        "English": "And remember Allah on the days numbered. Then whosoever hastenoth in two days on him is no sin, and whosoever delayeth, On him is no sin: this for him: who feareth. So fear Allah, and know that verily unto Him shall ye be gathered."
      },
      {
        "ayet_no": 204,
        "arbi": "وَمِنَ النَّاسِ مَنْ يُّعْجِبُكَ قَوْلُهٗ فِي الْحَيٰوةِ الدُّنْيَا وَيُشْهِدُ اللّٰهَ عَلٰي مَا فِيْ قَلْبِهٖ ۙ وَھُوَ اَلَدُّ الْخِصَامِ",
        "Urdu": "اور لوگوں میں سے (کوئی ایسابھی ہے) جو (کہ)بھلی لگتی ہے آپ کواس کی بات دنیا کی زندگی میں اوروہ گواہ بناتاہے اللہ کو اس پرجو اس کے دل میں ہے حالانکہ وہ سخت جھگڑالو ہے ۔",
        "English": "And of mankind is he whose discourse for the purpose of this world thou admirest, and he taketh Allah to witness as to that which is in his heart, whereas he is the most contentious of the adversaries."
      },
      {
        "ayet_no": 205,
        "arbi": "وَاِذَا تَوَلّٰى سَعٰى فِي الْاَرْضِ لِيُفْسِدَ فِيْهَا وَيُهْلِكَ الْحَرْثَ وَالنَّسْلَ ۭ وَاللّٰهُ لَا يُحِبُّ الْفَسَادَ",
        "Urdu": "اورجب وہ( فضول باتیں کرکے) لوٹتا ہے (یااسے حکومت ملتی ہے) کوشش کرتاہے زمین میں تاکہ وہ فساد پھیلائے اس میں اورتباہ کرے کھیتی اورنسل(انسانی)کو اوراللہ فساد کو پسند نہیں کرتا ۔",
        "English": "And when he turns away (from you 'O Muhammad' ) , his effort in the land is to make mischief therein and to destroy the crops and the cattle, andAllah likes not mischief."
      },
      {
        "ayet_no": 206,
        "arbi": "وَاِذَا قِيْلَ لَهُ اتَّقِ اللّٰهَ اَخَذَتْهُ الْعِزَّةُ بِالْاِثْمِ فَحَسْبُهٗ جَهَنَّمُ ۭ وَلَبِئْسَ الْمِهَادُ",
        "Urdu": "اورجب کہاجائے اس سے کہ اللہ سے ڈر (تو)پکڑ لیتاہے(جمادیتاہے)اسے غرور گناہ پر پس کافی ہے اسے جہنم اوریقینا وہ برا ٹھکانہ ہے ۔",
        "English": "And when it said unto him: fear Allah, arrogance taketh him to sin. Enough for him is Hell: surely an ill resort ! ."
      },
      {
        "ayet_no": 207,
        "arbi": "وَمِنَ النَّاسِ مَنْ يَّشْرِيْ نَفْسَهُ ابْـتِغَاۗءَ مَرْضَاتِ اللّٰهِ ۭ وَاللّٰهُ رَءُوْفٌۢ بِالْعِبَادِ",
        "Urdu": "اور لوگوں میں سے (کوئی ایسابھی ہے)جو بیچ ڈالتا ہے اپنی جان کواللہ کی خوشنودی چاہتے ہوئے اوراللہ بہت مہربان ہے ( اپنے ) بندوں پر ۔",
        "English": "And of mankind is he who selleth his life even, seeking the pleasure of Allah; and Allah is Tender unto His bond men"
      },
      {
        "ayet_no": 208,
        "arbi": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوا ادْخُلُوْا فِي السِّلْمِ كَاۗفَّةً   ۠وَلَا تَتَّبِعُوْا خُطُوٰتِ الشَّيْطٰنِ ۭ اِنَّهٗ لَكُمْ عَدُوٌّ مُّبِيْنٌ",
        "Urdu": "اے وہ لوگو جوایمان لائے ہو داخل ہوجاؤ اسلام میں پورے پورے اور مت پیروی کرو شیطان کے نقش قدم کی بے شک وہ تمہارا کھلا دشمن ہے ۔",
        "English": "O you who believe! Enter perfectly in Islm (by obeying all the rules and regulations of the Islmic religion) and follow not the footsteps of Shaitn (Satan) . Verily! He is to you a plain enemy."
      },
      {
        "ayet_no": 209,
        "arbi": "فَاِنْ زَلَلْتُمْ مِّنْۢ بَعْدِ مَا جَاۗءَتْكُمُ الْبَيِّنٰتُ فَاعْلَمُوْٓا اَنَّ اللّٰهَ عَزِيْزٌ حَكِيْمٌ",
        "Urdu": "پھر اگر تم پھسل گئے اس کے بعد کہ آچکی ہیں تمہارے پاس کھلی نشانیاں تو جان لو کہ بے شک اللہ زبردست حکمت والا ہے ۔",
        "English": "Wherefore if ye slip after that which hath come unto you of the evidence then - know that Allah is Mighty, Wise."
      },
      {
        "ayet_no": 210,
        "arbi": "ھَلْ يَنْظُرُوْنَ اِلَّآ اَنْ يَّاْتِيَهُمُ اللّٰهُ فِيْ ظُلَلٍ مِّنَ الْغَمَامِ وَالْمَلٰۗىِٕكَةُ وَقُضِيَ الْاَمْرُ ۭ وَاِلَى اللّٰهِ تُرْجَعُ الْاُمُوْرُ",
        "Urdu": "نہیں وہ انتظار کررہے مگر(اس بات کا)کہ آئے ان کے پاس اللہ بادلوں کے سائبانوں میں اورفرشتے(بھی آئیں)اورکام تمام کردیاجائے اوراللہ کی طرف لوئے جائیں گے تمام معاملات۔",
        "English": "Await they only that Allah shall come unto them in the shadows of the Clouds,and also the angels, and the affair is decreed! And unto Allah are all affairs returned."
      },
      {
        "ayet_no": 211,
        "arbi": "سَلْ بَنِىْٓ اِسْرَاۗءِ يْلَ كَمْ اٰتَيْنٰھُمْ مِّنْ اٰيَةٍۢ بَيِّنَةٍ  ۭ وَمَنْ يُّبَدِّلْ نِعْمَةَ اللّٰهِ مِنْۢ بَعْدِ مَا جَاۗءَتْهُ فَاِنَّ اللّٰهَ شَدِيْدُ الْعِقَابِ",
        "Urdu": "اے نبی صلی اللہ علیہ وسلم)پوچھیے بنی اسرائیل سے کتنی ہم نے دی ہیں انہیں کھلی نشانیاں اور جو بدل دے اللہ کی نعمت کو اس کے بعد کہ وہ آئی اس کے پاس تو بے شک اللہ سخت سزا دینے والا ہے ۔",
        "English": "Ask thou the Children of Isra'il, how many a manifest sign We brought unto them. And whosoever altereth the favour of Allah after it hath come unto him, then verily Allah is severe in Chastising."
      },
      {
        "ayet_no": 212,
        "arbi": "زُيِّنَ لِلَّذِيْنَ كَفَرُوا الْحَيٰوةُ الدُّنْيَا وَيَسْخَرُوْنَ مِنَ الَّذِيْنَ اٰمَنُوْا ۘ وَالَّذِيْنَ اتَّقَوْا فَوْقَهُمْ يَوْمَ الْقِيٰمَةِ  ۭ وَاللّٰهُ يَرْزُقُ مَنْ يَّشَاۗءُ بِغَيْرِ حِسَابٍ",
        "Urdu": "خوش نما بنادی گئی ان لوگوں کے لیے جنہوں نے کفر کیا دنیاوی زندگی اوروہ مذاق کرتے ہیں ان لوگوں سے جو ایمان لائے حالانکہ جن لوگوں نے تقوی اختیار کیا ہوگاوہ ان سے بالاتر ہوں گے قیامت کے دن اوراللہ رزق دیتا ہے جسے چاہتاہے بغیر حساب کے ۔",
        "English": "Fair-seeming is made the life of the world unto those who disbelieve, and they scoff at those who believe, whereas those who fear God shall be above them on the Day of Resurrection. And Allah provideth whomsoever He listeth without reckoning."
      },
      {
        "ayet_no": 213,
        "arbi": "كَانَ النَّاسُ اُمَّةً وَّاحِدَةً    ۣ  فَبَعَثَ اللّٰهُ النَّبِيّٖنَ مُبَشِّرِيْنَ وَمُنْذِرِيْنَ  ۠ وَاَنْزَلَ مَعَهُمُ الْكِتٰبَ بِالْحَقِّ لِيَحْكُمَ بَيْنَ النَّاسِ فِـيْمَا اخْتَلَفُوْا فِيْهِ  ۭ وَمَا اخْتَلَفَ فِيْهِ اِلَّا الَّذِيْنَ اُوْتُوْهُ مِنْۢ بَعْدِ مَا جَاۗءَتْهُمُ الْبَيِّنٰتُ بَغْيًۢـا بَيْنَهُمْ ۚفَهَدَى اللّٰهُ الَّذِيْنَ اٰمَنُوْا لِمَا اخْتَلَفُوْا فِيْهِ مِنَ الْحَقِّ بِاِذْنِهٖ ۭ وَاللّٰهُ يَهْدِيْ مَنْ يَّشَاۗءُ اِلٰى صِرَاطٍ مُّسْتَـقِيْمٍ",
        "Urdu": "لوگ ایک امت تھے(یعنی توحید پرتھے)(پھر ان میں اختلاف ہوا) تو اللہ نے نبی بھیجے (جو)خوش خبری دینے والے اور ڈرانے والے تھے اوراتاری ان کے ساتھ کتاب حق کے ساتھ تاکہ وہ فیصلہ کرے لوگوں کے درمیان ان باتوں میں جو کہ انہوں نے اختلاف کیا اس میں اور نہیں اختلاف کیااس(کتاب) میں مگر وہ لوگ جو دیے گئے وہ(کتاب)اس کے بعد کہ آگئے ان کے پاس واضح دلائل ان کے درمیان ضد کی وجہ سے تو اللہ نے ہدایت دی ان لوگوں کوجوایمان لائے(محمد صلی اللہ علیہ وسلم پر)ان حق کی باتوں میں جن میں انہوں نے اختلاف کیا اپنے حکم(مہربانی)سے اوراللہ ہدایت دیتا ہے جسے چاہتا ہے سیدھے راستے کی طرف ۔",
        "English": "Mankind was one community; thereafter Allah raised prophets as bearers of glad tidings and warners, as He sent down the Book With truth that He may judge between mankind in that wherein they disputed. And none differed therein save those unto whom it was vouchsafed after the evidences had come to them, out of spite among themselves; then Allah guided those who believed unto the truth of that regarding which they differed, by His leave. Allah guideth whomsoever He listeth unto a path straight."
      },
      {
        "ayet_no": 214,
        "arbi": "اَمْ حَسِبْتُمْ اَنْ تَدْخُلُوا الْجَنَّةَ وَلَمَّا يَاْتِكُمْ مَّثَلُ الَّذِيْنَ خَلَوْا مِنْ قَبْلِكُمْ ۭ مَسَّتْهُمُ الْبَاْسَاۗءُ وَالضَّرَّاۗءُ وَزُلْزِلُوْا حَتّٰى يَقُوْلَ الرَّسُوْلُ وَالَّذِيْنَ اٰمَنُوْا مَعَهٗ مَتٰى نَصْرُ اللّٰهِ  ۭ اَلَآ اِنَّ نَصْرَ اللّٰهِ قَرِيْبٌ",
        "Urdu": "کیا تم نے یہ سمجھ لیا کہ تم جنت میں داخل ہوجاؤ گے حالانکہ ابھی تک نہیں آئے تم پر(حالات)ان لوگوں جیسے جو گزرچکے ہیں تم سے پہلے پہنچی ان کوتنگ دستی اور مصیبت اوروہ ہلا کے رکھ دیے گئے یہاں تک کہ پکاراٹھا رسول اور وہ لوگ جوایمان لائے اس پرکب(آئے گی)اللہ کی مدد(جواب ملا)سن لو بے شک اللہ کی مدد قریب ہے ۔",
        "English": "Deem ye that ye will enter the Garden while ye hath not come upon you the like of that which came upon those who have passed away before you There touched them adversity and distress, and shaken were they, until the apostle and those who believed with him said; when cometh the succour of Allah! Lo! verily Allah's succour is nigh."
      },
      {
        "ayet_no": 215,
        "arbi": "يَسْــَٔـلُوْنَكَ مَاذَا يُنْفِقُوْنَ ڛ قُلْ مَآ اَنْفَقْتُمْ مِّنْ خَيْرٍ فَلِلْوَالِدَيْنِ وَالْاَقْرَبِيْنَ وَالْيَتٰمٰى وَالْمَسٰكِيْنِ وَابْنِ السَّبِيْلِ ۭ وَمَا تَفْعَلُوْا مِنْ خَيْرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيْمٌ",
        "Urdu": "وہ آپ سے پوچھتے ہیں کیاخرچ کریں کہہ دیں جوتم خرچ کرو مال میں سے تو وہ والدین کے لیے ہے اورقریبی رشتہ داروں اوریتیموں اورمسکینوں اورمسافروں کے لیے ہے اورجو(بھی)تم کرتے ہوکوئی بھلائی توبے شک اللہ اس کوخوب جانتا ہے ۔",
        "English": "They ask thee regarding whatsoever they shall expend. Say thou: whatsoever ye expend of wealth, let it be for the parents and kindred and orphans and the needy and the wayfarer and whatever good ye do, verily Allah is the Knower thereof."
      },
      {
        "ayet_no": 216,
        "arbi": "كُتِبَ عَلَيْكُمُ الْقِتَالُ وَھُوَ كُرْهٌ لَّكُمْ ۚ وَعَسٰٓى اَنْ تَكْرَھُوْا شَـيْـــًٔـا وَّھُوَ خَيْرٌ لَّكُمْ ۚ وَعَسٰٓى اَنْ تُحِبُّوْا شَـيْـــــًٔـا وَّھُوَ شَرٌّ لَّكُمْ ۭ وَاللّٰهُ يَعْلَمُ وَاَنْتُمْ لَا تَعْلَمُوْنَ",
        "Urdu": "فرض کیا گیا ہے تم پرجنگ کرناحالانکہ وہ ناگوار ہے تمہیں اور ہوسکتا ہے کہ تم ناپسند کرو ایک چیز حالانکہ وہ بہتر ہو تمہارے لیے اور ہوسکتا ہے کہ تم پسند کرو ایک چیز حالانکہ وہ بری ہو تمہارے لیے اوراللہ جانتا ہے اورتم نہیں جانتے ۔",
        "English": "Prescribed unto you is fighting, albeit it is abhorrent unto you. Belike ye abhor at thing whereas it is good for you, and belike ye desire a thing whereas it Is bad for you. And Allah knowcth and ye know not."
      },
      {
        "ayet_no": 217,
        "arbi": "يَسْــَٔـلُوْنَكَ عَنِ الشَّهْرِ الْحَرَامِ قِتَالٍ فِيْهِ ۭ قُلْ قِتَالٌ فِيْهِ كَبِيْرٌ ۭ وَصَدٌّ عَنْ سَبِيْلِ اللّٰهِ وَكُفْرٌۢ بِهٖ وَالْمَسْجِدِ الْحَرَامِ ۤ وَ اِخْرَاجُ اَھْلِهٖ مِنْهُ اَكْبَرُ عِنْدَ اللّٰهِ ۚ وَالْفِتْنَةُ اَكْبَرُ مِنَ الْقَتْلِ ۭ وَلَا يَزَالُوْنَ يُقَاتِلُوْنَكُمْ حَتّٰى يَرُدُّوْكُمْ عَنْ دِيْنِكُمْ اِنِ اسْتَطَاعُوْا ۭ وَمَنْ يَّرْتَدِدْ مِنْكُمْ عَنْ دِيْنِهٖ فَيَمُتْ وَھُوَ كَافِرٌ فَاُولٰۗىِٕكَ حَبِطَتْ اَعْمَالُهُمْ فِي الدُّنْيَا وَالْاٰخِرَةِ ۚ وَاُولٰۗىِٕكَ اَصْحٰبُ النَّارِ ۚ ھُمْ فِيْهَا خٰلِدُوْنَ",
        "Urdu": "وہ آپ سے سوال کرتے ہیں حرمت والے مہینے کے بارے میں جنگ کرنا(کیسا ہے)اس میں آپ کہہ دیں اس میں جنگ کرنا بڑا( گناہ)ہے اور روکنا اللہ کے راستے سے اور کفر کرنا اس کے ساتھ اور مسجد حرام(سے روکنا) اوراس کے رہنے والوں کونکالنا اس سے زیادہ بڑا ( گناہ) ہے اللہ کے نزدیک اورفتنہ انگیزی بڑا ( گناہ) ہے قتل سے(بھی)اور(یہ لوگ)ہمیشہ تم سے لڑتے رہیں گے یہاں تک کہ تمہیں پھیر دیں تمہارے دین سے اگر ان کابس چلے اورجو پلٹ جائے تم میں سے اپنے دین سے پھر مرجائے اس حال میں کہ وہ کافر ہو تویہی لوگ ہیں (کہ) ضائع ہوگئے ان کے اعمال دنیا اورآخرت میں اور وہی لوگ اہل دوزخ ہیں ،وہ اس میں ہمیشہ رہیں گے ۔",
        "English": "They ask you concerning fighting in the Sacred Months (i.e. 1st, 7th, 11th and 12th months of the Islmic calendar) . Say, (Fighting therein is a great (transgression) but a greater (transgression) withAllah is to prevent mankind from following the Way ofAllah, to disbelieve in Him, to prevent access to Al-Masjid-al-Harm (at Makkah) , and to drive out its inhabitants, and Al-Fitnah is worse than killing. And they will never cease fighting you until they turn you back from your religion (Islmic Monotheism) if they can. And whosoever of you turns back from his religion and dies as a disbeliever, then his deeds will be lost in this life and in the Hereafter, and they will be the dwellers of the Fire. They will abide therein forever)."
      },
      {
        "ayet_no": 218,
        "arbi": "اِنَّ الَّذِيْنَ اٰمَنُوْا وَالَّذِيْنَ ھَاجَرُوْا وَجٰهَدُوْا فِيْ سَبِيْلِ اللّٰهِ ۙ اُولٰۗىِٕكَ يَرْجُوْنَ رَحْمَتَ اللّٰهِ ۭ وَاللّٰهُ غَفُوْرٌ رَّحِيْمٌ",
        "Urdu": "بے شک وہ لوگ جو ایمان لائے اور وہ جنہوں نے ہجرت کی اورجہاد کیا اللہ کی راہ میں وہی لوگ ہیں(جو)امید رکھتے ہیں اللہ کی رحمت کی اوراللہ معاف کرنے والانہایت مہربان ہے ۔",
        "English": "Verily those who have believed and those who have emigrated and have striven hard in the way of Allah, all these shall hope for the mercy of Allah, and Allah is Forgiving, Merciful."
      },
      {
        "ayet_no": 219,
        "arbi": "يَسْــَٔـلُوْنَكَ عَنِ الْخَــمْرِ وَالْمَيْسِرِ ۭ قُلْ فِيْهِمَآ اِثْمٌ كَبِيْرٌ وَّمَنَافِعُ لِلنَّاسِ ۡ وَاِثْـمُهُمَآ اَكْبَرُ مِنْ نَّفْعِهِمَا ۭ وَيَسْــَٔـلُوْنَكَ مَاذَا يُنْفِقُوْنَ ڛ قُلِ الْعَفْوَ  ۭ كَذٰلِكَ يُـبَيِّنُ اللّٰهُ لَكُمُ الْاٰيٰتِ لَعَلَّكُمْ تَتَفَكَّرُوْنَ",
        "Urdu": "آپ سے پوچھتے ہیں شراب اور جوئے کے متعلق آپ کہہ دیجیے(کہ)ان دونوں میں بڑا گناہ ہے اورکچھ فوائد بھی ہیں لوگوں کے لیے حالانکہ ان دونوں کا گناہ زیادہ بڑا ہے ان کے فائدے سے اوروہ آپ سے پوچھتے ہیں وہ کیا خرچ کریں آپ کہیں(جوضرورت سے)زائد ہو(وہ سب اللہ کی راہ میں خرچ کردیں)اسی طرح اللہ بیان کرتاہے تمہارے لیے احکام تاکہ تم غوروفکر کرو ۔",
        "English": "They ask thee of wine, and gambling. Say thou: in both is a great sin, and some benefits for men, but the sin of them is for greater than their benefit. And they ask thee, how much they should expend. Say thou: the redundant portion. In this wise Allah expoundeth unto you His commandments that haply ye may ponder."
      },
      {
        "ayet_no": 220,
        "arbi": "فِى الدُّنْيَا وَالْاٰخِرَةِ   ۭ وَيَسْــَٔـلُوْنَكَ عَنِ الْيَتٰمٰي ۭ قُلْ اِصْلَاحٌ لَّھُمْ خَيْرٌ  ۭوَاِنْ تُخَالِطُوْھُمْ فَاِخْوَانُكُمْ ۭ وَاللّٰهُ يَعْلَمُ الْمُفْسِدَ مِنَ الْمُصْلِحِ ۭ وَلَوْ شَاۗءَ اللّٰهُ لَاَعْنَتَكُمْ ۭ اِنَّ اللّٰهَ عَزِيْزٌ حَكِيْمٌ",
        "Urdu": "دنیا میں(بھی)اورآخرت میں(بھی)اوروہ آپ سے پوچھتے ہیں یتیموں کے متعلق آپ کہہ دیں ان کے لیے بھلائی بہتر ہے اور اگر تم ان سے مل جل کررہو(اکٹھے کھاؤ پیو) تو وہ تمہارے بھائی ہیں اوراللہ جانتا ہے (کون)بگاڑ کرنے والاہے(اورکون)اصلاح کرنے والا ہے اوراگراللہ چاہتا(تو)یقینا سختی بھی کرسکتا تھا تم پر بے شک اللہ غالب ،حکمت والا ہے ۔",
        "English": "On this Wor1d and the Here after. And they ask thee of orphans. Say thou: to set right affairs for them were best. If ye mix with them, then they are your brethren. Allah knoweth the foul-dealer from the fair-dealer. And had Allah so willed, He could have harassed you; verily Allah is Mighty, Wise."
      },
      {
        "ayet_no": 221,
        "arbi": "وَلَا تَنْكِحُوا الْمُشْرِكٰتِ حَتّٰى يُؤْمِنَّ ۭوَلَاَمَةٌ مُّؤْمِنَةٌ خَيْرٌ مِّنْ مُّشْرِكَةٍ وَّلَوْ اَعْجَبَـتْكُمْ ۚ وَلَا تُنْكِحُوا الْمُشْرِكِيْنَ حَتّٰى يُؤْمِنُوْا ۭ وَلَعَبْدٌ مُّؤْمِنٌ خَيْرٌ مِّنْ مُّشْرِكٍ وَّلَوْ اَعْجَبَكُمْ ۭ اُولٰۗىِٕكَ يَدْعُوْنَ اِلَى النَّارِ ښ وَاللّٰهُ يَدْعُوْٓا اِلَى الْجَنَّةِ وَالْمَغْفِرَةِ بِاِذْنِهٖ ۚ وَيُبَيِّنُ اٰيٰتِهٖ لِلنَّاسِ لَعَلَّهُمْ يَــتَذَكَّرُوْنَ",
        "Urdu": "اورنہ تم نکاح کرو،مشرک عورتوں سے حتی کہ وہ ایمان(نہ)لے آئیں اورالبتہ مومنہ لونڈی بہتر ہے(آزاد)مشرک عورت سے اوراگرچہ وہ بھلی لگتی ہو آپ کو اور نہ نکاح کرواؤ (اپنی عورتوں کا)مشرک مردوں سے حتی کہ وہ ایمان(نہ )لے آئیں اوریقینا مومن غلام بہتر ہے(آزاد)مشرک مرد سے اوراگرچہ وہ تمہیں اچھا لگتاہو یہ لوگ بلاتے ہیں آگ کی طرف اوراللہ بلاتا ہے جنت اورمغفرت کی طرف اپنے(مہربانی) سے اوروہ بیان کرتا ہے اپنے احکام لوگوں کے لیے تاکہ وہ نصیحت حاصل کریں ۔",
        "English": "And wed not infidel women until they believe; of a surety a believing bondwoman is better than an infidel Woman, albeit she please you. And wed not your women to infidel men until they believe; of a surety a believing bondman is better than an infidel, albeit the please you. These Call you unto the Fire, and Allah calleth you unto the Garden and unto forgiveness, by His leave; and He expoundeth His commandments unto mankind that haply they may be admonished."
      },
      {
        "ayet_no": 222,
        "arbi": "وَيَسْــَٔـلُوْنَكَ عَنِ الْمَحِيْضِ ۭ قُلْ ھُوَ اَذًى ۙ فَاعْتَزِلُوا النِّسَاۗءَ فِي الْمَحِيْضِ ۙ وَلَا تَقْرَبُوْھُنَّ حَتّٰى يَـطْهُرْنَ ۚ فَاِذَا تَطَهَّرْنَ فَاْتُوْھُنَّ مِنْ حَيْثُ اَمَرَكُمُ اللّٰهُ ۭ اِنَّ اللّٰهَ يُحِبُّ التَّـوَّابِيْنَ وَيُحِبُّ الْمُتَطَهِّرِيْنَ",
        "Urdu": "اوروہ آپ سے پوچھتے ہیں حیض کے بارے میں آپ کہہ دیں وہ گندگی ہے توالگ رہو عورتوں سے حیض(کے دنوں)میں اورقریب مت جاؤ ان کے یہاں تک کہ وہ پاک ہوجائیں پھر جب (اچھی طرح)وہ پاک ہوجائیں تو آؤ ان کے پاس (اس طرح)سے جیسے حکم دیا ہے تم کواللہ نے بے شک اللہ پسند کرتاہے توبہ کرنے والوں کواوروہ پسند کرتاہے پاکیزگی اختیار کرنے والوں کو ۔",
        "English": "And they ask thee of menstruation. Say thou: it is a pollution, so keep away from women during menstruation, and go not in unto them until they have purified themselves. Then when they have thoroughly purified themselves, go in unto them as Allah hath commanded you. Verily Allah loveth the penitents, and loveth the purifiers of themselves."
      },
      {
        "ayet_no": 223,
        "arbi": "نِسَاۗؤُكُمْ حَرْثٌ لَّكُمْ ۠ فَاْتُوْا حَرْثَكُمْ اَنّٰى شِئْتُمْ ۡ وَقَدِّمُوْا لِاَنْفُسِكُمْ ۭ وَاتَّقُوا اللّٰهَ وَاعْلَمُوْٓا اَنَّكُمْ مُّلٰقُوْهُ   ۭوَبَشِّرِ الْمُؤْمِنِيْنَ",
        "Urdu": "تمہاری عورتیں تمہارے لیے کھیتی(کی مانند ہیں) پس آؤ اپنی کھیتی کو جس طرح سے تم چاہو اورآگے بھیجو اپنے نفسوں کے لیے (نیک اعمال)اوراللہ سے ڈرو اورجان لو کہ بے شک تم(ایک دن) اسے ملنے والے ہو اور(اے نبی)مومنوں کوخوش خبری دیدیں ۔",
        "English": "Your women are tilth Unto you, so go in unto your tilth as ye list, and provide beforehand for your souls. And fear Allah, and know that ye are going to meet Him; and give thou glad tidings Unto the believers."
      },
      {
        "ayet_no": 224,
        "arbi": "وَلَا تَجْعَلُوا اللّٰهَ عُرْضَةً لِّاَيْمَانِكُمْ اَنْ تَبَرُّوْا وَتَـتَّقُوْا وَتُصْلِحُوْا بَيْنَ النَّاسِ ۭ وَاللّٰهُ سَمِيْعٌ عَلِيْمٌ",
        "Urdu": "اورمت بناؤ اللہ(کے نام )کوڈھال اپنی قسموں کے لیے(کہ تم قسم کھالو)کہ(نہ) نیکی کرو گے اور(نہ)برائی سے بچو گے اور(نہ)اصلاح کروگے لوگوں کے درمیان اوراللہ خوب سننے والا جاننے والا ہے ۔",
        "English": "And make not Allah a butt of your oaths that ye shall not act piously nor fear Allah nor set things right between and Allah is Hearing, Knowing."
      },
      {
        "ayet_no": 225,
        "arbi": "لَا يُؤَاخِذُكُمُ اللّٰهُ بِاللَّغْوِ فِيْٓ اَيْمَانِكُمْ وَلٰكِنْ يُّؤَاخِذُكُمْ بِمَا كَسَبَتْ قُلُوْبُكُمْ ۭ وَاللّٰهُ غَفُوْرٌ حَلِيْمٌ",
        "Urdu": "نہیں تمہارامواخذہ کرے گااللہ تمہاری لغو(بلاارادہ)قسموں پر اورلیکن وہ تمہارا مواخذہ کرے گا(ان قسموں) پر جوتم نے دل سے کھائیں ہیں اوراللہ بخشنے والا بردبار ہے۔",
        "English": "Allah will not take you to task for the vain in Your oaths, but he shall take you to task for that which your hearts have earned, and He is the Forgiving, the Forbearing."
      },
      {
        "ayet_no": 226,
        "arbi": "لِلَّذِيْنَ يُؤْلُوْنَ مِنْ نِّسَاۗىِٕهِمْ تَرَبُّصُ اَرْبَعَةِ اَشْهُرٍ ۚ فَاِنْ فَاۗءُوْ فَاِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ",
        "Urdu": "ان لوگوں کے لیے جو قسم کھالیتے ہیں (تعلق نہ رکھنے کی)اپنی بیوی سے،انتظار کرناہے چار ماہ پھراگر(اس دوران)وہ رجوع کرلیں توبے شک اللہ بہت بخشنے والا،مہربان ہے ۔",
        "English": "For those who swear off from their wives is a awaiting of four months; then if they go back, verily Allah is Forgiving, Merciful."
      },
      {
        "ayet_no": 227,
        "arbi": "وَاِنْ عَزَمُوا الطَّلَاقَ فَاِنَّ اللّٰهَ سَمِيْعٌ عَلِيْمٌ",
        "Urdu": "اوراگروہ طلاق کی ٹھان لیں توبے شک اللہ سننے والا،جاننے والا ہے ۔",
        "English": "And if they resolve on divorcement, then verily Allah is Hearing, Knowing."
      },
      {
        "ayet_no": 228,
        "arbi": "وَالْمُطَلَّقٰتُ يَتَرَبَّصْنَ بِاَنْفُسِهِنَّ ثَلٰثَةَ قُرُوْۗءٍ ۭ وَلَا يَحِلُّ لَهُنَّ اَنْ يَّكْتُمْنَ مَا خَلَقَ اللّٰهُ فِيْٓ اَرْحَامِهِنَّ اِنْ كُنَّ يُؤْمِنَّ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِ ۭوَبُعُوْلَتُهُنَّ اَحَقُّ بِرَدِّھِنَّ فِيْ ذٰلِكَ اِنْ اَرَادُوْٓا اِصْلَاحًا ۭ وَلَهُنَّ مِثْلُ الَّذِيْ عَلَيْهِنَّ بِالْمَعْرُوْفِ ۠ وَلِلرِّجَالِ عَلَيْهِنَّ دَرَجَةٌ ۭ وَاللّٰهُ عَزِيْزٌ حَكِيْمٌ",
        "Urdu": "اورطلاق یافتہ روکے رکھیں اپنے آپ کو تین حیض تک اور نہیں جائز ان کے لیے یہ کہ وہ چھپائیں اسے جوپیدا کیاہے اللہ نے ان کے رحموں میں،اگرہوں وہ ایمان رکھتی اللہ اورآخرت کے دن پر اور ان کے خاوند زیادہ حقدار ہیں ان کو(اپنی زوجیت میں)لوٹانے کے اس(مدت)میں اگروہ ارادہ کرلیں صلح کا،اور ان(عورتوں)کے لیے (ویسے ہی حقوق ہیں) جس طرح ان پر مردوں کے حقوق ہیں )دستور کے مطابق اور(البتہ) مردوں کو ان پرایک درجہ حاصل ہے اوراللہ غالب،حکمت والا ہے ۔",
        "English": "And the divorced women shall keep themselves in waiting for three courses nor is it allowed unto them that they should hide that which Allah hath created in their wombs, if they believe in Allah and the Last Day. And their husbands are more entitled to their restorations during the same, if they desire rectification. Unto women is due likes that which is due from women reputably. And for men is a degree over them. And Allah is Mighty, Wise."
      },
      {
        "ayet_no": 229,
        "arbi": "اَلطَّلَاقُ مَرَّتٰنِ ۠ فَاِمْسَاكٌۢ بِمَعْرُوْفٍ اَوْ تَسْرِيْحٌۢ بِاِحْسَانٍ ۭ وَلَا يَحِلُّ لَكُمْ اَنْ تَاْخُذُوْا مِمَّآ اٰتَيْتُمُوْھُنَّ شَـيْـــًٔـا اِلَّآ اَنْ يَّخَافَآ اَلَّايُقِيْمَا حُدُوْدَ اللّٰهِ ۭ فَاِنْ خِفْتُمْ اَلَّا يُقِيْمَا حُدُوْدَ اللّٰهِ ۙ فَلَاجُنَاحَ عَلَيْھِمَا فِـيْمَا افْتَدَتْ بِهٖ ۭ تِلْكَ حُدُوْدُ اللّٰهِ فَلَاتَعْتَدُوْھَا  ۚ وَمَنْ يَّتَعَدَّ حُدُوْدَ اللّٰهِ فَاُولٰۗىِٕكَ ھُمُ الظّٰلِمُوْنَ",
        "Urdu": "طلاق (رجعی)دومرتبہ ہے پھر(یا تو)روک لیاجائے اچھے طریقے سے یارخصت کردیاجائے اچھے طریقے سے اور نہیں ہے جائز تمہارے لیے یہ کہ تم وا پس لو اس سے جو تم دے چکے ہو ا نہیں کچھ بھی مگریہ کہ وہ(میاں بیوی)دونوں ڈریں کہ نہ وہ قائم رکھ سکیں گے اللہ کی حدود کو پس اگر تمہیں ڈر ہو یہ کہ نہ وہ قائم رکھ سکیں گے اللہ کی حدوں کو توکوئی گناہ نہیں ان دونوں پر اس(معاوضہ)میں جوعورت بطور فدیہ دے (اور)اس کے بدلے میں(اپنی جان چھڑالے)یہ اللہ کی حدیں ہیں پس نہ تجاوز کرو ان سے اورجو تجاوز کرتاہے اللہ کی(مقررہ)حدوں سے تووہی لوگ ہی ظالم ہیں ۔",
        "English": "Divorcement is twice: thereafter either retaining her reputably, or letting her off kindly. And it is not allowed unto you to take away aught ye have given them, except the twain fear that they may not observe the bonds of Allah. If yes fear that the twain may not observe the bonds of Allah, then no blame is on the twain for that where with she ransometh herself. These are the bonds of Allah, wherefore trespass them not; and whosoever trespasseth the bonds of Allah, then verily these! they are the wrong-doers."
      },
      {
        "ayet_no": 230,
        "arbi": "فَاِنْ طَلَّقَھَا فَلَا تَحِلُّ لَهٗ مِنْۢ بَعْدُ حَتّٰي تَنْكِحَ زَوْجًا غَيْرَهٗ ۭ فَاِنْ طَلَّقَھَا فَلَاجُنَاحَ عَلَيْھِمَآ اَنْ يَّتَرَاجَعَآ اِنْ ظَنَّآ اَنْ يُّقِيْمَا حُدُوْدَ اللّٰهِ ۭ وَتِلْكَ حُدُوْدُ اللّٰهِ يُبَيِّنُھَا لِقَوْمٍ يَّعْلَمُوْنَ",
        "Urdu": "پھراگروہ طلاق دے اسے (تیسری بار)تو وہ حلال نہیں اس کے لیے اس کے بعد یہاں تک کہ وہ نکاح کرے کسی اورخاوند سے اس کے سوا پھراگروہ(دوسرا خاوند)اسے طلاق دے دے توکوئی گناہ نہیں ان دونوں پر کہ وہ رجوع کرلیں اگردونوں یہ خیال کریں کہ وہ قائم رکھ سکیں گے اللہ کی حدیں اوریہ اللہ کی (مقرر کی ہوئی)حدیں ہیں وہ کھول کھول کربیان کرتاہے ا نہیں اس قوم کے لیے (جو)علم رکھتے ہیںَ",
        "English": "And if he hath divorced her (the third time) , then she is not lawful unto him thereafter until she hath wedded another husband. Then if he (the other husband) divorce her it is no sin for both of them that they come together again if they consider that they are able to observe the limits of Allah. These are the limits of Allah. He manifest them for people who have knowledge."
      },
      {
        "ayet_no": 231,
        "arbi": "وَاِذَا طَلَّقْتُمُ النِّسَاۗءَ فَبَلَغْنَ اَجَلَھُنَّ فَاَمْسِكُوْھُنَّ بِمَعْرُوْفٍ اَوْ سَرِّحُوْھُنَّ بِمَعْرُوْفٍ وَلَا تُمْسِكُوْھُنَّ ضِرَارًا لِّتَعْتَدُوْا ۚ وَمَنْ يَّفْعَلْ ذٰلِكَ فَقَدْ ظَلَمَ نَفْسَهٗ ۭ وَلَا تَتَّخِذُوْٓا اٰيٰتِ اللّٰهِ ھُزُوًا ۡ وَاذْكُرُوْا نِعْمَتَ اللّٰهِ عَلَيْكُمْ وَمَآ اَنْزَلَ عَلَيْكُمْ مِّنَ الْكِتٰبِ وَالْحِكْمَةِ يَعِظُكُمْ بِهٖ ۭ وَاتَّقُوا اللّٰهَ وَاعْلَمُوْٓا اَنَّ اللّٰهَ بِكُلِّ شَيْءٍ عَلِيْمٌ",
        "Urdu": "اور جب تم طلاق دیدو عورتوں کو پھر پوری ہونے لگے ان کی عدت تو (پھر یاتو) روک لو ا نہیں اچھے طریقے سے یا(پھر) رخصت کر دو ا نہیں بھلے طریقے سے اور تم نہ روکو انہیں دکھ دینے کی خاطر(وہ یہ کہ رجوع کر لو)تاکہ تم زیادتی کرسکو(ان پر)اور جو ایسا کرے گا تو تحقیق اس نے ظلم کیااپنے آپ پر اور مت بناؤ اللہ کے احکام کا ہنسی مذاق اور یاد کرو اللہ کے احسان کو جو تم پر ہے اور جو اس نے نازل کی تم پر کتاب وحکمت وہ نصیحت کرتا ہے تمہیں اس کے ذریعے اور ڈرتے رہو اللہ سے اورجان لو کہ بے شک اللہ ہر چیز کو خوب جاننے والا ہے ۔",
        "English": "And when ye have divorced your women, and they have attained their period, then either retain them reputably or let them off kindly; and retain them not to their hurt that ye may trespass; and whosoever doth this assuredly wrongeth his soul. And hold not Allah's commandments in mockery and remember Allah's favour upon you, and that he hath sent down unto you the Book and the wisdom wherewith He exhorted you; and fear Allah, and know that verily Allah is of everything the Know."
      },
      {
        "ayet_no": 232,
        "arbi": "وَاِذَا طَلَّقْتُمُ النِّسَاۗءَ فَبَلَغْنَ اَجَلَهُنَّ فَلَا تَعْضُلُوْھُنَّ اَنْ يَّنْكِحْنَ اَزْوَاجَهُنَّ اِذَا تَرَاضَوْا بَيْنَهُمْ بِالْمَعْرُوْفِ ۭ ذٰلِكَ يُوْعَظُ بِهٖ مَنْ كَانَ مِنْكُمْ يُؤْمِنُ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِ ۭ ذٰلِكُمْ اَزْكٰى لَكُمْ وَاَطْهَرُ ۭ وَاللّٰهُ يَعْلَمُ وَاَنْتُمْ لَا تَعْلَمُوْنَ",
        "Urdu": "اورجب تم (رجعی) طلاق دیدو عورتوں کو پھروہ پوری کرلیں اپنی عدت تو نہ تم روکو انہیں کہ وہ نکاح کرلیں اپنے(پہلے) خاوندوں سے جبکہ راضی ہوں وہ آپس میں جائز طریقے سے اس بات کی نصیحت کی جاتی ہے اس کوجو ہے تم میں سے ایمان لاتا اللہ اورآخرت کے دن پر یہ(حکم)زیادہ پاکیزہ اور ستھرا ہے تمہارے لیے اوراللہ جانتا ہے اور تم نہیں جانتے ۔",
        "English": "And when ye have divorced women and they have attained their period; straiten them not so that they wed not their husbands when they have agreed between themselves reputably; hereby is exhorted he among you who believeth in Allah and the Last Day: this is cleanest for you and purest. Allah knoweth and ye know not."
      },
      {
        "ayet_no": 233,
        "arbi": "وَالْوَالِدٰتُ يُرْضِعْنَ اَوْلَادَھُنَّ حَوْلَيْنِ كَامِلَيْنِ لِمَنْ اَرَادَ اَنْ يُّـتِمَّ الرَّضَاعَةَ ۭ وَعَلَي الْمَوْلُوْدِ لَهٗ رِزْقُهُنَّ وَكِسْوَتُهُنَّ بِالْمَعْرُوْفِ ۭ لَا تُكَلَّفُ نَفْسٌ اِلَّا وُسْعَهَا ۚ لَا تُضَاۗرَّ وَالِدَةٌۢ بِوَلَدِھَا وَلَا مَوْلُوْدٌ لَّهٗ بِوَلَدِهٖ ۤ وَعَلَي الْوَارِثِ مِثْلُ ذٰلِكَ ۚ فَاِنْ اَرَادَا فِصَالًا عَنْ تَرَاضٍ مِّنْهُمَا وَتَشَاوُرٍ فَلَا جُنَاحَ عَلَيْهِمَا ۭ وَاِنْ اَرَدْتُّمْ اَنْ تَسْتَرْضِعُوْٓا اَوْلَادَكُمْ فَلَا جُنَاحَ عَلَيْكُمْ اِذَا سَلَّمْتُمْ مَّآ اٰتَيْتُمْ بِالْمَعْرُوْفِ ۭ وَاتَّقُوا اللّٰهَ وَاعْلَمُوْٓا اَنَّ اللّٰهَ بِمَا تَعْمَلُوْنَ بَصِيْرٌ",
        "Urdu": "اور مائیں دودھ پلائیں اپنی اولاد کو دوسال مکمل(یہ مدت)اس کے لیے ہے جو ارادہ کرے کہ وہ پوری کرے(بچے کے)دودھ پلانے کی مدت اور جس کا بیٹاہے اس پر ہے ان کا کھانا اور ان کا لباس دستور کے مطابق نہ تکلیف دی جائے کسی جان کو مگر اس کی گنجائش کے مطابق نہ نقصان پہنچایاجائے ماں کواس کے بیٹے کے سبب اورنہ جس کابیٹا ہو(باپ کو)اس کے بیٹے کے سبب اور وارث پربھی اسی طرح(نان ونفقہ) ہے پس اگر دونوں ارادہ کرلیں دودھ چھڑانے کا اپنی باہمی رضامندی سے اورمشورے سے توکوئی گناہ نہیں ہے ان دونوں پر اور اگرتم ارادہ کرو کہ تم دودھ پلواؤ اپنی اولاد کو تو کوئی گناہ نہیں تم پر جب تم دیدو جوتم نے دینا طے کیا ہے دستور کے مطابق اور اللہ سے ڈر جاؤ اور جان لو کہ بے شک اللہ اس کو جو تم کر رہے ہو خوب دیکھ رہا ہے ۔",
        "English": "The mothers shall give suck to their children for two whole years, (that is) for those (parents) who desire to complete the term of suckling, but the father of the child shall bear the cost of the mother's food and clothing on a reasonable basis. No person shall have a burden laid on him greater than he can bear. No mother shall be treated unfairly on account of her child, nor father on account of his child. And on the (father's) heir is incumbent the like of that (which was incumbent on the father) . If they both decide on weaning, by mutual consent, and after due consultation, there is no sin on them. And if you decide on a foster suckling-mother for your children, there is no sin on you, provided you pay (the mother) what you agreed (to give her) on reasonable basis. And fearAllah and know thatAllah is All-Seer of what you do."
      },
      {
        "ayet_no": 234,
        "arbi": "وَالَّذِيْنَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُوْنَ اَزْوَاجًا يَّتَرَبَّصْنَ بِاَنْفُسِهِنَّ اَرْبَعَةَ اَشْهُرٍ وَّعَشْرًا ۚ فَاِذَا بَلَغْنَ اَجَلَهُنَّ فَلَا جُنَاحَ عَلَيْكُمْ فِيْمَا فَعَلْنَ فِيْٓ اَنْفُسِهِنَّ بِالْمَعْرُوْفِ ۭ وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرٌ",
        "Urdu": "اوروہ لوگ جو فوت ہوجائیں تم میں سے اور چھوڑ جائیں بیویاں(تو)وہ روکے رکھیں اپنے آپ کو(نکاح سے)چار مہینے اوردس (دن)تک پھرجب وہ پوری کرلیں اپنی عدت تو کوئی گناہ نہیں تم پر(اس بارے)میں جوانہوں نے (فیصلہ)کیا اپنے حق میں دستور کے مطابق اوراللہ اس سے جو تم کررہے ہوخوب خبردار ہے ۔",
        "English": "And those of you who die and leave wives behind them, they (the wives) shall wait (as regards their marriage) for four months and ten days, then when they have fulfilled their term, there is no sin on you if they (the wives) dispose of themselves in a just and honourable manner (i.e. they can marry) . AndAllah is Well-Acquainted with what you do."
      },
      {
        "ayet_no": 235,
        "arbi": "وَلَا جُنَاحَ عَلَيْكُمْ فِـيْمَا عَرَّضْتُمْ بِهٖ مِنْ خِطْبَةِ النِّسَاۗءِ اَوْ اَكْنَنْتُمْ فِيْٓ اَنْفُسِكُمْ ۭ عَلِمَ اللّٰهُ اَنَّكُمْ سَتَذْكُرُوْنَهُنَّ وَلٰكِنْ لَّا تُوَاعِدُوْھُنَّ سِرًّا اِلَّآ اَنْ تَقُوْلُوْا قَوْلًا مَّعْرُوْفًا ڛ وَلَا تَعْزِمُوْا عُقْدَةَ النِّكَاحِ حَتّٰي يَبْلُغَ الْكِتٰبُ اَجَلَهٗ ۭوَاعْلَمُوْٓا اَنَّ اللّٰهَ يَعْلَمُ مَا فِىْٓ اَنْفُسِكُمْ فَاحْذَرُوْهُ ۚ وَاعْلَمُوْٓا اَنَّ اللّٰهَ غَفُوْرٌ حَلِيْمٌ",
        "Urdu": "اورکوئی گناہ نہیں تم پراس(بارے)میں جو تم اشارہ کرو پیغام نکاح کاان عورتوں سے (جو رجعی طلاق سے عدت والی ہوں)یا تم چھپا رکھو اپنے دلوں میں (یہ بات)اللہ کومعلوم ہوچکا ہے کہ بے شک تم عنقریب ذکر کرو گے ان سے(نکاح کا)اورلیکن تم نہ وعدہ کرو ان سے(نکاح) چھپ کر مگریہ کہ تم بات کہو معروف طریقے سے اور نہ پختہ ارادہ کرو عقدنکاح کا،یہاں تک کہ پہنچ جائے لکھی ہوئی(عدت)اپنی مدت کو اورجان لو کہ بے شک اللہ جانتا ہے جوتمہارے دلوں میں ہے پس اسی سے ڈرو اورجان لو کہ بے شک اللہ بخشنے والا بردبا رہے ۔",
        "English": "And no blame is on you in that ye speak indirectly of your troth unto the said women or conceal it in, your souls! Allah knoweth that ye will anon make mention of these women: but make no promises unto them in secret, except ye speak a reputable saying. And even resolve not on wedding-knot until the prescribed term hath attained its end; and know that Allah knoweth that which is in your souls, wherefore beware of Him, and know that Allah is Forgiving, Forbearing"
      },
      {
        "ayet_no": 236,
        "arbi": "لَاجُنَاحَ عَلَيْكُمْ اِنْ طَلَّقْتُمُ النِّسَاۗءَ مَالَمْ تَمَسُّوْھُنَّ اَوْ تَفْرِضُوْا لَھُنَّ فَرِيْضَةً  ښ وَّمَتِّعُوْھُنَّ ۚ عَلَي الْمُوْسِعِ قَدَرُهٗ وَعَلَي الْمُقْتِرِ قَدَرُهٗ  ۚ مَتَاعًۢا بِالْمَعْرُوْفِ ۚ حَقًّا عَلَي الْمُحْسِـنِيْنَ",
        "Urdu": "تم پر کوئی گناہ نہیں اگرتم طلاق دو عورتوں کو کہ (ابھی)تم نے نہ چھوا ہوان کو یا(نہ)مقرر کیا ہو ان کا حق مہر اور(البتہ ضرور)تم تحفے میں کچھ دے دو انہیں خوش حال پر اسکی مقدور(وسعت) کے مطابق ہے اور تنگ دست پراسکی مقدور کے مطابق ہے فائدہ پہنچانا ہے اچھے طریقے سے (یہ)حق ہے نیکی کرنے والوں پر ۔",
        "English": "No blame is on you if ye divorce women while yet ye have not touched them nor settled unto them a settlement. Benefit them on the affluent is due according to his means, and on the straitened is due according to his means. a reputable present, and duty on the well-doers."
      },
      {
        "ayet_no": 237,
        "arbi": "وَاِنْ طَلَّقْتُمُوْھُنَّ مِنْ قَبْلِ اَنْ تَمَسُّوْھُنَّ وَقَدْ فَرَضْتُمْ لَھُنَّ فَرِيْضَةً فَنِصْفُ مَا فَرَضْتُمْ اِلَّآ اَنْ يَّعْفُوْنَ اَوْ يَعْفُوَا الَّذِيْ بِيَدِهٖ عُقْدَةُ النِّكَاحِ  ۭ وَاَنْ تَعْفُوْٓا اَقْرَبُ لِلتَّقْوٰى ۭ وَلَا تَنْسَوُا الْفَضْلَ بَيْنَكُمْ ۭ اِنَّ اللّٰهَ بِمَا تَعْمَلُوْنَ بَصِيْرٌ",
        "Urdu": "اوراگرتم طلاق دو ان کو اس سے پہلے کہ تم ہاتھ لگاؤ ان کواس حال میں کہ تم مقرر کرچکے ہو ان کا حق مہر،توآدھا(مہر اداکرنا ہوگا)جوتم نے مقرر کیا ہے مگریہ کہ وہ عورتیں معاف کردیں یا وہ معاف کرے جس کے ہاتھ (اختیار) میں عقد نکاح ہے (یعنی فراخدلی سے پورامہر دے دے)اور یہ کہ تم درگزر کرو(اورپورا مہر اداکردو) یہ زیادہ قریب ہے تقوی کے اورمت بھولواحسان کرنا تم آ پس میں بے شک اللہ اسے جوتم عمل کررہے ہو خوب دیکھ رہا ہے ۔",
        "English": "And if ye divorce them ere ye have touched them but have settled unto them a settlement, then due from you is half of that which ye have settled unless the wives forego, or he in whose hand is the wedding-knot foregoeth, and that ye should forego is nigher unto piety. And forget not grace amongst yourself; verily of that which ye work Allah is the Beholder."
      },
      {
        "ayet_no": 238,
        "arbi": "حٰفِظُوْا عَلَي الصَّلَوٰتِ وَالصَّلٰوةِ الْوُسْطٰى ۤ وَقُوْمُوْا لِلّٰهِ قٰنِتِيْنَ",
        "Urdu": "حفاظت کرو نمازوں کی اور درمیانی نماز کی ( یعنی نماز عصر )اور کھڑے ہوا کرو اللہ کے سامنے ادب و نیاز سے ۔",
        "English": "Guard the prayers, and the middle prayer, and stand up to Allah truly devout."
      },
      {
        "ayet_no": 239,
        "arbi": "فَاِنْ خِفْتُمْ فَرِجَالًا اَوْ رُكْبَانًا ۚ فَاِذَآ اَمِنْتُمْ فَاذْكُرُوا اللّٰهَ كَمَا عَلَّمَكُمْ مَّا لَمْ تَكُوْنُوْا تَعْلَمُوْنَ",
        "Urdu": "پھراگر تم حالت خوف میں ہوتو پیدل یا سوار (جیسے ممکن ہو نماز پڑھ لو) پھرجب امن میں ہوجاؤ تو یاد کرو اللہ کو(ایسے)جیسے اس نے سکھایا ہے تم کو جو تم نہیں جانتے تھے ۔",
        "English": "And if you fear (an enemy) , perform Salt (pray) on foot or riding. And when you are in safety, offer the Salt (prayer) in the manner He has taught you, which you knew not (before) ."
      },
      {
        "ayet_no": 240,
        "arbi": "وَالَّذِيْنَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُوْنَ اَزْوَاجًا ښ وَّصِيَّةً لِّاَزْوَاجِهِمْ مَّتَاعًا اِلَى الْحَوْلِ غَيْرَ اِخْرَاجٍ ۚ فَاِنْ خَرَجْنَ فَلَا جُنَاحَ عَلَيْكُمْ فِيْ مَا فَعَلْنَ فِيْٓ اَنْفُسِهِنَّ مِنْ مَّعْرُوْفٍ ۭ وَاللّٰهُ عَزِيْزٌ حَكِيْمٌ",
        "Urdu": "اوروہ لوگ جو فوت ہوجائیں تم میں سے اوروہ چھوڑ جائیں بیویاں(توا نہیں چاہیے کہ)وہ وصیت کرجائیں اپنی بیویوں کے حق میں(کہ)فائدہ پہنچایاجائے(نان ونفقہ دے کر)ایک سال تک (اورگھر سے)نہ نکالاجائے پھراگر وہ خود چلی جائیں توتم پرکوئی گناہ نہیں اس میں جوانہوں نے کیا ہو اپنے متعلق مناسب(فیصلہ)اوراللہ غالب حکمت والا ہے۔",
        "English": "And those of you who die and leave wives behind, they shall make a bequest unto their wives a year's maintenance without their having to go out, then if they go out, then no blame is on you for that which they, do with themselves reputably, and Allah is Mighty, Wise."
      },
      {
        "ayet_no": 241,
        "arbi": "وَلِلْمُطَلَّقٰتِ مَتَاعٌۢ بِالْمَعْرُوْفِ ۭحَقًّا عَلَي الْمُتَّقِيْنَ",
        "Urdu": "اورطلاق یافتہ عورتوں کوبھی کچھ فائدہ پہنچایاجائے دستور کے مطابق(یہ)حق ہے پرہیزگاروں پر۔",
        "English": "And for the divorced women shall be a reputable present: and duty on the God-fearing."
      },
      {
        "ayet_no": 242,
        "arbi": "كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَكُمْ اٰيٰتِهٖ لَعَلَّكُمْ تَعْقِلُوْنَ",
        "Urdu": "اسی طرح اللہ صاف صاف بیان کرتاہے تمہارے لیے اپنے احکام تاکہ تم سمجھ بوجھ سے کام لو ۔",
        "English": "In this wise Allah expound unto you His commandments, haply ye may reflect."
      },
      {
        "ayet_no": 243,
        "arbi": "اَلَمْ تَرَ اِلَى الَّذِيْنَ خَرَجُوْا مِنْ دِيَارِھِمْ وَھُمْ اُلُوْفٌ حَذَرَ الْمَوْتِ ۠ فَقَالَ لَهُمُ اللّٰهُ مُوْتُوْا ۣ ثُمَّ اَحْيَاھُمْ ۭ اِنَّ اللّٰهَ لَذُوْ فَضْلٍ عَلَي النَّاسِ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يَشْكُرُوْنَ",
        "Urdu": "اے نبی)کیا نہیں آپ نے دیکھا ان لوگوں کو جو نکلے اپنے گھروں سے اس حال میں کہ وہ ہزاروں(کی تعداد میں)تھے موت کے ڈر سے تو کہااللہ نے ان سے(کہ)تم مرجاؤ ( چنانچہ وہ وہیں مرگئے)پھر(اللہ نے)ا نہیں زندہ کیا بے شک اللہ یقینا فضل کرنے والاہے لوگوں پر اورلیکن اکثر لوگ شکرادا نہیں کرتے ۔",
        "English": "Did you ( O Muhammad ) not think of those who went forth from their homes in thousands, fearing death?Allah said to them, ( Die ). And then He restored them to life. Truly,Allah is full of Bounty to mankind, but most men thank not."
      },
      {
        "ayet_no": 244,
        "arbi": "وَقَاتِلُوْا فِيْ سَبِيْلِ اللّٰهِ وَاعْلَمُوْٓا اَنَّ اللّٰهَ سَمِيْعٌ عَلِيْمٌ",
        "Urdu": "اورقتال کرو اللہ کے راستے میں اورجان لو کہ بے شک اللہ خوب سننے والا ،جاننے والا ہے ۔",
        "English": "And fight in the way of Allah and know that verily Allah is Hearing, Knowing."
      },
      {
        "ayet_no": 245,
        "arbi": "مَنْ ذَا الَّذِيْ يُقْرِضُ اللّٰهَ قَرْضًا حَسَنًا فَيُضٰعِفَهٗ لَهٗٓ اَضْعَافًا كَثِيْرَةً  ۭوَاللّٰهُ يَـقْبِضُ وَيَبْصُۜطُ ۠وَاِلَيْهِ تُرْجَعُوْنَ",
        "Urdu": "کون ہے وہ جواللہ کوقرض حسنہ دے تووہ بڑھا دے اسے اس کے لیے کئی گنا زیادہ اوراللہ ہی (روزی)تنگ کرتا ہے اورکشادہ کرتا ہے اور اسی کی طرف تم سب لوٹائے جاؤ گے ۔",
        "English": "Who is he that will lend to Allah a goodly loan so that He may multiply it to him many times? And it is Allah that decreases or increases ( your provisions ) , and unto Him you shall return."
      },
      {
        "ayet_no": 246,
        "arbi": "اَلَمْ تَرَ اِلَى الْمَلَاِ مِنْۢ بَنِىْٓ اِسْرَاۗءِ يْلَ مِنْۢ بَعْدِ مُوْسٰى ۘ اِذْ قَالُوْا لِنَبِىٍّ لَّهُمُ ابْعَثْ لَنَا مَلِكًا نُّقَاتِلْ فِيْ سَبِيْلِ اللّٰهِ ۭقَالَ ھَلْ عَسَيْتُمْ اِنْ كُتِبَ عَلَيْكُمُ الْقِتَالُ اَلَّا تُقَاتِلُوْا  ۭ قَالُوْا وَمَا لَنَآ اَلَّا نُقَاتِلَ فِيْ سَبِيْلِ اللّٰهِ وَقَدْ اُخْرِجْنَا مِنْ دِيَارِنَا وَاَبْنَاۗىِٕنَا  ۭ فَلَمَّا كُتِبَ عَلَيْهِمُ الْقِتَالُ تَوَلَّوْا اِلَّا قَلِيْلًا مِّنْهُمْ ۭ وَاللّٰهُ عَلِيْمٌۢ بِالظّٰلِمِيْنَ",
        "Urdu": "کیا نہیں آپ نے دیکھا بنی اسرائیل کے گروہ کو موسی کے بعد جب انہوں نے کہا اپنے نبی سے کہ مقرر کر ہمارے لیے ایک بادشاہ (جسکی رہنمائی میں) ہم اللہ کی راہ میں جہاد کریں اس نے کہا کیاہوسکتا ہے کہ تم اگرفرض کردی جائے تم پرجنگ یہ کہ تم جنگ نہ کرو وہ کہنے لگے اور کیا ہوگا ہمیں کہ نہ ہم جنگ کریں گے اللہ کے راستے میں حالانکہ یقینا ہم نکالے گئے ہوں گے اپنے گھروں سے اور اپنے بال بچوں سے پھر جب فرض کردی گئی ان پرجنگ (تواپنے عہد سے)پھرگئے سوائے چند ایک کے ان میں سے اللہ خوب جاننے والا ہے ظالموں کو ۔",
        "English": "Have you not thought about the group of the Children of Israel after (the time of) Mus (Moses) ? When they said to a Prophet of theirs, ( Appoint for us a king and we will fight inAllah's Way. ) He said, ( Would you then refrain from fighting, if fighting was prescribed for you ? )  They said, ' Why should we not fight in Allah's Way while we have been driven out of our homes and our children (families have been taken as captives) ?' But when fighting was ordered for them, they turned away, all except a few of them. And Allah is All-Aware of the Zlimn ( polytheists and wrong-doers ) ."
      },
      {
        "ayet_no": 247,
        "arbi": "وَقَالَ لَهُمْ نَبِيُّهُمْ اِنَّ اللّٰهَ قَدْ بَعَثَ لَكُمْ طَالُوْتَ مَلِكًا ۭ قَالُوْٓا اَنّٰى يَكُوْنُ لَهُ الْمُلْكُ عَلَيْنَا وَنَحْنُ اَحَقُّ بِالْمُلْكِ مِنْهُ وَلَمْ يُؤْتَ سَعَةً مِّنَ الْمَالِ ۭ قَالَ اِنَّ اللّٰهَ اصْطَفٰىهُ عَلَيْكُمْ وَزَادَهٗ بَسْطَةً فِي الْعِلْمِ وَالْجسمِ ۭ وَاللّٰهُ يُؤْتِيْ مُلْكَهٗ مَنْ يَّشَاۗءُ ۭ وَاللّٰهُ وَاسِعٌ عَلِيْمٌ",
        "Urdu": "اور کہا ان سے ان کے نبی نے بے شک اللہ نے تحقیق مقرر کردیا ہے تمہارے لیے طالوت کو بادشاہ کہنے لگے کیسے ہوسکتی ہے اس کی بادشاہی ہم پر حالانکہ ہم زیادہ حق دار ہیں بادشاہی کے اس سے اور نہیں دی گئی اسے وسعت مال کی اس نے کہا بے شک اللہ نے اسے منتخب کیاہے تم پراور اسے زیادہ دی ہے کشادگی علم اور جسم میں اوراللہ دیتا ہے اپنی بادشاہت جسے چاہتا ہے اوراللہ وسعت ولا،بہت علم والا ہے ۔",
        "English": "And their Prophet (Samuel) said to them, 'IndeedAllah has appointed Talt (Saul) as a king over you.' They said, 'How can he be a king over us when we are better fitted than him for the kingdom, and he has not been given enough wealth.' He said: 'Verily,Allah has chosen him above you and has increased him abundantly in knowledge and stature. And Allah grants His Kingdom to whom He wills. And Allah is All-Sufficient for His creatures' needs, All-Knower.'"
      },
      {
        "ayet_no": 248,
        "arbi": "وَقَالَ لَهُمْ نَبِيُّهُمْ اِنَّ اٰيَةَ مُلْكِهٖٓ اَنْ يَاْتِيَكُمُ التَّابُوْتُ فِيْهِ سَكِيْنَةٌ مِّنْ رَّبِّكُمْ وَبَقِيَّةٌ مِّمَّا تَرَكَ اٰلُ مُوْسٰى وَاٰلُ ھٰرُوْنَ تَحْمِلُهُ الْمَلٰۗىِٕكَةُ ۭ اِنَّ فِيْ ذٰلِكَ لَاٰيَةً لَّكُمْ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
        "Urdu": "اور کہاان سے ان کے نبی نے بے شک اس کی بادشاہت کی نشانی یہ ہے کہ آئے گا تمہارے پاس(اس کے عہد میں)وہ صندوق (کہ)اس میں ہوگی تسکین تمہارے رب کی طرف سے اورباقی ماندہ اشیاء میں جسے چھوڑا آل موسی اورآل ہارون نے اٹھالائیں گے اسے فرشتے،بے شک اس میں یقینا نشانی ہے تمہارے لیے اگر ہو تم مومن ۔",
        "English": "Their prophet said to them: :The sign of his kingship is that the Ark shall come to you, carried by the angels, having therein tranquillity from your Lord, and the remains of what the House of Musa and the House of Harun (Aaron) had left. Surely, in it there is a sign for you, if you are believers."
      },
      {
        "ayet_no": 249,
        "arbi": "فَلَمَّا فَصَلَ طَالُوْتُ بِالْجُنُوْدِ ۙ قَالَ اِنَّ اللّٰهَ مُبْتَلِيْكُمْ بِنَهَرٍ ۚ فَمَنْ شَرِبَ مِنْهُ فَلَيْسَ مِنِّىْ ۚ وَمَنْ لَّمْ يَطْعَمْهُ فَاِنَّهٗ مِنِّىْٓ اِلَّا مَنِ اغْتَرَفَ غُرْفَةًۢ بِيَدِهٖ ۚ فَشَرِبُوْا مِنْهُ اِلَّا قَلِيْلًا مِّنْهُمْ ۭ فَلَمَّا جَاوَزَهٗ ھُوَ وَالَّذِيْنَ اٰمَنُوْا مَعَهٗ ۙ قَالُوْا لَا طَاقَةَ لَنَا الْيَوْمَ بِجَالُوْتَ وَجُنُوْدِهٖ ۭ قَالَ الَّذِيْنَ يَظُنُّوْنَ اَنَّهُمْ مُّلٰقُوااللّٰهِ ۙ كَمْ مِّنْ فِئَةٍ قَلِيْلَةٍ غَلَبَتْ فِئَةً كَثِيْرَةًۢ بِاِذْنِ اللّٰهِ ۭ وَاللّٰهُ مَعَ الصّٰبِرِيْنَ",
        "Urdu": "پھر جب نکلا طالوت(اپنے) لشکروں کے ساتھ اس نے کہا بے شک اللہ تمہیں آزمانے والاہے ایک نہر سے پس جو پی لے گا اس سے تو نہیں ہے وہ مجھ سے(میرا ساتھی)اورجونہ چکھے گااسے پس بے شک وہ مجھ سے(میراساتھی) ہے مگرجوبھرلے ایک چلو اپنے ہاتھ سے پھرانہوں نے پی لیا اس سے سوائے تھوڑے(لوگوں) کے ان میں سے پھر جب اسے پار کرلیا اس نے اور ان لوگوں نے جوایمان لائے اس کے ساتھ وہ کہنے لگے کوئی طاقت نہیں ہمیں آج جالوت اوراس کے لشکروں سے (لڑنے کی)کہا ان لوگوں نے جو یقین رکھتے تھے کہ بے شک وہ اللہ سے ملنے والے ہیں بہت چھوٹے گروہ غالب آگئے بڑے گروہ پر اللہ کے حکم سے اوراللہ صبر کرنے والوں کے ساتھ ہے ۔",
        "English": "Then when Talut sallied forth with the hosts, he said, verily God will prove you with a river: then whosoever drink thereof shall be none of mine, and whosoever taste it not, verily shall be mine, excepting him who lad a lading with his hand. But they drank thereof, save a few of them. Then when he had crossed it, he,and those who believe with him, they said: We have no strength to-day against Jalut and his hosts. But those who imagined that they were going to meet Allah Said how oft hath a small party prevailed against a large party by God's leave! And Allah is with the patiently persevering."
      },
      {
        "ayet_no": 250,
        "arbi": "وَلَمَّا بَرَزُوْا لِجَالُوْتَ وَجُنُوْدِهٖ قَالُوْا رَبَّنَآ اَفْرِغْ عَلَيْنَا صَبْرًا وَّثَبِّتْ اَقْدَامَنَا وَانْصُرْنَا عَلَي الْقَوْمِ الْكٰفِرِيْنَ",
        "Urdu": "اورجب وہ مقابلے میں اترے جالوت اوراس کے لشکروں کے کہنے لگے اے ہمارے رب فیضان کر ہم پر صبر کا اورجمادے ہمارے قدم(میدان جنگ میں)اورہماری مدد فرما کافر قوم پر ۔",
        "English": "And when they arrayed themselves against Jalut and his hosts, they said: our Lord pour forth on us patience, and set firm our feet, and make us triumph over the infidel people."
      },
      {
        "ayet_no": 251,
        "arbi": "فَهَزَمُوْھُمْ بِاِذْنِ اللّٰهِ  ڐ وَقَتَلَ دَاوٗدُ جَالُوْتَ وَاٰتٰىهُ اللّٰهُ الْمُلْكَ وَالْحِكْمَةَ وَعَلَّمَهٗ مِمَّا يَشَاۗءُ   ۭ وَلَوْلَا دَفْعُ اللّٰهِ النَّاسَ بَعْضَهُمْ بِبَعْضٍ ۙ لَّفَسَدَتِ الْاَرْضُ وَلٰكِنَّ اللّٰهَ ذُوْ فَضْلٍ عَلَي الْعٰلَمِيْنَ",
        "Urdu": "پھر انہوں نے شکست دی ان کو اللہ کے حکم سے اور داؤ د نے جالوت کوقتل کیا اور دی اس کواللہ نے بادشاہی اور حکمت اور سکھایا اسے جو کچھ چاہا اور اگر نہ ہٹاتا اللہ لوگوں کو( یعنی )ان کے بعض ( شر پسندوں ) کو بعض ( صالح لوگوں ) کے ذریعے ( تو ) یقینا زمین ( کا نظام ) بگڑ جاتا اورلیکن اللہ فضل کرنے والاہے تمام جہان والوں پر ۔",
        "English": "Then they vanquished them by the leave of Allah, and Da'ud slew Jalut, and Allah vouchsafed him dominion, and Wisdom and taught him of that which He Willed. And, it not for Allah's repelling people, some of them by means of others, the earth surely were corrupted; but Allah is Gracious unto the Worlds."
      },
      {
        "ayet_no": 252,
        "arbi": "تِلْكَ اٰيٰتُ اللّٰهِ نَتْلُوْھَا عَلَيْكَ بِالْحَقِّ ۭ وَاِنَّكَ لَمِنَ الْمُرْسَلِيْنَ",
        "Urdu": "یہ اللہ کے احکام ہیں(کہ) انہیں ہم پڑھ کرسناتے ہیں آپ کو حق کے ساتھ اوربے شک آپ یقینا پیغمبروں میں سے ہیں ۔",
        "English": "These are the revelations of Allah We rehearse them unto thee with truth, and verily thou art of the sent ones."
      },
      {
        "ayet_no": 253,
        "arbi": "تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَھُمْ عَلٰي بَعْضٍ  ۘ مِنْھُمْ مَّنْ كَلَّمَ اللّٰهُ وَرَفَعَ بَعْضَھُمْ دَرَجٰتٍ ۭ وَاٰتَيْنَا عِيْسَى ابْنَ مَرْيَمَ الْبَيِّنٰتِ وَاَيَّدْنٰهُ بِرُوْحِ الْقُدُسِ ۭ وَلَوْ شَاۗءَ اللّٰهُ مَا اقْتَتَلَ الَّذِيْنَ مِنْۢ بَعْدِھِمْ مِّنْۢ بَعْدِ مَا جَاۗءَتْھُمُ الْبَيِّنٰتُ وَلٰكِنِ اخْتَلَفُوْا فَمِنْھُمْ مَّنْ اٰمَنَ وَمِنْھُمْ مَّنْ كَفَرَ  ۭ وَلَوْ شَاۗءَ اللّٰهُ مَا اقْتَتَلُوْا  ۣوَلٰكِنَّ اللّٰهَ يَفْعَلُ مَا يُرِيْدُ",
        "Urdu": "یہ سب رسول ،ہم نے فضیلت دی ہے ان میں سے بعض کو بعض پر ان میں سے (کوئی ایسا ہے)جس سے اللہ ہم کلام ہوا اوربلند کردیا ان میں سے بعض کے درجات کو اور ہم نے دیں عیسی بن مریم کو کھلی نشانیاں اور ہم نے اس کی مدد کی روح القدس(جبریل)سے اوراگراللہ چاہتا نہ لڑتے جھگڑتے (آپس میں)وہ لوگ جو ان کے بعد آئے اس کے بعد کہ آچکیں ان کے پاس کھلی نشانیاں اورلیکن انہوں نے اختلاف کیا پھران میں سے (کوئی ایساہے)جو ایمان لے آیا اور ان میں سے (کوئی ایسا ہے)جس نے کفر اختیار کیا اوراگراللہ چاہتایہ(آ پس میں)نہ لڑتے جھگڑتے اورلیکن اللہ تعالی(وہی) کرتاہے جووہ چاہتا ہے ۔",
        "English": "These apostles: We have preferred some of them above some others: of them are some unto whom Allah spake, and some He raised many degrees. And We vouchsafed unto Isa, son of Maryam, the evidences, and We aided him with the holy spirit; and had Allah so willed those who came after them had not fought among themselves after the evidences had come unto them but they differed; then of them some believed and of them some disbelieved. And had Allah so willed, they had not fought among themselves, but Allah doth whatsoever He intendeth."
      },
      {
        "ayet_no": 254,
        "arbi": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اَنْفِقُوْا مِمَّا رَزَقْنٰكُمْ مِّنْ قَبْلِ اَنْ يَّاْتِيَ يَوْمٌ لَّا بَيْعٌ فِيْهِ وَلَا خُلَّةٌ وَّلَا شَفَاعَةٌ  ۭ وَالْكٰفِرُوْنَ ھُمُ الظّٰلِمُوْنَ",
        "Urdu": "اے لوگو جوایمان لائے ہو خرچ کرو اس سے جو ہم نے تمہیں رزق دیا(اس)سے پہلے کہ آجائے وہ دن(کہ)اس میں سودے بازی نہ ہوگی اورنہ (کام آئیگی)دوستی اورنہ کوئی سفارش اور کافر ہی ظالم ہیں ۔",
        "English": "O ye who believe! spend of that wherewith We have provided you ere a day come when there will be no trafficking, nor friendship, nor intercession. The disbelievers, they are the wrong-doers."
      },
      {
        "ayet_no": 255,
        "arbi": "اَللّٰهُ لَآ اِلٰهَ اِلَّا ھُوَ  ۚ اَلْـحَيُّ الْقَيُّوْمُ ڬ لَا تَاْخُذُهٗ سِـنَةٌ وَّلَا نَوْمٌ  ۭ لَهٗ مَا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ  ۭ مَنْ ذَا الَّذِيْ يَشْفَعُ عِنْدَهٗٓ اِلَّا بِاِذْنِهٖ ۭ يَعْلَمُ مَا بَيْنَ اَيْدِيْهِمْ وَمَا خَلْفَھُمْ ۚ وَلَا يُحِيْطُوْنَ بِشَيْءٍ مِّنْ عِلْمِهٖٓ اِلَّا بِمَا شَاۗءَ  ۚ وَسِعَ كُرْسِـيُّهُ السَّمٰوٰتِ وَالْاَرْضَ ۚ وَلَا يَـــــُٔـــوْدُهٗ حِفْظُهُمَا  ۚ وَھُوَ الْعَلِيُّ الْعَظِيْمُ",
        "Urdu": "اللہ(ہی معبود برحق ہے)کوئی معبود نہیں اس کے سواء(وہ) زندہ ہے قائم رکھنے والا ہے نہیں آتی اسے اونگھ اور نہ نیند اسی کا ہے جوکچھ آسمانوں اورجو کچھ زمین میں ہے کون ہے وہ جوسفارش کرسکے اس کے سامنے مگر اس کی اجازت سے ،وہ جانتا ہے جوان کے سامنے ہے اورجو ان سے اوجھل ہے اوروہ احاطہ نہیں کرسکتے کسی چیز کا اس کے علم سے مگراس کا جو وہ چاہے گھیر رکھا ہے اس کی کرسی نے آسمانوں اورزمین کو اور نہیں تھکاتی اسے ان دونوں کی حفاظت اور وہ بہت بلند اور بہت عظمت والا ہے ۔",
        "English": "Allah! There is no god but He,-the Living, the Self-subsisting, Eternal. No slumber can seize Him nor sleep. His are all things in the heavens and on earth. Who is there can intercede in His presence except as He permit ? He know what (appear to His creatures as) before or after or behind them. Nor shall they compass aught of His knowledge except as He will. His Throne doth extend over the heavens and the earth, and He feel no fatigue in guarding and preserving them for He is the Most High, the Supreme (in glory) ."
      },
      {
        "ayet_no": 256,
        "arbi": "لَآ اِكْرَاهَ فِي الدِّيْنِ ڐ قَدْ تَّبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ ۚ فَمَنْ يَّكْفُرْ بِالطَّاغُوْتِ وَيُؤْمِنْۢ بِاللّٰهِ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقٰى ۤ لَا انْفِصَامَ لَهَا ۭ وَاللّٰهُ سَمِيْعٌ عَلِيْمٌ",
        "Urdu": "کوئی زبردستی نہیں دین (کے معاملے)میں یقینا ہدایت واضح ہوچکی ہے گمراہی سے پس جوانکار کرے طاغوت کا اورایمان لائے اللہ پریقینا اس نے تھام لیا مظبوط کڑے کو(کہ ممکن) نہیں ہے اس کا ٹوٹنا اوراللہ سننے والا جاننے والا ہے ۔",
        "English": "There is no compulsion in religion. Verily, the Right Path has become distinct from the wrong path. Whoever disbelieves in Taghut (the Rebel, the Satan) and believes in Allah, then he has grasped the most trustworthy handhold that will never break. And Allah is All-Hearer, All-Know."
      },
      {
        "ayet_no": 257,
        "arbi": "اللّٰهُ وَلِيُّ الَّذِيْنَ اٰمَنُوْا ۙيُخْرِجُهُمْ مِّنَ الظُّلُمٰتِ اِلَى النُّوْرِ ڛ وَالَّذِيْنَ كَفَرُوْٓا اَوْلِيٰۗــــــُٔــھُمُ الطَّاغُوْتُ ۙ يُخْرِجُوْنَـھُمْ مِّنَ النُّوْرِ اِلَى الظُّلُمٰتِ ۭ اُولٰۗىِٕكَ اَصْحٰبُ النَّارِ ۚ ھُمْ فِيْهَا خٰلِدُوْنَ",
        "Urdu": "اللہ دوست ہے ان لوگوں کاجو ایمان لائے وہ نکالتا ہے ا نہیں (کفر وشرک کی)تاریکیوں سے (اسلام کی)روشنی کی طرف اور جنہوں نے کفر اختیار کیا ان کے دوست طاغوت ہیں وہ نکالتے ہیں انہیں روشنی سے تاریکیوں کی طرف وہی لوگ اہل دوزخ ہیں وہ اس میں ہمیشہ رہنے والے ہیں ۔",
        "English": "Allah is the Protecting Guardian of those who believe. He bring them out of darkness into light. As for those who disbelieve, their patrons are false duties. They bring them out of light into darkness. Such are rightful owners of the Fire. They will abide therein."
      },
      {
        "ayet_no": 258,
        "arbi": "اَلَمْ تَرَ اِلَى الَّذِيْ حَاۗجَّ اِبْرٰھٖمَ فِيْ رَبِّهٖٓ اَنْ اٰتٰىهُ اللّٰهُ الْمُلْكَ ۘاِذْ قَالَ اِبْرٰھٖمُ رَبِّيَ الَّذِيْ يُـحْيٖ وَيُمِيْتُ ۙ قَالَ اَنَا اُحْيٖ وَاُمِيْتُ ۭ قَالَ اِبْرٰھٖمُ فَاِنَّ اللّٰهَ يَاْتِيْ بِالشَّمْسِ مِنَ الْمَشْرِقِ فَاْتِ بِهَا مِنَ الْمَغْرِبِ فَبُهِتَ الَّذِيْ كَفَرَ ۭ وَاللّٰهُ لَا يَهْدِي الْقَوْمَ الظّٰلِمِيْنَ",
        "Urdu": "کیا آپ نے دیکھا نہیں اس کی طرف جس نے جھگڑا کیا ابراہیم سے اس کے رب کے بارے میں کہ اللہ نے دے رکھی تھی اسے حکومت جب کہا ابراہیم نے میرا رب وہ ہے جو زند ہ کرتا ہے اورمارتا ہے وہ کہنے لگا میں(بھی)زندہ کرسکتا ہوں اورمار سکتا ہوں ابراہیم نے کہا پس بے شک اللہ لاتا ہے سورج کو مشرق سے تو تو لے آ اسے مغرب سے تو ہکابکا رہ گیا وہ جس نے کفر کیا اوراللہ ہدایت نہیں دیتا ظالموں کو ۔",
        "English": "Be think thee of him who had an argument with Abraham about his Lord, because Allah had given him the kingdom; how, when Abraham said: My Lord is He Who give life and cause death, he answered: I give life and cause death. Abraham said: Lo! Allah cause the sun to rise in the East, so do thou cause it to come up from the West. Thus was the disbeliever abashed. And Allah guid not wrongdoing folk."
      },
      {
        "ayet_no": 259,
        "arbi": "اَوْ كَالَّذِيْ مَرَّ عَلٰي قَرْيَةٍ وَّهِيَ خَاوِيَةٌ عَلٰي عُرُوْشِهَا ۚ قَالَ اَنّٰى يُـحْيٖ ھٰذِهِ اللّٰهُ بَعْدَ مَوْتِهَا ۚ فَاَمَاتَهُ اللّٰهُ مِائَـةَ عَامٍ ثُمَّ بَعَثَهٗ ۭ قَالَ كَمْ لَبِثْتَ ۭ قَالَ لَبِثْتُ يَوْمًا اَوْ بَعْضَ يَوْمٍ ۭ قَالَ بَلْ لَبِثْتَ مِائَةَ عَامٍ فَانْظُرْ اِلٰى طَعَامِكَ وَشَرَابِكَ لَمْ يَتَسَـنَّهْ ۚ وَانْظُرْ اِلٰى حِمَارِكَ وَلِنَجْعَلَكَ اٰيَةً لِّلنَّاسِ وَانْظُرْ اِلَى الْعِظَامِ كَيْفَ نُنْشِزُھَا ثُمَّ نَكْسُوْھَا لَحْــمًا ۭ فَلَمَّا تَبَيَّنَ لَهٗ ۙ قَالَ اَعْلَمُ اَنَّ اللّٰهَ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
        "Urdu": "یااس(شخص)کی طرح جوگزرا ایک بستی کے قریب سے اس حال میں وہ گری پڑی تھی اپنی چھتوں پر اس نے کہا کیسے زندہ(آباد) کرے گااسے اللہ اس کی موت کے بعد تو موت کی نیند سلادیا اسے اللہ نے سو سال(تک) پھراس نے اسے زندہ کیا (اور)کہا کتنی دیر تم ٹھہرے رہے ہو اس نے کہامیں ٹھہرا رہا ہوں ایک دن یادن کابعض حصہ فرمایا بلکہ تم ٹھہرے رہے ہوسوسال(تک) پس دیکھ اپنے کھانے اوراپنے پینے کی طرف وہ باسی نہیں ہوا،اوردیکھ اپنے گدھے کی طرف اور(یہ اس لیے کیا ہے)تاکہ ہم بنائیں تجھے ایک نشانی لوگوں کے لیے اوردیکھ(گدھے کی)ہڈیوں کی طرف کیسے ہم اسے جوڑتے ہیں پھر(کس طرح)ہم چڑھاتے ہیں ان پر گوشت(پوست) پس جب واضح ہوچکا اس پر(تو)کہا میں جانتا ہوں کہ بے شک اللہ ہر چیز پر قادر ہے ۔",
        "English": "Or (take) the similitude of one who passed by a hamlet, all in ruins to its roofs. He said: 'Oh! how shall Allah bring it (ever) to life, after (this) its death? ' but Allah caused him to die for a hundred years, then raised him up (again) . He said: 'How long didst thou tarry (thus) ? ' He said: (Perhaps) a day or part of a day.' He said: 'Nay, thou hast tarried thus a hundred years; but look at thy food and thy drink; they show no signs of age; and look at thy donkey: And that We may make of thee a sign unto the people, Look further at the bones, how We bring them together and clothe them with flesh.' When this was shown clearly to him, he said: 'I know that Allah hath power over all things.'"
      },
      {
        "ayet_no": 260,
        "arbi": "وَاِذْ قَالَ اِبْرٰھٖمُ رَبِّ اَرِنِيْ كَيْفَ تُـحْيِ الْمَوْتٰى ۭ قَالَ اَوَلَمْ تُؤْمِنْ ۭ قَالَ بَلٰي وَلٰكِنْ لِّيَطْمَىِٕنَّ قَلْبِىْ ۭ قَالَ فَخُذْ اَرْبَعَةً مِّنَ الطَّيْرِ فَصُرْھُنَّ اِلَيْكَ ثُمَّ اجْعَلْ عَلٰي كُلِّ جبلٍ مِّنْهُنَّ جُزْءًا ثُمَّ ادْعُهُنَّ يَاْتِيْنَكَ سَعْيًا ۭ وَاعْلَمْ اَنَّ اللّٰهَ عَزِيْزٌ حَكِيْمٌ",
        "Urdu": "اورجب ابراہیم نے کہا اے میرے رب تودکھا مجھے کیسے زندہ کرے گامردوں کو فرمایا اور کیا نہیں تم ایمان رکھتے کہا(ابرہیم نے) کیوں نہیں اور لیکن(میں دیکھنا اس لیے چاہتاہوں) تاکہ مطمئن ہوجائے میرا دل فرمایا(اچھا)تو لو چار پرندے پھر انہیں مانوس کرلو اپنے ساتھ پھر رکھ دو ہر پہاڑ پر ان سے (ایک ایک)ٹکڑا پھر پکارو انہیں وہ آئیں گے تیرے پاس دوڑتے ہوئے اورجان لو کہ بے شک اللہ اللہ غالب حکمت والا ہے ۔",
        "English": "And (remember) when Ibrhim (Abraham) said, 'My Lord! Show me how You give life to the dead.' He (Allh) said: 'Do you not believe?' He [Ibrhim (Abraham) ] said: 'Yes (I believe) , but to be stronger in Faith.' He said: 'Take four birds, then cause them to incline towards you (then slaughter them, cut them into pieces) , and then put a portion of them on every hill, and call them, they will come to you in haste. And know thatAllah is All-Mighty, All-Wise.'"
      },
      {
        "ayet_no" : 261,
        "arbi": "مَثَلُ الَّذِيْنَ يُنْفِقُوْنَ اَمْوَالَھُمْ فِيْ سَبِيْلِ اللّٰهِ كَمَثَلِ حَبَّةٍ اَنْۢبَتَتْ سَبْعَ سَـنَابِلَ فِيْ كُلِّ سُنْبُلَةٍ مِّائَةُ حَبَّةٍ ۭوَاللّٰهُ يُضٰعِفُ لِمَنْ يَّشَاۗءُ ۭ وَاللّٰهُ وَاسِعٌ عَلِيْمٌ",
        "Urdu" : "مثال ان لوگوں کی جوخرچ کرتے ہیں اپنے مال اللہ کی راہ میں ایک دانے کی طرح ہے(کہ)وہ (دانہ)اگائے سات بالیاں ہربالی میں سو دانے ہوں اوراللہ بڑھادیتا ہے جس کے لیے چاہتا ہے اوراللہ بہت وسعت والا،سب کچھ جاننے والا ہے ۔",
        "English": "The likeness of those who spend their wealth in Allah's way is as the likeness of a grain which groweth seven ears, in every ear a hundred grains. Allah giveth increase manifold to whom He will. Allah is All-Embracing, All-Knowing."
      },
      {
        "ayet_no" : 262,
        "arbi": "اَلَّذِيْنَ يُنْفِقُوْنَ اَمْوَالَھُمْ فِيْ سَبِيْلِ اللّٰهِ ثُمَّ لَا يُتْبِعُوْنَ مَآ اَنْفَقُوْا مَنًّا وَّلَآ اَذًى ۙ لَّھُمْ اَجْرُھُمْ عِنْدَ رَبِّهِمْ ۚ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا ھُمْ يَحْزَنُوْنَ",
        "Urdu" : "وہ لوگ جوخرچ کرتے ہیں اپنے مال اللہ کی راہ میں پھر وہ نہیں جتاتے احسان(اس پر)جووہ خرچ کریں اورنہ ہی دکھ (دیتے ہیں) ان کے لیے ان کا اجر ہے ان کے رب کے پاس اور نہ ان پرکوئی خوف ہوگا اورنہ وہ غمگین ہوں گے ۔",
        "English": "Those who spend their wealth in the Cause of Allah, and do not follow up their gifts with reminders of their generosity or with injury, their reward is with their Lord. On them shall be no fear, nor shall they grieve."
      },
      {
        "ayet_no" : 263,
        "arbi": "قَوْلٌ مَّعْرُوْفٌ وَّمَغْفِرَةٌ خَيْرٌ مِّنْ صَدَقَةٍ يَّتْبَعُهَآ اَذًى ۭ وَاللّٰهُ غَنِىٌّ حَلِيْمٌ",
        "Urdu" : "اچھی بات (کہنا)اوردرگزر کرنا بہتر ہے (اس)صدقے سے (کہ)اس کے پیچھے ہوایذا رسانی اوراللہ تعالی بے نیاز اور برد بار ہے ۔",
        "English": "Kind words and forgiving of faults are better than Sadaqah (charity) followed by injury. And Allah is Rich (Free of all wants) and He is Most-Forbearing."
      },
      {
        "ayet_no" : 264,
        "arbi": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تُبْطِلُوْا صَدَقٰتِكُمْ بِالْمَنِّ وَالْاَذٰى ۙ كَالَّذِيْ يُنْفِقُ مَالَهٗ رِئَاۗءَ النَّاسِ وَلَا يُؤْمِنُ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِ ۭ فَمَثَلُهٗ كَمَثَلِ صَفْوَانٍ عَلَيْهِ تُرَابٌ فَاَصَابَهٗ وَابِلٌ فَتَرَكَهٗ صَلْدًا  ۭ لَا يَـقْدِرُوْنَ عَلٰي شَيْءٍ مِّمَّا كَسَبُوْا  ۭ وَاللّٰهُ لَا يَهْدِي الْقَوْمَ الْكٰفِرِيْنَ",
        "Urdu" : "اے لوگو!جوایمان لائے ہو مت ضائع کرو اپنے صدقات کو احسان جتلا کر اوردکھ(پہنچاکر)(اس شخص کی) طرح جوخرچ کرتا ہے اپنا مال لوگوں کودکھلانے کی خاطر اورنہ اللہ پر ایمان رکھتا ہے اور(نہ)آخرت کے دن پر،تواس کی مثال ایک چٹان کی مثال کی طرح ہے(کہ)اس پرمٹی ہو پھربرسے اس پر زور کی بارش تو چھوڑ جائے اسے بالکل صاف(اسی طرح ریاکار) نہیں قدرت رکھتے کسی چیز پر اس سے جوانہوں نے کمایا اوراللہ ہدایت نہیں دیتا کافر قوم کو ۔",
        "English": "O ye who believe! Render not vain your alms giving by reproach and injury, like him who spend his wealth only to be seen of men and believe not in Allah and the Last Day. His likeness is as the likeness of a rock whereon is dust of earth; a rainstorm smite it, leaving it smooth and bare. They have no control of aught of that which they have gained. Allah guide not the disbelieving folk."
      },{
        "ayet_no" : 265,
        "arbi": "وَمَثَلُ الَّذِيْنَ يُنْفِقُوْنَ اَمْوَالَھُمُ ابْتِغَاۗءَ مَرْضَاتِ اللّٰهِ وَتَثْبِيْتًا مِّنْ اَنْفُسِهِمْ كَمَثَلِ جَنَّةٍۢ بِرَبْوَةٍ اَصَابَهَا وَابِلٌ فَاٰ تَتْ اُكُلَهَا ضِعْفَيْنِ ۚ فَاِنْ لَّمْ يُصِبْهَا وَابِلٌ فَطَلٌّ ۭ وَاللّٰهُ بِمَا تَعْمَلُوْنَ بَصِيْرٌ",
        "Urdu" : "اور مثال ان لوگوں کی جوخرچ کرتے ہیں اپنے مال اللہ کی خوشنودی چاہتے ہوئے اور اپنے نفسوں کی دل جمعی کے ساتھ ایک باغ کی مثال کی طرح ہے(جو) بلند جگہ پر ہو برسے اس پر زور کی بارش پھر لائے وہ اپنا پھل دگنا پس اگرنہ برسے اس پر تیر بارش تو پھوار(ہی کافی ہو جاتی ہے)اوراللہ جو کام تم کرتے ہو دیکھ رہا ہے ۔",
        "English": "And the likeness of those who expend their riches seeking the pleasure of Allah and for the strengthening of their souls is as the likeness of a garden on a height. A heavy rain falleth upon it, and it yieldeth its fruits two-fold and if no heavy rain falleth upon it, then a gentle rain and Allah is of that which ye work Beholder."
      },
      {
        "ayet_no" : 266,
        "arbi": "اَيَوَدُّ اَحَدُكُمْ اَنْ تَكُوْنَ لَهٗ جَنَّةٌ مِّنْ نَّخِيْلٍ وَّاَعْنَابٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ ۙ لَهٗ فِيْهَا مِنْ كُلِّ الثَّمَرٰتِ ۙ وَاَصَابَهُ الْكِبَرُ وَلَهٗ ذُرِّيَّةٌ ضُعَفَاۗءُ ښ فَاَصَابَهَآ اِعْصَارٌفِيْهِ نَارٌفَاحْتَرَقَتْ ۭ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَكُمُ الْاٰيٰتِ لَعَلَّكُمْ تَتَفَكَّرُوْنَ",
        "Urdu" : "کیا پسند کرتا ہے تم میں سے کوئی ایک کہ ہو اس کا ایک باغ کھجوروں اور انگوروں کا چلتی ہوں اس کے نیچے نہریں اس کے لیے ہوں اس میں ہرقسم کا پھل اور آلے اسے بڑھاپا اوراس کی کمزور اولاد ہو پھر آلے اس(باغ)کو بگولا اس میں آگ ہو پس وہ جل جائے ،اسی طرح اللہ تعالی بیان کرتا ہے ۔ تمہارے لیے (اپنی)آیات تاکہ تم غور و فکر کرو ۔",
        "English": "Would any of you like to have a garden of palm-trees and vines, with rivers flowing underneath it, with all kinds of fruit for him therein; and old age hath stricken him and he hath feeble offspring; and a fiery whirlwind strike it and it is (all) consumed by fire. Thus Allah make plain His revelations unto you, in order that ye may give thought."
      },
      {
        "ayet_no" : 267,
        "arbi": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اَنْفِقُوْا مِنْ طَيِّبٰتِ مَا كَسَبْتُمْ وَمِمَّآ اَخْرَجْنَا لَكُمْ مِّنَ الْاَرْضِ ۠ وَلَا تَيَمَّمُوا الْخَبِيْثَ مِنْهُ تُنْفِقُوْنَ وَلَسْتُمْ بِاٰخِذِيْهِ اِلَّآ اَنْ تُغْمِضُوْا فِيْهِ ۭ وَاعْلَمُوْٓا اَنَّ اللّٰهَ غَنِىٌّ حَمِيْدٌ",
        "Urdu" : "اے لوگو!جوایمان لائے ہو خرچ کرو اچھی چیزوں میں سے جوتم نے کمایا ہو اوراس سے جوہم نے نکالا تمہارے لیے زمین سے اورنہ تم قصد کرو ردی چیز کا(کہ)اس سے تم خرچ کرتے ہواور نہیں ہو تم خود اس کولینے والے مگریہ کہ تم چشم پوشی کرلو اس(اس بارے)میں اورجان لو کہ بے شک اللہ بے نیاز ،خوبیوں والا ہے ۔",
        "English": "Satan promise You poverty and command you to niggardliness, whereas Allah promise you forgiveness from Himself and abundance; and Allah is Bounteous, Knowing."
      },
      {
        "ayet_no" : 268,
        "arbi": "اَلشَّيْطٰنُ يَعِدُكُمُ الْفَقْرَ وَيَاْمُرُكُمْ بِالْفَحْشَاۗءِ ۚ وَاللّٰهُ يَعِدُكُمْ مَّغْفِرَةً مِّنْهُ وَفَضْلًا ۭ وَاللّٰهُ وَاسِعٌ عَلِيْمٌ",
        "Urdu" : "شیطان تمہیں ڈراتا ہے مفلسی سے اوروہ تمہیں حکم دیتا ہے بے حیائی کا اوراللہ تم سے وعدہ کرتاہے مغفرت کااپنی طرف سے اور فضل کا اوراللہ وسعت والا،علم والا ہے ۔",
        "English": "Satan promise You poverty and command you to niggardliness, whereas Allah promise you forgiveness from Himself and abundance; and Allah is Bounteous, Knowing."
      },
      {
        "ayet_no" : 269,
        "arbi": "يُّؤْتِي الْحِكْمَةَ مَنْ يَّشَاۗءُ ۚ وَمَنْ يُّؤْتَ الْحِكْمَةَ فَقَدْ اُوْتِيَ خَيْرًا كَثِيْرًا ۭوَمَا يَذَّكَّرُ اِلَّآ اُولُوا الْاَلْبَابِ",
        "Urdu" : "وہ عطاکرتا ہے حکمت جسے چاہتا ہے اورجسے نوازا گیاحکمت سے تویقینا وہ نوازا گیا بہت بڑی خیر سے اور نہیں نصیحت قبول کرتے مگر کم عقل والے ۔",
        "English": "He grants Hikmah to whom He pleases, and he, to whom Hikmah is granted, is indeed granted abundant good. But none remember (will receive admonition) except men of understanding."
      },
      {
        "ayet_no" : 270,
        "arbi": "وَمَآ اَنْفَقْتُمْ مِّنْ نَّفَقَةٍ اَوْ نَذَرْتُمْ مِّنْ نَّذْرٍ فَاِنَّ اللّٰهَ يَعْلَمُهٗ ۭ وَمَا لِلظّٰلِمِيْنَ مِنْ اَنْصَارٍ",
        "Urdu" : "اورجو تم خرچ کرو کسی بھی قسم کا خرچ یاتم نذر مانو کوئی نذر،تو بے شک اللہ اسے جانتا ہے اور نہیں ہے ظالموں کاکوئی مددگار ۔",
        "English": "And whatever you spend for spending (e.g., in Sadaqah - charity, etc. for Allah's Cause) or whatever vow you make, be sure Allah knows it all. And for the Zlimn (wrong-doers, etc.) there are no helpers."
      },
      {
        "ayet_no" : 271,
        "arbi": "اِنْ تُبْدُوا الصَّدَقٰتِ فَنِعِمَّا هِىَ  ۚ وَاِنْ تُخْفُوْھَا وَتُؤْتُوْھَا الْفُقَرَاۗءَ فَھُوَ خَيْرٌ لَّكُمْ ۭ وَيُكَفِّرُ عَنْكُمْ مِّنْ سَيِّاٰتِكُمْ ۭ وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرٌ",
        "Urdu" : "اگرتم ظاہر کرو(اپنے)صدقات کو تووہ بھی اچھا ہے اوراگرتم چھپالو انہیں اور فقراءکودیدو وہ(صدقات)تووہ زیادہ بہتر ہے تمہارے لیے اور(اوران صدقات کی وجہ سے)وہ دور کردے گا تم سے تمہارے گناہ اوراللہ اس سے جوتم عمل کرتے ہو خوب باخبر ہے ۔",
        "English": "If ye disclose the alms, even so it is well, and if ye hide them and give them unto the poor, it will be better for you and He will expiate some of your misdeeds Allah is of that which ye work Aware."
      },
      {
        "ayet_no" : 272,
        "arbi": "لَيْسَ عَلَيْكَ ھُدٰىھُمْ وَلٰكِنَّ اللّٰهَ يَهْدِيْ مَنْ يَّشَاۗءُ ۭ وَمَا تُنْفِقُوْا مِنْ خَيْرٍ فَلِاَنْفُسِكُمْ ۭ وَمَا تُنْفِقُوْنَ اِلَّا ابْتِغَاۗءَ وَجْهِ اللّٰهِ ۭوَمَا تُنْفِقُوْا مِنْ خَيْرٍ يُّوَفَّ اِلَيْكُمْ وَاَنْتُمْ لَا تُظْلَمُوْنَ",
        "Urdu" : "نہیں ہے آپ پر(ذمہ داری)ان کو ہدایت دینے کی اورلیکن اللہ ہی ہدایت دیتاہے جسے وہ چاہتا ہے اورجومال تم خرچ کرو گے تووہ تمہارے اپنے لیے (مفید)ہے اور نہیں تم خرچ کرتے مگر اللہ کی خوش نودی حاصل کرنے کے لیے اور جوتم خرچ کرو گے کوئی مال(بطور خیرات)پوراپورا(اجر)دے دیاجائے گا تمہیں (قیامت کے دن)اورتم ظلم نہیں کیےجاؤ گے ۔",
        "English": "Not on thee is their guidance, but Allah guide whomsoever He list. And whatsoever ye expend of good it is for your own souls, and ye expend not save to seek Allah's countenance and whatsoever ye expend of good shall be repaid to you, and ye shall not be wronged."
      },
      {
        "ayet_no" : 273,
        "arbi": "لِلْفُقَرَاۗءِ الَّذِيْنَ اُحْصِرُوْا فِيْ سَبِيْلِ اللّٰهِ لَا يَسْتَطِيْعُوْنَ ضَرْبًا فِي الْاَرْضِ ۡ يَحْسَبُھُمُ الْجَاهِلُ اَغْنِيَاۗءَ مِنَ التَّعَفُّفِ ۚ تَعْرِفُھُمْ بِسِيْمٰھُمْ ۚ لَا يَسْــَٔـلُوْنَ النَّاسَ اِلْحَافًا ۭ وَمَا تُنْفِقُوْا مِنْ خَيْرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيْمٌ",
        "Urdu" : "یہ خیرات)ان فقیروں کے لیے جو رکے ہوئے ہیں اللہ کی راہ میں،وہ طاقت نہیں رکھتے چلنے پھرنے کی (اپنے معاش کے لیے)زمین ،گمان کرتاہے ا نہیں ناواقف مالدار،نہ مانگنے کی وجہ سے آپ پہچان سکتے ہیں ا نہیں ان کے چہروں سے نہیں وہ سوال کرتے لوگوں سے لپٹ کر اورجومال تم خرچ کرو گے(خیرات کے طور پر)تویقینا اللہ اس کو خوب جاننے والا ہے ۔",
        "English": "Alms are for the poor who are restricted in the way of Allah, disabled from going about in the land. The (unknowing take them for the affluent because of their modesty thou I wouldst recognise them by their appearance: they ask not of men with importunity. And whatsoever ye shall expend of good, verily Allah is thereof Know"
      },
      {
        "ayet_no" : 274,
        "arbi": "اَلَّذِيْنَ يُنْفِقُوْنَ اَمْوَالَھُمْ بِالَّيْلِ وَالنَّهَارِ سِرًّا وَّعَلَانِيَةً فَلَھُمْ اَجْرُھُمْ عِنْدَ رَبِّهِمْ ۚ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا ھُمْ يَحْزَنُوْنَ",
        "Urdu" : "وہ لوگ جوخرچ کرتے ہیں اپنے مال رات اوردن کو،چھپا کر اورعلانیہ طور پر توان کے لیے ان کا اجر ہے ان کے رب کے پاس اور نہ ان پرکوئی خوف ہوگا اورنہ وہ غمگین ہوں گے ۔",
        "English": "Those who expend their riches by night and by day, in secret and openly, theirs shall be their hire with their Lord; no fear shall come on them, nor shall they grieve."
      },
      {
        "ayet_no" : 275,
        "arbi": "اَلَّذِيْنَ يَاْكُلُوْنَ الرِّبٰوا لَا يَقُوْمُوْنَ اِلَّا كَمَا يَقُوْمُ الَّذِيْ يَتَخَبَّطُهُ الشَّيْطٰنُ مِنَ الْمَسِّ ذٰلِكَ بِاَنَّھُمْ قَالُوْٓا اِنَّمَا الْبَيْعُ مِثْلُ الرِّبٰوا ۘ وَاَحَلَّ اللّٰهُ الْبَيْعَ وَحَرَّمَ الرِّبٰوا ۭ فَمَنْ جَاۗءَهٗ مَوْعِظَةٌ مِّنْ رَّبِّهٖ فَانْتَهٰى فَلَهٗ مَا سَلَفَ ۭ وَاَمْرُهٗٓ اِلَى اللّٰهِ ۭ وَ مَنْ عَادَ فَاُولٰۗىِٕكَ اَصْحٰبُ النَّارِ ۚ ھُمْ فِيْهَا خٰلِدُوْنَ",
        "Urdu" : "وہ لوگ جو سود کھاتے ہیں وہ نہیں اٹھیں گے مگرجیسے اٹھتا ہے وہ جو دیوانہ کردیاہو اسے شیطان نے چھو کر،یہ (حالت)اس وجہ سے ہوگی کہ بے شک انہوں نے کہا بے شک تجارت سود ہی کی مانند ہے حالانکہ اللہ نے حلال قرار دیا ہے تجارت کو اورحرام کردیا ہے سود کو پس جو(شخص کہ) آئی اس کے پاس نصیحت اس کے رب کی طرف سے پھروہ باز آگئے(سود سے) تووہ اسی کاہے جو وہ پہلے لے چکا ہے اور اس کامعاملہ اللہ کے سپر د ہے (وہ معاف کرے یا سزاد ے)اورجوکوئی پھر کرے(سودی کاروبار) تو وہی لوگ اہل دوزخ ہیں وہ اس میں ہمیشہ رہنے والے ہیں ۔",
        "English": "Those who eat Rib (usury) will not stand (on the Day of Resurrection) except like the standing of a person beaten by Shaitan (Satan) leading him to insanity. That is because they say: ' Trading is only like Rib (usury) ,' whereasAllah has permitted trading and forbidden Rib (usury) . So whosoever receives an admonition from his Lord and stops eating Rib (usury) shall not be punished for the past; his case is forAllah (to judge) ; but whoever returns [to Rib (usury) ], such are the dwellers of the Fire - they will abide therein."
      },
      {
        "ayet_no" : 276,
        "arbi": "يَمْحَقُ اللّٰهُ الرِّبٰوا وَيُرْبِي الصَّدَقٰتِ ۭ وَاللّٰهُ لَا يُحِبُّ كُلَّ كَفَّارٍ اَثِيْمٍ",
        "Urdu" : "مٹاتا ہے اللہ سود کو اوربڑھاتا ہے صدقات کو اوراللہ نہیں پسند کرتا ہر ناشکرے ، گناہ گار کو ۔",
        "English": "Allah obliterate usury, and increase the alms. And Allah love not any ingrate sinner."
      },
      {
        "ayet_no" : 277,
        "arbi": "اِنَّ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ وَاَقَامُوا الصَّلٰوةَ وَاٰتَوُا الزَّكٰوةَ لَھُمْ اَجْرُھُمْ عِنْدَ رَبِّهِمْ ۚ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا ھُمْ يَحْزَنُوْنَ",
        "Urdu" : "بے شک وہ لوگ جو ایمان لائے اورنیک عمل کیے اور نماز قائم کی اورزکوة اداکی ان کے لیے ان کا اجر ہے ان کے رب کے پاس اور نہ ان پر کوئی خوف ہو گا اورنہ وہ غمگین ہوں گے ۔",
        "English": "Verily those who believe and work righteous works and establish prayer and give the Poor-rate, theirs shall be their hire with their Lord: no fear shall come on them nor shall they grieve."
      },
      {
        "ayet_no" : 278,
        "arbi": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَذَرُوْا مَا بَقِيَ مِنَ الرِّبٰٓوا اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
        "Urdu" : "اے وہ لوگو جو ایمان لائے ہواللہ سے ڈر جاؤ اور چھوڑ دو جو باقی رہ گیا سود اگر ہو تم مومن ۔",
        "English": "O you who believe! Be afraid of Allah and give up what remains (due to you) from Rib (usury) (from now onward) , if you are (really) believers."
      },
      {
        "ayet_no" : 279,
        "arbi": "فَاِنْ لَّمْ تَفْعَلُوْا فَاْذَنُوْا بِحَرْبٍ مِّنَ اللّٰهِ وَرَسُوْلِهٖ ۚ وَاِنْ تُبْتُمْ فَلَكُمْ رُءُوْسُ اَمْوَالِكُمْ ۚ لَا تَظْلِمُوْنَ وَلَا تُظْلَمُوْنَ",
        "Urdu" : "پس اگر تم نے ایسا نہ کیا تو ہوشیار ہوجاؤ اللہ اور اس کے رسول سے جنگ کے لیے اور اگر تم توبہ کرلو(سود سے)توتمہارے لیے ہیں تمہارے اصل مال نہ تم ظلم کرواورنہ تم پر ظلم کیا جائے ۔",
        "English": "But if ye will do it not, then be apprised of war from Allah and His apostle. And if ye repent, then yours shall be your capital sums; ye shall neither wrong nor be wronged."
      },
      {
        "ayet_no" : 280,
        "arbi": "وَاِنْ كَانَ ذُوْ عُسْرَةٍ فَنَظِرَةٌ اِلٰى مَيْسَرَةٍ ۭ وَاَنْ تَصَدَّقُوْا خَيْرٌ لَّكُمْ اِنْ كُنْتُمْ تَعْلَمُوْنَ",
        "Urdu" : "اوراگرہو (مقروض)تنگی والا(تنگ دست) تو مہلت دینی چاہیے آسودہ حالی تک اور یہ کہ تم صدقہ کرو(اورراس المال چھوڑ دو)زیادہ بہتر ہے تمہارے لیے اگرہوتم سمجھ بوجھ رکھتے ۔",
        "English": "And if one be in difficulties, then let there be and deferment until easiness. But if ye for go, it were better for you if ye knew."
      },
      {
        "ayet_no" : 281,
        "arbi": "وَاتَّقُوْا يَوْمًا تُرْجَعُوْنَ فِيْهِ اِلَى اللّٰهِ ۼ ثُمَّ تُوَفّٰى كُلُّ نَفْسٍ مَّا كَسَبَتْ وَھُمْ لَا يُظْلَمُوْنَ",
        "Urdu" : "اورڈرو اس دن سے(کہ)تم لوٹائے جاؤ گے اس میں اللہ کی طرف پھر پوراپورا بدلہ دیاجائے گا ہرنفس کو جو اس نے کیا ہوگا اور وہ ظلم نہیں کے جائیں گے ۔",
        "English": "And be afraid of the Day when you shall be brought back to Allah. Then every person shall be paid what he earned, and they shall not be dealt with unjustly."
      },
      {
        "ayet_no" : 282,
        "arbi": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِذَا تَدَايَنْتُمْ بِدَيْنٍ اِلٰٓى اَجَلٍ مُّسَمًّى فَاكْتُبُوْهُ ۭ وَلْيَكْتُبْ بَّيْنَكُمْ كَاتِبٌۢ بِالْعَدْلِ ۠ وَلَا يَاْبَ كَاتِبٌ اَنْ يَّكْتُبَ كَمَا عَلَّمَهُ اللّٰهُ فَلْيَكْتُبْ ۚ وَلْيُمْلِلِ الَّذِيْ عَلَيْهِ الْحَقُّ وَلْيَتَّقِ اللّٰهَ رَبَّهٗ وَلَا يَبْخَسْ مِنْهُ شَـيْــــًٔـا ۭ فَاِنْ كَانَ الَّذِيْ عَلَيْهِ الْحَقُّ سَفِيْهًا اَوْ ضَعِيْفًا اَوْ لَا يَسْتَطِيْعُ اَنْ يُّمِلَّ ھُوَ فَلْيُمْلِلْ وَلِيُّهٗ بِالْعَدْلِ ۭ وَاسْتَشْهِدُوْا شَهِيْدَيْنِ مِنْ رِّجَالِكُمْ ۚ فَاِنْ لَّمْ يَكُوْنَا رَجُلَيْنِ فَرَجُلٌ وَّامْرَاَتٰنِ مِمَّنْ تَرْضَوْنَ مِنَ الشُّهَدَاۗءِ اَنْ تَضِلَّ اِحْدٰىھُمَا فَتُذَكِّرَ اِحْدٰىهُمَا الْاُخْرٰى ۭ وَلَا يَاْبَ الشُّهَدَاۗءُ اِذَا مَا دُعُوْا ۭ وَلَا تَسْــَٔـــمُوْٓا اَنْ تَكْتُبُوْهُ صَغِيْرًا اَوْ كَبِيْرًا اِلٰٓى اَجَلِهٖ ۭ ذٰلِكُمْ اَقْسَطُ عِنْدَ اللّٰهِ وَاَقْوَمُ لِلشَّهَادَةِ وَاَدْنٰٓى اَلَّا تَرْتَابُوْٓا اِلَّآ اَنْ تَكُوْنَ تِجَارَةً حَاضِرَةً تُدِيْرُوْنَهَا بَيْنَكُمْ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ اَلَّا تَكْتُبُوْھَا ۭ وَاَشْهِدُوْٓا اِذَا تَبَايَعْتُمْ ۠وَلَا يُضَاۗرَّ كَاتِبٌ وَّلَا شَهِيْدٌ ڛ وَاِنْ تَفْعَلُوْا فَاِنَّهٗ فُسُوْقٌۢ بِكُمْ ۭ وَاتَّقُوا اللّٰهَ ۭ وَيُعَلِّمُكُمُ اللّٰهُ ۭ وَاللّٰهُ بِكُلِّ شَيْءٍ عَلِيْمٌ",
        "Urdu" : "اے لوگو جو ایمان لائے ہو جب تم آ پس میں لین دین کرو ادھار کا ایک وقت مقررہ تک تواسے لکھ لیاکرو اور چاہیے کہ لکھے تمہارے درمیان لکھنے والا عدل کے ساتھ اور نہ انکار کرے لکھنے والا(اس بات سے) کہ وہ لکھے جیسا کہ اسے سکھایا ہے اللہ نے پس چاہیے کہ لکھے ،اور چاہے کہ لکھوائے وہ جس پر حق(قرض) ہے اور چاہیے کہ وہ اللہ سے ڈرے (جو)اس کا رب ہے اور نہ وہ کمی کرے اس سے کچھ بھی پس اگر ہووہ جس پر حق(قرض) ہے نادان یا کمزور یا وہ طاقت نہ رکھتا ہو کہ لکھوائے وہ تو چاہیے کہ لکھوادے اس کا ولی عدل کے ساتھ اورگواہ بنالو دوگواہ اپنے مردوں میں سے پس اگرنہ ہوں دومرد توایک آدمی اوردوعورتیں ان میں سے جنہیں تم پسند کرتے ہو گواہوں میں سے کہ (اگر)بھول چوک ہوجائے ان دونوں میں سے ایک سے تو یاد دلائے ان دونوں میں سے ایک دوسری کو اور نہ انکار کریں گواہ جب وہ بلائے جائیں اورنہ تم جی چڑاؤ (اس بات سے)کہ تم اسے لکھو چھوٹا (معاملہ) ہو یا بڑا،اس کی مقررہ میعاد تک یہ(لکھ لینا) زیادہ انصاف کی بات ہے اللہ کے ہاں اورزیادہ مضبوط رکھنے والی چیز ہے گواہی کو اور زیادہ قریب ہے اس کے کہ نہ تم شک میں پڑو مگر یہ کہ ہو(معاملہ)نقد تجارت کا (کہ) تم لین دین کرتے ہو اس کا اپنے درمیان (آپس میں) تو نہیں ہے تم پر کوئی گناہ کہ نہ تم لکھو اسے اورگواہ بنالیاکرو جب(بھی) تم سودا بازی کرو اورنہ تکلیف دی جائے کاتب کو اورنہ گواہ کو اور اگر تم (ایسا)کرو گے تو یقینا یہ گناہ کاکام ہے تمہاری(طرف) سے اورڈرتے رہو اللہ سے اوراللہ تمہیں تعلیم دیتا ہے (مفید باتوں کی) اوراللہ ہرچیز کوخوب جاننے والا ہے ۔",
        "English": "O you who believe! When you contract a debt for a fixed period, write it down. Let a scribe write it down in justice between you. Let not the scribe refuse to write asAllah has taught him, so let him write. Let him (the debtor) who incurs the liability dictate, and he must fearAllah, his Lord, and diminish not anything of what he owes. But if the debtor is of poor understanding, or weak, or is unable himself to dictate, then let his guardian dictate in justice. And get two witnesses out of your own men. And if there are not two men (available) , then a man and two women, such as you agree for witnesses, so that if one of them (two women) errs, the other can remind her. And the witnesses should not refuse when they are called on (for evidence) . You should not become weary to write it (your contract) , whether it be small or big, for its fixed term, that is more just withAllah; more solid as evidence, and more convenient to prevent doubts among yourselves, save when it is a present trade which you carry out on the spot among yourselves, then there is no sin on you if you do not write it down. But take witnesses whenever you make a commercial contract. Let neither scribe nor witness suffer any harm, but if you do (such harm) , it would be wickedness in you. So be afraid ofAllah; and Allah teaches you. AndAllah is the All-Know of each and everything."
      },
      {
        "ayet_no" : 283,
        "arbi": "وَاِنْ كُنْتُمْ عَلٰي سَفَرٍ وَّ لَمْ تَجِدُوْا كَاتِبًا فَرِھٰنٌ مَّقْبُوْضَةٌ ۭ فَاِنْ اَمِنَ بَعْضُكُمْ بَعْضًا فَلْيُؤَدِّ الَّذِي اؤْتُمِنَ اَمَانَتَهٗ وَلْيَتَّقِ اللّٰهَ رَبَّهٗ ۭ وَلَا تَكْتُمُوا الشَّهَادَةَ ۭ وَمَنْ يَّكْتُمْهَا فَاِنَّهٗٓ اٰثِمٌ قَلْبُهٗ ۭ وَاللّٰهُ بِمَا تَعْمَلُوْنَ عَلِيْمٌ",
        "Urdu" : "اوراگر ہوتم سفر پر اور تم نہ پاؤ کوئی کاتب تو رہن باقبضہ پر(معاملہ طے کرلو)پھراگراطمینان(اعتماد) ہوجائے تم میں سے ایک کو دوسرے پر توچاہے کہ اداکردے وہ جس کے پاس امانت رکھی گئی ہے اس(قرض خواہ)کی امانت اور چاہیے کہ وہ ڈرے اللہ سے (جو)اس کارب ہے اورمت چھپاؤ تم گواہی کو او رجوچھپاتا ہے اسے تویہ یقینی بات ہے (کہ)اس کادل گناہ گار ہے اوراللہ اسے جوتم کرتے ہوخوب جاننے والا ہے۔",
        "English": "And if ye be on a journey and ye find not a scribe, then let there be a pledge taken; then, if one of you entrust the other, let the one is trusted discharge his trust, and let him fear Allah, his Lord. And hide not testimony whosoever hide and it, his heart verily is Know. Allah is of that which ye work"
      },
      {
        "ayet_no" : 284,
        "arbi": "لِلّٰهِ مَا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ ۭ وَاِنْ تُبْدُوا مَا فِيْٓ اَنْفُسِكُمْ اَوْ تُخْفُوْهُ يُحَاسِبْكُمْ بِهِ اللّٰهُ ۭ فَيَغْفِرُ لِمَنْ يَّشَاۗءُ وَيُعَذِّبُ مَنْ يَّشَاۗءُ ۭ وَاللّٰهُ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
        "Urdu" : "اللہ ہی کے لیے جوکچھ آسمانوں میں ہے اورجوکچھ زمین میں ہے اوراگر تم ظاہر کرو جوتمہارے دلوں میں ہے یاتم اسے چھپاؤ اللہ(ضرور)تم سے حساب لے گا اس کا پھروہ بخش دے گاجس کوچاہے گااوروہ عذاب دے گاجس کوچاہے گااوراللہ ہرچیز پر قادر ہے ۔",
        "English": "Allah's is whatsoever is in the heavens and Whatsoever is in the earth, and whether ye disclose that which is in your soul or conceal it, Allah will reckon with you therefor, then He will forgive whomsoever He will, and torment whomsoever He will, And Allah is over everything Potent."
      },
      {
        "ayet_no" : 285,
        "arbi": "اٰمَنَ الرَّسُوْلُ بِمَآ اُنْزِلَ اِلَيْهِ مِنْ رَّبِّهٖ وَالْمُؤْمِنُوْنَ ۭ كُلٌّ اٰمَنَ بِاللّٰهِ وَمَلٰۗىِٕكَتِهٖ وَكُتُبِهٖ وَرُسُلِهٖ ۣلَا نُفَرِّقُ بَيْنَ اَحَدٍ مِّنْ رُّسُلِهٖ ۣ وَقَالُوْا سَمِعْنَا وَاَطَعْنَا ڭ غُفْرَانَكَ رَبَّنَا وَاِلَيْكَ الْمَصِيْرُ",
        "Urdu" : "ایمان لائے رسول(محمد صلی اللہ علیہ وسلم)اس پرجو نازل کیاگیا اس کی طرف اس کے رب کی طرف سے اور سب مومن (بھی)سب ایمان لائے اللہ پر اور اس کے فرشتوں (پر)اور اس کی کتابوں اور اس کے رسولوں (پر،اورکہتے ہیں) نہیں ہم فرق کرتے کسی ایک کے درمیان اس کے رسولوں میں سے اور کہتے ہیں کہ ہم نے سنا (اللہ کے احکام کو) اورہم نے اطاعت قبول کی،تیری بخشش (چاہتے ہیں) اے ہمارے رب اور تیری ہی طرف لوٹ کرجانا ہے",
        "English": "The apostle believe in that which is sent down Unto him from his Lord, and so do the believers. Each one believe in Allah and His angels and His Books and His apostles, saying: we differentiate not between any of His apostles. And they say: we hearken and obey; Thy forgiveness, Our Lord! and Unto Thee is the return!"
      },
      {
        "ayet_no" : 286,
        "arbi": "لَا يُكَلِّفُ اللّٰهُ نَفْسًا اِلَّا وُسْعَهَا ۭ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۭرَبَّنَا لَا تُؤَاخِذْنَآ اِنْ نَّسِيْنَآ اَوْ اَخْطَاْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَآ اِصْرًا كَمَا حَمَلْتَهٗ عَلَي الَّذِيْنَ مِنْ قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهٖ ۚ وَاعْفُ عَنَّا ۪ وَاغْفِرْ لَنَا ۪ وَارْحَمْنَا ۪ اَنْتَ مَوْلٰىنَا فَانْــصُرْنَا عَلَي الْقَوْمِ الْكٰفِرِيْنَ",
        "Urdu" : "نہیں تکلیف دیتا اللہ کسی شخص کو مگر اس کی طاقت کے مطابق اس کے لیے ہے جو (نیکی) اس نے کمائی اور اس پر(وبال)ہے جواس نے (برائی)کمائی اور اے ہمارے رب ہمارا مواخذہ نہ فرما اگر ہم سے بھول چوک ہوجائے یاہم غلطی کرلیں اے ہمارے رب او رنہ ڈال ہم پر بوجھ جیسا کہ تونے ڈالا اسے ان لوگوں پر جو ہم سے پہلے تھے اے ہمارے رب اور نہ ہم پربوجھ ڈال جو ہمیں طاقت نہ ہو(کہ)اس کو(اٹھاسکیں)اور ہم سے درگزر فرما اوربخش دے ہمیں اور ہم پررحم فرما،توہمارا مولی ہے پس ہماری مدد فرما کافر قوم پر ۔",
        "English": "Allah burdens not a person beyond his scope. He gets reward for that (good) which he has earned, and he is punished for that (evil) which he has earned. 'Our Lord! Punish us not if we forget or fall into error, our Lord! Lay not on us a burden like that which You did lay on those before us (Jews and Christians) ; our Lord! Put not on us a burden greater than we have strength to bear. Pardon us and grant us Forgiveness. Have mercy on us. You are our Maul (Patron, Suppor-ter and Protector, etc.) and give us victory over the disbelieving people.'"
      }
    ]
  },
]