[
  {
    "surah_no" : 59,
    "total_ayah" : 24,
    "name" : "Surah e AL-Hashar",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "سَبَّحَ لِلّٰهِ مَا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ ۚ وَهُوَ الْعَزِيْزُ الْحَكِيْمُ",
        "Urdu" : "اللہ ہی کی تسبیح کی (اور تسبیح کرتا ہے) وہ سب کچھ جو کہ آسمانوں میں ہے اور وہ سب کچھ جو کہ زمین میں ہے اور وہی ہے سب پر غالب بڑا ہی حکمت والا",
        "English" : "Allah‘s purity has been proclaimed by all that is in the heavens and all that is in the earth. And He is the All-Mighty, the All-Wise."
      },
      {
        "ayet_no" : 2,
        "arbi" : "هُوَ الَّذِيْٓ اَخْرَجَ الَّذِيْنَ كَفَرُوْا مِنْ اَهْلِ الْكِتٰبِ مِنْ دِيَارِهِمْ لِاَوَّلِ الْحَشْرِ ڼ مَا ظَنَنْتُمْ اَنْ يَّخْرُجُوْا وَظَنُّوْٓا اَنَّهُمْ مَّانِعَتُهُمْ حُصُوْنُهُمْ مِّنَ اللّٰهِ فَاَتٰىهُمُ اللّٰهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوْا   ۤ وَقَذَفَ فِيْ قُلُوْبِهِمُ الرُّعْبَ يُخْرِبُوْنَ بُيُوْتَهُمْ بِاَيْدِيْهِمْ وَاَيْدِي الْمُؤْمِنِيْنَ ۤ فَاعْتَبِرُوْا يٰٓاُولِي الْاَبْصَارِ",
        "Urdu" : "وہ وہی ہے جس نے نکال باہر کیا اہل کتاب کے کافروں کو ان کے گھروں سے پہلے حشر میں ف۱(ورنہ ظاہری حالات کے اعتبار سے) تمہیں یہ گمان بھی نہ تھا کہ کبھی یہ لوگ اپنے گھروں سے نکل جائیں گے اور خود انہوں نے بھی یہ سمجھ رکھا تھا کہ ان کے (یہ مضبوط) قلعے ان کو بچالیں گے اللہ سے مگر اللہ (کاعذاب) ان پر وہاں سے آیا جہاں سے ان کو گماں بھی نہ تھا اور اس نے ان کے دلوں میں ایسا رعب ڈال دیا کہ یہ اپنے گھروں کو خود اپنے ہاتھوں سے بھی ویران کر رہے تھے اور اہل ایمان کے ہاتھوں سے بھی (ان کو ویران کروا رہے تھے) پس تم عبرت پکڑو اے دیدہ بینا رکھنے والو! ف۲",
        "English" : "He is the One who expelled the disbelievers of the People of the Book from their homes at the time of the first gathering. You did not expect that they would leave, and they deemed that their fortresses would protect them from Allah. But Allah came to them from where they did not expect, and cast fear in their hearts when they were spoiling their homes with their own hands and with the hands of the believers. So, learn a lesson, O you who have eyes to see."
      },
      {
        "ayet_no" : 3,
        "arbi" : "وَلَوْلَآ اَنْ كَتَبَ اللّٰهُ عَلَيْهِمُ الْجَلَاۗءَ لَعَذَّبَهُمْ فِي الدُّنْيَا ۭ وَلَهُمْ فِي الْاٰخِرَةِ عَذَابُ النَّارِ",
        "Urdu" : "اور اگر اللہ نے ان کے حق میں جلاوطنی نہ لکھ دی ہوتی تو وہ ان کو دنیا ہی میں عذاب دے ڈالتا اور آخرت میں تو ان کے لئے دوزخ کا عذاب مقرر ہے ہی",
        "English" : "If Allah had not destined exile for them, He would have punished them in the world. And for them in the Hereafter is the torment of the Fire."
      },
      {
        "ayet_no" : 4,
        "arbi" : "ذٰلِكَ بِاَنَّهُمْ شَاۗقُّوا اللّٰهَ وَرَسُوْلَهٗ ۚ وَمَنْ يُّشَاۗقِّ اللّٰهَ فَاِنَّ اللّٰهَ شَدِيْدُ الْعِقَابِ",
        "Urdu" : "یہ سب کچھ اس لئے کہ ان لوگوں نے مقابلہ کیا اللہ کا اور اس کے رسول کا اور جو کوئی اللہ کا مقابلہ کرتا ہے تو (وہ اپنے انجام کو پہنچ کر رہتا ہے کیونکہ) بیشک اللہ بڑا ہی سخت عذاب دینے والا ہے",
        "English" : "That is because they were hostile to Allah and His Messenger. And whoever has hostility with Allah (must know that) Allah is severe in punishment."
      },
      {
        "ayet_no" : 5,
        "arbi" : "مَا قَطَعْتُمْ مِّنْ لِّيْنَةٍ اَوْ تَرَكْتُمُوْهَا قَاۗىِٕمَةً عَلٰٓي اُصُوْلِهَا فَبِاِذْنِ اللّٰهِ وَلِيُخْزِيَ الْفٰسِقِيْنَ",
        "Urdu" : "جو بھی کوئی درخت کھجور کا تم لوگوں نے کاٹا (اے مسلمانو!) یا اسے باقی رہنے دیااپنی جڑوں پر تو یہ سب کچھ اللہ ہی کے حکم سے تھا اور (اللہ نے یہ حکم اس لئے دیا کہ) تاکہ وہ رسوا کرے ان بدکاروں کو",
        "English" : "Whatever palm-trees you have cut down, or have left them standing on their roots, it was with Allah‘s permission, and so that He might disgrace the transgressors."
      },
      {
        "ayet_no" : 6,
        "arbi" : "وَمَآ اَفَاۗءَ اللّٰهُ عَلٰي رَسُوْلِهٖ مِنْهُمْ فَمَآ اَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَّلَا رِكَابٍ وَّلٰكِنَّ اللّٰهَ يُسَلِّــطُ رُسُلَهٗ عَلٰي مَنْ يَّشَاۗءُ    ۭ وَاللّٰهُ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
        "Urdu" : "اور جو بھی کچھ مال لوٹایا ہے اللہ نے اپنے رسول پر ان لوگوں کے قبضے سے نکال کر تو اس پر تم لوگوں نے (اے مسلمانو!) نہ گھوڑے دوڑائے نہ اونٹ بلکہ اللہ (اپنی شان قدرت و عنایت سے) اپنے رسولوں کو جس پر چاہے تسلط(اور غلبہ) عطا فرما دیتا ہے اور اللہ ہرچیز پر پوری قدرت رکھتا ہے",
        "English" : "And that which Allah gave as spoil unto His messenger from them, ye urged not any horse or riding-camel for the sake thereof, but Allah give His messenger lordship over whom He will. Allah is Able to do all things."
      },
      {
        "ayet_no" : 7,
        "arbi" : "مَآ اَفَاۗءَ اللّٰهُ عَلٰي رَسُوْلِهٖ مِنْ اَهْلِ الْقُرٰى فَلِلّٰهِ وَ لِلرَّسُوْلِ وَ لِذِي الْقُرْبٰى وَالْيَـتٰمٰى وَالْمَسٰكِيْنِ وَابْنِ السَّبِيْلِ ۙ كَيْ لَا يَكُوْنَ دُوْلَةًۢ بَيْنَ الْاَغْنِيَاۗءِ مِنْكُمْ ۭ وَمَآ اٰتٰىكُمُ الرَّسُوْلُ فَخُذُوْهُ ۤ وَمَا نَهٰىكُمْ عَنْهُ فَانْتَهُوْا ۚ وَاتَّقُوا اللّٰهَ ۭ اِنَّ اللّٰهَ شَدِيْدُ الْعِقَابِ",
        "Urdu" : "جو بھی کچھ اللہ نے ان بستیوں کے لوگوں سے لوٹا دیا اپنے رسول کی طرف تو وہ حق ہے اللہ کا، اس کے رسول کا اور رشتہ داروں یتیموں مسکینوں اور مسافروں کا تاکہ وہ (مال) تمہارے مال دار لوگوں کے درمیان ہی گردش کرتا نہ رہ جائے ف ۱ اور جو بھی کچھ رسول تمہیں عطا فرمائیں اسے لے لیا کرو اور جس سے وہ تمہیں روکیں اس سے رک جایا کرو ف ۲ اور (ہمیشہ) ڈرتے رہا کرو اللہ سے بیشک اللہ بڑا ہی سخت عذاب دینے والا ہے",
        "English" : "Whatsoever Allah may restore Unto His apostle from the people of the cities is due Unto Allah and Unto the apostle and Unto the near of kin and the orphans and the needy and the wayfarer, so that it may not be confined to the rich among you. And whatsoever the apostle give you, take; and whatsoever he forbid you, refrain from. And fear Allah; verily Allah is Stern in chastisement."
      },
      {
        "ayet_no" : 8,
        "arbi" : "لِلْفُقَرَاۗءِ الْمُهٰجِرِيْنَ الَّذِيْنَ اُخْرِجُوْا مِنْ دِيَارِهِمْ وَاَمْوَالِهِمْ يَبْتَغُوْنَ فَضْلًا مِّنَ اللّٰهِ وَرِضْوَانًا وَّيَنْصُرُوْنَ اللّٰهَ وَرَسُوْلَهٗ  ۭ اُولٰۗىِٕكَ هُمُ الصّٰدِقُوْنَ",
        "Urdu" : "یعنی (یہ اموال دراصل حق ہیں) ان (لٹے پٹے) ضرورت مند مہاجرین کا جن کو (ناحق طور پر) نکال باہر کیا گیا ان کے گھروں اور ان کے مالوں سے وہ اللہ کا فضل اور اس کی رضامندی چاہتے ہیں اور وہ مدد کرتے ہیں اللہ (کے دین) کی اور اس کے رسول کی یہی لوگ ہیں راست باز",
        "English" : "And it is due Unto the poor Muhajirs who have been driven forth from their homes and their substance, seeking grace from Allah and His goodwill and succouring Allah and His apostle. These! they are the truthful."
      },
      {
        "ayet_no" : 9,
        "arbi" : "وَالَّذِيْنَ تَبَوَّؤُ الدَّارَ وَالْاِيْمَانَ مِنْ قَبْلِهِمْ يُحِبُّوْنَ مَنْ هَاجَرَ اِلَيْهِمْ وَلَا يَجِدُوْنَ فِيْ صُدُوْرِهِمْ حَاجَةً مِّمَّآ اُوْتُوا وَيُؤْثِرُوْنَ عَلٰٓي اَنْفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ ڵ وَمَنْ يُّوْقَ شُحَّ نَفْسِهٖ فَاُولٰۗىِٕكَ هُمُ الْمُفْلِحُوْنَ",
        "Urdu" : "نیز (یہ مال حق ہے) ان لوگوں کا جنہوں نے قرار پکڑلیا ان سے پہلے (ہجرت اور امن و سلامتی کے) اس گھر میں اور وہ پختہ کار ہوگئے اپنے ایمان (و یقین) میں وہ محبت کرتے ہیں ان سے جو ہجرت کر کے ان کے پاس آتے ہیں اور یہ اپنے دلوں میں کوئی خلش (اور تنگی) نہیں پاتے اس سے جو کچھ کہ ان کو دیا جائے اور (اس سے بھی بڑھ کر یہ کہ) وہ ان کواپنی جانوں پر بھی ترجیح دیتے ہیں اگرچہ خود ان کو سخت محتاجی ہو اور حقیقت یہ ہے جو کوئی اپنے نفس کی تنگی سے بچالیا گیا تو (وہ کامیاب ہوگیا کہ) ایسے ہی لوگ کامیابی پانے والے ہوتے ہیں",
        "English" : "And it is also due Unto those who are settled in the dwelling and the faith before them, loving those who have migrated Unto them, and finding in their breasts no desire for that which hath been given them, and preferring them above themselves even though there was want amongst them. And whosoever is Preserved from covetousness of his soul, then those! - they are the blissful."
      },
      {
        "ayet_no" : 10,
        "arbi" : "وَالَّذِيْنَ جَاۗءُوْ مِنْۢ بَعْدِهِمْ يَقُوْلُوْنَ رَبَّنَا اغْفِرْ لَنَا وَلِاِخْوَانِنَا الَّذِيْنَ سَبَقُوْنَا بِالْاِيْمَانِ وَلَا تَجْعَلْ فِيْ قُلُوْبِنَا غِلًّا لِّلَّذِيْنَ اٰمَنُوْا رَبَّنَآ اِنَّكَ رَءُوْفٌ رَّحِيْمٌ",
        "Urdu" : "نیز (یہ مال) ان لوگوں کا (حق ہے) جوان سب کے بعد آئے ہیں جو کہتے ہیں کہ اے ہمارے رب بخش دے ہمیں بھی اور ہمارے ان بھائیوں کو بھی جو ہم سے پہلے ایمان لا چکے ہیں اور ہمارے دلوں میں ایمان والوں کے لئے کسی قسم کا کوئی کھوٹ نہ رکھ اے ہمارے رب بلاشبہ تو بڑا ہی شفیق انتہائی مہربان ہے ف۱",
        "English" : "And it is also due Unto those who came after them, saying: 'Our Lord! forgive us and our brethren who have preceded us in the faith, and place not in our hearts any rancour toward those who had believed. Our Lord! verily Thou art Tender, Merciful."
      },
      {
        "ayet_no" : 11,
        "arbi" : "اَلَمْ تَرَ اِلَى الَّذِيْنَ نَافَقُوْا يَقُوْلُوْنَ لِاِخْوَانِهِمُ الَّذِيْنَ كَفَرُوْا مِنْ اَهْلِ الْكِتٰبِ لَىِٕنْ اُخْرِجْتُمْ لَنَخْرُجَنَّ مَعَكُمْ وَلَا نُطِيْعُ فِيْكُمْ اَحَدًا اَبَدًا ۙ وَّاِنْ قُوْتِلْتُمْ لَنَنْصُرَنَّكُمْ ۭ وَاللّٰهُ يَشْهَدُ اِنَّهُمْ لَكٰذِبُوْنَ",
        "Urdu" : "یا تم نے ان لوگوں کو نہیں دیکھا جنہوں نے منافقت کو اپنا رکھا ہے کہ وہ (کس ڈھٹائی سے) اہل کتاب کے اپنے کافر بھائیوں سے کہتے ہیں کہ اگر تمہیں نکالا گیا تو ہم بھی ضرور تمہارے ساتھ نکل پڑیں گے اور تمہارے بارے میں ہم کبھی کسی کی بھی بات نہیں مانیں گے اور اگر تم سے لڑائی کی گئی تو ہم ضرور بالضرور (اور ہر قیمت پر) تمہاری مدد کریں گے مگر اللہ گواہ ہے کہ یہ لوگ قطعی طور پر جھوٹے ہیں",
        "English" : "Did you not see the hypocrites saying to their brothers from those of the people of the Book who are unbelievers, :If you are expelled, we will certainly go out with you, and we will never obey anyone about you. And if you are fought against, we will definitely help you. Allah bears witness that they are pure liars."
      },
      {
        "ayet_no" : 12,
        "arbi" : "لَىِٕنْ اُخْرِجُوْا لَا يَخْرُجُوْنَ مَعَهُمْ ۚ وَلَىِٕنْ قُوْتِلُوْا لَا يَنْصُرُوْنَهُمْ ۚ وَلَىِٕنْ نَّصَرُوْهُمْ لَيُوَلُّنَّ الْاَدْبَارَ     ۣ ثُمَّ لَا يُنْصَرُوْنَ",
        "Urdu" : "(چنانچہ) اگر ان کو نکالا گیا تو یہ کبھی ان کے ساتھ نہیں نکلیں گے اور اگر ان سے لڑائی ہوئی تو یہ ان کی کوئی مدد نہیں کریں گے اور اگر (بالفرض) انہوں نے ان کی مدد کی بھی تو یہ یقینا پیٹھ پھیر کر بھاگ نکلیں گے پھر کہیں سے خود ان کی کبھی کوئی مدد نہ ہوگی",
        "English" : "If they are expelled, they will not go out with them, and if they are fought against, they will not help them. And even if they help them, they will surely turn their backs, then they will not be helped."
      },
      {
        "ayet_no" : 13,
        "arbi" : "لَاَانْتُمْ اَشَدُّ رَهْبَةً فِيْ صُدُوْرِهِمْ مِّنَ اللّٰهِ ۭ ذٰلِكَ بِاَنَّهُمْ قَوْمٌ لَّا يَفْقَهُوْنَ",
        "Urdu" : "بیشک ان لوگوں کے دلوں میں تمہارا خوف (اے ایمان والو!) اللہ (کے خوف) سے بھی بڑھ کر ہے یہ اس لئے کہ یہ ایسے لوگ ہیں جو سمجھتے نہیں",
        "English" : "In fact, your fear in their hearts is greater than (that of) Allah. That is because they are a people who do not understand."
      },
      {
        "ayet_no" : 14,
        "arbi" : "لَا يُقَاتِلُوْنَكُمْ جَمِيْعًا اِلَّا فِيْ قُرًى مُّحَصَّنَةٍ اَوْ مِنْ وَّرَاۗءِ جُدُرٍ ۭ بَاْسُهُمْ بَيْنَهُمْ شَدِيْدٌ     ۭ تَحْسَبُهُمْ جَمِيْعًا وَّقُلُوْبُهُمْ شَتّٰى ۭذٰلِكَ بِاَنَّهُمْ قَوْمٌ لَّا يَعْقِلُوْنَ",
        "Urdu" : "یہ کبھی اکٹھے ہو کر (کھلے میدان میں) تم سے نہیں لڑیں گے مگر قلعہ بند بستیوں میں یادیواروں کی آڑمیں ان کی لڑائی آ پس میں بڑی سخت ہے تم ان کو اکٹھا سمجھتے ہو مگر (حقیقت یہ ہے کہ) ان کے دل آ پس میں پھٹے ہوئے ہیں یہ اس لئے کہ یہ ایسے لوگ ہیں جو عقل سے کام نہیں لیتے",
        "English" : "They do not fight you, even assembled together, but in fortified towns, or from behind the walls. Their quarrelling between themselves is severe. You think that they are united, while their hearts are divided. That is because they are a people who have no sense."
      },
      {
        "ayet_no" : 15,
        "arbi" : "كَمَثَلِ الَّذِيْنَ مِنْ قَبْلِهِمْ قَرِيْبًا ذَاقُوْا وَبَالَ اَمْرِهِمْ ۚ وَلَهُمْ عَذَابٌ اَلِيْمٌ",
        "Urdu" : "ان کا حال تو انہی لوگوں جیسا ہے جو ان سے کچھ ہی پہلے اپنے کئے کا مزہ چکھ چکے ہیں اور (آخرت میں تو) ان کے لئے ایک بڑا ہی دردناک عذاب ہے",
        "English" : "The example (of Banu NaDir) is like those who were before them in near past, who tasted the evil consequence of their conduct, and for them (in the Hereafter) there is a painful punishment."
      },
      {
        "ayet_no" : 16,
        "arbi" : "كَمَثَلِ الشَّيْطٰنِ  اِذْ قَالَ لِلْاِنْسَانِ اكْفُرْ ۚ فَلَمَّا كَفَرَ قَالَ اِنِّىْ بَرِيْۗءٌ مِّنْكَ اِنِّىْٓ اَخَافُ اللّٰهَ رَبَّ الْعٰلَمِيْنَ",
        "Urdu" : "ان کی مثال تو شیطان کی سی ہے کہ وہ پہلے تو انسان سے کہتا ہے کہ تو کفر کر مگر جب وہ کفر کر بیٹھتا ہے تو یہ اس سے کہتا ہے کہ میرا تجھ سے کوئی واسطہ نہیں میں تو بہر حال اللہ سے ڈرتا ہوں جو کہ پروردگار ہے سارے جہانوں کا",
        "English" : "The example (of the hypocrites) is like the ShaiTan when he says to a human being, :Become disbeliever then once he disbelieves, he says, :I disown you; I fear Allah, the Lord of the worlds."
      },
      {
        "ayet_no" : 17,
        "arbi" : "فَكَانَ عَاقِبَتَهُمَآ اَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيْهَا ۭ وَذٰلِكَ جَزٰۗؤُا الظّٰلِمِيْنَ",
        "Urdu" : "پھر ان دونوں کا انجام یہ ہوتا ہے کہ وہ دونوں دوزخ میں ہونگے جہاں انہیں ہمیشہ رہنا ہوگا اور یہی جزا ہے ایسے ظالموں کی ف۱",
        "English" : "So the end of both of them is that they will be in the Fire, living there forever. That is the punishment of the wrongdoers."
      },
      {
        "ayet_no" : 18,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَلْتَنْظُرْ نَفْسٌ مَّا قَدَّمَتْ لِغَدٍ ۚ وَاتَّقُوا اللّٰهَ   ۭ اِنَّ اللّٰهَ خَبِيْرٌۢ بِمَا تَعْمَلُوْنَ",
        "Urdu" : "اے وہ لوگوں جو ایمان لائے ہو ڈرو تم اللہ سے اور ہر شخص کو چاہیے کہ وہ خود دیکھ لے کہ اس نے کیا سامان کیا ہے انے والے کل کے لئے اور ڈرتے رہا کرو تم (ہر حال میں اپنے) اللہ سے بیشک اللہ پوری طرح باخبر ہے ان تمام کاموں سے جو تم لوگ کرتے ہو",
        "English" : "O you who believe, fear Allah, and everybody must consider what he (or she) has sent ahead for tomorrow. And fear Allah. Surely Allah is fully aware of what you do."
      },
      {
        "ayet_no" : 19,
        "arbi" : "وَلَا تَكُوْنُوْا كَالَّذِيْنَ نَسُوا اللّٰهَ فَاَنْسٰـىهُمْ اَنْفُسَهُمْ ۭ اُولٰۗىِٕكَ هُمُ الْفٰسِقُوْنَ",
        "Urdu" : "اور تم ان لوگوں کی طرح نہ ہو جانا جنہوں نے بھلا دیا اللہ کو تو اس کے نتیجے میں اللہ نے ان کو خوداپنی جانوں سے غافل کردیا ایسے ہی لوگ ہیں فاسق (وبدکار)",
        "English" : "Do not be like those who forgot Allah, so He made them forget their own selves. Those are the sinners."
      },
      {
        "ayet_no" : 20,
        "arbi" : "لَا يَسْتَوِيْٓ اَصْحٰبُ النَّارِ وَاَصْحٰبُ الْجَنَّةِ   ۭ اَصْحٰبُ الْجَنَّةِ هُمُ الْفَاۗىِٕزُوْنَ",
        "Urdu" : "باہم یکساں (و برابر) نہیں ہوسکتے دوزخ والے اور جنت والے، جنت والے ہی حقیقت میں کامیاب (اور فائزالمرام) ہیں",
        "English" : "The people of Hell and the people of Paradise are not equal. The people of Paradise are the successful."
      },
      {
        "ayet_no" : 21,
        "arbi" : "لَوْ اَنْزَلْنَا هٰذَا الْقُرْاٰنَ عَلٰي جَبَلٍ لَّرَاَيْتَهٗ خَاشِعًا مُّتَصَدِّعًا مِّنْ خَشْيَةِ اللّٰهِ ۭ وَتِلْكَ الْاَمْثَالُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُوْنَ",
        "Urdu" : "اگر ہم اس قران کو کسی پہاڑ پر اتار دیتے تو تم اسے دیکھتے کہ وہ بھی دبا جارہا ہے اور پھٹا پڑ رہا ہے اللہ کے خوف سے اور یہ مثالیں ہم بیان کرتے ہیں لوگوں کے لئے تاکہ وہ غوروفکر سے کام لیں ف۱",
        "English" : "Had We sent down this Qur‘an to a mountain, you would have seen it humbled, burst apart out of awe for Allah. We cite such examples for people, so that they may ponder."
      },
      {
        "ayet_no" : 22,
        "arbi" : "هُوَ اللّٰهُ الَّذِيْ لَآ اِلٰهَ اِلَّا هُوَ ۚ عٰلِمُ الْغَيْبِ وَالشَّهَادَةِ   ۚ هُوَ الرَّحْمٰنُ الرَّحِيْمُ",
        "Urdu" : "وہ اللہ وہی ہے جس کے سوا کوئی معبود نہیں جو (ایک برابر) جاننے والا ہے نہاں و عیاں کو وہی ہے بڑا مہربان نہایت رحم فرمانے والا",
        "English" : "He is Allah, besides whom there is no god, the Knower of the unseen and the seen. He is All-Merciful, Very-Merciful."
      },
      {
        "ayet_no" : 23,
        "arbi" : "هُوَ اللّٰهُ الَّذِيْ لَآ اِلٰهَ اِلَّا هُوَ ۚ اَلْمَلِكُ الْقُدُّوْسُ السَّلٰمُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيْزُ الْجَبَّارُ الْمُتَكَبِّرُ ۭ سُبْحٰنَ اللّٰهِ عَمَّا يُشْرِكُوْنَ",
        "Urdu" : "وہ اللہ وہی ہے جس کے سوا کوئی معبود نہیں وہ بادشاہ حقیقی ہے نہایت پاک سراسر سلامتی امن دینے والا نگہبان سبپر غالب ہر خرابی کو درست کرنے والا بڑی ہی عظمت والا اللہ پاک ہے ان تمام چیزوں سے جن کو یہ لوگ اس کا شریک ٹھہراتے ہیں",
        "English" : "Allah is He, than Whom there is no other god;- the Sovereign, the Holy One, the Source of Peace (and Perfection) , the Guardian of Faith, the Preserver of Safety, the Exalted in Might, the Irresistible, the Supreme: Glory to Allah! (High is He) above the partners they attribute to Him."
      },
      {
        "ayet_no" : 24,
        "arbi" : "هُوَ اللّٰهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْاَسْمَاۗءُ الْحُسْنٰى ۭ يُسَبِّحُ لَهٗ مَا فِي السَّمٰوٰتِ وَالْاَرْضِ ۚ وَهُوَ الْعَزِيْزُ الْحَكِيْمُ",
        "Urdu" : "وہی اللہ ہے پیدا کرنے والا وجود بخشنے والا صورت گری کرنے والا اسی کے لئے ہیں سب اچھے نام اسی کی پاکی بیان کرتا ہے وہ سب کچھ جو کہ آسمانوں اور زمین میں ہے اور وہی ہے سب پر غالب انتہائی حکمت والا ف۲",
        "English" : "He is Allah, the Creator, the Inventor, the Shape maker. His are the Most Beautiful Names. His purity is proclaimed by all that is in the heavens and the earth, and He is the All-Mighty, the All-Wise."
      }
    ]
  }
]