[
  {
    "surah_no" : 31,
    "total_ayah" : 34,
    "name" : "Surah e Luqman",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "الۗمّۗ",
        "Urdu" : "الم ۔",
        "English" : "AlifLmMm. [These letters are one of the miracles of the Qur'n, and none butAllah (Alone) knows their meanings.]"
      },
      {
        "ayet_no" : 2,
        "arbi" : "تِلْكَ اٰيٰتُ الْكِتٰبِ الْحَكِيْمِ",
        "Urdu" : "یہ حکمت والی کتاب کی آیات ہیں ۔",
        "English" : "These are verses of the Wise Book."
      },
      {
        "ayet_no" : 3,
        "arbi" : "هُدًى وَّرَحْمَةً لِّلْمُحْسِنِيْنَ",
        "Urdu" : "ہدایت اور رحمت ہیں نیکی کرنے والوں کے لیے ۔",
        "English" : "A guidance and mercy for those who are good in their deeds"
      },
      {
        "ayet_no" : 4,
        "arbi" : "الَّذِيْنَ يُقِيْمُوْنَ الصَّلٰوةَ وَيُؤْتُوْنَ الزَّكٰوةَ وَهُمْ بِالْاٰخِرَةِ هُمْ يُوْقِنُوْنَ",
        "Urdu" : "جو نمازقائم کرتےہیں اور زکوٰۃ ادا کرتے ہیں اور آخرت پر (بھی)وہی یقین رکھتے ہیں ۔",
        "English" : "Those who establish the prayer and give the poor-rate and of the Hereafter are convinced."
      },
      {
        "ayet_no" : 5,
        "arbi" : "اُولٰۗىِٕكَ عَلٰي هُدًى مِّنْ رَّبِّهِمْ وَاُولٰۗىِٕكَ هُمُ الْمُفْلِحُوْنَ",
        "Urdu" : "وہی لوگ ہدایت پر ہیں اپنے رب کی طرف سے اور وہی لوگ ہی فلاح پانے والے ہیں ۔",
        "English" : "It is these who are on guidance given by their Lord, and it is just these who are successful."
      },
      {
        "ayet_no" : 6,
        "arbi" : "وَمِنَ النَّاسِ مَنْ يَّشْتَرِيْ لَهْوَ الْحَدِيْثِ لِيُضِلَّ عَنْ سَبِيْلِ اللّٰهِ بِغَيْرِ عِلْمٍ ڰ وَّيَتَّخِذَهَا هُزُوًا ۭ اُولٰۗىِٕكَ لَهُمْ عَذَابٌ مُّهِيْنٌ",
        "Urdu" : "اور لوگوں میں سے(کوئی ایسا ہے ) جو خرید تا ہے لغو(بے کا ر)بات کو تاکہ وہ گمراہ کرے اللّٰہ کے راستے سے بغیر علم کے اور(تاکہ) وہ بنائے اُسے(یعنی اللّٰہ کی راہ کو ) مذاق،ہی لوگ ہیں( کہ) اُنکے لیے رسوا کرنے والا عذاب ہے ۔",
        "English" : "There is a man among the people who buys discourses of distracting amusements, so that he may mislead (people) from the Way of Allah, and make a mockery of it. For such people there is a disgraceful punishment."
      },
      {
        "ayet_no" : 7,
        "arbi" : "وَاِذَا تُتْلٰى عَلَيْهِ اٰيٰتُنَا وَلّٰى مُسْتَكْبِرًا كَاَنْ لَّمْ يَسْمَعْهَا كَاَنَّ فِيْٓ اُذُنَيْهِ وَقْرًا ۚ فَبَشِّرْهُ بِعَذَابٍ اَلِيْمٍ",
        "Urdu" : "اورجب تلاوت کی جاتی ہیں اُس پر ہماری آیتیں (تو )منہ پھیر لیتاہے تکبر کرتے ہوئے گویا کہ اُس نے سنا ہی نہیں اُنہیں گویا کہ اُس کے کانوں میں بوجھ ہے سوخوشخبری دے دیں اُسے درد ناک عذاب کی ۔",
        "English" : "And when Our verses are recited to him, he turns away in arrogance, as if he did not hear them, as if there is heaviness in his ears. So give him the _good‘ news of a painful punishment."
      },
      {
        "ayet_no" : 8,
        "arbi" : "اِنَّ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَهُمْ جَنّٰتُ النَّعِيْمِ",
        "Urdu" : "بیشک وہ لوگ جو ایمان لائے اور انہوں نے نیک عمل کیے اُن کے لیے نعمت کے باغات ہیں ۔",
        "English" : "Verily those who believe and work righteous works, theirs shall be Gardens of Delight."
      },
      {
        "ayet_no" : 9,
        "arbi" : "خٰلِدِيْنَ فِيْهَا  ۭ وَعْدَ اللّٰهِ حَقًّا  ۭ وَهُوَ الْعَزِيْزُ الْحَكِيْمُ",
        "Urdu" : "اُن میں ہمیشہ رہنے والے ہیں ،اللّٰہ کا وعدہ سچا ہے اور وہ خوب غالب نہایت حکمت والا ہے ۔",
        "English" : "(They) will live in them forever. The Promise of Allah is true. And He is Almighty, Most Wise."
      },
      {
        "ayet_no" : 10,
        "arbi" : "خَلَقَ السَّمٰوٰتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا وَاَلْقٰى فِي الْاَرْضِ رَوَاسِيَ اَنْ تَمِيْدَ بِكُمْ وَبَثَّ فِيْهَا مِنْ كُلِّ دَاۗبَّةٍ ۭ وَاَنْزَلْنَا مِنَ السَّمَاۗءِ مَاۗءً فَاَنْۢبَتْنَا فِيْهَا مِنْ كُلِّ زَوْجٍ كَرِيْمٍ",
        "Urdu" : "اُس نے پید اکیا آسمانوں کوستونوں کے بغیر تم دیکھتے ہو اُنہیں ۔اور اُس نے گاڑھ دیے زمین میں مضبوط پہاڑتاکہ وہ ہلا (نہ )دے تم کو اور اُس نے پھیلا دیے اُس میں ہر قسم کے چوپائے اور ہم نے نازل کیا آسمان سے پانیپھر ہم نے اُگائے اُس میں ہر عمدہ قسم سے (غلے) ۔",
        "English" : "He has created the skies without the pillars that you may see, and placed mountains on the earth, lest it shakes with you, and spread over it all kinds of creatures. And We sent down water from the heavens, and caused to grow in it every noble pair."
      },
      {
        "ayet_no" : 11,
        "arbi" : "ھٰذَا خَلْقُ اللّٰهِ فَاَرُوْنِيْ مَاذَا خَلَقَ الَّذِيْنَ مِنْ دُوْنِهٖ ۭ بَلِ الظّٰلِمُوْنَ فِيْ ضَلٰلٍ مُّبِيْنٍ",
        "Urdu" : "یہ اللّٰہ کی مخلوق ہے تو تم مجھے دکھاؤ کیا پید اکیا ہے (اُن معبودوںنے) جو اُسکے سوا ہیں بلکہ ظالم لو گ واضح گمراہی میں ہیں ۔",
        "English" : "This is the creation of Allah. Now, show me what is created by those others, besides Him. Rather, the transgressors are in open error."
      },
      {
        "ayet_no" : 12,
        "arbi" : "وَلَقَدْ اٰتَيْنَا لُقْمٰنَ الْحِكْمَةَ اَنِ اشْكُرْ لِلّٰهِ ۭ وَمَنْ يَّشْكُرْ فَاِنَّمَا يَشْكُرُ لِنَفْسِهٖ ۚ وَمَنْ كَفَرَ فَاِنَّ اللّٰهَ غَنِيٌّ حَمِيْدٌ",
        "Urdu" : "اور بلاشبہ یقیناًہم نے دی لقمان کو حکمت یہ کہ تو اللّٰہ کا شکر کر اور جو شکر کرتاہے تو بیشک صرف وہ شکر کرتاہے اپنے نفس کے لیے اور جو ناشکری کرے تو بیشک اللّٰہ بہت بے پروابہت تعریف والا ہے ۔",
        "English" : "We gave wisdom to Luqman, and said, :Be grateful to Allah; and whoever is grateful is, in fact, grateful for his own benefit, and whoever is ungrateful, then Allah is free of all needs, worthy of all praise."
      },
      {
        "ayet_no" : 13,
        "arbi" : "وَاِذْ قَالَ لُقْمٰنُ لِابْنِهٖ وَهُوَ يَعِظُهٗ يٰبُنَيَّ لَا تُشْرِكْ بِاللّٰهِ ڼ اِنَّ الشِّرْكَ لَظُلْمٌ عَظِيْمٌ",
        "Urdu" : "اور جب کہا لقمان نے اپنے بیٹے سے جبکہ وہ نصیحت کررہا تھا اُسے اے میرے بیٹے ! اللّٰہ کے ساتھ شرک نہ کرنا بیشک شرک یقینا ً بہت بڑا ظلم ہے ۔",
        "English" : "And recall what time Luqman said unto his son, while he was exhorting him: O my son! associate not aught with Allah; verily this associating is surely a tremendous wrong."
      },
      {
        "ayet_no" : 14,
        "arbi" : "وَوَصَّيْنَا الْاِنْسَانَ بِوَالِدَيْهِ ۚ حَمَلَتْهُ اُمُّهٗ وَهْنًا عَلٰي وَهْنٍ وَّفِصٰلُهٗ فِيْ عَامَيْنِ اَنِ اشْكُرْ لِيْ وَلِوَالِدَيْكَ ۭ اِلَيَّ الْمَصِيْرُ",
        "Urdu" : "اور ہم نے وصیت(تاکید ) کی انسان کو اپنے والدین کے ساتھ (حسن سلوک کی ) اُٹھا ئے رکھا اُسے اُس کی ماںنے کمزوری پر کمزوری (کے باجود) اور اُس کا دودھ چھڑا نا دو سالوں میں (اور )یہ کہ تو شکر کر میرا اور اپنے والدین کا میری ہی طرف (تم سب کا )لوٹنا ہے ۔",
        "English" : "We commanded man (to be good) in respect of his parents. His mother carried him (in her womb) despite weakness upon weakness, and his weaning is in two years. (We said to man,) :Be grateful to Me, and to your parents. To Me is the ultimate return."
      },
      {
        "ayet_no" : 15,
        "arbi" : "وَاِنْ جَاهَدٰكَ عَلٰٓي اَنْ تُشْرِكَ بِيْ مَا لَيْسَ لَكَ بِهٖ عِلْمٌ ۙفَلَا تُطِعْهُمَا وَصَاحِبْهُمَا فِي الدُّنْيَا مَعْرُوْفًا ۡ وَّاتَّبِعْ سَبِيْلَ مَنْ اَنَابَ اِلَيَّ ۚ ثُمَّ اِلَيَّ مَرْجِعُكُمْ فَاُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُوْنَ",
        "Urdu" : "اور اگروہ دونوں زور دیںتجھ پراس پرکہ تو شریک ٹھہرائے میرے ساتھ (اُسے)جو (کہ )نہیںہے تجھے اُس کا کوئی علم تو تم اطاعت نہ کرواُن دونوں کی اور سلوک کر اُن دونوں سے دنیا میں اچھے طریقے سے اور پیروی کر اُس شخص کے راستے کی جو رجوع کرتاہے میری طرف،پھر میری ہی طرف تمہارا لوٹنا ہے تو میں تمہیں خبر دوں گا(اُس) کی جوتم عمل کرتے تھے ۔",
        "English" : "However, if they force you to ascribe partners to Me about whom you (can) have no (source of) knowledge, then do not obey them. Remain with them in this world with due fairness, but follow the way of the one who has turned himself towards Me. Then, towards Me is your return, so I shall tell you what you had been doing."
      },
      {
        "ayet_no" : 16,
        "arbi" : "يٰبُنَيَّ اِنَّهَآ اِنْ تَكُ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ فَتَكُنْ فِيْ صَخْـرَةٍ اَوْ فِي السَّمٰوٰتِ اَوْ فِي الْاَرْضِ يَاْتِ بِهَا اللّٰهُ ۭ اِنَّ اللّٰهَ لَطِيْفٌ خَبِيْرٌ",
        "Urdu" : "اے میرے پیارے بیٹےبیشک وہ (اچھائی یا برائی ) اگر ہو رائی کےکسی دانے کے برابر پھر وہ ہو کسی چٹان میں یا (وہ ہو)آسمانوں میں یا زمین میں (تو)لے آئے گا اُس کو اللّٰہ بیشک اللّٰہ بہت باریک بین خوب خبردار ہے ۔",
        "English" : "(Luqman went on saying to his son,) :My dear son, in fact, if there be anything to the measure of a grain of rye, and it be (hidden) in a rock or in the heavens or in the earth, Allah will bring it forth. Surely, Allah is All-Fine, All-Aware."
      },
      {
        "ayet_no" : 17,
        "arbi" : "يٰبُنَيَّ اَقِمِ الصَّلٰوةَ وَاْمُرْ بِالْمَعْرُوْفِ وَانْهَ عَنِ الْمُنْكَرِ وَاصْبِرْ عَلٰي مَآ اَصَابَكَ ۭ اِنَّ ذٰلِكَ مِنْ عَزْمِ الْاُمُوْرِ",
        "Urdu" : "اے میرے پیارے بیٹے ! تو نماز قائم کر اور نیکی کا حکم کر اور برائی سے روک اور صبر کر اس(تکلیف) پر جو تجھے پہنچے بے شک یہ ہمت کے کاموں میں سے ہے ۔",
        "English" : "O My son! establish prayer and command that which is reputable and forbid iniquity, and bear patiently whatsoever may befall thee; verily that is of the firmness of affairs."
      },
      {
        "ayet_no" : 18,
        "arbi" : "وَلَا تُصَعِّرْ خَدَّكَ لِلنَّاسِ وَلَا تَمْشِ فِي الْاَرْضِ مَرَحًا ۭ اِنَّ اللّٰهَ لَا يُحِبُّ كُلَّ مُخْـتَالٍ فَخُــوْرٍ",
        "Urdu" : "اور نہ پھُلا اپنا رخسار لوگوں کے لیے اور مت چل زمین میں اکڑ کر بیشک اللّٰہ نہیں پسند کرتا ہر تکبر کرنے والے فخر کرنے والے کو ۔",
        "English" : "وَلَا تُصَعِّرْ خَدَّكَ لِلنَّاسِ وَلَا تَمْشِ فِي الْاَرْضِ مَرَحًا ۭ اِنَّ اللّٰهَ لَا يُحِبُّ كُلَّ مُخْـتَالٍ فَخُــوْرٍ"
      },
      {
        "ayet_no" : 19,
        "arbi" : "وَاقْصِدْ فِيْ مَشْيِكَ وَاغْضُضْ مِنْ صَوْتِكَ ۭ اِنَّ اَنْكَرَ الْاَصْوَاتِ لَصَوْتُ الْحَمِيْرِ",
        "Urdu" : "اور میانہ روی رکھ اپنی چال میں اور پست رکھ اپنی آواز کو بے شک بدترین آوازوں میں سے یقیناً گدھوں کی آواز ہے ۔",
        "English" : "And be moderate in your walk, and lower your voice. Surely, the ugliest of voices is the voice of the donkeys."
      },
      {
        "ayet_no" : 20,
        "arbi" : "اَلَمْ تَرَوْا اَنَّ اللّٰهَ سَخَّرَ لَكُمْ مَّا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ وَاَسْبَغَ عَلَيْكُمْ نِعَمَهٗ ظَاهِرَةً وَّبَاطِنَةً ۭ وَمِنَ النَّاسِ مَنْ يُّجَادِلُ فِي اللّٰهِ بِغَيْرِ عِلْمٍ وَّلَا هُدًى وَّلَا كِتٰبٍ مُّنِيْرٍ",
        "Urdu" : "کیا تم نے دیکھا نہیں کہ بیشک اللّٰہ نے مسخر کردیا ہے تمہارے لیے جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے اوراُس نے پوری کردیں تم پر اپنی نعمتیں ظاہری اور باطنی (سب) اور لوگوں میں سے (کوئی ایسا ہے) جو جھگڑا کرتاہے اللّٰہ( کے بارے )میں بغیر کسی علم کے اور بغیر کسی ہدایت کے اور بغیر کسی روشن کتاب کے ۔",
        "English" : "Have you not seen that Allah has subjugated for you what is in the heavens and what is on the earth, and has perfected His blessings on you, both outward and inward? But among people there are those who debate about Allah with no knowledge, no guidance and no book to enlighten."
      },
      {
        "ayet_no" : 21,
        "arbi" : "وَاِذَا قِيْلَ لَهُمُ اتَّبِعُوْا مَآ اَنْزَلَ اللّٰهُ قَالُوْا بَلْ نَتَّبِعُ مَا وَجَدْنَا عَلَيْهِ اٰبَاۗءَنَا ۭ اَوَلَوْ كَانَ الشَّيْطٰنُ يَدْعُوْهُمْ اِلٰى عَذَابِ السَّعِيْرِ",
        "Urdu" : "اور جب کہا جائے اُن سے (کہ)تم پیروی کرو (اُس کی )جو نازل کیا اللّٰہ نے، وہ کہتے ہیں بلکہ ہم تو پیروی کریں گے(اسکی)جو (کہ)ہم نے پایا اس پراپنے آباؤاجداد کو اور(بھلا) کیااگرچہ ہوشیطان پکارتااُنہیں عذا ب کی طرف جہنم کے(کیا پھر بھی وہ اُنہی کی پیروی کریں گے ) ۔",
        "English" : "When it is said to them, :follow what Allah has sent down, they say, :Instead, we would follow that on which we have found our fathers. Is it so, even though the Satan has been calling them to the punishment of the flaming Fire ?"
      },
      {
        "ayet_no" : 22,
        "arbi" : "وَمَنْ يُّسْلِمْ وَجْهَهٗٓ اِلَى اللّٰهِ وَهُوَ مُحْسِنٌ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقٰى ۭ وَاِلَى اللّٰهِ عَاقِبَةُ الْاُمُوْرِ",
        "Urdu" : "اور جو سپرد کردے اپنا چہرہ اللّٰہ کی طرف اس حال میں کہ وہ نیکی کرنے والا ہو تو یقیناًاس نے اچھی طرح پکڑ لیا مضبوط کڑے کو اور اللّٰہ کی طرف ہے سب کاموں کا انجام ۔",
        "English" : "And whoever submits his self to Allah and is good in deeds, he in fact holds on to the strongest ring. Towards Allah is the ultimate end of all matters."
      },
      {
        "ayet_no" : 23,
        "arbi" : "وَمَنْ كَفَرَ فَلَا يَحْزُنْكَ كُفْرُهٗ ۭ اِلَيْنَا مَرْجِعُهُمْ فَنُنَبِّئُهُمْ بِمَا عَمِلُوْا ۭ اِنَّ اللّٰهَ عَلِيْمٌۢ بِذَاتِ الصُّدُوْرِ",
        "Urdu" : "اورجس نے کفر کیا تو نہ غم میں ڈالے آپکو اُس کا کفرہماری طرف ہی اُن سب کا لوٹنا ہے پھر ہم خبر دیں گے اُنہیں (اس) کی جو اُنہوں نے عمل کیے بیشک اللّٰہ خوب جاننے والا ہے سینوں والی باتوں کو ۔",
        "English" : "And whoever disbelieves, let not his disbelief grieve you. To Us is their return. Then We will tell them what they did. Surely, Allah is All Aware of what lies in the hearts."
      },
      {
        "ayet_no" : 24,
        "arbi" : "نُمَـتِّعُهُمْ قَلِيْلًا ثُمَّ نَضْطَرُّهُمْ اِلٰى عَذَابٍ غَلِيْظٍ",
        "Urdu" : "ہم فائدہ دیں گے اُنہیں تھوڑا سا پھر ہم مجبور کردیں گے اُنہیں سخت عذاب کی طرف ۔",
        "English" : "We let them enjoy a little, then We will drag them to a heavy punishment."
      },
      {
        "ayet_no" : 25,
        "arbi" : "وَلَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ لَيَقُوْلُنَّ اللّٰهُ ۭ قُلِ الْحَمْدُ لِلّٰهِ ۭ بَلْ اَكْثَرُهُمْ لَا يَعْلَمُوْنَ",
        "Urdu" : "اور یقیناًاگر آپ پوچھیں اُن سے (کہ)کس نے پید اکیا آسمانوں اور زمین کو یقیناًضرور وہ کہیں گے!اللّٰہ نے کہہ دیجیے سب تعریف اللّٰہ کے لیے ہے بلکہ اُن کے اکثر نہیں جاتنے ۔",
        "English" : "And if you ask them as to who has created the heavens and the earth, they will certainly say, :Allah. Say, :AlHamdulillah  (Praise be to Allah). But most of them do not know."
      },
      {
        "ayet_no" : 26,
        "arbi" : "لِلّٰهِ مَا فِي السَّمٰوٰتِ وَالْاَرْضِ ۭ اِنَّ اللّٰهَ هُوَ الْغَنِيُّ الْحَمِيْدُ",
        "Urdu" : "اللّٰہ ہی کے لیے ہے جو کچھ آسمانوں میں ہے اور (جو)زمین میں ہے،بیشک اللّٰہ ہی بہت بے پروابہت تعریف والا ہے ۔",
        "English" : "To Allah belongs what is in the heavens and the earth. Surely, it is Allah who is free of all needs, worthy of every praise."
      },
      {
        "ayet_no" : 27,
        "arbi" : "وَلَوْ اَنَّ مَا فِي الْاَرْضِ مِنْ شَجَـرَةٍ اَقْلَامٌ وَّالْبَحْرُ يَمُدُّهٗ مِنْۢ بَعْدِهٖ سَبْعَةُ اَبْحُرٍ مَّا نَفِدَتْ كَلِمٰتُ اللّٰهِ ۭ اِنَّ اللّٰهَ عَزِيْزٌ حَكِيْمٌ",
        "Urdu" : "اور اگر بیشک جو زمین میں درخت ہیں (وہ) قلمیں بن جائیں اور سمندر(روشنائی بن کر ) مدد دیں اُس کی اس کےبعد سات سمندر (مزید ہوں) (تو بھی ) ختم نہ ہوں گی اللّٰہ کی باتیں بیشک اللّٰہ بہت غالب بے حد حکمت والا ہے ۔",
        "English" : "And if all trees that are on the earth were to be pens, and the ocean (converted into ink) is supported by seven seas following it, the words of Allah would not come to an end. Surely, Allah is Mighty, Wise."
      },
      {
        "ayet_no" : 28,
        "arbi" : "مَا خَلْقُكُمْ وَلَا بَعْثُكُمْ اِلَّا كَنَفْسٍ وَّاحِدَةٍ ۭ اِنَّ اللّٰهَ سَمِيْعٌۢ بَصِيْرٌ",
        "Urdu" : "نہیں ہے تمہارا پیدا کرنا اور نہ تمہارا دوبارہ اٹھایا جانا مگر ایک جان کی مانند، بیشک اللّٰہ خوب سننے والا بہت دیکھنے والا ہے ۔",
        "English" : "Creation and resurrection of all of you is no more (to Allah) than that of one single person. Surely, Allah is All-Hearing, All Seeing."
      },
      {
        "ayet_no" : 29,
        "arbi" : "اَلَمْ تَرَ اَنَّ اللّٰهَ يُوْ لِجُ الَّيْلَ فِي النَّهَارِ وَيُوْ لِجُ النَّهَارَ فِي الَّيْلِ وَسَخَّــرَ الشَّمْسَ وَالْقَمَرَ ۡ كُلٌّ يَّجْرِيْٓ اِلٰٓى اَجَلٍ مُّسَمًّى وَّاَنَّ اللّٰهَ بِمَا تَعْمَلُوْنَ خَبِيْرٌ",
        "Urdu" : "کیا نہیں آپ نے دیکھا بے شک اللّٰہ داخل کرتا ہے رات کو دن میں اور وہ داخل کرتا ہے دن کو رات میں اور اس نے مسخر کر دیا سورج اور چاند کو ہر ایک چل رہا ہے ایک مقرروقت تک اور یہ کہ بیشک اللّٰہ( اس) سے جوتم عمل کرتے ہو خوب خبردار ہے ۔",
        "English" : "Did you not see that Allah makes the night enter into the day, and makes the day enter into the night, and He has subjugated the sun and the moon, each running towards an appointed time, and that Allah is fully aware of what you do ?"
      },
      {
        "ayet_no" : 30,
        "arbi" : "ذٰلِكَ بِاَنَّ اللّٰهَ هُوَ الْحَقُّ وَاَنَّ مَا يَدْعُوْنَ مِنْ دُوْنِهِ الْبَاطِلُ ۙ وَاَنَّ اللّٰهَ هُوَ الْعَلِيُّ الْكَبِيْرُ",
        "Urdu" : "یہ اس وجہ سے کہ بے شک اللّٰہ ہی حق ہے اور( یہ) کہ بے شک جسے وہ پکارتے ہیں اس کے سوا (وہی)باطل ہے اور یہ کہ بے شک اللّٰہ ہی خوب بلند اور بہت بڑا ہے ۔",
        "English" : "That is because Allah is the only Real One and what they invoke other than Him is false and Allah is the High, the Great."
      },
      {
        "ayet_no" : 31,
        "arbi" : "اَلَمْ تَرَ اَنَّ الْفُلْكَ تَجْرِيْ فِي الْبَحْرِ بِنِعْمَتِ اللّٰهِ لِيُرِيَكُمْ مِّنْ اٰيٰتِهِ ۭ اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّكُلِّ صَبَّارٍ شَكُوْرٍ",
        "Urdu" : "کیا نہیں آپ نے دیکھا کہ بے شک کشتیاں چلتی ہیں سمند ر میں اللّٰہ کی مہربانی سے تاکہ وہ دکھائے تمہیں اپنی کچھ نشانیاں بلا شبہ اس میںیقیناً نشانیاں ہیں ہر بڑے صابر(اور )بہت شکر کرنے والے کے لیے ۔",
        "English" : "Did you not see that the ships sail through the sea by the grace of Allah, so that He shows you some of His signs? In that, indeed, there are signs for every man of patience and gratitude."
      },
      {
        "ayet_no" : 32,
        "arbi" : "وَاِذَا غَشِيَهُمْ مَّوْجٌ كَالظُّلَلِ دَعَوُا اللّٰهَ مُخْلِصِيْنَ لَهُ الدِّيْنَ ڬ فَلَمَّا نَجّٰىهُمْ اِلَى الْبَرِّ فَمِنْهُمْ مُّقْتَصِدٌ  ۭ وَمَا يَجْــحَدُ بِاٰيٰتِنَآ اِلَّا كُلُّ خَتَّارٍ كَفُوْرٍ",
        "Urdu" : "اور جب ڈھانپ لیتی ہے انہیں کوئی موج سائبانوں کی طرح تو وہ پکارتے ہیں اللّٰہ کو خالص کرتے ہوئے اسی کے لیے دین کو پھر جب وہ نجات دے دےانہیں خشکی کی طرف (لاکر) تو ان میں سے کوئی ہی سیدھی راہ پر قائم رہنے والا ہوتا ہے اور نہیں انکار کرتا ہماری آیات کا مگر ہر (وہ شخص جو )بہت عہد توڑنے والا اوربہت ناشکرا ہو ۔",
        "English" : "And when they are covered by waves like canopies, they pray to Allah, having faith exclusively in Him. Then, once He brings them safe to the land, some of them remain balanced, (while others turn ungrateful by denying Allah‘s signs.) And no one denies Our signs except every ungrateful traitor."
      },
      {
        "ayet_no" : 33,
        "arbi" : "يٰٓاَيُّهَا النَّاسُ اتَّقُوْا رَبَّكُمْ وَاخْشَوْا يَوْمًا لَّا يَجْزِيْ وَالِدٌ عَنْ وَّلَدِهٖ ۡ وَلَا مَوْلُوْدٌ هُوَ جَازٍ عَنْ وَّالِدِهٖ شَـيْـــــًٔا ۭ اِنَّ وَعْدَ اللّٰهِ حَقٌّ فَلَا تَغُرَّنَّكُمُ الْحَيٰوةُ الدُّنْيَا ۪ وَلَا يَغُرَّنَّكُمْ بِاللّٰهِ الْغَرُوْرُ",
        "Urdu" : "اے لوگو! اپنے رب سے ڈرواور ڈرو( اس )دن سے (کہ) نہیں کام آئے گا کوئی والد اپنے بیٹے کے اور(اسی طرح ) نہ کوئی بیٹا وہ کام آنے والا ہوگا اپنے والد کے کچھ بھی بے شک اللّٰہ کا وعدہ سچا ہے تو (کہیں) ہرگز دھوکے میں نہ ڈالے تمہیں دنیوی زندگی اور ہر گز دھوکے میں ڈالے تمہیں اللّٰہ کے بارے میں دغاباز (شیطان) ۔",
        "English" : "O people, fear your Lord and fear a day when no father will help his son, nor will a son be helpful to his father at all. Surely, the promise of Allah is true. So, the worldly life must not deceive you, nor should you ever be deceived about Allah by the Deceiver."
      },
      {
        "ayet_no" : 34,
        "arbi" : "اِنَّ اللّٰهَ عِنْدَهٗ عِلْمُ السَّاعَةِ  ۚ وَيُنَزِّلُ الْغَيْثَ ۚ وَيَعْلَمُ مَا فِي الْاَرْحَامِ ۭ وَمَا تَدْرِيْ نَفْسٌ مَّاذَا تَكْسِبُ غَدًا  ۭ وَمَا تَدْرِيْ نَفْسٌۢ بِاَيِّ اَرْضٍ تَمُوْتُ  ۭ اِنَّ اللّٰهَ عَلِيْمٌ خَبِيْرٌ",
        "Urdu" : "بے شک اللّٰہ اسی کے پاس ہے قیامت کا علم اور وہی بارش نازل کرتا ہے اور وہی جانتا ہے جو کچھ رحموں میں ہے اور نہیں جانتا کوئی نفس وہ کل کیا کمائی کرے گا اورنہیں جانتا کوئی نفس (کہ) کس زمیں پر وہ مرے گا بے شک اللّٰہ خوب علم والاخوب خبردار ہے ۔",
        "English" : "Surely, it is Allah with whom rests the knowledge of the Hour; and He sends down the rain, and He knows what is in the wombs. No one knows what he will earn tomorrow, and no one knows in which land he will die. Surely, Allah is All Knowing, All Aware."
      }
    ]
  }
]