[
  {
    "surah_no" : 17,
    "total_ayah" : 111,
    "name" : "Isra",
    "detail" : [

      {
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے (پاک) نام سے شروع کرتا ہوں جو کہ بڑا مہربان، نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "سُبْحٰنَ الَّذِيْٓ اَسْرٰى بِعَبْدِهٖ لَيْلًا مِّنَ الْمَسْجِدِ الْحَرَامِ اِلَى الْمَسْجِدِ الْاَقْصَا الَّذِيْ بٰرَكْنَا حَوْلَهٗ لِنُرِيَهٗ مِنْ اٰيٰتِنَا  ۭ اِنَّهٗ هُوَ السَّمِيْعُ الْبَصِيْرُ",
        "Urdu" : "پاک ہے وہ ذات، ف١ جو راتوں رات لے گئی اپنے بندہ خاص کو مسجد حرام سے مسجد اقصیٰ تک، جس کے آس پاس کو ہم نے نواز رکھا ہے طرح طرح (کی خیرات ) و برکات سے، ف۲ تاکہ ہم دکھائیں اس کواپنی نشانیوں میں سے (کچھ نشانیاں)، بیشک وہ (اللہ) ہی ہے سننے والا، دیکھنے والا،",
        "English" : "Glorious is He Who made his servant travel by night from Al-Masjid-ul-Haram to Al-Masjid-ul-AqSa whose environs We have blessed, so that We let him see some of Our signs. Surely, He is the All-Hearing, the All- Seeing."
      },
      {
        "ayet_no" : 2,
        "arbi" : "وَاٰتَيْنَا مُوْسَي الْكِتٰبَ وَجَعَلْنٰهُ هُدًى لِّبَنِيْٓ اِسْرَاۗءِيْلَ اَلَّا تَتَّخِذُوْا مِنْ دُوْنِيْ ‎وَكِيْلًا",
        "Urdu" : "اور (اس سے پہلے) ہم نے موسیٰ کو بھی وہ کتاب دی تھی ف۳ اور اسے ہم نے ذریعہ ہدایت بنایا تھا بنی اسرائیل کے لئے، (اس تاکید کے ساتھ) کہ میرے سوا کسی کو اپنا کار ساز نہیں قرار دینا،",
        "English" : "And We vouchsafed unto Musa the Book and We appointed it as a guidance to the Children of Isra'il: take not beside Me a trustee."
      },
      {
        "ayet_no" : 3,
        "arbi" : "ذُرِّيَّــةَ مَنْ حَمَلْنَا مَعَ نُوْحٍ ۭ اِنَّهٗ كَانَ عَبْدًا شَكُوْرًا",
        "Urdu" : "اے اولاد ان لوگوں کی، جن کو ہم نے اٹھایا نوح کے ساتھ (ان کی کشتی میں تم بھی اپنے اجداد کی پیروی میں شکر گزاری کو اپناؤ کہ) بلاشبہ وہ بڑا ہی شکر گزار بندہ تھا،",
        "English" : "O progeny of those whom We bare with Nuh: verily he was a bondman grateful."
      },
      {
        "ayet_no" : 4,
        "arbi" : "وَقَضَيْنَآ اِلٰى بَنِيْٓ اِسْرَاۗءِيْلَ فِي الْكِتٰبِ لَتُفْسِدُنَّ فِي الْاَرْضِ مَرَّتَيْنِ وَلَتَعْلُنَّ عُلُوًّا كَبِيْرًا",
        "Urdu" : "اور ہم نے بنی اسرائیل کو اپنے اس فیصلے سےاپنی کتاب میں آگاہ کر دیا تھا، کہ تم لوگ زمین میں بڑا سخت فساد پھیلاؤ گے دو مرتبہ، اور سرکشی کرو گے بہت بڑی سرکشی،",
        "English" : "And We declared to the children of Isra‘il in the Book: :You will surely spread mischief on the earth twice, and you will surely show utmost haughtiness."
      },
      {
        "ayet_no" : 5,
        "arbi" : "فَاِذَا جَاۗءَ وَعْدُ اُوْلٰىهُمَا بَعَثْنَا عَلَيْكُمْ عِبَادًا لَّنَآ اُولِيْ بَاْسٍ شَدِيْدٍ فَجَاسُوْا خِلٰلَ الدِّيَارِ ۭ وَكَانَ وَعْدًا مَّفْعُوْلًا",
        "Urdu" : "پھر جب ان دونوں میں سے پہلا موقع آپہنچے گا تو ہم تم پر اپنے ایسے بندے مسلط کر دیں گے جو بڑے سخت جنگجو ہوں گے پھر وہ گھس (گھس) جائیں گے تمہارے گھروں میں، یہ (اللہ کا) ایک وعدہ ہے جس نے بہر حال پورا ہو کر رہنا ہے،",
        "English" : "Then when the promise for the first of the two came, We raised against you bondmen of Ours endued with exceeding violence, so they entered the dwellings; and it was a promise fulfilled."
      },
      {
        "ayet_no" : 6,
        "arbi" : "ثُمَّ رَدَدْنَا لَكُمُ الْكَرَّةَ عَلَيْهِمْ وَاَمْدَدْنٰكُمْ بِاَمْوَالٍ وَّبَنِيْنَ وَجَعَلْنٰكُمْ اَكْثَرَ نَفِيْرًا",
        "Urdu" : "پھر (اس کے بعد تمہاری ندامت و توبہ پر) ہم تمہیں دوبارہ غلبہ عطا کر دیں گے ان پر، اور تمہاری مدد کریں گے طرح طرح کے مالوں اور بیٹوں (کی کثرت) سے، اور بڑھا دیں گے ہم تمہاری (تعداد اور) نفری کو،",
        "English" : "Thereafter We gave you a return of victory over them, and We supported you with riches and children, and We made you a numerous concourse."
      },
      {
        "ayet_no" : 7,
        "arbi" : "اِنْ اَحْسَنْتُمْ اَحْسَنْتُمْ لِاَنْفُسِكُمْ ۣوَاِنْ اَسَاْتُمْ فَلَهَا ۭ فَاِذَا جَاۗءَ وَعْدُ الْاٰخِرَةِ لِيَسُوْۗءٗا وُجُوْهَكُمْ وَلِيَدْخُلُوا الْمَسْجِدَ كَمَا دَخَلُوْهُ اَوَّلَ مَرَّةٍ وَّلِــيُتَبِّرُوْا مَا عَلَوْا تَتْبِيْرًا",
        "Urdu" : "(سو) اگر تم نے اچھا کیا تو اپنے ہی لئے کرو گے، اور اگر تم نے برائی کی تو اس کا وبال بھی خود تم ہی لوگوں پر ہوگا، پھر جب دوسرے وعدے کا وقت آئے گا (تو ہم تم پر دوبارہ اپنے ایسے بندے مسلط کر دیں گے) تاکہ وہ حلیہ بگاڑ کر رکھ دیں تمہارے چہروں کا، اور تاکہ وہ داخل ہوجائیں مسجد میں، جیسا کہ وہ اس میں داخل ہوگئے تھے پہلی مرتبہ، اور تاکہ وہ تمہیں تہس کر کے رکھ دیں، ہر اس چیز کو جس پر ان کا قابو چلے (اور ہاتھ پڑے ف۱)",
        "English" : "(saying) _If you do good, you will do it for your own benefit, and if you do evil, it will be against yourselves‘. Later, when came the time appointed for the second, (We sent others,) so that they spoil your faces, and so that they enter into the Mosque as the former ones entered it the first time, and utterly destroy whatever they prevail upon."
      },
      {
        "ayet_no" : 8,
        "arbi" : "عَسٰي رَبُّكُمْ اَنْ يَّرْحَمَكُمْ ۚ وَاِنْ عُدْتُّمْ عُدْنَا  ۘ وَجَعَلْنَا جَهَنَّمَ لِلْكٰفِرِيْنَ حَصِيْرًا",
        "Urdu" : "ہو سکتا ہے تمہارا رب تم پر رحم فرما دے اور اگر تم نے پھر وہی کچھ کیا (جو اس سے پہلے کیا تھا) تو ہم بھی وہی کچھ کریں گے (جس کے تم مستحق ہوؤ گے)، اور ہم نے بنا رکھا ہے جہنم کو کافروں کے لئے ایک بڑا ہی ہولناک قید خانہ، ف۲",
        "English" : "May be your Lord would bestow mercy upon you. But if you do this again, We shall do that again, and We have made Jahannam (Hell) a prison for the disbelievers."
      },
      {
        "ayet_no" : 9,
        "arbi" : "اِنَّ هٰذَا الْقُرْاٰنَ يَهْدِيْ لِلَّتِيْ ھِيَ اَقْوَمُ وَيُبَشِّرُ الْمُؤْمِنِيْنَ الَّذِيْنَ يَعْمَلُوْنَ الصّٰلِحٰتِ اَنَّ لَهُمْ اَجْرًا كَبِيْرًا",
        "Urdu" : "بیشک یہ قران راہنمائی کرتا ہے اس راستے کی جو سب سے زیادہ سیدھا ہے، اور یہ خوشخبری سناتا ہے ان ایمانداروں کو جو نیک کام کرتے ہیں، کہ ان کے لئے ایک بڑا ہی عظیم الشان اجر (و ثواب) ہے",
        "English" : "Lo! this Qur'an guide unto that which is straightest, and give tidings unto the believers who do good works that theirs will be a great reward."
      },
      {
        "ayet_no" : 10,
        "arbi" : "وَّاَنَّ الَّذِيْنَ لَا يُؤْمِنُوْنَ بِالْاٰخِرَةِ اَعْتَدْنَا لَهُمْ عَذَابًا اَلِـــيْمًا",
        "Urdu" : "اور یہ کہ بیشک جو لوگ ایمان نہیں رکھتے آخرت پر، ان کے لئے ہم نے ایک بڑا ہی (ہولناک اور) دردناک عذاب تیار کر رکھا ہے",
        "English" : "And that those who believe not in the Hereafter (i.e. they disbelieve that they will be recompensed for what they did in this world, good or bad, etc.), for them We have prepared a painful torment (Hell)."
      },
      {
        "ayet_no" : 11,
        "arbi" : "وَيَدْعُ الْاِنْسَانُ بِالشَّرِّ دُعَاۗءَهٗ بِالْخَيْرِ ۭ وَكَانَ الْاِنْسَانُ عَجُوْلًا",
        "Urdu" : "اور انسان برائی اس طرح مانگتا ہے جس طرح کہ اسے بھلائی مانگنی چاہیے، اور انسان بڑا ہی جلد باز واقع ہوا ہے",
        "English" : "Man prays for evil like his prayer for good, and man is so hasty."
      },
      {
        "ayet_no" : 12,
        "arbi" : "وَجَعَلْنَا الَّيْلَ وَالنَّهَارَ اٰيَـتَيْنِ فَمَــحَوْنَآ اٰيَةَ الَّيْلِ وَجَعَلْنَآ اٰيَةَ النَّهَارِ مُبْصِرَةً لِّتَبْتَغُوْا فَضْلًا مِّنْ رَّبِّكُمْ وَلِتَعْلَمُوْا عَدَدَ السِّنِيْنَ وَالْحِسَابَ ۭ وَكُلَّ شَيْءٍ فَصَّلْنٰهُ تَفْصِيْلًا",
        "Urdu" : "اور ہم نے بنایا رات اور دن کو (اپنی قدرت کاملہ اور حکمت بالغہ سے) دو عظیم الشان نشانیاں، پھر رات کی نشانی کوتوہم نے دھندلا (اور مدہم) رکھا، اور دن کی نشانی کو روشن بنا دیا تاکہ تم لوگ تلاش کر سکو اپنے رب کا فضل، اور تاکہ تم لوگ معلوم کر سکو سالوں کی گنتی اور حساب، اور ہرچیز کو ہم نے بیان کر دیا پوری تفصیل سے",
        "English" : "We have made the night and the day two signs, then We made the sign of night marked by darkness and the sign of day bright, so that you may seek grace from your Lord, and that you may know how to number the years and how to compute, and We have expounded everything in detail."
      },
      {
        "ayet_no" : 13,
        "arbi" : "وَكُلَّ اِنْسَانٍ اَلْزَمْنٰهُ طٰۗىِٕرَهٗ فِيْ عُنُقِهٖ ۭ وَنُخْرِجُ لَهٗ يَوْمَ الْقِيٰمَةِ كِتٰبًا يَّلْقٰىهُ مَنْشُوْرًا",
        "Urdu" : "اور ہم نے مڑھ دیا ہر انسان کے شگون کو اس کے گلے میں، اور نکال دکھائیں گے ہم اس کو قیامت کے روز ایک ایسی کتاب (اس کے کئے کرائے کی) جسے وہ اپنے سامنے کھلا پائے گا، (اور اس سے کہا جائے گا کہ لے)",
        "English" : "And every man: We have fastened his action round his neck, and We shall bring forth unto him on the Day of Judgment a book proffered him open."
      },
      {
        "ayet_no" : 14,
        "arbi" : "اِقْرَاْ كِتٰبَكَ ۭ كَفٰى بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيْبًا",
        "Urdu" : "خود پڑھ لے تو اپنے نامہ اعمال کو، آج تو اپنا حساب لینے کے لئے خود کافی ہے، ف۱",
        "English" : "Read your book; your own self is sufficient as a reckoner against you this day. "
      },
      {
        "ayet_no" : 15,
        "arbi" : "مَنِ اهْتَدٰى فَاِنَّمَا يَهْــتَدِيْ لِنَفْسِهٖ ۚ وَمَنْ ضَلَّ فَاِنَّمَا يَضِلُّ عَلَيْهَا ۭ وَلَا تَزِرُ وَازِرَةٌ وِّزْرَ اُخْرٰى ۭ وَمَا كُنَّا مُعَذِّبِيْنَ حَتّٰى نَبْعَثَ رَسُوْلًا",
        "Urdu" : "( پس) جو کوئی سیدھی راہ پر چلا تو وہ اپنے ہی لئے چلا، اور جو کوئی بھٹک گیا تو اس کا نقصان بھی خود اسی کو اٹھانا ہوگا، اور کوئی بھی بوجھ اٹھانے والا کسی دوسرے کا بوجھ نہیں اٹھائے گا، اور ہم کبھی سزا نہیں دیتے جب تک ہم نہ بھیج دیں کسی رسول کو، ف۲",
        "English" : "Whoever adopts the right path does so for his own benefit, and whoever goes astray does so to his own detriment, and no bearer of burden shall bear the burden of another, and it is not Our way to punish (anyone) unless We send a Messenger."
      },
      {
        "ayet_no" : 16,
        "arbi" : "وَاِذَآ اَرَدْنَآ اَنْ نُّهْلِكَ قَرْيَةً اَمَرْنَا مُتْرَفِيْهَا فَفَسَقُوْا فِيْهَا فَحَقَّ عَلَيْهَا الْقَوْلُ فَدَمَّرْنٰهَا تَدْمِيْرًا",
        "Urdu" : "اور جب ہم کسی بستی کو ہلاک کرنا چاہتے ہیں تو (پہلے) وہاں کے خوشحال لوگوں کو (ایمان و اطاعت) کا حکم دیتے ہیں، پھر جب وہ اس میں نافرمانیاں کرنے لگتے ہیں، تو ان پر حجت تمام ہو جاتی ہے، تب ہم اسے تباہ و برباد کر کے رکھ دیتے ہیں،",
        "English" : "And when We intend to destroy a habitation, We command its affluent people (to do good), then they commit sins therein, and thus the word (of punishment) becomes applicable to it (habitation), and We annihilate it totally."
      },
      {
        "ayet_no" : 17,
        "arbi" : "وَكَمْ اَهْلَكْنَا مِنَ الْقُرُوْنِ مِنْۢ بَعْدِ نُوْحٍ ۭوَكَفٰى بِرَبِّكَ بِذُنُوْبِ عِبَادِهٖ خَبِيْرًۢا بَصِيْرًا",
        "Urdu" : "اور (اسی قانون کے مطابق) ہم نے کتنی ہی قوموں کو ہلاک کر دیا نوح کے بعد، اور کافی ہے تمہارا رب اپنے بندوں کے گناہوں سے باخبر رہنے والا، دیکھنے والا",
        "English" : "How many a generation have We destroyed after NuH! And enough is your Lord to know, (and) watch the sins of His servants."
      },
      {
        "ayet_no" : 18,
        "arbi" : "مَنْ كَانَ يُرِيْدُ الْعَاجِلَةَ عَجَّــلْنَا لَهٗ فِيْهَا مَا نَشَاۗءُ لِمَنْ نُّرِيْدُ ثُمَّ جَعَلْنَا لَهٗ جَهَنَّمَ   ۚ يَصْلٰىهَا مَذْمُوْمًا مَّدْحُوْرًا",
        "Urdu" : "جو کوئی (صرف) دنیا ہی چاہتا ہے، ہم اس کو یہیں دے دیتے ہیں جو کچھ ہمیں دینا ہوتا ہے، جس کو دینا ہوتا ہے، پھر جہنم ہی کو اس کا مقسوم بنا دیتے ہیں، جس میں اسے داخل ہونا ہوگا بدحال اور خوار ہو کر، ف۳",
        "English" : "Whoever opts for the immediate (benefits from) life herein, We give him, right here in this life, as much as We will, to whomever We intend. Then We assign Jahannam for him where he shall enter condemned, discarded."
      },
      {
        "ayet_no" : 19,
        "arbi" : "وَمَنْ اَرَادَ الْاٰخِرَةَ وَسَعٰى لَهَا سَعْيَهَا وَهُوَ مُؤْمِنٌ فَاُولٰۗىِٕكَ كَانَ سَعْيُهُمْ مَّشْكُوْرًا",
        "Urdu" : "اور (اس کے برعکس) جو کوئی آخرت کا طلب گار ہوگا، اور اس کے لئے وہ ایسی کوشش بھی کرے گا جیسی کوشش کہ اس کے لئے کرنی چاہیے، بشرطیکہ وہ ایماندار بھی ہو، تو ایسے لوگوں کی کوشش مقبول ہوگی، ف۱",
        "English" : "And whosoever intend the Hereafter and strive therefor with due striving, while he is a believer, then those: their striving shall be appreciated."
      },
      {
        "ayet_no" : 20,
        "arbi" : "كُلًّا نُّمِدُّ هٰٓؤُلَاۗءِ وَهٰٓؤُلَاۗءِ مِنْ عَطَاۗءِ رَبِّكَ  ۭ وَمَا كَانَ عَطَاۗءُ رَبِّكَ مَحْظُوْرًا",
        "Urdu" : "(رہی دنیا تو اس میں) ہم (اپنی پروردگاری اور بخشش سے) ہر فریق کو مدد دئیے جا رہے ہیں، ان کو بھی اور ان کو بھی، اور تمہارے رب کی بخشش (ان دونوں میں سے کسی فریق پر بھی) بند نہیں",
        "English" : "To all of them - both these and those - We extend the grants of your Lord. And the grant of your Lord is not barred (for anyone)."
      },
      {
        "ayet_no" : 21,
        "arbi" : "اُنْظُرْ كَيْفَ فَضَّلْنَا بَعْضَهُمْ عَلٰي بَعْضٍ ۭ وَلَلْاٰخِرَةُ اَكْبَرُ دَرَجٰتٍ وَّاَكْبَرُ تَفْضِيْلًا",
        "Urdu" : "دیکھو (دنیا میں) ہم نے ان میں سے ایک کو دوسرے پر کس طرح فضیلت دے رکھی ہے، اور آخرت تو یقینا اپنے درجات کے اعتبار سے بھی اس سے کہیں بڑی ہے، اور اس کی فضیلت بھی اس سے کہیں بڑھ چڑھ کر ہوگی، ف۲",
        "English" : "See how We made some of them excel some others (in this world) and, of course, the Hereafter is much higher in ranks and much greater in degrees of merit."
      },
      {
        "ayet_no" : 22,
        "arbi" : "لَا تَجْعَلْ مَعَ اللّٰهِ اِلٰـهًا اٰخَرَ فَتَقْعُدَ مَذْمُوْمًا مَّخْذُوْلًا",
        "Urdu" : "اللہ کے ساتھ کوئی دوسرا معبود نہ بنانا کہ اس کے نتیجے میں تمہیں بیٹھنا پڑے بد حال اور بےیارو مددگار ہو کر،",
        "English" : "Do not set up any other god along with Allah, otherwise you will sit condemned, forsaken."
      },
      {
        "ayet_no" : 23,
        "arbi" : "وَقَضٰى رَبُّكَ اَلَّا تَعْبُدُوْٓا اِلَّآ اِيَّاهُ وَبِالْوَالِدَيْنِ اِحْسَانًا ۭ اِمَّا يَبْلُغَنَّ عِنْدَكَ الْكِبَرَ اَحَدُهُمَآ اَوْ كِلٰـهُمَا فَلَا تَـقُلْ لَّهُمَآ اُفٍّ وَّلَا تَنْهَرْهُمَا وَقُلْ لَّهُمَا قَوْلًا كَرِيْمًا",
        "Urdu" : "اور تمہارا رب یہ فیصلہ کر چکا کہ تم نے بندگی نہیں کرنی مگر اسی کی، اور اپنے ماں باپ کے ساتھ اچھا سلوک کرنا ہے، ف۳ اگر تمہارے سامنے ان میں سے کوئی ایک بڑھاپے کو پہنچ جائے، یا دونوں، تو تم انھیں اف بھی نہ کہنا، اور انھیں جھڑکنا بھی نہیں، اور ان سے بات بھی پورے احترام سے کرنا،",
        "English" : "Your Lord has decreed that you worship none but Him, and do good to parents. If any one of them or both of them reach old age, do not say to them: uff (a word or expression of anger or contempt) and do not scold them, and address them with respectful words,"
      },
      {
        "ayet_no" : 24,
        "arbi" : "وَاخْفِضْ لَهُمَا جَنَاحَ الذُّلِّ مِنَ الرَّحْمَةِ وَقُلْ رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيٰنِيْ صَغِيْرًا",
        "Urdu" : "اور جھکائے رکھنا اس کے سامنے عاجزی کے بازو و نیازمندی کی بناء پر، اور (ان کے حق میں) یہ دعاء بھی کرتے رہنا کہ اے میرے رب، رحم فرما ان دونوں پر، جیسا کہ انہوں نے مجھے پالا پوسا بچپن میں،",
        "English" : "And lower unto them the wing of meekness out of mercy, and say: O my Lord! have mercy on the twain even as they brought me up when young."
      },
      {
        "ayet_no" : 25,
        "arbi" : "رَبُّكُمْ اَعْلَمُ بِمَا فِيْ نُفُوْسِكُمْ ۭ اِنْ تَكُوْنُوْا صٰلِحِيْنَ فَاِنَّهٗ كَانَ لِلْاَوَّابِيْنَ غَفُوْرًا",
        "Urdu" : "تمہارا رب جانتا ہے وہ سب کچھ جو کہ تمہارے دلوں کے اندر (موجود) ہے، اگر تم نیک کردار ہوئے تو (بتقاضائے بشریت سرزد ہو جانے والی کسی ناشدنی سے مایوس نہیں ہو جانا کہ) بیشک وہ سچی توبہ کرنے والوں کے لئے بڑا ہی بخشنے والا ہے",
        "English" : "Your Lord knows best what is in your hearts. If you are righteous, then He is Most-Forgiving for those who turn to Him in repentance."
      },
      {
        "ayet_no" : 26,
        "arbi" : "وَاٰتِ ذَا الْقُرْبٰى حَقَّهٗ وَالْمِسْكِيْنَ وَابْنَ السَّبِيْلِ وَلَا تُبَذِّرْ تَبْذِيْرًا",
        "Urdu" : "اور رشتہ دار کو اس کا حق دے دیا کرو، اور مسکین اور مسافر کو بھی، پر بےجا خرچ نہیں کرنا،",
        "English" : "Give the relative his right, and the needy and the wayfarer. And do not squander recklessly."
      },
      {
        "ayet_no" : 27,
        "arbi" : "اِنَّ الْمُبَذِّرِيْنَ كَانُوْٓا اِخْوَانَ الشَّيٰطِيْنِ ۭ وَكَانَ الشَّيْطٰنُ لِرَبِّهٖ كَفُوْرًا",
        "Urdu" : "کہ بےجا خرچ کرنے والے یقینی طور پر شیطانوں کے بھائی ہیں، اور شیطان اپنے رب کا بڑا ہی ناشکرا ہے،",
        "English" : "Surely the spendthrifts are the brothers of Satan, and Satan is most ungrateful to his Lord."
      },
      {
        "ayet_no" : 28,
        "arbi" : "وَاِمَّا تُعْرِضَنَّ عَنْهُمُ ابْتِغَاۗءَ رَحْمَةٍ مِّنْ رَّبِّكَ تَرْجُوْهَا فَقُلْ لَّهُمْ قَوْلًا مَّيْسُوْرًا",
        "Urdu" : "اور اگر کبھی تمہیں ان (اہل حقوق) سے پہلو تہی کرنا پڑے، اپنے رب کی کسی ایسی رحمت کی تلاش میں جس کی تمہیں امید ہو، تو تم ان سے نرم (اور آسان) بات کہہ دیا کرو، ف۱",
        "English" : "And if you turn away from them looking for a bounty from your Lord you are expecting, then speak to them in polite words."
      },
      {
        "ayet_no" : 29,
        "arbi" : "وَلَا تَجْعَلْ يَدَكَ مَغْلُوْلَةً اِلٰى عُنُقِكَ وَلَا تَبْسُطْهَا كُلَّ الْبَسْطِ فَتَـقْعُدَ مَلُوْمًا مَّحْسُوْرًا",
        "Urdu" : "اور نہ تو تم اپنے ہاتھ کواپنی گردن سے باندھ رکھو، اور نہ ہی اسے اس طرح پورا کھول دو کہ اس کے نتیجے میں تم الزام خوردہ اور تنگ دست ہو کر رہ جاؤ، ف۲",
        "English" : "And let not thine hand be chained to thy neck, nor stretch it forth to the utmost stretching, lest thou sit down reproached, impoverished."
      },
      {
        "ayet_no" : 30,
        "arbi" : "اِنَّ رَبَّكَ يَبْسُطُ الرِّزْقَ لِمَنْ يَّشَاۗءُ وَيَــقْدِرُ ۭ اِنَّهٗ كَانَ بِعِبَادِهٖ خَبِيْرًۢا بَصِيْرًا",
        "Urdu" : "بیشک تمہارا رب روزی کشادہ کرتا ہے جس کے لئے چاہتا ہے، اور تنگ فرماتا ہے (جس کے لئے چاہتا ہے)، بیشک وہ اپنے بندوں سے پوری طرح باخبر بھی ہے، اور سب کچھ دیکھتا (سنتا) بھی، ف۳",
        "English" : "Indeed, your Lord expands sustenance for whomsoever He wills, and constricts (for whomsoever He wills). Surely, He is All-Aware of His servants, All-Seeing."
      },
      {
        "ayet_no" : 31,
        "arbi" : "وَلَا تَقْتُلُوْٓا اَوْلَادَكُمْ خَشْـيَةَ اِمْلَاقٍ ۭ نَحْنُ نَرْزُقُهُمْ وَاِيَّاكُمْ ۭ اِنَّ قَتْلَهُمْ كَانَ خِطْاً كَبِيْرًا",
        "Urdu" : "اوراپنی اولاد کو قتل نہیں کرنا تنگ دستی کے خوف سے، کہ روزی ہم ہی دیتے ہیں ان کو بھی، اور تم کو بھی، بلاشبہ (بے گناہوں) کا قتل کرنا بڑا بھاری گناہ ہے",
        "English" : "Do not kill your children for fear of poverty. We provide sustenance to them and to you, too. Killing them is a great sin indeed."
      },
      {
        "ayet_no" : 32,
        "arbi" : "وَلَا تَقْرَبُوا الزِّنٰٓى اِنَّهٗ كَانَ فَاحِشَةً  ۭ وَسَاۗءَ سَبِيْلًا",
        "Urdu" : "اور (خبردار!) زنا کے قریب بھی نہ پھٹکنا بیشک وہ ایک بڑی بےحیائی اور بہت ہی بری راہ ہے، ف٤",
        "English" : "Do not even go close to fornication. It is indeed a shameful act, and an evil way to follow."
      },
      {
        "ayet_no" : 33,
        "arbi" : "وَلَا تَقْتُلُوا النَّفْسَ الَّتِيْ حَرَّمَ اللّٰهُ اِلَّا بِالْحَقِّ ۭ وَمَنْ قُتِلَ مَظْلُوْمًا فَقَدْ جَعَلْنَا لِوَلِيِّهٖ سُلْطٰنًا فَلَا يُسْرِفْ فِّي الْقَتْلِ ۭ اِنَّهٗ كَانَ مَنْصُوْرًا",
        "Urdu" : "اور قتل نہیں کرنا کسی ایسی جان کو جسے اللہ نے حرام کر رکھا ہو، مگر حق کے ساتھ، اور جس کو قتل کیا گیا ظلم (و زیادتی) کے ساتھ، تو اس کے وارث کو ہم نے ایک بڑا زور (اور غلبہ) دیا ہے، پس وہ قتل میں حد سے نہ گزرے، یقینا اس کی مدد کی جائے گی",
        "English" : "And slay not anyone whom Allah hath forbidden except for justification; and whosoever is slain wrongfully, We have surely given his next-of-kin authority so let him not be extravagant in slaying; verily he is ever succoured."
      },
      {
        "ayet_no" : 34,
        "arbi" : "وَلَا تَقْرَبُوْا مَالَ الْيَتِيْمِ اِلَّا بِالَّتِيْ ھِيَ اَحْسَنُ حَتّٰى يَبْلُغَ اَشُدَّهٗ  ۠وَاَوْفُوْا بِالْعَهْدِ ۚاِنَّ الْعَهْدَ كَانَ مَسْــــُٔـوْلًا",
        "Urdu" : "اور یتیم کے مال کے قریب بھی نہ پھٹکنا، مگر اس طریقے سے جو کہ سب سے اچھا ہو، یہاں تک کہ وہ پہنچ جائےاپنی (جوانی کی) قوتوں کو، اور پورا کیا کرو تم لوگ اپنے عہد کو، بیشک عہد کی باز پرس ہوگی",
        "English" : "Do not go near the property of an orphan, except in a manner that is good, until he comes to his maturity. And fulfill the covenant. Surely, the covenant shall be asked about (on the Day of Reckoning)."
      },
      {
        "ayet_no" : 35,
        "arbi" : "وَاَوْفُوا الْكَيْلَ اِذَا كِلْتُمْ وَزِنُوْا بِالْقِسْطَاسِ الْمُسْتَــقِيْمِ ۭ ذٰلِكَ خَيْرٌ وَّاَحْسَنُ تَاْوِيْلًا",
        "Urdu" : "اور جب تم ناپو تو پورا ناپو، اور (جب تولو تو) ٹھیک ترازو سے تولو، کہ یہ (فی نفسہ بھی) اچھی بات ہے، اور اس کا انجام بھی اچھا ہے، ف۱",
        "English" : "And give full measures when ye measure and weight with an even balance that is good, and the best interpretation."
      },
      {
        "ayet_no" : 36,
        "arbi" : "وَلَا تَــقْفُ مَا لَيْسَ لَكَ بِهٖ عِلْمٌ  ۭ اِنَّ السَّمْعَ وَالْبَصَرَ وَالْفُؤَادَ كُلُّ اُولٰۗىِٕكَ كَانَ عَنْهُ مَسْــــُٔــوْلًا",
        "Urdu" : "اور ایسی بات کے پیچھے نہ پڑا کرو جس کا تمہیں علم نہ ہو، کہ بلاشبہ کان، انکھ اور دل، سب ہی کے بارے میں باز پرس ہوگی، ف۲",
        "English" : "And do not follow a thing about which you have no knowledge. Surely, the ear, the eye and the heart - each one of them shall be interrogated about."
      },
      {
        "ayet_no" : 37,
        "arbi" : "وَلَا تَمْشِ فِي الْاَرْضِ مَرَحًا ۚ اِنَّكَ لَنْ تَخْرِقَ الْاَرْضَ وَلَنْ تَبْلُغَ الْجِبَالَ طُوْلًا",
        "Urdu" : "اور اکڑ کر نہیں چلنا (اللہ کی) زمین میں، بیشک نہ تو تم پھاڑ سکتے ہو اس زمین کو (ایڑیاں مارمار کر)، اور نہ ہی تم پہنچ سکتے ہو پہاڑوں کی بلندی کو (اپنی گردن کو تان کر)،",
        "English" : "Do not walk on the earth in haughty style. You can neither tear the earth apart, nor can you match the mountains in height."
      },
      {
        "ayet_no" : 38,
        "arbi" : "كُلُّ ذٰلِكَ كَانَ سَيِّئُهٗ عِنْدَ رَبِّكَ مَكْرُوْهًا",
        "Urdu" : "ان سب باتوں میں سے ہر ایک کا برا پہلو تمہارے رب کے یہاں نا پسندیدہ ہے،",
        "English" : "That which is evil, of all these, is detestable in the sight of your Lord."
      },
      {
        "ayet_no" : 39,
        "arbi" : "ذٰلِكَ مِمَّآ اَوْحٰٓى اِلَيْكَ رَبُّكَ مِنَ الْحِكْمَةِ ۭ وَلَا تَجْعَلْ مَعَ اللّٰهِ اِلٰـهًا اٰخَرَ فَتُلْقٰى فِيْ جَهَنَّمَ مَلُوْمًا مَّدْحُوْرًا",
        "Urdu" : "یہ سب باتیں ہیں اس حکمت (لا یزال) کی، جس کی وحی فرمائی ہے تمہاری طرف تمہارے رب نے (اپنے کرم سے) اور مت ٹھہرانا اللہ کے ساتھ کوئی اور معبود، کہ اس کے نتیجے میں تم کو پھینک دیا جائے جہنم میں ملامت زدہ اور راندہ (و محروم کر کے)، ف۳",
        "English" : "This is part of the Wisdom your Lord has revealed to you. And do not set up any other god along with Allah, lest you should be thrown into Jahannam , reproached, rejected."
      },
      {
        "ayet_no" : 40,
        "arbi" : "اَفَاَصْفٰىكُمْ رَبُّكُمْ بِالْبَنِيْنَ وَاتَّخَذَ مِنَ الْمَلٰۗىِٕكَةِ اِنَاثًا  ۭاِنَّكُمْ لَتَقُوْلُوْنَ قَوْلًا عَظِيْمًا",
        "Urdu" : "تو کیا تمہارے رب نے تمہیں تو چن لیا بیٹوں کے ساتھ، اور خود اپنے لئے فرشتوں کو بیٹیاں بنا دیا؟ یقینا تم لوگ ایک بڑی بھاری بات منہ سے نکالتے ہو",
        "English" : "Is it, then, that your Lord has chosen you people to have sons, and has Himself opted for females from among the angels? Surely, you are uttering a serious statement."
      },
      {
        "ayet_no" : 41,
        "arbi" : "وَلَقَدْ صَرَّفْــنَا فِيْ هٰذَا الْقُرْاٰنِ لِيَذَّكَّرُوْا ۭ وَمَا يَزِيْدُهُمْ اِلَّا نُفُوْرًا",
        "Urdu" : "اور یقینا ہم نے طرح طرح سے بیان کیا ہے اس قران میں (حق اور حقیقت کو)، تاکہ کہ لوگ سمجھیں، مگر اس سے ان (بدبخت ہٹ دھرموں) کی نفرت (اور محرومی) ہی میں اضافہ ہوتا گیا،",
        "English" : "Surely, We have explained things in various ways in this Qur‘an, so that they may pay heed to the advice; but it increases nothing in them except aversion."
      },
      {
        "ayet_no" : 42,
        "arbi" : "قُلْ لَّوْ كَانَ مَعَهٗٓ اٰلِـهَةٌ كَمَا يَقُوْلُوْنَ اِذًا لَّابْتَغَوْا اِلٰى ذِي الْعَرْشِ سَبِيْلًا",
        "Urdu" : "(ان سے) کہو کہ اگر اس (وحدہ، لا شریک) کے ساتھ اور بھی معبود ہوتے، جیسا کہ ان کا کہنا ہے، تو یقینا انہوں نے عرش والے تک پہنچنے کے لئے ضرور کوئی نہ کوئی راستہ ڈھونڈ لیا ہوتا،",
        "English" : "Say, :Had there been other gods along with Him , as they say, :then they would have found out a way to the Lord of the Throne ."
      },
      {
        "ayet_no" : 43,
        "arbi" : "سُبْحٰنَهٗ وَتَعٰلٰى عَمَّا يَقُوْلُوْنَ عُلُوًّا كَبِيْرًا",
        "Urdu" : "پاک ہے وہ (اللہ) اور بہت ہی بلند اور بالا، ان تمام باتوں سے جو یہ لوگ اس (کی شان اقدس) کے بارے میں بنا رہے ہیں",
        "English" : "Pure is He, and Exalted, immensely above what they say."
      },
      {
        "ayet_no" : 44,
        "arbi" : "تُـسَبِّحُ لَهُ السَّمٰوٰتُ السَّـبْعُ وَالْاَرْضُ وَمَنْ فِيْهِنَّ ۭ وَاِنْ مِّنْ شَيْءٍ اِلَّايُسَبِّحُ بِحَمْدِهٖ وَلٰكِنْ لَّا تَفْقَهُوْنَ تَسْبِيْحَهُمْ  ۭ اِنَّهٗ كَانَ حَلِــيْمًا غَفُوْرًا",
        "Urdu" : "اسی کی پاکی بیان کرتے (اور اس کی عظمت کے گن گاتے) ہیں یہ ساتوں آسمان اور زمین، اور اس کے اندر کی سب مخلوق، (خواہ زبان حال سے خواہ زبان قال سے)، اور کوئی بھی چیز ایسی نہیں جو تسبیح نہ کرتی ہو، اس کی حمد (و ثناء) کے ساتھ، مگر تم لوگ ان کی تسبیح کو سمجھ نہیں سکتے، یقینا وہ نہایت ہی بردبار، بڑا ہی بخشنے والا ہے، ف۱",
        "English" : "All the seven skies and the earth and all those therein extol His purity. And there is not a single thing that does not extol His purity along with His praise, but you do not understand their extolling. Surely He is Forbearing, Most-Forgiving."
      },
      {
        "ayet_no" : 45,
        "arbi" : "وَاِذَا قَرَاْتَ الْقُرْاٰنَ جَعَلْنَا بَيْنَكَ وَبَيْنَ الَّذِيْنَ لَا يُؤْمِنُوْنَ بِالْاٰخِرَةِ حِجَابًا مَّسْتُوْرًا",
        "Urdu" : "اور جب تم قران پڑھتے ہو تو ہم تمہارا اور ان لوگوں کے درمیان جو کہ ایمان نہیں رکھتے آخرت پر، ایک مخفی پردہ حائل کر دیتے ہیں،",
        "English" : "And when you ( Muhammad ) recite the Qur'an, We put between you and those who believe not in the Hereafter, an invisible veil (or screen their hearts, so they hear or understand it not)."
      },
      {
        "ayet_no" : 46,
        "arbi" : "وَّجَعَلْنَا عَلٰي قُلُوْبِهِمْ اَكِنَّةً اَنْ يَّفْقَهُوْهُ وَفِيْٓ اٰذَانِهِمْ وَقْرًا  ۭ وَاِذَا ذَكَرْتَ رَبَّكَ فِي الْقُرْاٰنِ وَحْدَهٗ وَلَّوْا عَلٰٓي اَدْبَارِهِمْ نُفُوْرًا",
        "Urdu" : "اور ہم نے ان کے دلوں پر پردے ڈال دیے (ان کیاپنی بد نیتی کی بنا پر) اس بات سے کہ وہ اسے سمجھیں اور ان کے کانوں میں بھاری ڈاٹ رکھ دئے (اس سے کہ یہ اسے سنیں)، اور جب تم قران میں صرف اپنے رب ہی کا ذکر کرتے ہو، تو یہ لوگ نفرت سے پیٹھ پھیر کر بھاگ کھڑے ہوتے ہیں، ف۲",
        "English" : "And We place upon their hearts veils lest they should understand it, and in their ears a deafness; and when thou makest mention of thy Lord alone in the Qur'an, they turn their backs in aversion."
      },
      {
        "ayet_no" : 47,
        "arbi" : "نَحْنُ اَعْلَمُ بِمَا يَسْتَمِعُوْنَ بِهٖٓ اِذْ يَسْتَمِعُوْنَ اِلَيْكَ وَاِذْ هُمْ نَجوٰٓى اِذْ يَقُوْلُ الظّٰلِمُوْنَ اِنْ تَتَّبِعُوْنَ اِلَّا رَجُلًا مَّسْحُوْرًا",
        "Urdu" : "ہمیں خوب معلوم ہے وہ غرض جس کے لئے یہ لوگ کان لگا کر سنتے ہیں، جب کہ یہ تمہاری طرف کان لگائے ہوتے ہیں، اور جب یہ آ پس میں سرگوشیاں کر رہے ہوتے ہیں، جب کہ یہ ظالم کہتے ہیں کہ تم لوگ تو محض ایک جادو زدہ شخص کی پیروی کرتے ہو، ف۳",
        "English" : "We are fully aware of the reason for which they listen, when they listen to you, and when they are in secret consultation: when the transgressors say, :You are following none but a bewitched man."
      },
      {
        "ayet_no" : 48,
        "arbi" : "اُنْظُرْ كَيْفَ ضَرَبُوْا لَكَ الْاَمْثَالَ فَضَلُّوْا فَلَا يَسْتَطِيْعُوْنَ سَبِيْلًا",
        "Urdu" : "دیکھو تو سہی (عقل کے دشمن اور نصیب کے کھوٹے) یہ لوگ آپ کے لئے کیسی کیسی مثالیں بیان کرتے ہیں، سو یہ ایسے بھٹکے کہ اب انھیں کوئی راہ دکھائی ہی نہیں دیتی",
        "English" : "See how they have made (silly) statements about you; so they have gone astray and cannot find a way."
      },
      {
        "ayet_no" : 49,
        "arbi" : "وَقَالُوْٓا ءَاِذَا كُنَّا عِظَامًا وَّرُفَاتًا ءَاِنَّا لَمَبْعُوْثُوْنَ خَلْقًا جَدِيْدًا",
        "Urdu" : "اور کہتے ہیں کہ کیا جب ہم (مر کر) ہڈیاں اور چورا ہوجائیں گے، تو کیا پھر ہم نئے سرے سے پیدا کر کے اٹھائے جائیں گے ؟",
        "English" : "And they say: when we shall have become bones and fragments, shall we in sooth be raised as a new creation ?"
      },
      {
        "ayet_no" : 50,
        "arbi" : "قُلْ كُوْنُوْا حِجَارَةً اَوْ حَدِيْدًا",
        "Urdu" : "کہو کہ (ہڈیاں اور چورا تو کیا) تم پتھر یا لوہا ہو جاؤ،",
        "English" : "Say, :Be you stones or iron"
      },
      {
        "ayet_no" : 51,
        "arbi" : "اَوْ خَلْقًا مِّمَّا يَكْبُرُ فِيْ صُدُوْرِكُمْ ۚ فَسَيَقُوْلُوْنَ مَنْ يُّعِيْدُنَا ۭ قُلِ الَّذِيْ فَطَرَكُمْ اَوَّلَ مَرَّةٍ ۚ فَسَيُنْغِضُوْنَ اِلَيْكَ رُءُوْسَهُمْ وَيَقُوْلُوْنَ مَتٰى هُوَ ۭ قُلْ عَسٰٓي اَنْ يَّكُوْنَ قَرِيْبًا",
        "Urdu" : "یا اور کوئی ایسی مخلوق بن جاؤ جس کا زندہ ہونا تمہارے خیال میں بہت مشکل بات ہو، (پھر بھی تم نے اٹھ کر رہنا ہے)، اس پر یہ کہیں گے کہ (اچھا تو) وہ کون ہے جو ہمیں (اس حالت پر بھی) دوبارہ زندہ کر دے گا؟ کہو وہ وہی ہے جس نے تم کو پہلی مرتبہ پیدا کیا، (جب کہ تمہارا کوئی نام و نشان تک بھی نہ تھا ف۱) اس پر یہ لوگ سر ہلاتے ہوئے یہ سوال کریں گے کہ (اچھا تو) یہ کب ہوگا؟ جواب دو کہ کیا عجب کہ وہ وقت تمہارے قریب ہی آگیا ہو،",
        "English" : "Or any creation you deem harder in your hearts. Thereupon they will ask, :Who will bring us back? Say, :The One who created you for the first time. So, they will shake their heads before you and say, : When shall that be ? Say, :May be, it is near."
      },
      {
        "ayet_no" : 52,
        "arbi" : "يَوْمَ يَدْعُوْكُمْ فَتَسْتَجِيْبُوْنَ بِحَمْدِهٖ وَتَظُنُّوْنَ اِنْ لَّبِثْتُمْ اِلَّا قَلِيْلًا",
        "Urdu" : "جس روز وہ تمہیں پکارے گا تو تم اس کی پکار پر (بلا کسی چوں چرا کے فوراً) چلے آؤ گے اس کی حمد (ثناء) کرتے ہوئے، اور (آج جلدی مچانے والے منکرو، اس روز) تم یہ خیال کرو گے کہ تم بہت ہی کم (مدت اس دنیا میں) رہے تھے، ف۲",
        "English" : "The Day whereon He will call you, and ye will answer with His praise, and ye will imagine that ye had tarried but little."
      },
      {
        "ayet_no" : 53,
        "arbi" : "وَقُلْ لِّعِبَادِيْ يَـقُوْلُوا الَّتِيْ ھِيَ اَحْسَنُ ۭ اِنَّ الشَّيْطٰنَ يَنْزَغُ بَيْنَهُمْ ۭ اِنَّ الشَّيْطٰنَ كَانَ لِلْاِنْسَانِ عَدُوًّا مُّبِيْنًا",
        "Urdu" : "اور کہو میرے بندوں سے (اے پیغمبر!) کہ وہ بات ہمیشہ وہی کریں جو ہر لحاظ سے اچھی ہو، کہ شیطان (ناروا بات کے ذریعے) ان کے درمیان فساد ڈلوانے کی کوشش میں رہتا ہے، بلاشبہ شیطان انسان کا کھلم کھلا دشمن ہے",
        "English" : "Tell My servants that they should speak that which is best. Surely, Satan creates discord among them. Indeed, Satan is an open enemy to mankind."
      },
      {
        "ayet_no" : 54,
        "arbi" : "رَبُّكُمْ اَعْلَمُ بِكُمْ ۭ اِنْ يَّشَاْ يَرْحَمْكُمْ اَوْ اِنْ يَّشَاْ يُعَذِّبْكُمْ ۭ وَمَآ اَرْسَلْنٰكَ عَلَيْهِمْ وَكِيْلًا",
        "Urdu" : "تمہارا رب تمہیں خوب جانتا ہے (کہ تم میں سے کون کس قابل ہے، پس) وہ اگر چاہے تو تم پر رحم فرما دے، اور اگر چاہے تو تم کو عذاب میں ڈال دے، اور ہم نے آپ کو (اے پیغمبر!) ان کا ذمہ دار بنا کر نہیں بھیجا، ف۳",
        "English" : "Your Lord knows you best. If He so wills, He will have mercy on you, and if He so wills, He will punish you, and We did not send you (O Prophet,) to become responsible for them."
      },
      {
        "ayet_no" : 55,
        "arbi" : "وَرَبُّكَ اَعْلَمُ بِمَنْ فِي السَّمٰوٰتِ وَالْاَرْضِ ۭ وَلَقَدْ فَضَّلْنَا بَعْضَ النَّبِيّٖنَ عَلٰي بَعْضٍ وَّاٰتَيْنَا دَاوٗدَ زَبُوْرًا",
        "Urdu" : "اور آپ کا رب خوب جانتا ہے ان سب کو جو کہ آسمانوں اور زمین (کی اس وسیع کائنات) میں موجود ہیں، اور بلاشبہ ہم نے فضیلت بخشی بعض نبیوں کو بعض پر، اور ہم ہی نے داؤد کو زبور عطا کی تھی،",
        "English" : "Your Lord knows best about all those in the heavens and the earth, and We have certainly granted excellence to some prophets over some others, and We gave Dawud the Zabur (the Psalms)."
      },
      {
        "ayet_no" : 56,
        "arbi" : "قُلِ ادْعُوا الَّذِيْنَ زَعَمْتُمْ مِّنْ دُوْنِهٖ فَلَا يَمْلِكُوْنَ كَشْفَ الضُّرِّ عَنْكُمْ وَلَا تَحْوِيْلًا",
        "Urdu" : "(ان سے) کہو کہ تم لوگ پکار دیکھو اپنے ان (خود ساختہ) معبودوں کو جن کا تم گھمنڈ رکھتے ہو، اس (معبود حق) کے سواء وہ نہ تمہاری تکلیف کو دور کر سکتے ہیں اور نہ ہی اس کو کچھ پھیر سکتے ہیں،",
        "English" : "Say, :Call those whom you assume (to be gods), besides Him, while they have no power to remove distress from you, nor to change it."
      },
      {
        "ayet_no" : 57,
        "arbi" : "اُولٰۗىِٕكَ الَّذِيْنَ يَدْعُوْنَ يَبْتَغُوْنَ اِلٰى رَبِّهِمُ الْوَسِـيْلَةَ اَيُّهُمْ اَقْرَبُ وَيَرْجُوْنَ رَحْمَتَهٗ وَيَخَافُوْنَ عَذَابَهٗ ۭ اِنَّ عَذَابَ رَبِّكَ كَانَ مَحْذُوْرًا",
        "Urdu" : "وہ ہستیاں جن کو یہ لوگ (اپنی حاجت روائی و مشکل کشائی، اور وسیلہ جوئی کے لئے) پکارتے ہیں، وہ (ان کے کام کیا آتے وہ تو) خود اپنے رب کے حضور پہنچنے کے لئے (نی کیوں کے ذریعے) قرب ڈھونڈنے میں لگے رہتے ہیں، کہ کون اس کا زیادہ مقرب بنتا ہے وہ اپنے رب کی رحمت کی امید رکھتے اور اس کے عذاب سے ڈرتے رہتے ہیں، بلاشبہ آپ کے رب کا عذاب ہے ہی ڈرنے کی چیز، ف۱",
        "English" : "Those whom they invoke, do themselves seek the means of access to their Lord as to which of them becomes the closest, and they hope for His Mercy and fear His punishment. The punishment of your Lord is really something to be feared."
      },
      {
        "ayet_no" : 58,
        "arbi" : "وَاِنْ مِّنْ قَرْيَةٍ اِلَّا نَحْنُ مُهْلِكُوْهَا قَبْلَ يَوْمِ الْقِيٰمَةِ اَوْ مُعَذِّبُوْهَا عَذَابًا شَدِيْدًا  ۭ كَانَ ذٰلِكَ فِي الْكِتٰبِ مَسْطُوْرًا",
        "Urdu" : "اور کوئی بستی ایسی نہیں، جسے ہم ہلاک (اور تباہ و برباد) کر دیں قیامت سے پہلے، یا اسے کوئی سخت عذاب نہ دے دیں، یہ بات اس کتاب میں لکھی ہوئی ہے، ف۲",
        "English" : "There is no town but We are to destroy it before the Doomsday, or punish it with severe punishment. That is what stands written in the Book."
      },
      {
        "ayet_no" : 59,
        "arbi" : "وَمَا مَنَعَنَآ اَنْ نُّرْسِلَ بِالْاٰيٰتِ اِلَّآ اَنْ كَذَّبَ بِهَا الْاَوَّلُوْنَ ۭ وَاٰتَيْنَا ثَمُوْدَ النَّاقَةَ مُبْصِرَةً فَظَلَمُوْا بِهَا ۭ وَمَا نُرْسِلُ بِالْاٰيٰتِ اِلَّا تَخْوِيْفًا",
        "Urdu" : "اور ہمیں ایسی نشانیاں (یعنی فرمائشی معجزات) بھیجنے سے نہیں روکا مگر اس بات نے کہ اس طرح کی نشانیوں کو جھٹلا چکے ہیں پہلے لوگ، چنانچہ (نمونے کے طور پر دیکھ لو کہ) ہم نے قوم ثمود کو وہ اونٹنی بخشی انکھیں کھول دینے والی ایک عظیم الشان نشانی کے طور پر، مگر انہوں نے اس پر ظلم کیا، اور ہماپنی نشانیاں نہیں بھیجتے مگر ڈرانے کے لئے،",
        "English" : "Nothing made us refrain from sending the signs (demanded by the pagans,) except that the earlier people had rejected them. (For example,) We gave Thamud the she-camel, as an eye-opener, then they did wrong to her, and We do not send signs but as a warning."
      },
      {
        "ayet_no" : 60,
        "arbi" : "وَاِذْ قُلْنَا لَكَ اِنَّ رَبَّكَ اَحَاطَ بِالنَّاسِ ۭ وَمَا جَعَلْنَا الرُّءْيَا الَّتِيْٓ اَرَيْنٰكَ اِلَّا فِتْنَةً لِّلنَّاسِ وَالشَّجَرَةَ الْمَلْعُوْنَةَ فِي الْقُرْاٰنِ ۭ وَنُخَوِّفُهُمْ ۙ فَمَا يَزِيْدُهُمْ اِلَّا طُغْيَانًا كَبِيْرًا",
        "Urdu" : "اور (وہ بھی یاد کرو کہ) جب ہم نے آپ سے کہا تھا کہ آپ کے رب نے گھیر رکھا ہے، ان لوگوں کو (اپنے علم اور قدرت سے)، اور (ان عجائب قدرت کا) وہ دیکھنا جو کہ ہم نے آپ کو دکھایا تھا (اپنی قدرت و عنایت سے) اور اس درخت کو جس پر لعنت وارد ہوئی ہے قران میں، ( نہیں بنایا ہم نے اس سب کو) مگر آزمائش کا سامان لوگوں کے لئے، اور ہم انھیں برابر ڈراتے (اور تنبیہ کرتے) رہتے ہیں، (تاکہ یہ لوگ باز آجائیں)، مگر اس سب سے ان کی اس بڑی سرکشی ہی میں اضافہ ہوتا جاتا ہے، ف۳",
        "English" : "(Remember) when We said to you that your Lord encompasses all humans. And We did not make the vision We showed to you, but a test for the people — and the tree cursed in the Qur‘an as well. And We warn them, yet it adds nothing to them but enormous rebellion."
      },
      {
        "ayet_no" : 61,
        "arbi" : "وَاِذْ قُلْنَا لِلْمَلٰۗىِٕكَةِ اسْجُدُوْا لِاٰدَمَ فَسَجَدُوْٓا اِلَّآ اِبْلِيْسَ ۭ قَالَ ءَاَسْجُدُ لِمَنْ خَلَقْتَ طِيْنًا",
        "Urdu" : "اور (وہ بھی یاد کرو کہ) جب ہم نے فرشتوں سے کہا کہ تم سجدہ کرو آدم کے لئے، تو وہ سب سجدے میں گر پڑے بجز ابلیس کے (کہ اس نے سجدہ نہ کیا)، کہنے لگا کیا میں اس کو سجدہ کروں جس کو تو نے پیدا کیا ہے مٹی سے ؟",
        "English" : "(Remember) when We said to the angels, :Prostrate yourself before ‘Adam. So, they all prostrated, except Iblis (Satan). He said, :Shall I prostrate before the one You have created from mud ?"
      },
      {
        "ayet_no" : 62,
        "arbi" : "قَالَ اَرَءَيْتَكَ هٰذَا الَّذِيْ كَرَّمْتَ عَلَيَّ ۡ لَىِٕنْ اَخَّرْتَنِ اِلٰى يَوْمِ الْقِيٰمَةِ لَاَحْتَنِكَنَّ ذُرِّيَّتَهٗٓ اِلَّا قَلِيْلًا",
        "Urdu" : "مزید کہا کہ بھلا دیکھ تو سہی، یہ جس کو تو نے مجھ پر فوقیت دی ہے اگر تو نے مجھے مہلت دے دی قیامت کے دن تک، تو میں جڑ نکال کر رکھ دوں گا اس کی سب نسل کی، بجز تھوڑے سے لوگوں کے",
        "English" : "He (Iblis) added, :Tell me, this one whom You have honored more than me, if You give me respite till the Doomsday, I will subdue his progeny, except a few of them."
      },
      {
        "ayet_no" : 63,
        "arbi" : "قَالَ اذْهَبْ فَمَنْ تَبِعَكَ مِنْهُمْ فَاِنَّ جَهَنَّمَ جَزَاۗؤُكُمْ جَزَاۗءً مَّوْفُوْرًا",
        "Urdu" : "ارشاد ہوا کہ جا (اور جو کچھ تجھ سے ہو سکے کر گزر، پر یاد رکھنا کہ) ان میں سے جو بھی کوئی تیرے پیچھے چلا، تو یقینی طور پر جہنم ہی بدلہ ہوگا تم سب کا پورا پورا بدلہ، ف۱",
        "English" : "He (Allah) said, :Go then, for whoever of them follows you, the Hell shall be the recompense of you all, a full recompense."
      },
      {
        "ayet_no" : 64,
        "arbi" : "وَاسْتَفْزِزْ مَنِ اسْـتَـطَعْتَ مِنْهُمْ بِصَوْتِكَ وَاَجْلِبْ عَلَيْهِمْ بِخَيْلِكَ وَرَجِلِكَ وَشَارِكْهُمْ فِي الْاَمْوَالِ وَالْاَوْلَادِ وَعِدْهُمْ ۭ وَمَا يَعِدُهُمُ الشَّيْطٰنُ اِلَّا غُرُوْرًا",
        "Urdu" : "اور پھسلا لے تو ان میں سے جس کو بھی پھسلا سکتا ہے،اپنی آواز (اور چیخ و پکار) سے، ف۲ اور دوڑالے ان پر اپنے سوار اور پیادہ (لشکر)، اور ساجھا کر لے تو ان کے ساتھ ان کے مالوں میں بھی، ف۳ اور ان کی اولادوں میں، اور پھانستا جا ان کو اپنے (جھوٹے) وعدوں کے جال میں، اور شیطان کے وعدے کچھ نہیں ہوتے سوائے دھوکے کے سامان کے، ف٤",
        "English" : "And unsettle thou whomsoever of them thou canst with thy voice, and summon against them thine horse and thine foot, and share with them riches- and children, and promise unto them; and the Satan promise not but to delude."
      },
      {
        "ayet_no" : 65,
        "arbi" : "اِنَّ عِبَادِيْ لَيْسَ لَكَ عَلَيْهِمْ سُلْطٰنٌ ۭ وَكَفٰى بِرَبِّكَ وَكِيْلًا",
        "Urdu" : "(پر واضح رہے کہ) میرے خاص بندوں پر یقینا تیرا کوئی زور نہیں چل سکے گا، اور کافی ہے تمہارا رب کار سازی کیلئے،",
        "English" : "Verily My bondmen; over them thou hast no authority; and thy Lord suffice as a Trustee."
      },
      {
        "ayet_no" : 66,
        "arbi" : "رَبُّكُمُ الَّذِيْ يُزْجِيْ لَكُمُ الْفُلْكَ فِي الْبَحْرِ لِتَبْتَغُوْا مِنْ فَضْلِهٖ  ۭ اِنَّهٗ كَانَ بِكُمْ رَحِـيْمًا",
        "Urdu" : "تمہارا رب ہی تو ہے جو تمہارے (طرح طرح کے فائدوں کے) لئے کشتیاں (اور جہاز) چلاتا ہے سمندر میں، تاکہ تم لوگ تلاش کر سکو اس کا فضل، (اور اس کی روزی)، بیشک وہ تم پر بڑا ہی مہربان ہے",
        "English" : "Your Lord is the One who causes ships to sail for you through the sea, so that you may go in quest of His bounty; surely, He is Ever-Merciful for you."
      },
      {
        "ayet_no" : 67,
        "arbi" : "وَاِذَا مَسَّكُمُ الضُّرُّ فِي الْبَحْرِ ضَلَّ مَنْ تَدْعُوْنَ اِلَّآ اِيَّاهُ ۚ فَلَمَّا نَجّٰىكُمْ اِلَى الْبَرِّ اَعْرَضْتُمْ ۭ وَكَانَ الْاِنْسَانُ كَفُوْرًا",
        "Urdu" : "اور جب تم لوگوں کو سمندر (کی ان ہولناک موجوں) میں کوئی تکلیف پہنچتی ہے تو گم ہو جاتے ہیں (تمہارے وہ سب خود ساختہ حاجت روا و مشکل کشا) جن کو تم لوگ پکارا کرتے تھے، سوائے اس (معبود برحق) کے، پھر جب وہ تمہیں بچا کر خشکی پر پہنچا دیتا ہے، تو تم اس سے منہ موڑ لیتے ہو، واقعی انسان بڑا ہی ناشکرا ہے",
        "English" : "You face a hardship at sea, vanished are those whom you used to invoke, except Him (Allah). Then, once He brings you safe to the land, you turn away (from Him); man is so ungrateful."
      },
      {
        "ayet_no" : 68,
        "arbi" : "اَفَاَمِنْتُمْ اَنْ يَّخْسِفَ بِكُمْ جَانِبَ الْبَرِّ اَوْ يُرْسِلَ عَلَيْكُمْ حَاصِبًا ثُمَّ لَا تَجِدُوْا لَكُمْ وَكِيْلًا",
        "Urdu" : "اچھا تو کیا تم لوگ نڈر (اور بےخوف) ہوگئے ہو اس بات سے کہ وہ کبھی تم کو خشکی کی جانب ہی زمین میں دھنسا دے یا وہ بھیج دے تم پر پتھر برسانے والی کوئی اندھی، پھر تم نہ پاسکو اپنے لئے کوئی کار ساز",
        "English" : "Do you, then, feel secure from that He makes a part of the land sink down along with you, or that He sends down a rain of stones on you, whereupon you will find no one to protect you ?"
      },
      {
        "ayet_no" : 69,
        "arbi" : "اَمْ اَمِنْتُمْ اَنْ يُّعِيْدَكُمْ فِيْهِ تَارَةً اُخْرٰى فَيُرْسِلَ عَلَيْكُمْ قَاصِفًا مِّنَ الرِّيْحِ فَيُغْرِقَكُمْ بِمَا كَفَرْتُمْ ۙ ثُمَّ لَا تَجِدُوْا لَكُمْ عَلَيْنَا بِهٖ تَبِيْعًا",
        "Urdu" : "کیا تم لوگ نڈر (اور بےخوف) ہوگئے اس سے کہ وہ کبھی تم کو پھر لے جائے سمندر میں، اور تم پر کوئی سخت طوفانی ہوا بھیج کر تم سب کو اس میں غرق کر دے، تمہارے کفر (و ناشکری) کی پاداش میں، پھر تم نہ پاسکو اپنے لئے ہم سے کوئی پوچھنے والا،",
        "English" : "Or, do you feel secure from that He takes you back to it (the sea) once again, and sends a heavy storm of wind upon you which drowns you because of your disbelief, and then you will find no one to help ?"
      },
      {
        "ayet_no" : 70,
        "arbi" : "وَلَقَدْ كَرَّمْنَا بَنِيْٓ اٰدَمَ وَحَمَلْنٰهُمْ فِي الْبَرِّ وَالْبَحْرِ وَرَزَقْنٰهُمْ مِّنَ الطَّيِّبٰتِ وَفَضَّلْنٰهُمْ عَلٰي كَثِيْرٍ مِّمَّنْ خَلَقْنَا تَفْضِيْلًا",
        "Urdu" : "اور بلاشبہ ہم نے عزت بخشی بنی آدم کو، اور ان کو طرح طرح کی سواریوں سے نوازا خشکی میں بھی اور تری میں بھی اور ہم نے ان کو روزی کا سامان کیا طرح طرح کی پاکیزہ چیزوں سے، اور ان کواپنی بہت سی مخلوق پر طرح طرح کی فضیلت (و بزرگی) بخشی، ف۱",
        "English" : "And We bestowed dignity on the children of ‘Adam and provided them with rides on the land and in the sea, and provided them with a variety of good things and made them much superior to many of those whom We have created."
      },
      {
        "ayet_no" : 71,
        "arbi" : "يَوْمَ نَدْعُوْا كُلَّ اُنَاسٍۢ بِاِمَامِهِمْ ۚ فَمَنْ اُوْتِيَ كِتٰبَهٗ بِيَمِيْنِهٖ فَاُولٰۗىِٕكَ يَقْرَءُوْنَ كِتٰبَهُمْ وَلَا يُظْلَمُوْنَ فَتِيْلًا",
        "Urdu" : "(اور یاد کرو اس ہولناک دن کو کہ) جس دن ہم بلائیں گے لوگوں کے ہر گروہ کو اس کے پیشوا کے ساتھ پھر جن کو ان کا نامہ اعمال ان کے دائیں ہاتھ میں دیا جائے گا تو وہ (خوش ہو ہو کر) اپنے نامہ اعمال کو پڑھیں گے، اور ان پر ذرہ برابر کوئی ظلم نہیں ہوگا، ف۲",
        "English" : "(Think of) the Day when We will call every people with their books of deeds. Then the ones who will be given their book in their right hands will read their book (happily) and will not be wronged even to the measure of a fine thread."
      },
      {
        "ayet_no" : 72,
        "arbi" : "وَمَنْ كَانَ فِيْ هٰذِهٖٓ اَعْمٰى فَهُوَ فِي الْاٰخِرَةِ اَعْمٰى وَاَضَلُّ سَبِيْلًا",
        "Urdu" : "اور جو کوئی اندھا بن کر رہا ہوگا، اس (دنیا کی زندگی) میں تو وہ آخرت میں بھی اندھا ہی رہے گا، بلکہ اس سے بھی زیادہ گمراہ،",
        "English" : "But whoever is (too) blind in this (world to see the right path) will be (too) blind in the Hereafter (to reach the salvation), and much more astray from the path."
      },
      {
        "ayet_no" : 73,
        "arbi" : "وَاِنْ كَادُوْا لَيَفْتِنُوْنَكَ عَنِ الَّذِيْٓ اَوْحَيْنَآ اِلَيْكَ لِتَفْتَرِيَ عَلَيْنَا غَيْرَهٗ ڰ وَاِذًا لَّاتَّخَذُوْكَ خَلِيْلًا",
        "Urdu" : "اور (اے پیغمبر!) ان لوگوں نےاپنی اس کوشش میں کوئی کسر اٹھا نہیں رکھی تھی کہ آپ کو فتنے میں ڈال کر پھیر دیں اس وحی سے جو ہم نے بھیجی ہے آپ کی طرف، تاکہ آپ اس کے خلاف ہماری طرف کسی اور بات کی نسبت کر دیں، اور اگر ایسا ہو جاتا تو یہ لوگ یقینا آپ کو اپنا گہرا دوست بنا لیتے،",
        "English" : "(O Prophet,) Surely, they were about to lure you away from what We have revealed to you, so that you forge something else against Us, and in that case they would have certainly made you a bosom friend."
      },
      {
        "ayet_no" : 74,
        "arbi" : "وَلَوْلَآ اَنْ ثَبَّتْنٰكَ لَقَدْ كِدْتَّ تَرْكَنُ اِلَيْهِمْ شَـيْــــًٔـا قَلِيْلًا",
        "Urdu" : "اور اگر ہم نے آپ کو ثابت قدم نہ رکھا ہوتا، تو بلاشبہ آپ کسی قدر ان کی طرف جھکنے کے قریب ہو جاتے،",
        "English" : "Had We not made you firm, it was likely that you would have inclined towards them a little bit."
      },
      {
        "ayet_no" : 75,
        "arbi" : "اِذًا لَّاَذَقْنٰكَ ضِعْفَ الْحَيٰوةِ وَضِعْفَ الْمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيْنَا نَصِيْرًا",
        "Urdu" : "اور اگر ایسے ہو جاتا تو ہم یقینا آپ کو دوہرا عذاب چکھاتے، دنیاوی زندگی میں بھی، اور موت کے بعد بھی، پھر آپ ہمارے مقابلے میں کوئی مددگار نہ پا سکتے",
        "English" : "In that case, We would have surely made you taste a double (punishment) in life and a double (punishment) after death, then you would not have found anyone to help you against Us."
      },
      {
        "ayet_no" : 76,
        "arbi" : "وَاِنْ كَادُوْا لَيَسْتَفِزُّوْنَكَ مِنَ الْاَرْضِ لِيُخْرِجُوْكَ مِنْهَا وَاِذًا لَّا يَلْبَثُوْنَ خِلٰفَكَ اِلَّا قَلِيْلًا",
        "Urdu" : "اور انہوں نے اس میں بھی کوئی کسر اٹھا نہیں رکھی کہ آپ کے قدم اکھاڑ دیں اس سرزمین سے، تاکہ آپ کو اس سے نکال باہر کر دیں، (خواہ جبر سے خواہ مکر سے) اور اگر ایسا ہو جاتا تو یہ لوگ بھی آپ کے بعد یہاں نہ ٹھہر سکتے مگر بہت کم،",
        "English" : "And they were likely to harass you in the land, so that they could expel you from there, and in that case, they will have not lived (there) after you, but a little."
      },
      {
        "ayet_no" : 77,
        "arbi" : "سُنَّةَ مَنْ قَدْ اَرْسَلْنَا قَبْلَكَ مِنْ رُّسُلِنَا وَلَا تَجِدُ لِسُنَّتِنَا تَحْوِيْلًا",
        "Urdu" : "اپنے اس دستور کے مطابق جو ہمارا ان تمام رسولوں کے بارے میں رہا ہے جن کو ہم آپ سے پہلے بھیج چکے ہیں، اور آپ ہمارے دستور میں کوئی تبدیلی نہیں پائیں گے،",
        "English" : "Such has been Our way with the messengers We sent before you. And you will find no change in Our way."
      },
      {
        "ayet_no" : 78,
        "arbi" : "اَقِمِ الصَّلٰوةَ لِدُلُوْكِ الشَّمْسِ اِلٰى غَسَقِ الَّيْلِ وَقُرْاٰنَ الْفَجْرِ ۭ اِنَّ قُرْاٰنَ الْفَجْرِ كَانَ مَشْهُوْدًا",
        "Urdu" : "نماز قائم رکھو سورج ڈھلنے سے لے کر رات کے اندھیرے تک اور خاص کر فجر کے قران پڑھنے کو، بلاشبہ فجر کے قران پڑھنے کا وقت حضوری کا وقت ہوتا ہے، ف۱",
        "English" : "(O Prophet,) establish Salah between the decline of the sun and the darkness of the night, and (establish) the recital at dawn. Surely, the recital at dawn is well attended."
      },
      {
        "ayet_no" : 79,
        "arbi" : "وَمِنَ الَّيْلِ فَتَهَجَّدْ بِهٖ نَافِلَةً لَّكَ ڰ عَسٰٓي اَنْ يَّبْعَثَكَ رَبُّكَ مَقَامًا مَّحْمُوْدًا",
        "Urdu" : "اور رات کے کچھ حصے میں تہجد بھی پڑھا کرو، جو کہ آپ کے لئے ایک زائد عبادت ہے، بعید نہیں کہ آپ کا رب آپ کو سرفراز فرما دے مقام محمود سے،",
        "English" : "And during the night, wake up for Salah of tahajjud , an additional prayer for you. It is very likely that your Lord will place you at Praised Station."
      },
      {
        "ayet_no" : 80,
        "arbi" : "وَقُلْ رَّبِّ اَدْخِلْنِيْ مُدْخَلَ صِدْقٍ وَّاَخْرِجْنِيْ مُخْــرَجَ صِدْقٍ وَّاجْعَلْ لِّيْ مِنْ لَّدُنْكَ سُلْطٰنًا نَّصِيْرًا",
        "Urdu" : "اور یہ دعاء کرتے رہا کرو کہ میرے رب! مجھے (جہاں بھی لے جانا ہو) سچائی کے ساتھ لے جانا، اور (جہاں سے بھی نکالنا ہو) سچائی کے ساتھ نکالنا اور مجھےاپنی طرف سے ایسا غلبہ عطا فرما جس کے ساتھ (تیری دائمی) نصرت شامل ہو،",
        "English" : "And say, :O my Lord, make me enter a rightful entrance and make me exit a rightful exit, and grant me from Your Own a power, favored (by You)."
      },
      {
        "ayet_no" : 81,
        "arbi" : "وَقُلْ جَاۗءَ الْحَقُّ وَزَهَقَ الْبَاطِلُ ۭ اِنَّ الْبَاطِلَ كَانَ زَهُوْقًا",
        "Urdu" : "اور اعلان کر دو (اے پیغمبر!) کہ حق آگیا اور باطل مٹ گیا، اور بلاشبہ باطل ہے ہی مٹنے کی چیز",
        "English" : "And say, :Truth has come and falsehood has vanished. Falsehood is surely bound to vanish."
      },
      {
        "ayet_no" : 82,
        "arbi" : "وَنُنَزِّلُ مِنَ الْقُرْاٰنِ مَا هُوَ شِفَاۗءٌ وَّرَحْمَةٌ لِّلْمُؤْمِنِيْنَ ۙ وَلَا يَزِيْدُ الظّٰلِمِيْنَ اِلَّا خَسَارًا",
        "Urdu" : "اور ہم اس قران کے ذریعے وہ کچھ نازل کرتے ہیں جو سراسر شفاء اور عین رحمت ہے ایمانداروں کے لئے، مگر ظالموں کے لئے اس سے خسارے کے سوا اور کسی چیز کا اضافہ نہیں ہوتا، ف۲",
        "English" : "We reveal the Qur‘an, which is cure and mercy for the believers; and it adds nothing to the unjust but loss."
      },
      {
        "ayet_no" : 83,
        "arbi" : "وَاِذَآ اَنْعَمْنَا عَلَي الْاِنْسَانِ اَعْرَضَ وَنَاٰ بِجَانِبِهٖ ۚ وَاِذَا مَسَّهُ الشَّرُّ كَانَ يَـــــُٔوْسًا",
        "Urdu" : "اور جب ہم انسان پر کوئی انعام کرتے ہیں تو وہ منہ موڑ لیتا ہے، اور پیٹھ پھیر لیتا ہے، اور جب اسے کوئی تکلیف پہنچتی ہے تو وہ مایوس ہو جاتا ہے،",
        "English" : "When We bestow Our favor upon man, he avoids (to recognize it) and keeps himself far aside (from obedience), and when some evil touches him, he is in total despair."
      },
      {
        "ayet_no" : 84,
        "arbi" : "قُلْ كُلٌّ يَّعْمَلُ عَلٰي شَاكِلَتِهٖ ۭ فَرَبُّكُمْ اَعْلَمُ بِمَنْ هُوَ اَهْدٰى سَبِيْلًا",
        "Urdu" : "(ان سے) کہو کہ ہر کوئی اپنے طریقے پر کام کئے جا رہا ہے، پر آپ کے رب کو خوب معلوم ہے کہ کون سب سے زیادہ سیدھی راہ پر ہے،",
        "English" : "Say, :Everyone acts in his own style. So, your Lord knows best which one is better guided in his way."
      },
      {
        "ayet_no" : 85,
        "arbi" : "وَيَسْــــَٔـلُوْنَكَ عَنِ الرُّوْحِ ۭ قُلِ الرُّوْحُ مِنْ اَمْرِ رَبِّيْ وَمَآ اُوْتِيْتُمْ مِّنَ الْعِلْمِ اِلَّا قَلِيْلًا",
        "Urdu" : "اور پوچھتے ہیں آپ سے (اے پیغمبر!) روح کے بارے میں، تو انھیں بتا دو کہ روح تو میرے رب کے حکم سے ہے، اور تمہیں جو کچھ بھی علم دیا گیا ہے (اے لوگو) بہت ہی تھوڑا ہے،",
        "English" : "And they ask you about the soul. Say, :The soul is something from the command of my Lord, and you are not given from the knowledge but a little."
      },
      {
        "ayet_no" : 86,
        "arbi" : "وَلَىِٕنْ شِـئْنَا لَنَذْهَبَنَّ بِالَّذِيْٓ اَوْحَيْنَآ اِلَيْكَ ثُمَّ لَا تَجِدُ لَكَ بِهٖ عَلَيْنَا وَكِيْلًا",
        "Urdu" : "اور اگر ہم چاہیں تو چھین لیں آپ سے (اے پیغمبر!) وہ سب کچھ جو ہم نے آپ کو بذریعہ وحی عطا کیا ہے، پھر آپ کو ہمارے مقابلے میں کوئی حمایتی بھی نہ مل سکے،",
        "English" : "And if We so will, We will surely take away what We have revealed to you, then you shall find no one to rely upon against Us in this matter."
      },
      {
        "ayet_no" : 87,
        "arbi" : "اِلَّا رَحْمَةً مِّنْ رَّبِّكَ ۭ اِنَّ فَضْلَهٗ كَانَ عَلَيْكَ كَبِيْرًا",
        "Urdu" : "مگر (یہ صرف) آپ کے رب کی مہربانی ہے (کہ ایسے نہیں ہوا) بیشک اس کی عنایت آپ پر بہت ہی بڑی ہے، ف۱",
        "English" : "But it is a mercy from your Lord. Great is indeed His favor upon you."
      },
      {
        "ayet_no" : 88,
        "arbi" : "قُلْ لَّىِٕنِ اجْتَمَعَتِ الْاِنْسُ وَالْجِنُّ عَلٰٓي اَنْ يَّاْتُوْا بِمِثْلِ هٰذَا الْقُرْاٰنِ لَا يَاْتُوْنَ بِمِثْلِهٖ وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيْرًا",
        "Urdu" : "(اور عظمت قران کے اظہار و بیان کے لئے) کہو کہ اگر سارے انسان اور جن مل کر بھی اس قران جیسا کوئی کلام لانا چاہیں تو (ہرگز ہرگز) نہیں لا سکیں گے، اگرچہ وہ سب ایک دوسرے کے مددگار بھی بن جائیں، ف۲",
        "English" : "Say, :If all the humans and jinns join together to produce anything like this Qur‘an, they will not (be able to) come up with anything like it, even if they assist one another."
      },
      {
        "ayet_no" : 89,
        "arbi" : "وَلَقَدْ صَرَّفْـنَا لِلنَّاسِ فِيْ هٰذَا الْقُرْاٰنِ مِنْ كُلِّ مَثَلٍ ۡ فَاَبٰٓى اَكْثَرُ النَّاسِ اِلَّا كُفُوْرًا",
        "Urdu" : "اور بلاشبہ ہم نے لوگوں کے لئے اس قران میں عمدہ مضمون کو طرح طرح سے بیان کیا، مگر لوگوں کی اکثریت (پھر بھی) انکار ہی پر کمربستہ رہی، ف۳",
        "English" : "Indeed We explained every subject in this Qur‘an in various ways for the benefit of mankind. Still, most of the people refused to do anything but reject."
      },
      {
        "ayet_no" : 90,
        "arbi" : "وَقَالُوْا لَنْ نُّؤْمِنَ لَكَ حَتّٰى تَفْجُرَ لَنَا مِنَ الْاَرْضِ يَنْۢبُوْعًا",
        "Urdu" : "اور (قران حکیم کے اس عظیم معجزے کے باوجود) یہ لوگ کہتے ہیں کہ ہم ہرگز آپ پر ایمان نہیں لائیں گے، یہاں تک کہ آپ پھاڑ نکالیں ہمارے لئے (مکہ کی) اس زمین سے ایک عظیم الشان چشمہ،",
        "English" : "They said, :We shall never believe in you unless you cause a spring to gush forth for us from the earth."
      },
      {
        "ayet_no" : 91,
        "arbi" : "اَوْ تَكُوْنَ لَكَ جَنَّةٌ مِّنْ نَّخِيْلٍ وَّعِنَبٍ فَتُفَجِّرَ الْاَنْهٰرَ خِلٰلَهَا تَفْجِيْرًا",
        "Urdu" : "یاخود آپ کے لئے ایک عظیم الشان باغ ہو کھجوروں اور انگوروں کا، پھر آپ جاری کر دیں اس میں طرح طرح کی نہریں،",
        "English" : "Or you have a garden of date palms and grapes, then you bring forth rivers from their midst in abundance."
      },
      {
        "ayet_no" : 92,
        "arbi" : "اَوْ تُسْقِطَ السَّمَاۗءَ كَمَا زَعَمْتَ عَلَيْنَا كِسَفًا اَوْ تَاْتِيَ بِاللّٰهِ وَالْمَلٰۗىِٕكَةِ قَبِيْلًا",
        "Urdu" : "یا گرا دیں آپ ہم پر آسمان کو ٹکڑے ٹکڑے کر کے، جیسا کہ آپ کا دعویٰ ہے، یا ہمارے سامنے لے آئیں آپ اللہ اور اس کے فرشتوں کو،",
        "English" : "Or you cause the sky to fall upon us in pieces, as you claimed, or you bring Allah and angels before us face to face."
      },
      {
        "ayet_no" : 93,
        "arbi" : "اَوْ يَكُوْنَ لَكَ بَيْتٌ مِّنْ زُخْرُفٍ اَوْ تَرْقٰى فِي السَّمَاۗءِ ۭ وَلَنْ نُّؤْمِنَ لِرُقِيِّكَ حَتّٰى تُنَزِّلَ عَلَيْنَا كِتٰبًا نَّقْرَؤُهٗ ۭ قُلْ سُبْحَانَ رَبِّيْ هَلْ كُنْتُ اِلَّا بَشَرًا رَّسُوْلًا",
        "Urdu" : "یا آپ کے لئے ایک عظیم الشان گھر ہو سونے کا، یا آپ چڑھ جائیں آسمان پر، اور آپ کے چڑھنے کا بھی ہم یقین نہیں کریں گے، یہاں تک کہ آپ اتار دیں ہم پر ایک کتاب، جس کو ہم خود پڑھیں، سو آپ (اے پیغمبر! اس کے جواب میں) کہو کہ پاک ہے میرا رب، میں تو صرف ایک بشر (اور انسان) ہوں بھیجا ہوا، ف۱",
        "English" : "Or you have a house made of gold. Or you ascend to the sky, and we will not believe in your ascension unless you send down to us a book we may read. Say, :I proclaim the Purity of my Lord. I am nothing but human, a messenger."
      },
      {
        "ayet_no" : 94,
        "arbi" : "وَمَا مَنَعَ النَّاسَ اَنْ يُّؤْمِنُوْٓا اِذْ جَاۗءَهُمُ الْهُدٰٓى اِلَّآ اَنْ قَالُوْٓا اَبَعَثَ اللّٰهُ بَشَرًا رَّسُوْلًا",
        "Urdu" : "اور لوگوں کے پاس جب بھی کبھی ہدایت آئی تو ان کو اس پر ایمان لانے سے اس بات کے سوا اور کسی چیز نے نہیں روکا کہ کیا اللہ نے ایک بشر (اور انسان) ہی کو رسول بنا کر بھیجنا تھا ؟ ف۲",
        "English" : "Nothing prevented people from believing, when guidance came to them, except that they said, :Has Allah sent a man as a messenger ?"
      },
      {
        "ayet_no" : 95,
        "arbi" : "قُلْ لَّوْ كَانَ فِي الْاَرْضِ مَلٰۗىِٕكَةٌ يَّمْشُوْنَ مُطْمَىِٕنِّيْنَ لَنَزَّلْنَا عَلَيْهِمْ مِّنَ السَّمَاۗءِ مَلَكًا رَّسُوْلًا",
        "Urdu" : "(ان سے) کہو کہ اگر زمین میں (انسانوں کی بجائے) فرشتے ہوتے جو یہاں اطمینان سے (رہتے بستے اور) چل پھر رہے ہوتے، تو ہم ضرور ان پر آسمان سے کسی فرشتہ ہی کو رسول بنا کر بھیج دیتے، ف۳",
        "English" : "Say, :Had there been angels (living) on the earth, walking about in peace, We would have certainly sent down an angel from the heavens as a messenger."
      },
      {
        "ayet_no" : 96,
        "arbi" : "قُلْ كَفٰى بِاللّٰهِ شَهِيْدًۢا بَيْنِيْ وَبَيْنَكُمْ ۭ اِنَّهٗ كَانَ بِعِبَادِهٖ خَبِيْرًۢا بَصِيْرًا",
        "Urdu" : "(اور ان سے آخری بات کے طور پر) کہہ دو کافی ہے اللہ، میرے اور تمہارے درمیان گواہی دینے کو، بیشک وہ اپنے بندوں سے پوری طرح باخبر اور سب کچھ دیکھتا ہے",
        "English" : "Say, :Allah is sufficient as witness between me and you. Surely, He is All-Aware, All-Watchful to His servants."
      },
      {
        "ayet_no" : 97,
        "arbi" : "وَمَنْ يَّهْدِ اللّٰهُ فَهُوَ الْمُهْتَدِ ۚ وَمَنْ يُّضْلِلْ فَلَنْ تَجِدَ لَهُمْ اَوْلِيَاۗءَ مِنْ دُوْنِهٖ ۭ وَنَحْشُرُهُمْ يَوْمَ الْقِيٰمَةِ عَلٰي وُجُوْهِهِمْ عُمْيًا وَّبُكْمًا وَّصُمًّا ۭ مَاْوٰىهُمْ جَهَنَّمُ ۭ كُلَّمَا خَبَتْ زِدْنٰهُمْ سَعِيْرًا",
        "Urdu" : "جسے اللہ ہدایت بخشے وہی ہے ہدایت پانے والا اور جسے وہ گمراہی میں ڈال دے تو آپ ایسوں کے لئے حمایتی (اور مددگار) نہیں پا سکیں گے، اس (وحدہ، لا شریک) کے سوا، اور ایسے لوگوں کو ہم قیامت کے روز ان کے مونہوں کے بل کھینچ لائیں گے، اندھے، گونگے اور بہرے کرکے، ان کا ٹھکانا جہنم ہوگا، جب کبھی اس کی آگ بجھنے لگے گی تو ہم اسے اور بھڑکا دیں گے،",
        "English" : "The one whom Allah guides is the guided one; and those whom He lets go astray, you will never find for them any helpers other than Him. And We shall gather them on the Day of Judgment, with their faces down—blind, dumb and deaf. Their abode is the Fire. Whenever it calms down, We increase its flames for them."
      },
      {
        "ayet_no" : 98,
        "arbi" : "ذٰلِكَ جَزَاۗؤُهُمْ بِاَنَّهُمْ كَفَرُوْا بِاٰيٰتِنَا وَقَالُوْٓا ءَاِذَا كُنَّا عِظَامًا وَّرُفَاتًا ءَاِنَّا لَمَبْعُوْثُوْنَ خَلْقًا جَدِيْدًا",
        "Urdu" : "ان کی یہ سزا اس وجہ سے ہوگی کہ انہوں نے کفر (و انکار) کا ارتکاب کیا تھا ہماری آیتوں کے ساتھ، اور یہ کہا کرتے تھے کہ کیا جب ہم ہڈیاں اور خاک ہو کر رہ جائیں گے تو ہمیں نئے سرے سے زندہ کرکے اٹھایا جائے گا ؟",
        "English" : "That is their punishment, because they rejected Our signs and said, :Is it that once we are reduced to bones and dust, is it then that we shall be raised, created anew ?"
      },
      {
        "ayet_no" : 99,
        "arbi" : "اَوَلَمْ يَرَوْا اَنَّ اللّٰهَ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ قَادِرٌ عَلٰٓي اَنْ يَّخْلُقَ مِثْلَهُمْ وَجَعَلَ لَهُمْ اَجَلًا لَّا رَيْبَ فِيْهِ ۭ فَاَبَى الظّٰلِمُوْنَ اِلَّا كُفُوْرًا",
        "Urdu" : "کیا انہوں نے یہ نہ دیکھا کہ جس اللہ نے آسمانوں اور زمین کو پیدا کیا ہے وہ ان جیسے انسانوں کے دوبارہ پیدا کر دینے پر بھی یقینا قدرت رکھتا ہے، اور اس نے ان کے لئے ایک ایسی مدت مقرر کر رکھی ہے جس میں کوئی شک نہیں، مگر ظالم پھر بھی انکار ہی کئے جا رہے ہیں، ف۱",
        "English" : "Have they not seen that Allah who has created the heavens and the earth has the power to create them as they were ? He has appointed a time for them in which there is no doubt. Still, the wrongdoers refused to do anything but reject."
      },
      {
        "ayet_no" : 100,
        "arbi" : "قُلْ لَّوْ اَنْتُمْ تَمْلِكُوْنَ خَزَاۗىِٕنَ رَحْمَةِ رَبِّيْٓ اِذًا لَّاَمْسَكْتُمْ خَشْيَةَ الْاِنْفَاقِ  ۭ وَكَانَ الْاِنْسَانُ قَتُوْرًا",
        "Urdu" : "(ان سے) کہو کہ اگر کہیں تم لوگ مالک ہوگئے ہوتے میرے رب کی رحمت کے خزانوں کے، تو یقینا تم ان کو روک رکھتے خرچ ہو جانے کے اندیشے سے، واقعی انسان بڑا ہی تنگ دل ہے، ف۲",
        "English" : "Say, :If you were to own the treasures of my Lord‘s blessing, you would certainly hold them back, lest it should be spent. Man is so niggardly."
      },
      {
        "ayet_no" : 101,
        "arbi" : "وَلَقَدْ اٰتَيْنَا مُوْسٰي تِسْعَ اٰيٰتٍۢ بَيِّنٰتٍ فَسْــــَٔـلْ بَنِيْٓ اِسْرَاۗءِيْلَ اِذْ جَاۗءَهُمْ فَقَالَ لَهٗ فِرْعَوْنُ اِنِّىْ لَاَظُنُّكَ يٰمُوْسٰي مَسْحُوْرًا",
        "Urdu" : "اور بلاشبہ ہم نے موسیٰ کو عطا کی تھیں نو کھلی نشانیاں، پس تم پوچھ لو بنی اسرائیل سے کہ جب موسیٰ ان کے پاس آیا تو فرعون نے ان سے کہا کہ اے موسیٰ میں تو تجھے یقینی طور پر ایک جادو کا مارا ہوا انسان سمجھتا ہوں،",
        "English" : "Surely we gave Musa nine clear signs. So, ask the children of Isra‘il, when he came to them, Pharaoh said to him, :I am afraid, O Musa, you are under the spell of magic."
      },
      {
        "ayet_no" : 102,
        "arbi" : "قَالَ لَقَدْ عَلِمْتَ مَآ اَنْزَلَ هٰٓؤُلَاۗءِ اِلَّا رَبُّ السَّمٰوٰتِ وَالْاَرْضِ بَصَاۗىِٕرَ ۚ وَاِنِّىْ لَاَظُنُّكَ يٰفِرْعَوْنُ مَثْبُوْرًا",
        "Urdu" : "موسیٰ نے جواب میں کہا کہ تجھے اچھی طرح معلوم ہے کہ ان بصیرت افروز نشانیوں کو آسمانوں اور زمین کے مالک کے سوا اور کسی نے نہیں اتارا اور میں تجھے اے فرعون، قطعی طور پر ایک ہلاک ہونے والا انسان سمجھتا ہوں،",
        "English" : "He (Musa) said, :You know well that these (signs) are sent down by none but by the Lord of the heavens and the earth as eye-openers. And, I am afraid O Pharaoh, you are going to be destroyed."
      },
      {
        "ayet_no" : 103,
        "arbi" : "فَاَرَادَ اَنْ يَّسْتَفِزَّهُمْ مِّنَ الْاَرْضِ فَاَغْرَقْنٰهُ وَمَنْ مَّعَهٗ جَمِيْعًا",
        "Urdu" : "سو فرعون نے چاہا تھا کہ اکھاڑ پھینکے ان سب کو اس سرزمین سے، مگر اس کے نتیجے میں ہم نے غرق کر دیا خود فرعون کو اور ان سب کو جو اس کے ساتھ تھے یکجا طور پر، ف۲",
        "English" : "Then he besought to unsettle them from the land; wherefore We drowned him and those with him, all together."
      },
      {
        "ayet_no" : 104,
        "arbi" : "وَّقُلْنَا مِنْۢ بَعْدِهٖ لِبَنِيْٓ اِسْرَاۗءِيْلَ اسْكُنُوا الْاَرْضَ فَاِذَا جَاۗءَ وَعْدُ الْاٰخِرَةِ جِئْنَا بِكُمْ لَفِيْفًا",
        "Urdu" : "اور اس کے بعد ہم نے بنی اسرائیل سے کہا کہ اب تم لوگ رہو بسو، اس زمین میں، پھر جب آپہنچے گا آخرت کے وعدے کا وقت، تو ہم لے آئیں گے تم سب کو اکٹھا کر کے،",
        "English" : "And We said, after him, unto the Children of Isra'l: dwell on the earth, then when there come the promise of the Hereafter, We shall bring you as a crowd."
      },
      {
        "ayet_no" : 105,
        "arbi" : "وَبِالْحَـقِّ اَنْزَلْنٰهُ وَبِالْحَقِّ نَزَلَ ۭ وَمَآ اَرْسَلْنٰكَ اِلَّا مُبَشِّرًا وَّنَذِيْرًا",
        "Urdu" : "اور حق ہی کے ساتھ اتارا ہے ہم نے اس (قران حکیم) کو اور حق ہی کے ساتھ نازل ہوا ہے یہ، اور ہم نے نہیں بھیجا آپ کو (اے پیغمبر!) مگر خوشخبری سنانے والا، اور خبردار کرنے والا بنا کر",
        "English" : "With truth We have sent it (the Qur‘an) down and with truth it descended, and We did not send you but as a bearer of good tidings and as a warner."
      },
      {
        "ayet_no" : 106,
        "arbi" : "وَقُرْاٰنًا فَرَقْنٰهُ لِتَقْرَاَهٗ عَلَي النَّاسِ عَلٰي مُكْثٍ وَّنَزَّلْنٰهُ تَنْزِيْلًا",
        "Urdu" : "اور ہم نے قران کو تھوڑا تھوڑا کر کے اتارا، تاکہ آپ اسے ٹھہر ٹھہر کر لوگوں کو سنائیں، اور ہم نے اسے (موقع بموقع) ایک خاص تدریج سے اتارا ہے،",
        "English" : "We have divided the Qur‘an in portions, so that you may recite it to the people gradually, and We have revealed it little by little."
      },
      {
        "ayet_no" : 107,
        "arbi" : "قُلْ اٰمِنُوْا بِهٖٓ اَوْ لَا تُؤْمِنُوْا ۭ اِنَّ الَّذِيْنَ اُوْتُوا الْعِلْمَ مِنْ قَبْلِهٖٓ اِذَا يُتْلٰى عَلَيْهِمْ يَخِرُّوْنَ لِلْاَذْقَانِ سُجَّدًا  ۙ {السجدہ}",
        "Urdu" : "کہو کہ تم لوگ اس پر ایمان لاؤ یا نہ لاؤ (اے لوگو! یہ بہر حال حق ہے) بلاشبہ جن لوگوں کو اس سے پہلے علم دیا گیا ہے جب یہ انھیں سنایا جاتا ہے، تو وہ ٹھوڑیوں کے بل سجدے میں گر پڑتے ہیں،",
        "English" : "Say, :Believe in it or do not believe in it; when it is recited to those who were given knowledge before it, they fall down on their faces in prostration."
      },
      {
        "ayet_no" : 108,
        "arbi" : "وَّيَـقُوْلُوْنَ سُبْحٰنَ رَبِّنَآ اِنْ كَانَ وَعْدُ رَبِّنَا لَمَفْعُوْلًا",
        "Urdu" : "اور وہ پکارا اٹھتے ہیں کہ پاک ہے ہمارا رب، بیشک ہمارے رب کے وعدے نے بہر حال پورا ہو کر ہی رہنا تھا،",
        "English" : "And they say: hallowed be our Lord! the promise of Our Lord was ever to have been fulfilled."
      },
      {
        "ayet_no" : 109,
        "arbi" : "وَيَخِرُّوْنَ لِلْاَذْقَانِ يَبْكُوْنَ وَيَزِيْدُهُمْ خُشُوْعًا",
        "Urdu" : "اور وہ گر جاتے ہیں ٹھوڑیوں کے بل روتے ہوئے اور اس سے ان کے خشوع (اور عاجزی) میں اور اضافہ ہو جاتا ہے، ف۱",
        "English" : "They fall down on their faces weeping, and it increases humbleness in their hearts."
      },
      {
        "ayet_no" : 110,
        "arbi" : "قُلِ ادْعُوا اللّٰهَ اَوِ ادْعُوا الرَّحْمٰنَ  ۭ اَيًّا مَّا تَدْعُوْا فَلَهُ الْاَسْمَاۗءُ الْحُسْنٰى  ۚ وَلَا تَجْـهَرْ بِصَلَاتِكَ وَلَا تُخَافِتْ بِهَا وَابْتَغِ بَيْنَ ذٰلِكَ سَبِيْلًا",
        "Urdu" : "کہو کہ تم (اے لوگو! اپنے رب کو) اللہ کہہ کر پکارو، یا رحمان کہہ کر، جس نام سے بھی پکارو (خیر ہی خیر ہے کہ یہ) سب اچھے نام اسی (وحدہ، لا شریک) کے ہیں، اوراپنی نماز میں نہ تو تم بہت بلند آواز سے پڑھو، اور نہ بالکل پست آواز سے، بلکہ ان دونوں کے درمیان کا راستہ اختیار کرو",
        "English" : "Say, :Call (Him by the name of) Allah or Ar-RaHman, in whichever way you call, His are the Best Names. Do not be (too) loud in your Salah, nor be (too) low in it, and seek a way in between."
      },
      {
        "ayet_no" : 111,
        "arbi" : "وَقُلِ الْحَمْدُ لِلّٰهِ الَّذِيْ لَمْ يَتَّخِذْ وَلَدًا وَّلَمْ يَكُنْ لَّهٗ شَرِيْكٌ فِي الْمُلْكِ وَلَمْ يَكُنْ لَّهٗ وَلِيٌّ مِّنَ الذُّلِّ وَكَبِرْهُ تَكْبِيْرًا",
        "Urdu" : "اور کہو سب تعریفیں اس اللہ ہی کے لئے ہیں جس کی نہ کوئی اولاد ہے، نہ اس کی سلطنت میں اس کا کوئی شریک، اور نہ ہی اس کا کوئی حمایتی (مددگار) ہے عاجزی (اور کمزوری) کی بنا پر، اور اسی کی بڑائی بیان کرو، کمال درجے کی بڑائی۔ ف۲",
        "English" : "And say thou: all praise is unto Allah who hath not taken a son, and whose is no associate in the dominion, nor hath He a protector through weakness, and magnify Him with all magnificence."
      }

    ]
  }
]