[
  {
    "surah_no" : 40,
    "total_ayah" : 85,
    "name" : "Surah e Ghafir",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "حٰمۗ",
        "Urdu" : "حٰ مٓ",
        "English" : "Ha. Mim."
      },
      {
        "ayet_no" : 2,
        "arbi" : "تَنْزِيْلُ الْكِتٰبِ مِنَ اللّٰهِ الْعَزِيْزِ الْعَلِيْمِ",
        "Urdu" : "یہ کتاب محض اتاری ہوئی ہے اللہ کی طرف سے جو کہ بڑا ہی زبردست نہایت ہی علم والا ہے",
        "English" : "The revelation of the Book is from Allah, the Mighty, the Knower. Forgiver of sin, and Accepter of repentance, severe in chastisement, Lord of power. There is no god but He; Unto Him is the journeying."
      },
      {
        "ayet_no" : 3,
        "arbi" : "غَافِرِ الذَّنْۢبِ وَقَابِلِ التَّوْبِ شَدِيْدِ الْعِقَابِ ۙ ذِي الطَّوْلِ ۭ لَآ اِلٰهَ اِلَّا هُوَ ۭ اِلَيْهِ الْمَصِيْرُ",
        "Urdu" : "گناہ بخشنے والا توبہ قبول کرنے والا سخت عذاب دینے والا بڑا ہی فضل والا ہے کوئی بھی عبادت کے لائق نہیں سوائے اس (وحدہ لاشریک) کے اسی کی طرف بہرحال لوٹنا ہے سب کو",
        "English" : "The One who forgives sins and accepts repentance, the One who is severe in punishment, the One who is the source of all power. There is no god but He. To Him is the ultimate return (of all)."
      },
      {
        "ayet_no" : 4,
        "arbi" : "مَا يُجَادِلُ فِيْٓ اٰيٰتِ اللّٰهِ اِلَّا الَّذِيْنَ كَفَرُوْا فَلَا يَغْرُرْكَ تَــقَلُّبُهُمْ فِي الْبِلَادِ",
        "Urdu" : "اللہ کی آیتوں میں جھگڑا نہیں کرتے مگر وہی لوگ جو اڑے ہوتے ہیں اپنے کفر (و باطل) پر سو (ان کو اس کا بھگتان بہرحال بھگتنا ہوگا پس) تم کو کہیں دھوکے میں نہ ڈالنے پائے ان لوگوں کا چلنا پھرنا مختلف شہروں (اور ملکوں) میں ف۲",
        "English" : "No one quarrels about the verses of Allah, except those who disbelieve. So, their (prosperous) movements in the cities should not deceive you."
      },
      {
        "ayet_no" : 5,
        "arbi" : "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوْحٍ وَّالْاَحْزَابُ مِنْۢ بَعْدِهِمْ ۠ وَهَمَّتْ كُلُّ اُمَّةٍۢ بِرَسُوْلِهِمْ لِيَاْخُذُوْهُ وَجٰدَلُوْا بِالْبَاطِلِ لِيُدْحِضُوْا بِهِ الْحَقَّ فَاَخَذْتُهُمْ ۣ فَكَيْفَ كَانَ عِقَابِ",
        "Urdu" : "ان سے پہلے قوم نوح نے بھی جھٹلایا (حق اور حقیقت کو) اور ان کے بعد کی کئی جماعتوں نے بھی ہر امت نے اپنے پیغمبر کو پکڑنے (اور قتل کر ڈالنے تک کا خبیث) ارادہ کیا اور انہوں نے باطل (کے طرح طرح ہتھیاروں) سے کام لیا تاکہ اس طرح وہ نیچا دکھا سکیں حق کو آخرکار میں نے پکڑا ان سب کو (اس عذاب میں جس کا مستحق انہوں نے اپنے آپ کو بنا لیا تھا) سو (دیکھ لو) کیسا تھا میرا عذاب ؟",
        "English" : "Before these, the people of NuH and the groups after them had rejected (the messengers). Every group intended to seize their messenger, and raised disputes on the basis of falsehood, so that they might refute the truth with it, hence I seized them. So, how was My punishment ?"
      },
      {
        "ayet_no" : 6,
        "arbi" : "وَكَذٰلِكَ حَقَّتْ كَلِمَتُ رَبِّكَ عَلَي الَّذِيْنَ كَفَرُوْٓا اَنَّهُمْ اَصْحٰبُ النَّارِ",
        "Urdu" : "اور اسی طرح پکی (اور ثابت) ہوگئی (آپ کی قوم کے ان) کافروں کے بارے میں آپ کے رب کی یہ بات کہ یقینی طور پر یہ بھی دوزخی ہیں",
        "English" : "And thus hath the Word of thy Lord been justified on those who disbelieve: that they shall be the fellows of the Fire."
      },
      {
        "ayet_no" : 7,
        "arbi" : "اَلَّذِيْنَ يَحْمِلُوْنَ الْعَرْشَ وَمَنْ حَوْلَهٗ يُسَبِّحُوْنَ بِحَمْدِ رَبِّهِمْ وَيُؤْمِنُوْنَ بِهٖ وَيَسْتَغْفِرُوْنَ لِلَّذِيْنَ اٰمَنُوْا ۚ رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَّحْمَةً وَّعِلْمًا فَاغْفِرْ لِلَّذِيْنَ تَابُوْا وَاتَّبَعُوْا سَبِيْلَكَ وَقِهِمْ عَذَابَ الْجَــحِيْمِ",
        "Urdu" : "جو فرشتے اٹھائے ہوئے ہیں عرش (خداوندی) کو اور جو اس کے اردگرد ہیں وہ سب کے سب تسبیح کرتے ہیں اپنے رب کی حمد و (ثناء) کے ساتھ اور وہ اس پر ایمان رکھتے ہیں اور وہ بخشش کی دعا مانگتے ہیں ایمان والوں کے لئے (اور کہتے ہیں کہ) اے ہمارے رب تیری رحمت بھی ہرچیز پر چھائی ہوئی ہے اور تیرا علم بھی ہرچیز پر حاوی ہے پس تو معاف فرما دے ان سب لوگوں کو جنہوں نے توبہ کی اور انہوں نے (صدق دل سے) پیروی کی تیرے راستے کی اور بچا دے تو ان کو دوزخ کے عذاب سے ف۱",
        "English" : "Those who are bearing the Throne and those who are around it pronounce the purity of your Lord along with His praise, and believe in Him, and pray for the forgiveness of those who believe, (saying): :Our Lord, Your mercy and knowledge comprehends everything; so forgive those who repent and follow Your way, and save them from the punishment of the Fire."
      },
      {
        "ayet_no" : 8,
        "arbi" : "رَبَّنَا وَاَدْخِلْهُمْ جَنّٰتِ عَدْنِۨ الَّتِيْ وَعَدْتَّهُمْ وَمَنْ صَلَحَ مِنْ اٰبَاۗىِٕـهِمْ وَاَزْوَاجِهِمْ وَذُرِّيّٰــتِهِمْ ۭ اِنَّكَ اَنْتَ الْعَزِيْزُ الْحَكِيْمُ",
        "Urdu" : "اے ہمارے رب اور تو داخل فرما دے ان کو ہمیشہ رہنے کی ان جنتوں میں جن کا تو نے ان سے وعدہ فرما رکھا ہے ان کو بھی اور ان کے ماں باپ کو بھی اور ان کی بیویوں اور ان کی اولادوں میں سے بھی ان سب کو جو اس کے لائق ہوں بلاشبہ تو ہی ہے (اے ہمارے مالک !) سب پر غالب نہایت ہی حکمت والا",
        "English" : "Our Lord! make them enter the Everlasting Gardens Which Thou hast promised them, and also such of their fathers and their spouses and their offspring as verify Thou: Thou art the Mighty, the Wise."
      },
      {
        "ayet_no" : 9,
        "arbi" : "وَقِهِمُ السَّيِّاٰتِ ۭ وَمَنْ تَقِ السَّيِّاٰتِ يَوْمَىِٕذٍ فَقَدْ رَحِمْتَهٗ ۭ وَذٰلِكَ هُوَ الْفَوْزُ الْعَظِيْمُ",
        "Urdu" : "اور بچا دے تو (اے ہمارے مالک !) ان کو ان کی برائیوں سے اور جس کو تو نے بچا لیا اس کی برائیوں سے اس دن تو یقینا اس پر تو نے بڑی ہی مہربانی فرما دی اور یہی ہے (اصل حقیقی اور سب سے) بڑی کامیابی",
        "English" : "And protect them from evils. And whosoever Thou shalt protect from evils on that Day, him Thou hast of a surety taken into mercy and that: it is an achievement mighty."
      },
      {
        "ayet_no" : 10,
        "arbi" : "اِنَّ الَّذِيْنَ كَفَرُوْا يُنَادَوْنَ لَمَقْتُ اللّٰهِ اَكْبَرُ مِنْ مَّقْتِكُمْ اَنْفُسَكُمْ اِذْ تُدْعَوْنَ اِلَى الْاِيْمَانِ فَتَكْفُرُوْنَ",
        "Urdu" : "بیشک جو لوگ (زندگی بھر) اڑے رہے ہوں گے اپنے کفر (و باطل) پر ان سے (قیامت کے روز) کہا جائے گا کہ جتنا غصہ تمہیں آج اپنے اوپر آرہا ہے اس سے کہیں بڑھ کر غصہ اللہ کو تم پر اس وقت آیا کرتا تھا جب کہ (دنیا میں) تمہیں ایمان کی طرف بلایا جاتا تھا مگر تم لوگ کفر ہی کیا کرتے تھے",
        "English" : "Verily those who disbelieve-they will be cried Unto: surely Allah's abhorrence was greater than Is your abhorrence toward yourselves when ye were called Unto the belief, and ye disbelieved."
      },
      {
        "ayet_no" : 11,
        "arbi" : "قَالُوْا رَبَّنَآ اَمَتَّنَا اثْنَتَيْنِ وَاَحْيَيْتَنَا اثْنَتَيْنِ فَاعْتَرَفْنَا بِذُنُوْبِنَا فَهَلْ اِلٰى خُرُوْجٍ مِّنْ سَبِيْلٍ",
        "Urdu" : "وہ کہیں گے اے ہمارے رب واقعی تو نے ہم کو دو مرتبہ موت بھی دے دی اور دو مرتبہ زندگی بھی بخش دی سو ہم نے اعتراف (و اقرار) کرلیا اپنے گناہوں کا تو کیا اب نکلنے کی کوئی صورت ہوسکتی ہے ؟",
        "English" : "They will say, :Our Lord, You gave us death twice and You gave us life twice. Now we confess our sins. So, is there any way to come out of here ?"
      },
      {
        "ayet_no" : 12,
        "arbi" : "ذٰلِكُمْ بِاَنَّهٗٓ اِذَا دُعِيَ اللّٰهُ وَحْدَهٗ كَفَرْتُمْ ۚ وَاِنْ يُّشْرَكْ بِهٖ تُؤْمِنُوْا ۭ فَالْحُكْمُ لِلّٰهِ الْعَلِيِّ الْكَبِيْرِ",
        "Urdu" : "(جواب ملے گا نہیں اور) یہ اس لئے کہ جب اکیلے اللہ کی طرف بلایا جاتا تھا تو تم لوگ انکار کر دیا کرتے تھے اور اگر اس کے ساتھ (دوسروں کو) شریک کرلیا جاتا تو تم مان لیتے تھے سو اب فیصلہ اللہ ہی کے ہاتھ میں ہے جو بڑی شان والا بڑے ہی بلند مرتبے والا ہے",
        "English" : "(The reply will be, :No.) This is because whenever Allah alone was invoked, you used to disbelieve, and if partners were associated with Him, you used to believe. Now the decision lies with Allah, the High, the Great."
      },
      {
        "ayet_no" : 13,
        "arbi" : "هُوَ الَّذِيْ يُرِيْكُمْ اٰيٰتِهٖ وَيُنَزِّلُ لَكُمْ مِّنَ السَّمَاۗءِ رِزْقًا ۭ وَمَا يَتَذَكَّرُ اِلَّا مَنْ يُّنِيْبُ",
        "Urdu" : "وہ وہی ہے جو دکھاتا ہے تمہیں اپنی نشانیاں اور وہ اتارتا ہے تمہارے لئے آسمان سے روزی اور سبق نہیں لیتا مگر وہی جو رجوع کرتا ہے (سچے دل سے)",
        "English" : "It is He who shows you His signs and sends down provision for you from the sky; and no one takes lesson but the one who turns to Him."
      },
      {
        "ayet_no" : 14,
        "arbi" : "فَادْعُوا اللّٰهَ مُخْلِصِيْنَ لَهُ الدِّيْنَ وَلَوْ كَرِهَ الْكٰفِرُوْنَ",
        "Urdu" : "پس تم لوگ اللہ ہی کو پکارو اسی کے لئے خالص کرتے ہوئے اپنے دین کو اگرچہ یہ برا لگے کافروں (اور منکروں) کو",
        "English" : "So, worship Allah, making your submission exclusive for Him, even though the disbelievers dislike (it)."
      },
      {
        "ayet_no" : 15,
        "arbi" : "رَفِيْعُ الدَّرَجٰتِ ذُو الْعَرْشِ ۚ يُلْقِي الرُّوْحَ مِنْ اَمْرِهٖ عَلٰي مَنْ يَّشَاۗءُ مِنْ عِبَادِهٖ لِيُنْذِرَ يَوْمَ التَّلَاقِ",
        "Urdu" : "وہ بلند درجوں والا عرش کا مالک اتارتا ہے روح (یعنیاپنی وحی) اپنے حکم سے اپنے بندوں میں سے جس پر چاہتا ہے تاکہ وہ خبردار کرے ملاقات کے (اس ہولناک) دن سے",
        "English" : "He is Lofty in degrees, Lord of the Throne. He caste the spirit of His command upon whomsoever He will of His bondmen, that he may warn people of the Day of Meeting."
      },
      {
        "ayet_no" : 16,
        "arbi" : "يَوْمَ هُمْ بٰرِزُوْنَ ڬ لَا يَخْـفٰى عَلَي اللّٰهِ مِنْهُمْ شَيْءٌ ۭ لِمَنِ الْمُلْكُ الْيَوْمَ ۭ لِلّٰهِ الْوَاحِدِ الْقَهَّارِ",
        "Urdu" : "جس دن وہ سب بالکل سامنے آموجود ہوں گے (اور اس طرح کہ) اللہ پر ان کی کوئی بات بھی چھپی نہ رہے گی (جب کہ پوچھا جائے گا کہ) کس کی بادشاہی ہے آج کے دن؟ (تو سارا عالم پکار اٹھے گا کہ) اکیلے اللہ ہی کی جو کہ سب پر غالب ہے",
        "English" : "The Day whereon they will appear: naught of them will be concealed from Allah, Whose is the dominion to-day? It is of Allah, the One, the Subduer."
      },
      {
        "ayet_no" : 17,
        "arbi" : "اَلْيَوْمَ تُجْزٰى كُلُّ نَفْسٍۢ بِمَا كَسَبَتْ ۭ لَا ظُلْمَ الْيَوْمَ ۭ اِنَّ اللّٰهَ سَرِيْعُ الْحِسَابِ",
        "Urdu" : "(پھر کہا جائے گا کہ) آج کے دن ہر شخص کو پورا بدلہ دیا جائے گا اس کی (زندگی بھر کی) کمائی کا آج کے دن کوئی ظلم نہ ہوگا بلاشبہ اللہ بہت جلد حساب لینے والا ہے",
        "English" : "Today, everyone will be recompensed for what one earned. There is no injustice today. Surely, Allah is swift in reckoning."
      },
      {
        "ayet_no" : 18,
        "arbi" : "وَاَنْذِرْهُمْ يَوْمَ الْاٰزِفَةِ اِذِ الْقُلُوْبُ لَدَى الْحَـنَاجِرِ كٰظِمِيْنَ ڛ مَا لِلظّٰلِمِيْنَ مِنْ حَمِيْمٍ وَّلَا شَفِيْعٍ يُّــطَاعُ",
        "Urdu" : "اور خبردار کر دو ان کو اس قریب آلگنے والی (ہولناک آفت) سے جب کہ (مارے خوف کے) کلیجے منہ کو آرہے ہوں گے اور لوگ غم میں گھٹے کھڑے ہوں گے (اس روز) ظالموں کے لئے نہ تو کوئی ہمدرد دوست ہوگا اور نہ ہی کوئی ایسا سفارشی جس کی بات مانی جائے",
        "English" : "And warn them of the Day of approaching horror, when hearts will jump up into the throats, (and they will be) choked. There will be neither a friend for the unjust, nor an intercessor to be listened to."
      },
      {
        "ayet_no" : 19,
        "arbi" : "يَعْلَمُ خَاۗىِٕنَةَ الْاَعْيُنِ وَمَا تُخْفِي الصُّدُوْرُ",
        "Urdu" : "اللہ خوب جانتا ہے انکھوں کی (چوری اور) خیانت کو بھی اور دلوں میں چھپے رازوں کو بھی",
        "English" : "He knows the treachery of the eyes and whatever is concealed by hearts."
      },
      {
        "ayet_no" : 20,
        "arbi" : "وَاللّٰهُ يَـقْضِيْ بِالْحَقِّ ۭ وَالَّذِيْنَ يَدْعُوْنَ مِنْ دُوْنِهٖ لَا يَـقْضُوْنَ بِشَيْءٍ ۭ اِنَّ اللّٰهَ هُوَ السَّمِيْعُ الْبَصِيْرُ",
        "Urdu" : "اور اللہ ہی فیصلہ فرماتا ہے حق (اور انصاف) کے ساتھ اور اس کے سوا جن کو یہ لوگ پکارتے ہیں وہ کسی بھی چیز کا فیصلہ نہیں کر سکتے بلاشبہ اللہ ہی ہے ہر کسی کی سنتا (سب کچھ) دیکھتا",
        "English" : "He will give His judgment with truth. And those whom they invoke beside Him cannot judge anything. Surely, it is Allah who is Hearing, Seeing."
      },
      {
        "ayet_no" : 21,
        "arbi" : "اَوَلَمْ يَسِيْرُوْا فِي الْاَرْضِ فَيَنْظُرُوْا كَيْفَ كَانَ عَاقِبَةُ الَّذِيْنَ كَانُوْا مِنْ قَبْلِهِمْ ۭ كَانُوْا هُمْ اَشَدَّ مِنْهُمْ قُوَّةً وَّاٰثَارًا فِي الْاَرْضِ فَاَخَذَهُمُ اللّٰهُ بِذُنُوْبِهِمْ ۭ وَمَا كَانَ لَهُمْ مِّنَ اللّٰهِ مِنْ وَّاقٍ",
        "Urdu" : "کیا یہ لوگ چلے پھرے نہیں (عبرتوں بھری) اس زمین میں؟ تاکہ یہ خود دیکھ لیتے کہ کیسا ہوا انجام ان لوگوں کا جو گزر چکے ہیں ان سے پہلے وہ ان سے کہیں زیادہ سخت تھے قوت کے اعتبار سے بھی اور زمین میں اپنے آثار (و نشانات) کے لحاظ سے بھی مگر آخرکار اللہ نے پکڑا ان سب کو ان کے گناہوں کی پاداش میں اور کوئی نہیں تھا ان کے لئے اللہ سے بچانے والا ف۱",
        "English" : "Have they not traveled through the earth and seen how was the fate of those who used to be before them? They were stronger than these in power and in traces left on the earth, but Allah seized them because of their sins. There was no one to save them from Allah."
      },
      {
        "ayet_no" : 22,
        "arbi" : "ذٰلِكَ بِاَنَّهُمْ كَانَتْ تَّاْتِيْهِمْ رُسُلُهُمْ بِالْبَيِّنٰتِ فَكَفَرُوْا فَاَخَذَهُمُ اللّٰهُ ۭ اِنَّهٗ قَوِيٌّ شَدِيْدُ الْعِقَابِ",
        "Urdu" : "یہ اس لئے کہ ان کے پاس ان کے رسول آتے تھے کھلے دلائل کے ساتھ مگر وہ (بدبخت) لوگ انکار ہی کرتے گئے سو آخرکار اللہ نے پکڑا ان سب کو (ان کے کفر و انکار کی پاداش میں) بیشک وہ بڑا ہی قوت والا سخت عذاب دینے والا ہے ف۲",
        "English" : "That was because messengers used to come to them with clear signs, but they disbelieved. Then, Allah seized them. Surely, He is Strong, severe in punishment."
      },
      {
        "ayet_no" : 23,
        "arbi" : "وَلَـقَدْ اَرْسَلْنَا مُوْسٰى بِاٰيٰتِنَا وَسُلْطٰنٍ مُّبِيْنٍ",
        "Urdu" : "اور بلاشبہ ہم ہی نے بھیجا موسیٰ کواپنی نشانیوں اور ایک کھلی سند کے ساتھ",
        "English" : "And assuredly We sent Musa with Our signs and a manifest authority."
      },
      {
        "ayet_no" : 24,
        "arbi" : "اِلٰى فِرْعَوْنَ وَهَامٰنَ وَقَارُوْنَ فَقَالُوْا سٰحِرٌ كَذَّابٌ",
        "Urdu" : "فرعون ہامان اور قارون کی طرف مگر انہوں نے کہا کہ یہ تو ایک جادوگر ہے بڑا جھوٹا",
        "English" : "To Pharaoh and Haman and Qarun, but they said, :He is a sorcerer, a liar."
      },
      {
        "ayet_no" : 25,
        "arbi" : "فَلَمَّا جَاۗءَهُمْ بِالْحَقِّ مِنْ عِنْدِنَا قَالُوا اقْتُلُوْٓا اَبْنَاۗءَ الَّذِيْنَ اٰمَنُوْا مَعَهٗ وَاسْتَحْيُوْا نِسَاۗءَهُمْ ۭ وَمَا كَيْدُ الْكٰفِرِيْنَ اِلَّا فِيْ ضَلٰلٍ",
        "Urdu" : "پھر جب وہ پہنچ گئے ان کے پاس حق کے ساتھ ہماری طرف سے تو ان لوگوں نے کہا قتل کر دو ان لوگوں کے بیٹوں کو جو ایمان لائے ہیں اس کے ساتھ اور زندہ رکھو ان کی عورتوں کو اور کافروں کی چال (ہلاکت و) بربادی کے سوا کچھ نہیں ف۳",
        "English" : "And when he brought them the truth from Us, they said, :Kill the sons of those who have accepted faith with him, and spare the lives of their women. But the plot of the disbelievers is nothing but a failure."
      },
      {
        "ayet_no" : 26,
        "arbi" : "وَقَالَ فِرْعَوْنُ ذَرُوْنِيْٓ اَقْتُلْ مُوْسٰى وَلْيَدْعُ رَبَّهٗ ۚ اِنِّىْٓ اَخَافُ اَنْ يُّبَدِّلَ دِيْنَكُمْ اَوْ اَنْ يُّظْهِرَ فِي الْاَرْضِ الْفَسَادَ",
        "Urdu" : "اور فرعون نے کہا کہ چھوڑو مجھے میں قتل کرتا ہوں موسیٰ کو, اور یہ بلا دیکھے اپنے رب کو, مجھے سخت اندیشہ ہے اس بات کا کہ یہ شخص بدل دے گا تمہارے دین کو, یا یہ فساد برپا کر دے گا اس سرزمین میں",
        "English" : "And Pharaoh said, :Let me kill Musa, and let him call his Lord. I am afraid that he will change your religion or he will cause havoc to appear in the land."
      },
      {
        "ayet_no" : 27,
        "arbi" : "وَقَالَ مُوْسٰٓى اِنِّىْ عُذْتُ بِرَبِّيْ وَرَبِّكُمْ مِّنْ كُلِّ مُتَكَبِّرٍ لَّا يُؤْمِنُ بِيَوْمِ الْحِسَابِ",
        "Urdu" : "اور (اس کے جواب میں) موسیٰ نے کہا میں پناہ مانگتا ہوں اس کی جو رب ہے میرا بھی اور تمہارا بھی ہر ایسے متکبر (کے شر) سے جو ایمان نہیں رکھتا حساب کے دن پر ف۱",
        "English" : "And Musa said, :I have sought protection of my Lord and your Lord from every arrogant man who does not believe in the Day of Reckoning."
      },
      {
        "ayet_no" : 28,
        "arbi" : "وَقَالَ رَجُلٌ مُّؤْمِنٌ ڰ مِّنْ اٰلِ فِرْعَوْنَ يَكْتُمُ اِيْمَانَهٗٓ اَتَقْتُلُوْنَ رَجُلًا اَنْ يَّقُوْلَ رَبِّيَ اللّٰهُ وَقَدْ جَاۗءَكُمْ بِالْبَيِّنٰتِ مِنْ رَّبِّكُمْ ۭ وَاِنْ يَّكُ كَاذِبًا فَعَلَيْهِ كَذِبُهٗ ۚ وَاِنْ يَّكُ صَادِقًا يُّصِبْكُمْ بَعْضُ الَّذِيْ يَعِدُكُمْ ۭ اِنَّ اللّٰهَ لَا يَهْدِيْ مَنْ هُوَ مُسْرِفٌ كَذَّابٌ",
        "Urdu" : "اور (تائید غیبی کے طور پر اسی موقع پر) بول اٹھا آل فرعون ہی کا ایک ایسا مرد مومن جو چھپائے ہوئے تھا اپنے ایمان (و یقین کی دولت) کو کیا تم لوگ محض اس بناء پر ایک شریف آدمی کے قتل کے درپے ہو کہ وہ کہتا ہے کہ میرا رب اللہ ہے؟ جب کہ وہ کھلے دلائل (اور براہین) لے کر آیا ہے تمہارے رب کی طرف سے اور اگر (بفرض محال) وہ جھوٹا بھی ہو تو اس کا جھوٹ اسی پر پڑے گا اور اگر وہ سچا ہے (جیسا کہ وہ واقع میں ہے) تو پھر تمہیں اس انجام میں سے کچھ نہ کچھ پہنچ کر رہے گا جس سے وہ تمہیں ڈرا رہا ہے بیشک اللہ ہدایت (کی دولت) سے نہیں نوازتا کسی بھی ایسے شخص کو جو حد سے بڑھنے والا بڑا جھوٹا ہو ف۲",
        "English" : "And said a believing man from the House of Pharaoh who had kept his faith secret, :Would you kill a man because he says – 'Allah is my Lord‘ – while he has come to you with clear signs from your Lord? If he is a liar, his lie will fall back on himself, and if he is truthful, some of that (punishment) of which he warns you will afflict you. Indeed, Allah does not give guidance to anyone who is transgressor, a liar."
      },
      {
        "ayet_no" : 29,
        "arbi" : "يٰقَوْمِ لَكُمُ الْمُلْكُ الْيَوْمَ ظٰهِرِيْنَ فِي الْاَرْضِ ۡ فَمَنْ يَّنْصُرُنَا مِنْۢ بَاْسِ اللّٰهِ اِنْ جَاۗءَنَا ۭ قَالَ فِرْعَوْنُ مَآ اُرِيْكُمْ اِلَّا مَآ اَرٰى وَمَآ اَهْدِيْكُمْ اِلَّا سَبِيْلَ الرَّشَادِ",
        "Urdu" : "اے میری قوم کے لوگو! (ٹھیک ہے) آج تو بادشاہی بھی تمہاری ہے اور اس ملک میں غالب بھی تم ہی ہو لیکن (مجھے تو یہ بتاؤ کہ کل) اگر اللہ کا عذاب ہم پر آگیا تو کون ہے جو اس کے مقابلے میں ہماری مدد کر سکے؟ (بیچ میں اس رجل مومن کی بات کاٹتے ہوئے) فرعون بولا کہ میں تو بہرحال تم لوگوں کو وہی رائے دے رہا ہوں جس کو میں مناسب سمجھتا ہو اور میں تمہیں بھلائی کا راستہ ہی بتاتا ہوں",
        "English" : "O my people, the kingdom is yours today, while you are dominant on the land. But, who is going to help us against Allah‘s punishment, if it comes upon us? Pharaoh said, :I do not give you an opinion unless I myself believe it to be correct, and I do not direct you to anything but to the right way."
      },
      {
        "ayet_no" : 30,
        "arbi" : "وَقَالَ الَّذِيْٓ اٰمَنَ يٰقَوْمِ اِنِّىْٓ اَخَافُ عَلَيْكُمْ مِّثْلَ يَوْمِ الْاَحْزَابِ",
        "Urdu" : "مگر اس شخص نے جو ایمان سے سرشار ہو چکا تھا (اپنی تقریر جاری رکھتے ہوئے) کہا کہ اے میری قوم کے لوگو! مجھے تو تمہارے بارے میں شدت سے اندیشہ ہو رہا ہے پہلی قوموں کے جیسے دن کا",
        "English" : "And he who believed said: O my people. verily I fear for you a fate like the day of the confederates."
      },
      {
        "ayet_no" : 31,
        "arbi" : "مِثْلَ دَاْبِ قَوْمِ نُوْحٍ وَّعَادٍ وَّثَمُوْدَ وَالَّذِيْنَ مِنْۢ بَعْدِهِمْ ۭ وَمَا اللّٰهُ يُرِيْدُ ظُلْمًا لِّلْعِبَادِ",
        "Urdu" : "جیسا کہ قوم نوح عاد ثمود اور ان لوگوں کا حال ہوا ہے جو ان سے بعد گزرے ہیں اور اللہ تو اپنے بندوں پر کسی طرح کا کوئی ظلم نہیں کرنا چاہتا ف۳",
        "English" : "Like the wont of the people of Nuh and A'ad and Thamud and those after them, and God intend not any wrong Unto His bondmen."
      },
      {
        "ayet_no" : 32,
        "arbi" : "وَيٰقَوْمِ اِنِّىْٓ اَخَافُ عَلَيْكُمْ يَوْمَ التَّنَادِ",
        "Urdu" : "اور میری قوم مجھے سخت اندیشہ ہے تمہارے بارے میں چیخ و پکار کے اس دن (کے ہولناک عذاب) کا",
        "English" : "And, O my people! verily fear for you a Day of Mutual Calling."
      },
      {
        "ayet_no" : 33,
        "arbi" : "يَوْمَ تُوَلُّوْنَ مُدْبِرِيْنَ ۚ مَا لَكُمْ مِّنَ اللّٰهِ مِنْ عَاصِمٍ ۚ وَمَنْ يُّضْلِلِ اللّٰهُ فَمَا لَهٗ مِنْ هَادٍ",
        "Urdu" : "جس دن تم پیٹھ دے کر بھاگے جا رہے ہو گے مگر تمہارے لئے کوئی بچانے والا نہیں ہوگا اللہ (کی گرفت و پکڑ) سے اور جس کو اللہ ڈال دے گمراہی (کے گڑھے) میں (اس کے سوء اختیار اور خبث باطن کی بناء پر) تو اس کو کوئی بھی ہدایت نہیں دے سکتا",
        "English" : "A day when you will turn back on your heels, having no one to save you from Allah – but, whomever Allah lets go astray, for him there is no one to guide."
      },
      {
        "ayet_no" : 34,
        "arbi" : "وَلَقَدْ جَاۗءَكُمْ يُوْسُفُ مِنْ قَبْلُ بِالْبَيِّنٰتِ فَمَا زِلْتُمْ فِيْ شَكٍّ مِّمَّا جَاۗءَكُمْ بِهٖ ۭ حَتّىٰٓ اِذَا هَلَكَ قُلْتُمْ لَنْ يَّبْعَثَ اللّٰهُ مِنْۢ بَعْدِهٖ رَسُوْلًا ۭ كَذٰلِكَ يُضِلُّ اللّٰهُ مَنْ هُوَ مُسْرِفٌ مُّرْتَابُۨ",
        "Urdu" : "اور یقینا تمہارے پاس اس سے پہلے یوسف بھی آچکے ہیں کھلے دلائل (و براہین) کے ساتھ مگر تم لوگ اس پیغام کے بارے میں بھی شک ہی میں پڑے رہے جس کے ساتھ وہ تشریف لائے تھے یہاں تک کہ جب وہ فوت ہوگئے تو تم نے کہا (بس جی) اب تو ان کے بعد اللہ کبھی کوئی رسول بھیجے گا ہی نہیں اسی طرح اللہ گمراہی (کے گڑھے) میں ڈال دیتا ہے ہر اس شخص کو جو حد سے بڑھنے والا شک (و ریب کی دلدل) میں پڑا ہوتا ہے ف۱",
        "English" : "And assuredly there came Unto you Yusuf a fore time with evidences, yet ye ceased not to be in doubt concerning that which he brought Unto you, until when he died, ye said: God shall by no means raise an apostle after him. Thus Allah keep astray one who is extravagant and a doubter."
      },
      {
        "ayet_no" : 35,
        "arbi" : "الَّذِيْنَ يُجَادِلُوْنَ فِيْٓ اٰيٰتِ اللّٰهِ بِغَيْرِ سُلْطٰنٍ اَتٰىهُمْ ۭ كَبُرَ مَقْتًا عِنْدَ اللّٰهِ وَعِنْدَ الَّذِيْنَ اٰمَنُوْا ۭ كَذٰلِكَ يَطْبَعُ اللّٰهُ عَلٰي كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ",
        "Urdu" : "جو کہ جھگڑتے (اور بحثیں کرتے) ہیں اللہ کی آیتوں کے بارے میں بغیر کسی ایسی سند کے جوان کے پاس آئی ہو بڑے ہی غصے اور نفرت کی بات ہے یہ اللہ کے یہاں بھی اور ان لوگوں کے یہاں بھی جو ایمان رکھتے ہیں اللہ اسی طرح (محرومی اور بدبختی کا) ٹھپہ لگا دیتا ہے ہر متکبر اور جبار کے پورے دل پر",
        "English" : "Those who quarrel in Allah‘s verses without any authority having reached them. It is terribly hateful with Allah and with those who believe. That is how Allah stamps a seal on the entire heart of an arrogant tyrant."
      },
      {
        "ayet_no" : 36,
        "arbi" : "وَقَالَ فِرْعَوْنُ يٰهَامٰنُ ابْنِ لِيْ صَرْحًا لَّعَلِّيْٓ اَبْلُغُ الْاَسْبَابَ",
        "Urdu" : "اور فرعون نے (اس لاجواب تقریر سے کھسیانہ ہونے کے بعد) کہا اے ہامان بنوادو میرے لئے ایک بلند و بالا عمارت تاکہ (اس کے ذریعے) میں پہنچ سکوں ان راستوں تک",
        "English" : "And Fir'awn said: O Haman! build for me a tower that haply I may reach the ways of access"
      },
      {
        "ayet_no" : 37,
        "arbi" : "اَسْبَابَ السَّمٰوٰتِ فَاَطَّلِعَ اِلٰٓى اِلٰهِ مُوْسٰى وَاِنِّىْ لَاَظُنُّهٗ كَاذِبًا ۭ وَكَذٰلِكَ زُيِّنَ لِفِرْعَوْنَ سُوْۗءُ عَمَلِهٖ وَصُدَّ عَنِ السَّبِيْلِ ۭ وَمَا كَيْدُ فِرْعَوْنَ اِلَّا فِيْ تَبَابٍ",
        "Urdu" : "یعنی آسمانوں کے راستوں تک تاکہ وہاں سے میں جھانک کر دیکھ سکوں موسیٰ کے خدا کو میں تو اسے قطعی طور پر جھوٹا ہی سمجھتا ہوں اور اس طرح خوشنما بنا دیا گیا فرعون کے لئے اس کے برے عملوں کو اور روک دیا گیا اس کو راہ (حق و صواب) سے اور فرعون کی ساری چالبازی کچھ نہ تھی سوائے اس کی (اپنی ہلاکت و) تباہی کے",
        "English" : "The ways to the heavens, and peek towards the God of Musa. And indeed I deem him a liar. That is how his evil deeds were made attractive to Fir'awn, and (how) he was held back from the way. The evil design of Fir'awn was (to end) in nothing but ruin."
      },
      {
        "ayet_no" : 38,
        "arbi" : "وَقَالَ الَّذِيْٓ اٰمَنَ يٰقَوْمِ اتَّبِعُوْنِ اَهْدِكُمْ سَبِيْلَ الرَّشَادِ",
        "Urdu" : "اور اس شخص نے جو کہ ایمان لا چکا تھا مزید کہا کہ اے میری قوم کے لوگو! تم میری پیروی کرو میں تم کو صحیح راستہ بتاتا ہوں",
        "English" : "And said he who had believed, :O my people, follow me, I will show you the path of guidance."
      },
      {
        "ayet_no" : 39,
        "arbi" : "يٰقَوْمِ اِنَّمَا هٰذِهِ الْحَيٰوةُ الدُّنْيَا مَتَاعٌ ۡ وَّاِنَّ الْاٰخِرَةَ هِىَ دَارُ الْقَرَارِ",
        "Urdu" : "اے میری قوم یہ دنیا تو محض (چند روزہ) فائدے کا سامان ہے اور بلاشبہ آخرت ہی ہمیشہ ٹھہرنے کی جگہ ہے ف۱",
        "English" : "O my people, this life of the world is only a (momentary) benefit, while the Hereafter is, indeed, the place of permanent living."
      },
      {
        "ayet_no" : 40,
        "arbi" : "مَنْ عَمِلَ سَيِّئَةً فَلَا يُجْزٰٓى اِلَّا مِثْلَهَا ۚ وَمَنْ عَمِلَ صَالِحًا مِّنْ ذَكَرٍ اَوْ اُنْثٰى وَهُوَ مُؤْمِنٌ فَاُولٰۗىِٕكَ يَدْخُلُوْنَ الْجَنَّةَ يُرْزَقُوْنَ فِيْهَا بِغَيْرِ حِسَابٍ",
        "Urdu" : "جس نے کوئی برائی کی تو اس کو اسی کے برابر سزا ملے گی اور جس نے کوئی نیک کام کیا خواہ وہ کوئی مرد ہو یا عورت بشرطیکہ وہ ایمان (و یقین کی دولت) سے سرشار ہو تو ایسے لوگ داخل ہوں گے (سدا بہار اور ابدی نعمتوں والی) اس جنت میں جہاں ان کو رزق دیا جائے گا بغیر کسی حساب (و گمان) کے",
        "English" : "The one who does something evil will not be punished but in its equal proportion, but the one who does a righteous deed, be he male or female, while he is a believer, then, such people will enter the Jannah (Paradise) where they will be provided with bounties beyond reckoning."
      },
      {
        "ayet_no" : 41,
        "arbi" : "وَيٰقَوْمِ مَالِيْٓ اَدْعُوْكُمْ اِلَى النَّجٰوةِ وَتَدْعُوْنَنِيْٓ اِلَى النَّارِ",
        "Urdu" : "اور اے میری قوم یہ کیا ماجرا ہے کہ میں تم کو بلا رہا ہوں نجات (کے راستے) کی طرف اور تم مجھے بلا رہے ہو (دوزخ کی ہولناک) آگ کی طرف ؟",
        "English" : "And O my people, what is wrong with me that I call you to salvation and you call me to the Fire ?"
      },
      {
        "ayet_no" : 42,
        "arbi" : "تَدْعُوْنَنِيْ لِاَكْفُرَ بِاللّٰهِ وَاُشْرِكَ بِهٖ مَا لَيْسَ لِيْ بِهٖ عِلْمٌ ۡ وَّاَنَا اَدْعُوْكُمْ اِلَى الْعَزِيْزِ الْغَفَّارِ",
        "Urdu" : "تم لوگ مجھے اس بات کی طرف بلا رہے ہو کہ میں کفر کروں اللہ کے ساتھ اور اس کے ساتھ شریک ٹھہراؤں ایسی چیزوں کو جن (کی شرکت) کے بارے میں میرے پاس کوئی علم نہیں درانحالیکہ میں تم کو بلا رہا ہوں اس (معبود برحق) کی طرف جو سب پر غالب انتہائی بخشنے والا ہے ف۲",
        "English" : "You invite me to reject my belief in Allah and ascribe to Him partners about whom I have no knowledge, while I invite you to (Him who is) the Mighty, the Most-Forgiving."
      },
      {
        "ayet_no" : 43,
        "arbi" : "لَا جَرَمَ اَنَّمَا تَدْعُوْنَنِيْٓ اِلَيْهِ لَيْسَ لَهٗ دَعْوَةٌ فِي الدُّنْيَا وَلَا فِي الْاٰخِرَةِ وَاَنَّ مَرَدَّنَآ اِلَى اللّٰهِ وَاَنَّ الْمُسْرِفِيْنَ هُمْ اَصْحٰبُ النَّارِ",
        "Urdu" : "یقینی بات ہے کہ جن کی طرف تم لوگ مجھے بلا رہے ہو ان کے لئے نہ تو اس دنیا میں کوئی دعوت ہے نہ آخرت میں اور اس میں بھی کوئی شک نہیں کہ ہم سب کو بہرحال اللہ ہی کی طرف لوٹ کر جانا ہے اور یہ بھی حقیقت ہے کہ جو لوگ حد سے بڑھنے والے ہیں وہ سب دوزخی ہیں ف۳",
        "English" : "It is obvious that those (gods) to whom you are inviting me are not worth calling, neither in this world nor in the world to come, and that we have to return back to Allah, and that the transgressors are indeed the people of the Fire."
      },
      {
        "ayet_no" : 44,
        "arbi" : "فَسَتَذْكُرُوْنَ مَآ اَقُوْلُ لَكُمْ ۭ وَاُفَوِّضُ اَمْرِيْٓ اِلَى اللّٰهِ ۭ اِنَّ اللّٰهَ بَصِيْرٌۢ بِالْعِبَادِ",
        "Urdu" : "پھر عنقریب وہ وقت بھی آئے گا جب کہ تمہیں (رہ رہ کر) وہ سب کچھ یاد آئے گا جو میں (آج) تم سے کہہ رہا ہوں اور میں اپنا معاملہ اللہ کے سپرد کرتا ہوں بلاشبہ وہ پوری طرح دیکھتا ہے اپنے بندوں (کے احوال) کو",
        "English" : "Soon you will remember what I am saying to you. And I entrust my matter with Allah. Surely, Allah has all (His) servants in sight."
      },
      {
        "ayet_no" : 45,
        "arbi" : "فَوَقٰىهُ اللّٰهُ سَيِّاٰتِ مَا مَكَرُوْا وَحَاقَ بِاٰلِ فِرْعَوْنَ سُوْۗءُ الْعَذَابِ",
        "Urdu" : "آخرکار اللہ نے اس کو بچا لیا ان تمام بری چالوں سے جو ان لوگوں نے اس کے خلاف چلی تھیں اور گھیر لیا فرعون والوں کو اس برے عذاب نے (جو ان کا مقدر بن چکا تھا)",
        "English" : "Then Allah saved him from the evils of what they designed, and the House of Pharaoh was encircled by an evil punishment."
      },
      {
        "ayet_no" : 46,
        "arbi" : "اَلنَّارُ يُعْرَضُوْنَ عَلَيْهَا غُدُوًّا وَّعَشِـيًّا ۚ وَيَوْمَ تَـقُوْمُ السَّاعَةُ ۣ اَدْخِلُوْٓا اٰلَ فِرْعَوْنَ اَشَدَّ الْعَذَابِ",
        "Urdu" : "یعنی (دوزخ کی) اس ہولناک آگ نے جس پر (زمانہ برزخ میں) ان کو پیش کیا جاتا رہے گا صبح و شام اور جس روز قیامت قائم ہوگی (اس روز حکم ہوگا کہ) داخل کر دو فرعون والوں کو سخت ترین عذاب میں ف۱",
        "English" : "It is the Fire before which they are presented morning and evening. And on the day when the Hour (of final judgment) will take place, (the order will be released,): :Admit the family of Pharaoh into the most severe punishment."
      },
      {
        "ayet_no" : 47,
        "arbi" : "وَاِذْ يَتَـحَاۗجُّوْنَ فِي النَّارِ فَيَقُوْلُ الضُّعَفٰۗؤُا لِلَّذِيْنَ اسْتَكْبَرُوْٓا اِنَّا كُنَّا لَكُمْ تَبَعًا فَهَلْ اَنْتُمْ مُّغْنُوْنَ عَنَّا نَصِيْبًا مِّنَ النَّارِ",
        "Urdu" : "اور (ان کو ذرا وہ بھی بتا اور سنا دو کہ) جب یہ لوگ دوزخ میں آ پس میں جھگڑ رہے ہوں گے چنانچہ کمزور لوگ ان لوگوں سے کہیں گے جو دنیا میں بڑے بنے ہوئے تھے کہ ہم تو تمہارے تابع تھے تو کیا اب تم لوگ ہم سے اس (دہکتی بڑھکتی) آگ کا کوئی حصہ ہٹا سکو گے ؟",
        "English" : "And (worth remembering is the time) when they (the infidels) will argue with each other in the Fire. So, the weak will say to those who were arrogant, :Surely, we used to be your followers, would you, then, stand for us in (suffering at least a) part of the (punishment of) Fire ?"
      },
      {
        "ayet_no" : 48,
        "arbi" : "قَالَ الَّذِيْنَ اسْتَكْبَرُوْٓا اِنَّا كُلٌّ فِيْهَآ ۙ اِنَّ اللّٰهَ قَدْ حَكَمَ بَيْنَ الْعِبَادِ",
        "Urdu" : "اس پر وہ لوگ جو (دنیا میں) بڑے بنے ہوئے تھے کہیں گے (کہ تمہارے کام کیا آتے) ہم تو خود سب کے سب اسی میں پڑے ہوئے ہیں بیشک اللہ نے قطعی (اور آخری) فیصلہ صادر فرما دیا اپنے بندوں کے درمیان",
        "English" : "Those who were stiff-necked will say: verily we are all in it; verily Allah hath judged between His bondmen."
      },
      {
        "ayet_no" : 49,
        "arbi" : "وَقَالَ الَّذِيْنَ فِي النَّارِ لِخَزَنَةِ جَهَنَّمَ ادْعُوْا رَبَّكُمْ يُخَفِّفْ عَنَّا يَوْمًا مِّنَ الْعَذَابِ",
        "Urdu" : "اور دوزخی جہنم کے اہل کاروں سے کہیں گے کہ تم دعاء (و درخواست) کرو اپنے رب کے حضور کہ ایک دن ہلکا کر دے وہ ہم سے ہمارے عذاب کو",
        "English" : "And those in the Fire will say to the keepers of Jahannam (Hell), :Pray to your Lord to lighten the punishment for us some day."
      },
      {
        "ayet_no" : 50,
        "arbi" : "قَالُوْٓا اَوَ لَمْ تَكُ تَاْتِيْكُمْ رُسُلُكُمْ بِالْبَيِّنٰتِ ۭ قَالُوْا بَلٰى ۭ قَالُوْا فَادْعُوْا ۚ وَمَا دُعٰۗـؤُا الْكٰفِرِيْنَ اِلَّا فِيْ ضَلٰلٍ",
        "Urdu" : "وہ (اس کے جواب میں ان سے) کہیں گے کہ کیا تمہارے پاس رسول نہیں آیا کرتے تھے کھلے دلائل کے ساتھ؟ وہ کہیں گے ہاں اس پر دوزخ کے وہ اہلکار ان سے کہیں گے کہ پھر تم خود ہی دعاء (و درخواست) کر لو مگر (یاد رہے کہ) کافروں کی (درخواست و) پکار بےسود محض ہے ف۲",
        "English" : "They will say, :Had your messengers not been coming to you with open signs? They will say, :Of course, (they had come). They (the keepers) will say, :Then, keep praying – but praying of disbelievers (in the Hereafter) is only in vain."
      },
      {
        "ayet_no" : 51,
        "arbi" : "اِنَّا لَنَنْصُرُ رُسُلَنَا وَالَّذِيْنَ اٰمَنُوْا فِي الْحَيٰوةِ الدُّنْيَا وَيَوْمَ يَقُوْمُ الْاَشْهَادُ",
        "Urdu" : "بلاشبہ ہم ضرور مدد کرتے ہیں اپنے رسولوں کی اور ان تمام لوگوں کی جو (سچے دل سے ان پر) ایمان لے آئے اس دنیا کی زندگی میں بھی اور اس دن بھی جب کہ گواہ کھڑے ہوں گے",
        "English" : "Verily We! We shall surely succour Our apostles and those who believe, both in the life of the world and on a Day whereon the witnesses will stand forth."
      },
      {
        "ayet_no" : 52,
        "arbi" : "يَوْمَ لَا يَنْفَعُ الظّٰلِمِيْنَ مَعْذِرَتُهُمْ وَلَهُمُ اللَّعْنَةُ وَلَهُمْ سُوْۗءُ الدَّارِ",
        "Urdu" : "جس دن کہ ظالموں کو کچھ کام نہ آسکے گی ان کی معذرت ان کے لئے لعنت ہوگی اور ان کے لئے بڑا ہی برا گھر ہوگا",
        "English" : "A day when apology of the unjust will bring them no benefit, and on them shall be the curse, and for them will be the evil abode."
      },
      {
        "ayet_no" : 53,
        "arbi" : "وَلَقَدْ اٰتَيْنَا مُوْسَى الْهُدٰى وَاَوْرَثْنَا بَنِيْٓ اِسْرَاۗءِيْلَ الْكِتٰبَ",
        "Urdu" : "اور بلاشبہ ہم نے موسیٰ کو بھی وہ ہدایت نامہ عطا فرمایا تھا اور ہم نے وارث بنا دیا تھا بنی اسرائیل کو اس کتاب کا",
        "English" : "And assuredly We vouchsafed Unto Musa the guidance, and We caused the Children of Isra'il to inherit the Book."
      },
      {
        "ayet_no" : 54,
        "arbi" : "هُدًى وَّذِكْرٰى لِاُولِي الْاَلْبَابِ",
        "Urdu" : "جو کہ سراسر ہدایت اور ایک عظیم الشان نصیحت (و یاد دہانی) تھی عقل سلیم رکھنے والوں کے لئے",
        "English" : "A guide and a reminder for men of understanding."
      },
      {
        "ayet_no" : 55,
        "arbi" : "فَاصْبِرْ اِنَّ وَعْدَ اللّٰهِ حَقٌّ وَّاسْتَـغْفِرْ لِذَنْۢبِكَ وَسَبِّحْ بِحَمْدِ رَبِّكَ بِالْعَشِيِّ وَالْاِبْكَارِ",
        "Urdu" : "پس آپ صبر سے ہی کام لیتے رہیں یقینا اللہ کا وعدہ سچا ہے اور معافی مانگو اپنے گناہ کی اور تسبیح کرتے رہو اپنے رب کی حمد کے ساتھ صبح و شام",
        "English" : "So, be patient — surely the promise of Allah is true - and seek forgiveness for your sins, and proclaim the purity and praise of your Lord in the afternoon and at dawn."
      },
      {
        "ayet_no" : 56,
        "arbi" : "اِنَّ الَّذِيْنَ يُجَادِلُوْنَ فِيْٓ اٰيٰتِ اللّٰهِ بِغَيْرِ سُلْطٰنٍ اَتٰىهُمْ ۙ اِنْ فِيْ صُدُوْرِهِمْ اِلَّا كِبْرٌ مَّا هُمْ بِبَالِغِيْهِ ۚ فَاسْتَعِذْ بِاللّٰهِ ۭ اِنَّهٗ هُوَ السَّمِيْعُ الْبَصِيْرُ",
        "Urdu" : "بے شک جو لوگ جھگڑتے ہیں اللہ کی آیتوں کے بارے میں بغیر ایسی کسی سند کے جو ان کے پاس آئی ہو ان کے دلوں میں ایسی بڑائی (کا گھمنڈ) ہے جس کو وہ کبھی پہنچ نہیں سکتے سو (ایسوں کے مقابلے میں) پناہ مانگو تم اللہ کی بیشک وہی ہے سنتا (ہر کسی کی) دیکھتا (سب کچھ)",
        "English" : "Surely, those who quarrel in Allah‘s verses without any authority having reached them, there is nothing in their hearts but pride of greatness that they are not (able) to reach. So, seek refuge with Allah. Surely, He is the All-Hearing, the All-Seeing."
      },
      {
        "ayet_no" : 57,
        "arbi" : "لَخَــلْقُ السَّمٰوٰتِ وَالْاَرْضِ اَكْبَرُ مِنْ خَلْقِ النَّاسِ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ",
        "Urdu" : "بلاشبہ آسمانوں اور زمین کا پیدا کرنا انسانوں کے پیدا کرنے کے مقابلہ میں کہیں بڑا کام ہے لیکن اکثر لوگ جانتے نہیں",
        "English" : "Certainly, the creation of the heavens and the earth is greater than the creation of human beings, but most human beings do not know."
      },
      {
        "ayet_no" : 58,
        "arbi" : "وَمَا يَسْتَوِي الْاَعْمٰى وَالْبَصِيْرُ ڏ وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ وَلَا الْمُسِيْۗءُ ۭ قَلِيْلًا مَّا تَتَذَكَّرُوْنَ",
        "Urdu" : "اور برابر نہیں ہو سکتے اندھا اور دیکھنے والا اور نہ ہی وہ لوگ جو ایمان لا کر نیک کام کرتے رہے ہوں اور بدکار آ پس میں برابر ہو سکتے ہیں تم لوگ کم ہی سبق لیتے (اور عبرت پکڑتے) ہو",
        "English" : "And the blind and the seeing cannot be equal. So (in the same way) those who believe and do righteous works and the evildoers too cannot be (alike). You accept direction and guidance but little."
      },
      {
        "ayet_no" : 59,
        "arbi" : "اِنَّ السَّاعَةَ لَاٰتِيَةٌ لَّا رَيْبَ فِيْهَا وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يُؤْمِنُوْنَ",
        "Urdu" : "بیشک (قیامت کی) اس (ہولناک) گھڑی نے بہرحال (اپنے وقت پر) آکر رہنا ہے اس میں کوئی شک نہیں لیکن اکثر لوگ ایمان نہیں رکھتے",
        "English" : "Certainly, the Hour is bound to come. There is no doubt in it, but most of the people do not believe."
      },
      {
        "ayet_no" : 60,
        "arbi" : "وَقَالَ رَبُّكُمُ ادْعُوْنِيْٓ اَسْتَجِبْ لَكُمْ ۭ اِنَّ الَّذِيْنَ يَسْتَكْبِرُوْنَ عَنْ عِبَادَتِيْ سَيَدْخُلُوْنَ جَهَنَّمَ دٰخِرِيْنَ",
        "Urdu" : "اور فرمایا تمہارے رب نے کہ تم لوگ مجھ ہی کو پکارو میں تمہاری پکار کو سنوں گا بیشک جو لوگاپنی بڑائی کے گھمنڈ میں میری عبادت سے منہ موڑتے ہیں ان کو عنقریب ہی داخل ہونا ہوگا جہنم میں ذلیل و خوار ہو کر ف۱",
        "English" : "Your Lord has said, :Call Me, I will respond to you. Definitely those who show arrogance against worshipping Me shall enter Jahannam (Hell) with disgrace."
      },
      {
        "ayet_no" : 61,
        "arbi" : "اَللّٰهُ الَّذِيْ جَعَلَ لَكُمُ الَّيْلَ لِتَسْكُنُوْا فِيْهِ وَالنَّهَارَ مُبْصِرًا ۭ اِنَّ اللّٰهَ لَذُوْ فَضْلٍ عَلَي النَّاسِ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يَشْكُرُوْنَ",
        "Urdu" : "اللہ وہ ہے جس نے بنایا تمہارے لیے رات کو ایسا کہ تم اس میں (آرام و) سکون پا سکو اور دن کو بنایا روشن (تاکہ اس میں تم لوگاپنی روزی روٹی کا کام کر سکو) بیشک اللہ بڑا ہی فضل فرمانے والا ہے لوگوں پر لیکن اکثر لوگ شکر نہیں ادا کرتے (اس مہربان مطلق کا) ف۱",
        "English" : "Allah is the One who made for you the night, so that you may have rest in it, and the day to let you see. Surely, Allah is most kind to people, but most of the people do not offer gratitude."
      },
      {
        "ayet_no" : 62,
        "arbi" : "ذٰلِكُمُ اللّٰهُ رَبُّكُمْ خَالِقُ كُلِّ شَيْءٍ ۘ لَآ اِلٰهَ اِلَّا هُوَ ۵ فَاَنّٰى تُؤْفَكُوْنَ",
        "Urdu" : "یہ ہے اللہ رب تم سب کا پیدا کرنے والا ہرچیز کا کوئی بھی عبادت کے لائق نہیں سوائے اس کے پھر تم لوگ کہاں اوندھے کئے جاتے ہو؟ (اور تمہاری مت کہاں ماری جاتی ہے ؟)",
        "English" : "This is Allah, your Lord, the Creator of everything. There is no god but He. Then, from where are you being reversed (by your selfish desires) ?"
      },
      {
        "ayet_no" : 63,
        "arbi" : "كَذٰلِكَ يُؤْفَكُ الَّذِيْنَ كَانُوْا بِاٰيٰتِ اللّٰهِ يَجْحَدُوْنَ",
        "Urdu" : "اسی طرح اوندھے کئے جاتے رہے وہ لوگ جو اللہ کی آیتوں کا انکار کرتے تھے",
        "English" : "Similarly reversed were those who used to deny Our verses."
      },
      {
        "ayet_no" : 64,
        "arbi" : "اَللّٰهُ الَّذِيْ جَعَلَ لَكُمُ الْاَرْضَ قَرَارًا وَّالسَّمَاۗءَ بِنَاۗءً وَّصَوَّرَكُمْ فَاَحْسَنَ صُوَرَكُمْ وَرَزَقَكُمْ مِّنَ الطَّيِّبٰتِ ۭ ذٰلِكُمُ اللّٰهُ رَبُّكُمْ ښ فَتَبٰرَكَ اللّٰهُ رَبُّ الْعٰلَمِيْنَ",
        "Urdu" : "اللہ وہی ہے جس نے تمہارے لئے زمین (کے اس عظیم الشان کرے) کو آرام گاہ بنا دیا اور آسمان کو ایک عظیم الشان چھت اور اسی نے صورت گری فرمائی تم سب کی سو اس نے کیا ہی عمدہ صورتیں بخشیں تمہیں اور اسی نے طرح طرح کی پاکیزہ چیزوں سے تمہاری روزی کا سامان کیا یہ ہے اللہ رب تم سب کا سو بڑی ہی برکت والا ہے اللہ پروردگار سب جہانوں کا",
        "English" : "Allah is the One who made for you the earth a place to live, and the sky a roof, and shaped you, and made your shapes so good – and provided you with a lot of good things. That is Allah, your Lord. So, Glorious is Allah, the Lord of the worlds."
      },
      {
        "ayet_no" : 65,
        "arbi" : "هُوَ الْـحَيُّ لَآ اِلٰهَ اِلَّا هُوَ فَادْعُوْهُ مُخْلِصِيْنَ لَهُ الدِّيْنَ ۭاَلْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ",
        "Urdu" : "وہی (اور صرف وہی) ہے زندہ کوئی معبود نہیں سوائے اس کے پس تم سب اسی کو پکارو اسی کے لئے خالص کرتے ہوئے اپنے دین (و اعتقاد) کو سب تعریفیں اللہ ہی کے لئے ہیں جو پالنے والا ہے سب جہانوں کا",
        "English" : "He is Ever-living. There is no god but He. So worship Him making your submission exclusive for Him. All praise belongs to Allah, the Lord of all the worlds."
      },
      {
        "ayet_no" : 66,
        "arbi" : "قُلْ اِنِّىْ نُهِيْتُ اَنْ اَعْبُدَ الَّذِيْنَ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ لَمَّا جَاۗءَنِيَ الْبَيِّنٰتُ مِنْ رَّبِّيْ ۡ وَاُمِرْتُ اَنْ اُسْلِمَ لِرَبِّ الْعٰلَمِيْنَ",
        "Urdu" : "(ان سے صاف) کہہ دو کہ مجھے تو بہرحال اس سے منع کیا گیا ہے کہ میں عبادت (و بندگی) کروں ان ہستیوں کی جن کو تم لوگ (پوجتے) پکارتے ہو اللہ کے سوا جب کہ پہنچ چکے میرے پاس روشن دلائل میرے رب کی جانب سے اور مجھے یہ حکم دیا گیا ہے کہ میں سر تسلیم خم کردوں پروردگار عالم کے آگے",
        "English" : "Say, :I have been ordered not to worship those whom you invoke beside Allah when clear signs from my Lord have (already) come to me, and I have been ordered that I should submit to the Lord of the worlds."
      },
      {
        "ayet_no" : 67,
        "arbi" : "هُوَ الَّذِيْ خَلَقَكُمْ مِّنْ تُرَابٍ ثُمَّ مِنْ نُّــطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ ثُمَّ يُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوْٓا اَشُدَّكُمْ ثُمَّ لِتَكُوْنُوْا شُيُوْخًا ۚ وَمِنْكُمْ مَّنْ يُّتَوَفّٰى مِنْ قَبْلُ وَلِتَبْلُغُوْٓا اَجَلًا مُّسَمًّى وَّلَعَلَّكُمْ تَعْقِلُوْنَ",
        "Urdu" : "وہ (اللہ) وہی تو ہے جس نے پیدا فرمایا تم سب کو مٹی سے پھر نطفے سے پھر خون کے لوتھڑے سے پھر وہی تمہیں نکالتا ہے (تمہاری ماؤں کے پیٹوں سے) ایک کامل بچے کی شکل میں پھر (وہ تمہیں بڑھاتا پالتا جاتا ہے) تاکہ تم لوگ پہنچ جاؤاپنی (جوانی کی) بھرپور قوتوں کو (پھر وہ تم کو اور موقع دیتا ہے کہ) تاکہ تم پہنچ جاؤ اپنے بڑھاپے کی عمر کو اور تم میں سے کوئی اس سے پہلے مر جاتا ہے (یہ سب کچھ اس لئے کہ) تاکہ تم پہنچ جاؤ مقررہ مدت کو اور تاکہ تم لوگ کام لواپنی عقل (و فکر) سے",
        "English" : "He is the One who created you from dust, then from a drop of semen, then from a clot. After that, He takes you out as an infant. Then, (He makes you grow) so that you reach your full maturity, and, thereafter, become old – and some of you die earlier – and so that you reach the appointed term, and so that you understand."
      },
      {
        "ayet_no" : 68,
        "arbi" : "هُوَ الَّذِيْ يُـحْيٖ وَيُمِيْتُ ۚ فَاِذَا قَضٰٓى اَمْرًا فَاِنَّمَا يَـقُوْلُ لَهٗ كُنْ فَيَكُوْنُ",
        "Urdu" : "وہی زندگی بخشتا ہے اور وہی موت دیتا ہے پھر جب وہ کسی کام کا فیصلہ کر لیتا ہے تو اس کو صرف اتنا کہنا ہوتا ہے کہ ہو جا پس وہ ہو چکا ہوتا ہے ف۱",
        "English" : "He is the One who gives life and brings death, and when He decides to do something, He only says to it: :Be and it comes to be."
      },
      {
        "ayet_no" : 69,
        "arbi" : "اَلَمْ تَرَ اِلَى الَّذِيْنَ يُجَادِلُوْنَ فِيْٓ اٰيٰتِ اللّٰهِ ۭاَنّٰى يُصْرَفُوْنَ",
        "Urdu" : "کیا تم نے ان لوگوں کو نہیں دیکھا جو جھگڑا کرتے ہیں اللہ کی آیتوں کے بارے میں کہاں (اور کیسے) پھیرے جاتے ہیں یہ لوگ (حق اور حقیقت سے) ؟",
        "English" : "Have you not seen those who quarrel in Allah‘s verses? From where are they being turned away (by their selfish desires?)"
      },
      {
        "ayet_no" : 70,
        "arbi" : "الَّذِيْنَ كَذَّبُوْا بِالْكِتٰبِ وَبِمَآ اَرْسَلْنَا بِهٖ رُسُلَنَا ڕ فَسَوْفَ يَعْلَمُوْنَ",
        "Urdu" : "جن لوگوں نے جھٹلایا ہماری اس کتاب کو اور ان تعلیمات کو جن کے ساتھ ہم نے بھیجا اپنے رسولوں کو وہ عنقریب خود ہی جان لیں گے (اپنے کئے کرائے کے نتیجہ و انجام کو)",
        "English" : "Those who believe the Book and that message wherewith We sent Our apostles, presently they shall come to know."
      },
      {
        "ayet_no" : 71,
        "arbi" : "اِذِ الْاَغْلٰلُ فِيْٓ اَعْنَاقِهِمْ وَالسَّلٰسِلُ ۭ يُسْحَبُوْنَ",
        "Urdu" : "جب کہ طوق پڑے ہوں گے ان کی گردنوں میں اور زنجیریں (ان کے پاؤں میں اور) انہیں گھسیٹا جا رہا ہوگا",
        "English" : "When shackles will be on their necks and also chains; they will be dragged."
      },
      {
        "ayet_no" : 72,
        "arbi" : "فِي الْحَمِيْمِ ڏ ثُمَّ فِي النَّارِ يُسْجَرُوْنَ",
        "Urdu" : "کھولتے پانی میں پھر ان کو جھونک دیا جائے گا (دوزخ کی دہکتی بڑھتی) اس آگ میں",
        "English" : "Into the balling water; then into the Fire they will be stocked."
      },
      {
        "ayet_no" : 73,
        "arbi" : "ثُمَّ قِيْلَ لَهُمْ اَيْنَ مَا كُنْتُمْ تُشْرِكُوْنَ",
        "Urdu" : "پھر ان سے کہا جائے گا کہ کہاں ہیں وہ جن کو تم لوگ شریک ٹھہرایا کرتے تھے",
        "English" : "Then it will be said to them: (Where are (all) those whom you used to join in worship as partners)."
      },
      {
        "ayet_no" : 74,
        "arbi" : "مِنْ دُوْنِ اللّٰهِ ۭ قَالُوْا ضَلُّوْا عَنَّا بَلْ لَّمْ نَكُنْ نَّدْعُوْا مِنْ قَبْلُ شَـيْـــــًٔا ۭ كَذٰلِكَ يُضِلُّ اللّٰهُ الْكٰفِرِيْنَ",
        "Urdu" : "اللہ کے سوا؟ ف۲ وہ کہیں گے کہ وہ سب کھو گئے ہم سے بلکہ ہم تو اس سے پہلے کسی چیز کو (سرے سے) پکارتے ہی نہیں تھے اسی طرح اللہ گمراہی (کے گڑھے) میں ڈالتا ہے کافروں کو ف۳",
        "English" : "Beside Allah ? They will say: they have failed us: aye! we have not been calling upon aught a fore. Thus doth Allah lead the infidels astray."
      },
      {
        "ayet_no" : 75,
        "arbi" : "ذٰلِكُمْ بِمَا كُنْتُمْ تَفْرَحُوْنَ فِي الْاَرْضِ بِغَيْرِ الْحَقِّ وَبِمَا كُنْتُمْ تَمْرَحُوْنَ",
        "Urdu" : "(ان سے کہا جائے گا کہ) یہ بدلہ ہے اس کا جو تم اترایا کرتے تھے زمین میں ناحق طور پر اور اس کا جو تم اکڑا کرتے تھے (وہاں)",
        "English" : "That is because ye had been exulting in the earth without right, and because ye had been strutting."
      },
      {
        "ayet_no" : 76,
        "arbi" : "اُدْخُلُوْٓا اَبْوَابَ جَهَنَّمَ خٰلِدِيْنَ فِيْهَا ۚ فَبِئْسَ مَثْوَى الْمُتَكَبِّرِيْنَ",
        "Urdu" : "اب داخل ہو جاؤ تم سب جہنم کے دروازوں میں جہاں تم کو ہمیشہ رہنا ہے سو بڑا ہی برا ٹھکانا ہے تکبر کرنے والوں کا ف۱",
        "English" : "Enter the gates of Jahannam to live in it forever. So, how evil is the abode of the arrogant."
      },
      {
        "ayet_no" : 77,
        "arbi" : "فَاصْبِرْ اِنَّ وَعْدَ اللّٰهِ حَقٌّ ۚ فَاِمَّا نُرِيَنَّكَ بَعْضَ الَّذِيْ نَعِدُهُمْ اَوْ نَتَـوَفَّيَنَّكَ فَاِلَيْنَا يُرْجَعُوْنَ",
        "Urdu" : "پس آپ صبر ہی سے کام لیتے رہیں یقینا اللہ کا وعدہ سچا ہے پھر اگر ہم دکھا دیں آپ کو (اے پیغمبر !) کچھ حصہ اس عذاب کا جس سے ہم ان لوگوں کو ڈرا رہے ہیں یا آپ کو اس سے پہلے ہی دنیا سے اٹھا لیں تو (اس سے کیا فرق پڑتا ہے کہ) ان سب نے تو بہرحال ہماری ہی طرف لوٹ کر انا ہے",
        "English" : "So be patient (O Muhammad ), verily, the Promise ofAllah is true, and whether We show you (O Muhammad in this world) some part of what We have promised them, or We cause you to die, then it is to Us they all shall be returned."
      },
      {
        "ayet_no" : 78,
        "arbi" : "وَلَقَدْ اَرْسَلْنَا رُسُلًا مِّنْ قَبْلِكَ مِنْهُمْ مَّنْ قَصَصْنَا عَلَيْكَ وَمِنْهُمْ مَّنْ لَّمْ نَقْصُصْ عَلَيْكَ ۭ وَمَا كَانَ لِرَسُوْلٍ اَنْ يَّاْتِيَ بِاٰيَةٍ اِلَّا بِاِذْنِ اللّٰهِ ۚ فَاِذَا جَاۗءَ اَمْرُ اللّٰهِ قُضِيَ بِالْحَقِّ وَخَسِرَ هُنَالِكَ الْمُبْطِلُوْنَ",
        "Urdu" : "اور بلاشبہ ہم آپ سے پہلے بھی بہت سے رسول بھیج چکے ہیں ان میں سے کچھ کے حالات تو ہم نے آپ کو بتا دئیے ہیں اور کچھ کے نہیں بتائے اور کسی رسول کے بس میں نہیں تھا کہ وہ کوئی معجزہ پیش کر سکے مگر اللہ کے اذن کے ساتھ پھر جب آپہنچا اللہ کا حکم تو فیصلہ کر دیا گیا حق (اور انصاف) کے ساتھ اور سخت خسارے میں پڑ گئے اس موقع پر باطل پرست",
        "English" : "We had sent messengers before you. Among them there are those whose history We have narrated to you, and of them there are those whose history We did not narrate to you. And it is not up to a messenger that he could come up with a sign without permission from Allah. So, when the command of Allah will come, matters will stand decided justly, and on that occasion all adherents of falsehood will turn into losers."
      },
      {
        "ayet_no" : 79,
        "arbi" : "اَللّٰهُ الَّذِيْ جَعَلَ لَكُمُ الْاَنْعَامَ لِتَرْكَبُوْا مِنْهَا وَمِنْهَا تَاْكُلُوْنَ",
        "Urdu" : "اللہ وہی ہے جس نے بنائے تمہارے (بھلے اور فائدے کے) لئے چوپائے تاکہ تم لوگ ان میں سے کسی پر سواری کرو اور انہی میں سے تم کھاتے (اور روزی بھی حاصل کرتے) رہو",
        "English" : "Allah, it is He Who has made cattle for you, that you may ride on some of them and of some you eat."
      },
      {
        "ayet_no" : 80,
        "arbi" : "وَلَكُمْ فِيْهَا مَنَافِعُ وَلِتَبْلُغُوْا عَلَيْهَا حَاجَةً فِيْ صُدُوْرِكُمْ وَعَلَيْهَا وَعَلَي الْفُلْكِ تُحْمَلُوْنَ",
        "Urdu" : "اور تمہارے لئے ان میں اور بھی طرح طرح کے (فوائد و) منافع ہیں اور (یہ اس لئے پیدا کئے کہ) تاکہ ان پر سوار ہو کر تم لوگاپنی کسی بھی ایسی حاجت کو پہنچ سکو جو تمہارے دلوں میں ہو اور ان پر اور کشتیوں اور جہازوں پر بھی تم لوگ سوار کئے جاتے ہو اور (اس کے علاوہ بھی)",
        "English" : "And you have (many other) benefits from them, and that you may reach by their means a desire that is in your breasts (i.e. carry your goods, loads, etc.), and on them and on ships you are carried."
      },
      {
        "ayet_no" : 81,
        "arbi" : "وَيُرِيْكُمْ اٰيٰتِهٖ ڰ فَاَيَّ اٰيٰتِ اللّٰهِ تُنْكِرُوْنَ",
        "Urdu" : "وہ تم کو دکھاتا ہےاپنی طرح طرح کی نشانیاں پھر تم لوگ اللہ کی کون کون سی نشانیوں کا انکار کرو گے ؟ ف۲",
        "English" : "And He shew you His signs. Which, then, of the signs of Allah shall ya deny?"
      },
      {
        "ayet_no" : 82,
        "arbi" : "اَفَلَمْ يَسِيْرُوْا فِي الْاَرْضِ فَيَنْظُرُوْا كَيْفَ كَانَ عَاقِبَةُ الَّذِيْنَ مِنْ قَبْلِهِمْ ۭكَانُوْٓا اَكْثَرَ مِنْهُمْ وَاَشَدَّ قُوَّةً وَّاٰثَارًا فِي الْاَرْضِ فَمَآ اَغْنٰى عَنْهُمْ مَّا كَانُوْا يَكْسِبُوْنَ",
        "Urdu" : "تو کیا یہ لوگ چلے پھرے نہیں (عبرتوں بھری) اس زمین میں تاکہ یہ خود دیکھ لیتے کہ کیسا ہوا انجام ان لوگوں کا جو ان سے پہلے تھے وہ (گنتی اور) تعداد کے لحاظ سے بھی ان سے کہیں زیادہ تھے اور قوت (و طاقت) کے اعتبار سے بھی وہ ان سے کہیں زیادہ سخت تھے اور زمین میں چھوڑے جانے والے آثار (اور نشانات) کے اعتبار سے بھی وہ ان سے کہیں بڑھ کر تھے پھر (وقت پڑنے پر) ان کے کچھ کام نہ آسکی ان کی وہ کمائی جو وہ کرتے رہے تھے",
        "English" : "Have they not traveled through the earth and seen how was the fate of those before them? Most of them were more in numbers than these, and superior in vigor and vestiges left on the earth. So then, whatever they used to earn did not work for them at all."
      },
      {
        "ayet_no" : 83,
        "arbi" : "فَلَمَّا جَاۗءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنٰتِ فَرِحُوْا بِمَا عِنْدَهُمْ مِّنَ الْعِلْمِ وَحَاقَ بِهِمْ مَّا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ",
        "Urdu" : "چنانچہ جب ان کے پاس ان کے رسول (حق و صداقت کے) کھلے دلائل لے کر آئے تو یہ (اس سے لاپرواہ ہو کر مست و) مگن رہے اپنے اس علم (و فن) کی بناء پر جو کہ ان کے پاس تھا اور (آخرکار) ان کو گھیر لیا اسی چیز نے جس کا یہ مذاق اڑاتے رہے تھے ف۱",
        "English" : "When their messengers came to them with manifest signs, they exulted because of whatever knowledge they had, and they were encircled by what they used to ridicule."
      },
      {
        "ayet_no" : 84,
        "arbi" : "فَلَمَّا رَاَوْا بَاْسَنَا قَالُوْٓا اٰمَنَّا بِاللّٰهِ وَحْدَهٗ وَكَفَرْنَا بِمَا كُنَّا بِهٖ مُشْرِكِيْنَ",
        "Urdu" : "پھر جب انہوں نے دیکھا ہمارے عذاب کو تو وہ (چیخ چیخ کر) کہنے لگے کہ ہم ایمان لے آئے اکیلے اللہ پر اور انکار کر دیا ہم نے ان سب چیزوں کا جن کو ہم (اس سے پہلے) اس کا شریک ٹھہراتے رہے تھے",
        "English" : "When they saw Our punishment, they said, :We have (now) come to believe in Allah alone, and We have rejected everything we used to ascribe (to Him) as partners."
      },
      {
        "ayet_no" : 85,
        "arbi" : "فَلَمْ يَكُ يَنْفَعُهُمْ اِيْمَانُهُمْ لَمَّا رَاَوْا بَاْسَـنَا ۭ سُنَّتَ اللّٰهِ الَّتِيْ قَدْ خَلَتْ فِيْ عِبَادِهٖ ۚ وَخَسِرَ هُنَالِكَ الْكٰفِرُوْنَ",
        "Urdu" : "مگر (اس وقت کا) ان کا یہ ایمان ایسا نہیں تھا کہ ان کو کچھ نفع دے سکے (اور فائدہ پہنچا سکے) جب کہ انہوں نے دیکھ لیا تھا ہمارے عذاب کو اللہ کے اس دستور کے مطابق جو کہ پہلے سے چلا آیا ہے اس کے بندوں میں اور اس موقع پر (دائمی) خسارے میں پڑے گئے ایسے کافر (و منکر) لوگ ف۲",
        "English" : "But, their profession of faith was not (competent) to benefit them, once they had seen Our punishment – a customary practice of Allah that has been there all along in the matter of His servants – and hence, the disbelievers became the losers."
      }

    ]
  }
]