[
  {
    "surah_no" : 69,
    "total_ayah" : 52,
    "name" : "Surah e AL-Haq'ah",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "اَلْحَاۗقَّةُ",
        "Urdu" : "وہ ہو کر رہنے والی ف۲",
        "English" : "The Sure Reality!"
      },
      {
        "ayet_no" : 2,
        "arbi" : "مَا الْحَاۗقَّةُ",
        "Urdu" : "کیا ہے وہ ہو کر رہنے والی",
        "English" : "What is the Sure Reality ?"
      },
      {
        "ayet_no" : 3,
        "arbi" : "وَمَآ اَدْرٰىكَ مَا الْحَاۗقَّةُ",
        "Urdu" : "اور تم کیا جانو کہ کیا ہے وہ ہو کر رہنے والی",
        "English" : "And what can let you know what the Imminent happening is?"
      },
      {
        "ayet_no" : 4,
        "arbi" : "كَذَّبَتْ ثَمُوْدُ وَعَادٌۢ بِالْقَارِعَةِ",
        "Urdu" : "جھٹلایا ثمود اور عاد نے دہلا دینے والے اس حادثہ کبریٰ کو",
        "English" : "The tribes of Thamud and 'Aad belied the Striking Day."
      },
      {
        "ayet_no" : 5,
        "arbi" : "فَاَمَّا ثَمُوْدُ فَاُهْلِكُوْا بِالطَّاغِيَةِ",
        "Urdu" : "پھر ثمود کو تو ہلاک کر دیا گیا حد سے بڑھ جانے والی اس ہولناک آفت سے",
        "English" : "As for Thamud, they were destroyed by that (dreadful cry) , which exceeded all limits."
      },
      {
        "ayet_no" : 6,
        "arbi" : "وَاَمَّا عَادٌ فَاُهْلِكُوْا بِرِيْحٍ صَرْصَرٍ عَاتِيَةٍ",
        "Urdu" : "اور جو عاد تھے تو ان کو ہلاک کیا گیا ایک ایسی تند و تیز اور سرکش (و بےقابو) ہوا سے",
        "English" : "And as for 'Aad they were destroyed by a wind, furious. roaring."
      },
      {
        "ayet_no" : 7,
        "arbi" : "سَخَّرَهَا عَلَيْهِمْ سَبْعَ لَيَالٍ وَّثَمٰنِيَةَ اَيَّامٍ ۙ حُسُوْمًا ۙ فَتَرَى الْقَوْمَ فِيْهَا صَرْعٰى ۙ كَاَنَّهُمْ اَعْجَازُ نَخْلٍ خَاوِيَةٍ",
        "Urdu" : "جس کو اللہ نے مسلط رکھا ان پر سات راتیں اور آٹھ دن لگاتار جس کے نتیجے میں اس قوم (کا حال یہ ہوگیا تھا کہ اگر تم وہاں ہوتے تو ان لوگوں) کو تم اس طرح گرا ہوا دیکھتے کہ گویا کہ وہ کھوکھلے (اور بوسیدہ) تنے ہیں گری ہوئی کھجوروں کے",
        "English" : "Allah made that (gale) seize them for consecutive seven nights and eight days. So, you could see them lying dead (during that time as if) they were hollow roots of the uprooted palm trees."
      },
      {
        "ayet_no" : 8,
        "arbi" : "فَهَلْ تَرٰى لَهُمْ مِّنْۢ بَاقِيَةٍ",
        "Urdu" : "تو کیا (اب) تمہیں ان سے میں سے کوئی بھی بچا ہوا نظر آتا ہے ؟",
        "English" : "Now, do you see any remnant of them ?"
      },
      {
        "ayet_no" : 9,
        "arbi" : "وَجَاۗءَ فِرْعَوْنُ وَمَنْ قَبْلَهٗ وَالْمُؤْتَفِكٰتُ بِالْخَاطِئَةِ",
        "Urdu" : "اور فرعون اور اس سے پہلے کے لوگوں نے اور ان الٹی ہوئی بستیوں (کے باشندوں) نے بھی ارتکاب کیا اسی بڑی (اور ہولناک) خطا کا",
        "English" : "And Fir'awn and those before him and the overturned cities committed sin."
      },
      {
        "ayet_no" : 10,
        "arbi" : "فَعَصَوْا رَسُوْلَ رَبِّهِمْ فَاَخَذَهُمْ اَخْذَةً رَّابِيَةً",
        "Urdu" : "ان سب نے نافرمانی کی اپنے رب کے رسول کی سو اس نے پکڑا ان سب کو ایک بڑی ہی سخت (اور ہولناک) پکڑ میں",
        "English" : "And they disobeyed their Lord's apostle, so He laid hold of them with a grip increasing."
      },
      {
        "ayet_no" : 11,
        "arbi" : "اِنَّا لَمَّا طَغَا الْمَاۗءُ حَمَلْنٰكُمْ فِي الْجَارِيَةِ",
        "Urdu" : "بلاشبہ ہم ہی نے سوار کیا تھا تم کو (اپنی رحمت و عنایت سے نوح کی) اس کشتی میں جبکہ (طوفان کا) پانی کراس کر گیا تھا سب حدوں کو",
        "English" : "Verily We! when the water rose, We bare you upon the traversing ark."
      },
      {
        "ayet_no" : 12,
        "arbi" : "لِنَجْعَلَهَا لَكُمْ تَذْكِرَةً وَّتَعِيَهَآ اُذُنٌ وَّاعِيَةٌ",
        "Urdu" : "تاکہ ہم اس (واقعہ) کو تمہارے لئے (عبرت پذیری کی) ایک عظیم الشان یادگار بنا دیں اور تاکہ یاد رکھیں اس کو یاد رکھنے والے کان",
        "English" : "That We might make it a remembrance for you, and the keen ear (person) may (hear and) understand it."
      },
      {
        "ayet_no" : 13,
        "arbi" : "فَاِذَا نُفِخَ فِي الصُّوْرِ نَفْخَةٌ وَّاحِدَةٌ",
        "Urdu" : "پھر جب (اپنے مقرر وقت پر) پھونک مار دی جائے گی صور میں ایک ہی بار",
        "English" : "And when the Trumpet shall sound a single blast."
      },
      {
        "ayet_no" : 14,
        "arbi" : "وَّحُمِلَتِ الْاَرْضُ وَالْجِبَالُ فَدُكَّتَا دَكَّةً وَّاحِدَةً",
        "Urdu" : "اور زمین اور پہاڑوں کو اٹھا کر کوٹ دیا جائے گا سو یہ سب ریزہ ریزہ ہو جائیں گے ایک ہی چوٹ سے ف۱",
        "English" : "And the earth and the mountains shall be borne and the twain shall be crushed with a single crash."
      },
      {
        "ayet_no" : 15,
        "arbi" : "فَيَوْمَىِٕذٍ وَّقَعَتِ الْوَاقِعَةُ",
        "Urdu" : "تو اس دن ہو کر رہے گی وہ ہو پڑنے والی",
        "English" : "Then on that Day shall happen the Event."
      },
      {
        "ayet_no" : 16,
        "arbi" : "وَانْشَقَّتِ السَّمَاۗءُ فَھِيَ يَوْمَىِٕذٍ وَّاهِيَةٌ",
        "Urdu" : "اور پھٹ پڑے گا آسمان سو وہ اس روز (اپنی بندشیں ڈھیلی پڑ جانے سے) بالکل بودا ہو جائے گا",
        "English" : "And the heaven shall be rent in sunder, it on that Day shall be frail."
      },
      {
        "ayet_no" : 17,
        "arbi" : "وَّالْمَلَكُ عَلٰٓي اَرْجَاۗىِٕهَا ۭ وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَىِٕذٍ ثَمٰنِيَةٌ",
        "Urdu" : "فرشتے اس کے کناروں پر ہوں گے اور اٹھائے ہوں گے تمہارے رب کے عرش کو اپنے اوپر اس روز آٹھ فرشتے ف۲",
        "English" : "And the angels will be on its borders. And on that Day, the Throne of your Lord will be carried above them by eight (angels)."
      },
      {
        "ayet_no" : 18,
        "arbi" : "يَوْمَىِٕذٍ تُعْرَضُوْنَ لَا تَخْفٰى مِنْكُمْ خَافِيَةٌ",
        "Urdu" : "اس روز تمہیں پیش کیا جائے گا (اپنے رب کے حضور) اس حال میں کہ چھپی نہ رہے گی تمہاری کوئی بات (اس سے) ف۳",
        "English" : "On that day, you will be brought forward in a way that no secret of yours will remain secret."
      },
      {
        "ayet_no" : 19,
        "arbi" : "فَاَمَّا مَنْ اُوْتِيَ كِتٰبَهٗ بِيَمِيْنِهٖ ۙ فَيَقُوْلُ هَاۗؤُمُ اقْرَءُوْا كِتٰبِيَهْ",
        "Urdu" : "پھر جس (خوش نصیب) کو دیا گیا ہوگا اس کا نامہ اعمال اس کے داہنے ہاتھ میں تو وہ (مارے خوشی کے دوسروں سے) کہہ رہا ہوگا کہ لو جی ذرا میرا نامہ اعمال پڑھئے گا",
        "English" : "So the one who will be given his record in the right hand will say (pleased) : ‘Come and read my record."
      },
      {
        "ayet_no" : 20,
        "arbi" : "اِنِّىْ ظَنَنْتُ اَنِّىْ مُلٰقٍ حِسَابِيَهْ",
        "Urdu" : "مجھے تو یہ یقین تھا کہ مجھے بہرحال سابقہ پڑنا ہے اپنے حساب سے",
        "English" : "Verily I was sure that I should be a meeter of my reckoning."
      },
      {
        "ayet_no" : 21,
        "arbi" : "فَهُوَ فِيْ عِيْشَةٍ رَّاضِيَةٍ",
        "Urdu" : "پس وہ تو ایک بڑی ہی (عمدہ و پاکیزہ اور) پسندیدہ گزران میں ہوگا",
        "English" : "So he shall be in a life, well-pleasing."
      },
      {
        "ayet_no" : 22,
        "arbi" : "فِيْ جَنَّةٍ عَالِيَةٍ",
        "Urdu" : "یعنی ایک ایسی عالی شان جنت میں",
        "English" : "In a Garden lofty."
      },
      {
        "ayet_no" : 23,
        "arbi" : "قُطُوْفُهَا دَانِيَةٌ",
        "Urdu" : "جس کے خوشے جھکے پڑ رہے ہوں گے",
        "English" : "Clusters whereof shall be near at hand."
      },
      {
        "ayet_no" : 24,
        "arbi" : "كُلُوْا وَاشْرَبُوْا هَنِيْۗئًۢا بِمَآ اَسْلَفْتُمْ فِي الْاَيَّامِ الْخَالِيَةِ",
        "Urdu" : "(کہا جائے گا کہ) مزے سے کھاؤ اور پیو تم لوگ اپنے ان اعمال کے بدلے میں جو تم لوگوں نے گزرے ہوئے دنوں میں (دنیا میں) کئے تھے",
        "English" : "Eat and drink with benefit for that which ye sent on beforehand in days past."
      },
      {
        "ayet_no" : 25,
        "arbi" : "وَاَمَّا مَنْ اُوْتِيَ كِتٰبَهٗ بِشِمَالِهٖ ڏ فَيَقُوْلُ يٰلَيْتَنِيْ لَمْ اُوْتَ كِتٰبِيَهْ",
        "Urdu" : "اور (اس کے برعکس) جس کو اس کا نامہ اعمال اسکے بائیں ہاتھ میں دیا گیا ہوگا تو وہ (مارے حسرت و افسوس کے) کہے گا کہ اے کاش مجھے نہ دیا گیا ہوتا میرا نامہ اعمال",
        "English" : "Then as to him who shall be vouchsafed his book in his left hand, he shall say: Oh! would that I had not been vouchsafed my book."
      },
      {
        "ayet_no" : 26,
        "arbi" : "وَلَمْ اَدْرِ مَا حِسَابِيَهْ",
        "Urdu" : "اور مجھے اس کی خبر ہی نہ ہوتی کہ میرا حساب کیا ہے",
        "English" : "And that I had never known, how my Account is ?"
      },
      {
        "ayet_no" : 27,
        "arbi" : "يٰلَيْتَهَا كَانَتِ الْقَاضِيَةَ",
        "Urdu" : "اے کاش وہی (دنیا والی) موت ہی خاتمہ کر دینے والی ہوتی",
        "English" : "O would that it had made an end (of me) :"
      },
      {
        "ayet_no" : 28,
        "arbi" : "مَآ اَغْنٰى عَنِّيْ مَالِيَهْ",
        "Urdu" : "کچھ کام نہ آ سکا مجھے میرا مال ف۱",
        "English" : "My wealth has not been of any use to me."
      },
      {
        "ayet_no" : 29,
        "arbi" : "هَلَكَ عَنِّيْ سُلْطٰنِيَهْ",
        "Urdu" : "ہلاک (اور رخصت) ہوگیا مجھ سے میرا (جاہ و) اقتدار ف۲",
        "English" : "My power has gone from me for good."
      },
      {
        "ayet_no" : 30,
        "arbi" : "خُذُوْهُ فَغُلُّوْهُ",
        "Urdu" : "(حکم ہوگا کہ) پکڑو اس کو اور پہنا دو اس کو طوق",
        "English" : "(It will be said) : Take him and fetter him"
      },
      {
        "ayet_no" : 31,
        "arbi" : "ثُمَّ الْجَحِيْمَ صَلُّوْهُ",
        "Urdu" : "پھر جھونک دو اس کو (دوزخ کی) دہکتی آگ میں",
        "English" : "Then throw him in the blazing Fire."
      },
      {
        "ayet_no" : 32,
        "arbi" : "ثُمَّ فِيْ سِلْسِلَةٍ ذَرْعُهَا سَبْعُوْنَ ذِرَاعًا فَاسْلُكُوْهُ",
        "Urdu" : "پھر جکڑ دو اس کو ایک ایسی ہولناک زنجیر میں جس کی لمبائی ستر ہاتھ ہے",
        "English" : "Thereafter, fasten him with a chain the measure of which is seventy hands."
      },
      {
        "ayet_no" : 33,
        "arbi" : "اِنَّهٗ كَانَ لَا يُؤْمِنُ بِاللّٰهِ الْعَظِيْمِ",
        "Urdu" : "کہ یہ ایمان نہیں رکھتا تھا اس اللہ پر جو کہ بڑی ہی عظمتوں والا ہے",
        "English" : "Verily he was wont not to believe in Allah, the Mighty."
      },
      {
        "ayet_no" : 34,
        "arbi" : "وَلَا يَحُضُّ عَلٰي طَعَامِ الْمِسْكِيْنِ",
        "Urdu" : "اور یہ مسکین کو کھانا کھلانے کی ترغیب بھی نہیں دیتا تھا",
        "English" : "And urged not on the feeding of the wretched."
      },
      {
        "ayet_no" : 35,
        "arbi" : "فَلَيْسَ لَهُ الْيَوْمَ هٰهُنَا حَمِيْمٌ",
        "Urdu" : "پس اب نہ تو یہاں اس کا کوئی دوست ہے",
        "English" : "Wherefore for him here this Day there is no friend."
      },
      {
        "ayet_no" : 36,
        "arbi" : "وَّلَا طَعَامٌ اِلَّا مِنْ غِسْلِيْنٍ",
        "Urdu" : "اور نہ ہی اس کے لئے کھانے کی کوئی چیز ہوگی بجز (دوزخیوں کے) زخموں کی اس دھوون کے",
        "English" : "Nor any food save filthy corruption."
      },
      {
        "ayet_no" : 37,
        "arbi" : "لَّا يَاْكُلُهٗٓ اِلَّا الْخَاطِـــُٔوْنَ",
        "Urdu" : "جس کو کوئی نہ کھائے گا بجز ایسے ہی بڑے (بدبخت) گنہگاروں کے",
        "English" : "None shall eat it but the sinners."
      },
      {
        "ayet_no" : 38,
        "arbi" : "فَلَآ اُقْسِمُ بِمَا تُبْصِرُوْنَ",
        "Urdu" : "پس نہیں میں قسم کھاتا ہوں ان چیزوں کی جن کو تم لوگ دیکھ رہے ہو",
        "English" : "I swear by that which you see."
      },
      {
        "ayet_no" : 39,
        "arbi" : "وَمَا لَا تُبْصِرُوْنَ",
        "Urdu" : "اور ان کی بھی جن کو تم نہیں دیکھتے",
        "English" : "And that which you see not."
      },
      {
        "ayet_no" : 40,
        "arbi" : "اِنَّهٗ لَقَوْلُ رَسُوْلٍ كَرِيْمٍ",
        "Urdu" : "بلاشبہ یہ (قران) قطعی طور پر ایک بڑے ہی معزز پیغمبر کا پیش کیا ہوا کلام ہے",
        "English" : "That it is surely the speech brought by messenger honourable."
      },
      {
        "ayet_no" : 41,
        "arbi" : "وَّمَا هُوَ بِقَوْلِ شَاعِرٍ ۭ قَلِيْلًا مَّا تُؤْمِنُوْنَ",
        "Urdu" : "اور یہ کسی شاعر کا کلام نہیں کم ہی ایمان لاتے ہو تم لوگ",
        "English" : "And it is not the poetry of a poet (composed with literary expertise). You have but little faith."
      },
      {
        "ayet_no" : 42,
        "arbi" : "وَلَا بِقَوْلِ كَاهِنٍ ۭ قَلِيْلًا مَّا تَذَكَّرُوْنَ",
        "Urdu" : "اور نہ ہی یہ کسی کاہن کا قول ہے کم ہی غور کرتے ہو تم لوگ",
        "English" : "Nor is it the speech of a sooth- sayer. Little are ye admonished."
      },
      {
        "ayet_no" : 43,
        "arbi" : "تَنْزِيْلٌ مِّنْ رَّبِّ الْعٰلَمِيْنَ",
        "Urdu" : "یہ تو سراسر (اور پورے کا پورا) اتارا ہوا ہے پروردگار عالم کی طرف سے",
        "English" : "It is a Revelation from the Lord of the worlds."
      },
      {
        "ayet_no" : 44,
        "arbi" : "وَلَوْ تَقَوَّلَ عَلَيْنَا بَعْضَ الْاَقَاوِيْلِ",
        "Urdu" : "اور اگر یہ (پیغمبر) از خود کوئی بات بنا کر ہمارے ذمے لگا دیتے",
        "English" : "And if he had forged concerning us some discourses."
      },
      {
        "ayet_no" : 45,
        "arbi" : "لَاَخَذْنَا مِنْهُ بِالْيَمِيْنِ",
        "Urdu" : "تو ہم یقینا پکڑ لیتے ان کو داہنے ہاتھ سے",
        "English" : "We surely had lain hold of him by the right hand."
      },
      {
        "ayet_no" : 46,
        "arbi" : "ثُمَّ لَقَطَعْنَا مِنْهُ الْوَتِيْنَ",
        "Urdu" : "پھر سختی کے ساتھ کاٹ ڈالتے ہم ان کی رگ جان کو",
        "English" : "And then severed his life-vein."
      },
      {
        "ayet_no" : 47,
        "arbi" : "فَمَا مِنْكُمْ مِّنْ اَحَدٍ عَنْهُ حٰجِـزِيْنَ",
        "Urdu" : "اس صورت میں تم میں سے کوئی بھی (ہمیں) اس سے روکنے والا نہ ہوتا",
        "English" : "And none of you could have saved him from it."
      },
      {
        "ayet_no" : 48,
        "arbi" : "وَاِنَّهٗ لَتَذْكِرَةٌ لِّلْمُتَّقِيْنَ",
        "Urdu" : "اور بلاشبہ یہ (قران) قطعی طور پر ایک عظیم الشان نصیحت (اور یاد دہانی) ہے پرہیزگاروں کے لئے",
        "English" : "And verily it is an Admonition Unto the God-fearing."
      },
      {
        "ayet_no" : 49,
        "arbi" : "وَاِنَّا لَنَعْلَمُ اَنَّ مِنْكُمْ مُّكَذِّبِيْنَ",
        "Urdu" : "اور ہمیں اچھی طرح معلوم ہے کہ تم میں سے کچھ لوگ جھٹلانے والے بھی ہیں",
        "English" : "And verily We! We know that some among you are believers thereof."
      },
      {
        "ayet_no" : 50,
        "arbi" : "وَاِنَّهٗ لَحَسْرَةٌ عَلَي الْكٰفِرِيْنَ",
        "Urdu" : "اور بلاشبہ یہ (کلام حق) قطعی طور پر حسرت (و یاس) ہے کافروں کے لئے",
        "English" : "And surely, it is a cause of remorse for the disbelievers."
      },
      {
        "ayet_no" : 51,
        "arbi" : "وَاِنَّهٗ لَحَقُّ الْيَقِيْنِ",
        "Urdu" : "اور بلاشبہ یہ قطعی طور پر یقینی حق ہے",
        "English" : "And it is surely an absolute truth."
      },
      {
        "ayet_no" : 52,
        "arbi" : "فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيْمِ",
        "Urdu" : "پس آپ تسبیح کرتے رہیں اپنے رب کے نام کی جو بڑا ہی عظمت والا ہے ف۱",
        "English" : "So, pronounce the purity of the name of your magnificent Lord."
      }
    ]
  }
]