[
  {
    "surah_no" : 67,
    "total_ayah" : 30,
    "name" : "Surah e AL-Mulk",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "تَبٰرَكَ الَّذِيْ بِيَدِهِ الْمُلْكُ ۡ وَهُوَ عَلٰي كُلِّ شَيْءٍ قَدِيْرُۨ",
        "Urdu" : "بڑی ہی برکت والی ہے وہ ذات جس کے ہاتھ میں ہے بادشاہی (اس ساری کائنات کی) اور وہ ہرچیز پر پوری پوری قدرت رکھتا ہے ف۱",
        "English" : "Blessed is He in Whose Hand is the dominion, and He is Able to do all things."
      },
      {
        "ayet_no" : 2,
        "arbi" : "الَّذِيْ خَلَقَ الْمَوْتَ وَالْحَيٰوةَ لِيَبْلُوَكُمْ اَيُّكُمْ اَحْسَنُ عَمَلًا ۭوَهُوَ الْعَزِيْزُ الْغَفُوْرُ",
        "Urdu" : "جس نے پیدا فرمایا موت اور حیات کو تاکہ وہ تمہیں آزمائے کہ تم میں سے کس کا کام سب سے اچھا ہے اور وہی ہے سب پر غالب بڑا ہی بخشنے والا (اور نہایت درگزر کرنے والا) ف۲",
        "English" : "He Who created Death and Life, that He may try which of you is best in deed: and He is the Exalted in Might, Oft-Forgiving;-"
      },
      {
        "ayet_no" : 3,
        "arbi" : "الَّذِيْ خَلَقَ سَبْعَ سَمٰوٰتٍ طِبَاقًا   ۭ مَا تَرٰى فِيْ خَلْقِ الرَّحْمٰنِ مِنْ تَفٰوُتٍ ۭ فَارْجِعِ الْبَصَرَ ۙ هَلْ تَرٰى مِنْ فُطُوْرٍ",
        "Urdu" : "جس نے پیدا فرمایا (اپنی قدرت کاملہ اور حکمت بالغہ سے) سات آسمانوں کو تہ بر تہ تم (خدائے) رحمان کی صنعت میں (کسی طرح کا) کوئی فرق نہ دیکھ سکو گے تم پھر نگاہ ڈال کر دیکھ لو کیا تمہیں (کہیں) کوئی خلل نظر آتا ہے ؟",
        "English" : "He Who created the seven heavens one above another: No want of proportion wilt thou see in the Creation of (Allah) Most Gracious. So turn thy vision again: see thou any flaw ?"
      },
      {
        "ayet_no" : 4,
        "arbi" : "ثُمَّ ارْجِعِ الْبَصَرَ كَرَّتَيْنِ يَنْقَلِبْ اِلَيْكَ الْبَصَرُ خَاسِئًا وَّهُوَ حَسِيْرٌ",
        "Urdu" : "تم پھر بار بار نگاہ ڈال کر دیکھ لو تمہاری نگاہ تھکی ہاری ناکام ہو کر تمہاری طرف وا پس لوٹ آئے گی",
        "English" : "Then cast your eye again and again, and the eye will come back to you abased, in a state of weariness."
      },
      {
        "ayet_no" : 5,
        "arbi" : "وَلَقَدْ زَيَّنَّا السَّمَاۗءَ الدُّنْيَا بِمَصَابِيْحَ وَجَعَلْنٰهَا رُجُوْمًا لِّلشَّـيٰطِيْنِ وَاَعْتَدْنَا لَهُمْ عَذَابَ السَّعِيْرِ",
        "Urdu" : "اور بلاشبہ ہم ہی نے مزین (اور آراستہ و پیراستہ) کیا (اپنی قدرت کا ملہ اور حکمت بالغہ سے تمہارے) قریب کے اس آسمان کو (ستاروں کے) عظیم الشان چراغوں سے اور ہم ہی نے ان کو بنایا شیطانوں کے مار بھگانے کا ذریعہ اور ہم نے تیار کر رکھا ہے ان کے لئے عذاب بھڑکتی آگ کا",
        "English" : "And We have decorated the nearest sky with lamps, and have made them devices to stone the devils, and We have prepared for them the punishment of Hell."
      },
      {
        "ayet_no" : 6,
        "arbi" : "وَلِلَّذِيْنَ كَفَرُوْا بِرَبِّهِمْ عَذَابُ جَهَنَّمَ ۭ وَبِئْسَ الْمَصِيْرُ",
        "Urdu" : "اور جن لوگوں نے کفر کیا ہوگا اپنے رب کے ساتھ ان کے لئے عذاب ہے جہنم (کی اس دہکتی آگ) کا اور بڑا ہی برا ٹھکانا ہے وہ",
        "English" : "And for those who disbelieve in their Lord (Allh) is the torment of Hell, and worst indeed is that destination."
      },
      {
        "ayet_no" : 7,
        "arbi" : "اِذَآ اُلْقُوْا فِيْهَا سَمِعُوْا لَهَا شَهِيْقًا وَّهِىَ تَفُوْرُ",
        "Urdu" : "جب وہ اس میں ڈالے جائیں گے تو وہ اس کے سخت شور کی آوازیں سنیں گے",
        "English" : "When they are cast therein, they will hear the (terrible) drawing in of its breath as it blazes forth."
      },
      {
        "ayet_no" : 8,
        "arbi" : "تَكَادُ تَمَــيَّزُ مِنَ الْغَيْظِ ۭ كُلَّمَآ اُلْقِيَ فِيْهَا فَوْجٌ سَاَلَهُمْ خَزَنَــتُهَآ اَلَمْ يَاْتِكُمْ نَذِيْرٌ",
        "Urdu" : "جبکہ وہ جوش مار رہی ہوگی شدت غضب سے وہ پھٹی جا رہی ہوگی جب بھی ڈالا جائے گا اس میں (کفار و منکرین) کا کوئی گروہ تو اس کے کارندے ان لوگوں سے پوچھیں گے کہ کیا تمہارے پاس کوئی خبردار کرنے والا نہیں آیا تھا ؟",
        "English" : "It almost bursts up with fury. Every time a group is cast therein, its keeper will ask: [Did no warner come to you ?]"
      },
      {
        "ayet_no" : 9,
        "arbi" : "قَالُوْا بَلٰي قَدْ جَاۗءَنَا نَذِيْرٌ ڏ فَكَذَّبْنَا وَقُلْنَا مَا نَزَّلَ اللّٰهُ مِنْ شَيْءٍ ښ اِنْ اَنْتُمْ اِلَّا فِيْ ضَلٰلٍ كَبِيْرٍ",
        "Urdu" : "وہ جواب میں کہیں گے کہ ہاں خبرادر کرنے والا تو ہمارے پاس ضرور آیا تھا مگر ہم نے اس کو جھٹلا دیا اور کہہ دیا کہ اللہ نے تو کچھ بھی نازل نہیں کیا تم لوگ تو خود ہی ایک بڑی گمراہی میں پڑے ہو",
        "English" : "They will say: yea! surely there came a warner Unto us, but we belied, and said: God hath not sent down aught, are naught but in a great error."
      },
      {
        "ayet_no" : 10,
        "arbi" : "وَقَالُوْا لَوْ كُنَّا نَسْمَعُ اَوْ نَعْقِلُ مَا كُنَّا فِيْٓ اَصْحٰبِ السَّعِيْرِ",
        "Urdu" : "اور وہ (بصد حسرت و افسوس) کہیں گے کہ اے کاش اگر ہم سنتے یا سمجھتے تو آج ہم اس بھڑکتی آگ کے سزا واروں میں نہ ہوتے ف۱",
        "English" : "And they will say, :Had we been listening or understanding, we would not have been among the people of the Hell."
      },
      {
        "ayet_no" : 11,
        "arbi" : "فَاعْتَرَفُوْا بِذَنْۢبِهِمْ ۚ فَسُحْقًا لِّاَصْحٰبِ السَّعِيْرِ",
        "Urdu" : "اس طرح وہ اپنے گناہ کا خود اقرار کرلیں گے سو پھٹکار ہے ان دوزخیوں کے لئے",
        "English" : "Then they will confess their sin. So, away with the dwellers of the blazing Fire."
      },
      {
        "ayet_no" : 12,
        "arbi" : "اِنَّ الَّذِيْنَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ لَهُمْ مَّغْفِرَةٌ وَّاَجْرٌ كَبِيْرٌ",
        "Urdu" : "(اس کے برعکس) جو لوگ ڈرتے رہتے ہیں اپنے رب سے بن دیکھے ان کے لئے یقینا بڑی بخشش بھی ہے اور ایک بہت بڑا اجر بھی",
        "English" : "Surely, for those who have awe of their Lord without seeing (Him) , there is forgiveness and a big reward."
      },
      {
        "ayet_no" : 13,
        "arbi" : "وَاَسِرُّوْا قَوْلَكُمْ اَوِ اجْهَرُوْا بِهٖ  ۭ اِنَّهٗ عَلِيْمٌۢ بِذَاتِ الصُّدُوْرِ",
        "Urdu" : "اور تم لوگ خواہ چپکے سے بات کرو یا اونچی آواز سے (اللہ کو سب معلوم ہے کیونکہ) وہ تو یقینی طور پر دلوں کے بھیدوں کو بھی پوری طرح جانتا ہے",
        "English" : "Whether you keep your talk secret or make it aloud, He knows well what lies in the hearts."
      },
      {
        "ayet_no" : 14,
        "arbi" : "اَلَا يَعْلَمُ مَنْ خَلَقَ ۭ وَهُوَ اللَّطِيْفُ الْخَبِيْرُ",
        "Urdu" : "کیا وہی نہ جانے گا جس نے خود پیدا کیا ہے ؟ جب کہ وہ (ذات اقدس) انتہائی باریک بیں بھی ہے اور نہایت باخبر بھی ؟",
        "English" : "Is it (imaginable) that He who has created (them) will not have (such a) knowledge, while He is the Knower of the finest things, the All-Aware ?"
      },
      {
        "ayet_no" : 15,
        "arbi" : "هُوَ الَّذِيْ جَعَلَ لَكُمُ الْاَرْضَ ذَلُوْلًا فَامْشُوْا فِيْ مَنَاكِبِهَا وَكُلُوْا مِنْ رِّزْقِهٖ  ۭ وَاِلَيْهِ النُّشُوْرُ",
        "Urdu" : "وہ (اللہ) وہی تو ہے جس نے رام کر دیا تمہارے لئے (اپنی قدرت کاملہ اور حکمت بالغہ سے) زمین (کے اس عظیم الشان کرے) کو پس تم لوگ چلو (پھرو) اس کے کندھوں پر اور کھاؤ (پیو) اس (وحدہ لاشریک) کے دیئے ہوئے میں سے اور (یاد رکھو کہ آخرکار تم سب کو) بہر حال اسی کے حضور جانا ہے دوبارہ زندہ ہو کر",
        "English" : "He is the One who has made the earth subjugated for you, so walk on its shoulders, and eat out of His provision, and to Him is the Resurrection."
      },
      {
        "ayet_no" : 16,
        "arbi" : "ءَاَمِنْتُمْ مَّنْ فِي السَّمَاۗءِ اَنْ يَّخْسِفَ بِكُمُ الْاَرْضَ فَاِذَا هِيَ تَمُوْرُ",
        "Urdu" : "کیا تم لوگ نڈر (اور بےخوف) ہوگئے ہو اس سے جو کہ آسمان میں (بھی معبود و متصرف) ہے اس بات سے کہ وہ تمہیں دھنسا دے (تمہارے اپنے زیر پا افتادہ) اسی زمین میں پھر یکا یک یہ (عظیم الشان کرہ) ہچکو لے کھانے لگے ؟",
        "English" : "Have you become fearless of Him who is in the sky if He makes you sink into the earth, and it starts trembling at once ?"
      },
      {
        "ayet_no" : 17,
        "arbi" : "اَمْ اَمِنْتُمْ مَّنْ فِي السَّمَاۗءِ اَنْ يُّرْسِلَ عَلَيْكُمْ حَاصِبًا   ۭ فَسَتَعْلَمُوْنَ كَيْفَ نَذِيْرِ",
        "Urdu" : "کیا تم لوگ نڈر (اور بےخوف) ہوگئے ہو اس سے جو کہ آسمان میں (بھی معبود و متصرف) ہے اس سے کہ وہ بھیج دے تم پر پتھر برسانے والی کوئی ہولناک ہوا، پھر تمہیں خود معلوم ہو جائے کہ کیسا تھا میرا ڈرانا (اور خبردار کرنا) ؟",
        "English" : "Or are ye secure that He Who is in the heaven will not send against you a whirlwind ? Anon ye shall know what wise hath been My warning."
      },
      {
        "ayet_no" : 18,
        "arbi" : "وَلَقَدْ كَذَّبَ الَّذِيْنَ مِنْ قَبْلِهِمْ فَكَيْفَ كَانَ نَكِيْرِ",
        "Urdu" : "اور بلاشبہ جھٹلایا (حق اور حقیقت کو) ان لوگوں نے بھی جو گزر چکے ہیں ان سے پہلے پھر (دیکھ لو) کیسا تھا میرا عذاب ؟",
        "English" : "And of course, those before them (also) rejected (the truth) . So, how was My censure ?"
      },
      {
        "ayet_no" : 19,
        "arbi" : "اَوَلَمْ يَرَوْا اِلَى الطَّيْرِ فَوْقَهُمْ صٰۗفّٰتٍ وَّيَقْبِضْنَ ڪ مَا يُمْسِكُـهُنَّ اِلَّا الرَّحْمٰنُ ۭ اِنَّهٗ بِكُلِّ شَيْءٍۢ بَصِيْرٌ",
        "Urdu" : "کیا ان لوگوں نے خود اپنے اوپر (اڑتے پھرتے) ان پرندوں کو نہیں دیکھا ؟ جو کبھی پر پھیلائے ہوتے ہیں اور کبھی وہ ان کو سکیڑ لیتے ہیں کوئی نہیں جو ان کو روک سکے (اس طرح کھلی فضاء میں) سوائے (خدائے) رحمان کے بلاشبہ وہ ہرچیز کو پوری طرح دیکھ رہا ہے",
        "English" : "Have they not looked to the birds above them spreading their wings, and (at times) they fold (them) in ? No one holds them up except the Rahman (the All-Merciful Allah). Surely He is watchful of every thing."
      },
      {
        "ayet_no" : 20,
        "arbi" : "اَمَّنْ هٰذَا الَّذِيْ هُوَ جُنْدٌ لَّكُمْ يَنْصُرُكُمْ مِّنْ دُوْنِ الرَّحْمٰنِ ۭ اِنِ الْكٰفِرُوْنَ اِلَّا فِيْ غُرُوْرٍ",
        "Urdu" : "(ان سے کہو کہ) بھلا کون ہے وہ جو تمہارے لئے لشکر بن کر تمہاری مدد کر سکے (خدائے) رحمان کے مقابلے میں؟ کافر لوگ تو محض دھوکے میں پڑے ہوئے ہیں",
        "English" : "Now, who is there to act as a force for you to help you, except the Rahman ? The disbelievers are in nothing but delusion."
      },
      {
        "ayet_no" : 21,
        "arbi" : "اَمَّنْ هٰذَا الَّذِيْ يَرْزُقُكُمْ اِنْ اَمْسَكَ رِزْقَهٗ  ۚ بَلْ لَّجُّوْا فِيْ عُتُوٍّ وَّنُفُوْرٍ",
        "Urdu" : "بھلا وہ کون ہو سکتا ہے جو تمہیں روزی دے اگر وہ (خدائے رحمٰن) بند کرےاپنی روزی؟ (ایسا کوئی بھی نہیں) مگر یہ لوگ (ہیں کہ اس سب کے باوجود) اڑے ہوئے ہیں سرکشی اور (حق سے) گریز (وفرار) میں",
        "English" : "Or, who is there to give you sustenance, if He withholds His sustenance ? Still, they persist in rebellion and aversion."
      },
      {
        "ayet_no" : 22,
        "arbi" : "اَفَمَنْ يَّمْشِيْ مُكِبًّا عَلٰي وَجْهِهٖٓ اَهْدٰٓى اَمَّنْ يَّمْشِيْ سَوِيًّا عَلٰي صِرَاطٍ مُّسْتَقِيْمٍ",
        "Urdu" : "تو کیا وہ شخص زیادہ راست رو ہے جو اوندھا چل رہا ہو اپنے منہ کے بل یا وہ جو سر اٹھا کر سیدھا چل رہا ہو ایک (کھلی کشادہ) شاہراہ پر ؟ ف۱",
        "English" : "Then, is the one who walks falling down (frequently) on his face more right or the one who walks properly on a straight path ?"
      },
      {
        "ayet_no" : 23,
        "arbi" : "قُلْ هُوَ الَّذِيْٓ اَنْشَاَكُمْ وَجَعَلَ لَكُمُ السَّمْعَ وَالْاَبْصَارَ وَالْاَفْــِٕدَةَ    ۭ قَلِيْلًا مَّا تَشْكُرُوْنَ",
        "Urdu" : "(ان سے) کہو کہ وہ (معبود برحق) وہی ہے جس نے پیدا فرمایا تم سب کو (اپنی قدرت کا ملہ اور حکمت بالغہ سے) اور اسی نے تمہیں کان بخشے انکھیں عطا فرمائیں اور دل دیئے (مگر) تم لوگ بہت ہی کم شکر ادا کرتے ہو،",
        "English" : "Say it is He Who has created you, and endowed you with hearing (ears) , seeing (eyes) , and hearts. Little thanks you give."
      },
      {
        "ayet_no" : 24,
        "arbi" : "قُلْ هُوَ الَّذِيْ ذَرَاَكُمْ فِي الْاَرْضِ وَاِلَيْهِ تُحْشَرُوْنَ",
        "Urdu" : "(ان سے مزید) کہو کہ وہ (وحدہ لاشریک) وہی ہے جس نے پھیلا دیا تم سب کو زمین میں (نہایت پُر حکمت طریقے سے) اور آخرکار اسی کی طرف لوٹنا ہے تم سب کو سمٹ کر",
        "English" : "Say, :He is the One who has scattered you on the earth, and to Him you will be assembled."
      },
      {
        "ayet_no" : 25,
        "arbi" : "وَيَقُوْلُوْنَ مَتٰى هٰذَا الْوَعْدُ اِنْ كُنْتُمْ صٰدِقِيْنَ",
        "Urdu" : "اور کہتے ہیں کہ آخر کب پورا ہوگا تمہارا یہ وعدہ اگر تم سچے ہو ؟",
        "English" : "And they say, :When will this promise (of the Day of Judgment) be fulfilled, if you are true ?"
      },
      {
        "ayet_no" : 26,
        "arbi" : "قُلْ اِنَّمَا الْعِلْمُ عِنْدَ اللّٰهِ ۠ وَاِنَّمَآ اَنَا نَذِيْرٌ مُّبِيْنٌ",
        "Urdu" : "کہو کہ اس کا علم تو اللہ ہی کے پاس ہے اور میں تو محض ایک خبردار کرنے والا ہوں (حقیقت امر کو) کھول کر",
        "English" : "Say: The knowledge (thereof is only with Allah and I am only a plain warner."
      },
      {
        "ayet_no" : 27,
        "arbi" : "فَلَمَّا رَاَوْهُ زُلْفَةً سِيْۗـــــَٔتْ وُجُوْهُ الَّذِيْنَ كَفَرُوْا وَقِيْلَ هٰذَا الَّذِيْ كُنْتُمْ بِهٖ تَدَّعُوْنَ",
        "Urdu" : "سو جب یہ اس کو قریب دیکھیں گے تو بگڑ جائیں گے چہرے ان لوگوں کے جو اس کا انکار کرتے رہے تھے اور (اس وقت ان سے) کہا جائے گا کہ یہی ہے وہ چیز جس کا تم لوگ (دنیا میں) بار بار مطالبہ کیا کرتے تھے",
        "English" : "But when they see it nigh, the faces of those who disbelieve will be awry, and it will be said (unto them) : This is that for which ye used to call."
      },
      {
        "ayet_no" : 28,
        "arbi" : "قُلْ اَرَءَيْتُمْ اِنْ اَهْلَكَنِيَ اللّٰهُ وَمَنْ مَّعِيَ اَوْ رَحِمَنَا ۙ فَمَنْ يُّجِيْرُ الْكٰفِرِيْنَ مِنْ عَذَابٍ اَلِيْمٍ",
        "Urdu" : "(ان سے) کہو کہ (نادانو!) ذرا یہ تو بتاؤ کہ اگر اللہ ہلاک کر دے مجھے اور ان سب کو بھی جو میرے ساتھ ہیں یا رحم فرما دے ہم سب پر تو (اس سے تمہیں کیا ملے گا؟ تم تو یہ سوچو کہ) کون بچائے گا کافروں کو دردناک عذاب سے ؟",
        "English" : "Say (O Muhammad) : Have ye thought: Whether Allah cause me (Muhammad) and those with me to perish or hath mercy on us, still, who will protect the disbelievers from a painful doom ?"
      },
      {
        "ayet_no" : 29,
        "arbi" : "قُلْ هُوَ الرَّحْمٰنُ اٰمَنَّا بِهٖ وَعَلَيْهِ تَوَكَّلْنَا  ۚ فَسَتَعْلَمُوْنَ مَنْ هُوَ فِيْ ضَلٰلٍ مُّبِيْنٍ",
        "Urdu" : "(ان سے) کہو کہ وہ (رب) بڑا ہی مہربان ہے ہم اس پر ایمان لائے (سچے دل سے) اور ہم نے اسی پر بھروسہ کر رکھا ہے (ہر حال میں) پس تم لوگوں کو عنقریب خود ہی معلوم ہو جائے گا کہ کون ہے وہ جو پڑا ہے کھلی گمراہی میں ف۱",
        "English" : "Say: He is the Beneficent. In Him we believe and in Him we put our trust. And you will soon know who it is that is in error manifest."
      },
      {
        "ayet_no" : 30,
        "arbi" : "قُلْ اَرَءَيْتُمْ اِنْ اَصْبَحَ مَاۗؤُكُمْ غَوْرًا فَمَنْ يَّاْتِيْكُمْ بِمَاۗءٍ مَّعِيْنٍ",
        "Urdu" : "(ان سے یہ بھی) کہو کہ اچھا تم یہ تو بتاؤ کہ اگر تمہارا پانی (زمین میں) نیچے کو اتر جائے تو پھر کون ہے جو تمہیں لا دے ستھرے پانی کی بہتی ہوئی سوتیں ؟ ف۲",
        "English" : "Say, :Tell me, Should your water vanish into the earth, who will bring you a flowing (stream of) water ?"
      }
    ]
  }
]