[
  {
    "surah_no" : 83,
    "total_ayah" : 36,
    "name" : "Surah e AL-Mutaffifin",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "وَيْلٌ لِّـلْمُطَفِّفِيْنَ",
        "Urdu" : "ہلاکت ہے ماپ تول میں کمی کرنے والوں کیلیے",
        "English" : "Woe to those that deal in fraud"
      },
      {
        "ayet_no" : 2,
        "arbi" : "الَّذِيْنَ اِذَا اكْتَالُوْا عَلَي النَّاسِ يَسْتَوْفُوْنَ",
        "Urdu" : "وہ لوگ جو جب ماپ کرتے ہیں لوگوں سے تو پورا پورا لیتے ہیں",
        "English" : "When (they) take by measure from others they take (from them) full."
      },
      {
        "ayet_no" : 3,
        "arbi" : "وَاِذَا كَالُوْهُمْ اَوْ وَّزَنُوْهُمْ يُخْسِرُوْنَ",
        "Urdu" : "اور جب وہ ماپ کر کے دیتے ہیں انہیں یا تول کر دیتے ہیں انہیں تو کم دیتے ہیں",
        "English" : "And when they have to give by measure or weight to men, give less than due."
      },
      {
        "ayet_no" : 4,
        "arbi" : "اَلَا يَظُنُّ اُولٰۗىِٕكَ اَنَّهُمْ مَّبْعُوْثُوْنَ",
        "Urdu" : "کیا نہیں سمجھتے یہ لوگ کہ بے شک وہ اٹھائے جانے والے ہیں",
        "English" : "Imagine such men not that they shall be raised up ?"
      },
      {
        "ayet_no" : 5,
        "arbi" : "لِيَوْمٍ عَظِيْمٍ",
        "Urdu" : "اس بڑے دن کے لیے",
        "English" : "On a mighty Day."
      },
      {
        "ayet_no" : 6,
        "arbi" : "يَّوْمَ يَقُوْمُ النَّاسُ لِرَبِّ الْعٰلَمِيْنَ",
        "Urdu" : "جس دن کھڑے ہوں گے لوگ رب العالمین کے سامنے",
        "English" : "A Day whereon mankind shall stand before the Lord of the worlds ?"
      },
      {
        "ayet_no" : 7,
        "arbi" : "كَلَّآ اِنَّ كِتٰبَ الْفُجَّارِ لَفِيْ سِجِّيْنٍ",
        "Urdu" : "ہرگز نہیں بے شک نافرمانوں کا اعمال نامہ یقینا سجین میں ہے",
        "English" : "Nay! Truly, the Record (writing of the deeds) of the Fujjr (disbelievers, sinners, evil-doers and wicked) is (preserved) in Sijjn."
      },
      {
        "ayet_no" : 8,
        "arbi" : "وَمَآ اَدْرٰىكَ مَا سِجِّيْنٌ",
        "Urdu" : "اور کیا جانیں آپ سجین کیا ہے",
        "English" : "And what will make thee know whatsoever the record in Sijjin is ?"
      },
      {
        "ayet_no" : 9,
        "arbi" : "كِتٰبٌ مَّرْقُوْمٌ",
        "Urdu" : "وہ ایک کتاب ہے لکھی ہوئی",
        "English" : "A record of misdeeds written."
      },
      {
        "ayet_no" : 10,
        "arbi" : "وَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَ",
        "Urdu" : "ہلاکت ہے اس دن جھٹلانے والوں کے لیے",
        "English" : "Woe to the deniers on that Day,"
      },
      {
        "ayet_no" : 11,
        "arbi" : "الَّذِيْنَ يُكَذِّبُوْنَ بِيَوْمِ الدِّيْنِ",
        "Urdu" : "وہ لوگ جو جھٹلاتے ہیں جزا کے دن کو",
        "English" : "Those that deny the Day of Judgment."
      },
      {
        "ayet_no" : 12,
        "arbi" : "وَمَا يُكَذِّبُ بِهٖٓ اِلَّا كُلُّ مُعْتَدٍ اَثِيْمٍ",
        "Urdu" : "اور نہیں جھٹلاتا اسے مگر ہر حد سے تجاوز کرنے والا سخت گناہگار",
        "English" : "And no one else denies it except every defiant and sinner."
      },
      {
        "ayet_no" : 13,
        "arbi" : "اِذَا تُتْلٰى عَلَيْهِ اٰيٰـتُنَا قَالَ اَسَاطِيْرُ الْاَوَّلِيْنَ",
        "Urdu" : "جب تلاوت کی جاتیں ہیں اس پر ہماری آیتیں تو وہ کہتا ہے یہ افسانے ہیں پہلے لوگوں کے",
        "English" : "When Our Revelations are read out to him, he says (or thinks) that (they are) tales of the ancients."
      },
      {
        "ayet_no" : 14,
        "arbi" : "كَلَّا بَلْ ۫ رَانَ عَلٰي قُلُوْبِهِمْ مَّا كَانُوْا يَكْسِبُوْنَ",
        "Urdu" : "ہرگز نہیں بلکہ زنگ لگا دیا ہے ان کے دلوں پر اس نے جو وہ کماتے تھے",
        "English" : "By no means!' Aye! encrusted upon their hearts is that which they have been earning."
      },
      {
        "ayet_no" : 15,
        "arbi" : "كَلَّآ اِنَّهُمْ عَنْ رَّبِّهِمْ يَوْمَىِٕذٍ لَّمَحْجُوْبُوْنَ",
        "Urdu" : "ہر گز نہیں بے شک وہ اپنے رب کے دیدار سے اس دن ضرور حجاب میں رکھے جائیں گے ۔",
        "English" : "No! Indeed they will be screened off from their Lord on that Day."
      },
      {
        "ayet_no" : 16,
        "arbi" : "ثُمَّ اِنَّهُمْ لَصَالُوا الْجَــحِيْمِ",
        "Urdu" : "پھر بےشک وہ ضرور داخل ہوں گے جہنم میں",
        "English" : "Then they will have to enter the Hell."
      },
      {
        "ayet_no" : 17,
        "arbi" : "ثُمَّ يُقَالُ هٰذَا الَّذِيْ كُنْتُمْ بِهٖ تُكَذِّبُوْنَ",
        "Urdu" : "پھر کہا جائے گا یہ ہے وہ جو تھے تم اس کو جھٹلاتے",
        "English" : "Then it will be said, :This is what you used to deny."
      },
      {
        "ayet_no" : 18,
        "arbi" : "كَلَّآ اِنَّ كِتٰبَ الْاَبْرَارِ لَفِيْ عِلِّيِّيْنَ",
        "Urdu" : "ہرگز نہیں بیشک نیک لوگوں کا اعمال نامہ یقینا علیین میں ہوگا",
        "English" : "By no means! Verily the record of the virtuous shall be in 'Illiyun."
      },
      {
        "ayet_no" : 19,
        "arbi" : "وَمَآ اَدْرٰىكَ مَا عِلِّيُّوْنَ",
        "Urdu" : "اور کیا جانیں آپ کیا ہے علیین",
        "English" : "And what may let you know what 'Illiyyun is ?"
      },
      {
        "ayet_no" : 20,
        "arbi" : "كِتٰبٌ مَّرْقُوْمٌ",
        "Urdu" : "ایک کتاب ہے لکھی ہوئی",
        "English" : "A record of good deeds written."
      },
      {
        "ayet_no" : 21,
        "arbi" : "يَّشْهَدُهُ الْمُقَرَّبُوْنَ",
        "Urdu" : "حاضر رہتے ہیں اس کے پاس مقرب فرشتے",
        "English" : "To which bear witness those nearest (toAllah, i.e. the angels)."
      },
      {
        "ayet_no" : 22,
        "arbi" : "اِنَّ الْاَبْرَارَ لَفِيْ نَعِيْمٍ",
        "Urdu" : "بیشک نیک لوگ یقینا نعمت جنت میں ہوں گے",
        "English" : "Verily, Al-Abrr (the pious who fearAllah and avoid evil) will be in delight (Paradise)."
      },
      {
        "ayet_no" : 23,
        "arbi" : "عَلَي الْاَرَاۗىِٕكِ يَنْظُرُوْنَ",
        "Urdu" : "تختوں پر بیٹھے دیکھ رہے ہوں گے",
        "English" : "While (sitting) on thrones they will be watching (the scenes of Paradise)."
      },
      {
        "ayet_no" : 24,
        "arbi" : "تَعْرِفُ فِيْ وُجُوْهِهِمْ نَضْرَةَ النَّعِيْمِ",
        "Urdu" : "آپ پہچانیں گے ا نکے چہروں میں نعمت کی تازگی",
        "English" : "You will recognize the glamour of bliss on their faces."
      },
      {
        "ayet_no" : 25,
        "arbi" : "يُسْقَوْنَ مِنْ رَّحِيْقٍ مَّخْتُوْمٍ",
        "Urdu" : "وہ پلائے جائیں گے سربمہرخالص شراب میں سے",
        "English" : "They will be given to drink of pure wine, sealed."
      },
      {
        "ayet_no" : 26,
        "arbi" : "خِتٰمُهٗ مِسْكٌ ۭ وَفِيْ ذٰلِكَ فَلْيَتَنَافَسِ الْمُتَنَافِسُوْنَ",
        "Urdu" : "اس کی مہر کستوری ہوگی اور اس میں پس چاہیے کہ رغبت کریں رغبت کرنیوالے",
        "English" : "The last thereof (that wine) will be the smell of musk, and for this let (all) those strive who want to strive (i.e. hasten earnestly to the obedience of Allah)."
      },
      {
        "ayet_no" : 27,
        "arbi" : "وَمِزَاجُهٗ مِنْ تَسْنِيْمٍ",
        "Urdu" : "اور اس کی ملاوٹ تسنیم سے ہوگی",
        "English" : "And this (beverage of Paradise) will be mixed with the water of Tasnim."
      },
      {
        "ayet_no" : 28,
        "arbi" : "عَيْنًا يَّشْرَبُ بِهَا الْمُقَرَّبُوْنَ",
        "Urdu" : "جو ایک چشمہ ہے پییں گے اس سے مقرب لوگ",
        "English" : "A spring whereof drink those nearest to Allah."
      },
      {
        "ayet_no" : 29,
        "arbi" : "اِنَّ الَّذِيْنَ اَجْرَمُوْا كَانُوْا مِنَ الَّذِيْنَ اٰمَنُوْا يَضْحَكُوْنَ",
        "Urdu" : "بے شک وہ لوگ جنہوں نے جرم کیے تھے وہ ہنستے ان لوگوں سے جو ایمان لائے",
        "English" : "Verily! (During the worldly life) those who committed crimes used to laugh at those who believed."
      },
      {
        "ayet_no" : 30,
        "arbi" : "وَاِذَا مَرُّوْا بِهِمْ يَتَغَامَزُوْنَ",
        "Urdu" : "اور جب گزرتے ان کے پاس سے تو آ پس میں انکھو سے اشارے کرتے تھے",
        "English" : "And, when they passed them, to wink at each other,"
      },
      {
        "ayet_no" : 31,
        "arbi" : "وَاِذَا انْقَلَبُوْٓا اِلٰٓى اَهْلِهِمُ انْقَلَبُوْا فَكِهِيْنَ",
        "Urdu" : "اور جب وہ لوٹتے اپنے گھروالوں کی طرف تو لوٹتے دل لگی کرتے ہوئے",
        "English" : "And when they returned to their household they returned jesting."
      },
      {
        "ayet_no" : 32,
        "arbi" : "وَاِذَا رَاَوْهُمْ قَالُوْٓا اِنَّ هٰٓؤُلَاۗءِ لَضَاۗلُّوْنَ",
        "Urdu" : "اور جب وہ کافر دیکھتے ان مسلمانوں کو تو کہتے تھے بے شک یہ لوگ یقینا گمراہ ہیں",
        "English" : "And when they saw them, they said: verily these are the strayed ones."
      },
      {
        "ayet_no" : 33,
        "arbi" : "وَمَآ اُرْسِلُوْا عَلَيْهِمْ حٰفِظِيْنَ",
        "Urdu" : "حالانکہ نہیں بھیجے گئے تھے وہ ان پر نگران بناکر ۔",
        "English" : "But they (disbelievers, sinners) had not been sent as watchers over them (the believers)."
      },
      {
        "ayet_no" : 34,
        "arbi" : "فَالْيَوْمَ الَّذِيْنَ اٰمَنُوْا مِنَ الْكُفَّارِ يَضْحَكُوْنَ",
        "Urdu" : "چنانچہ آج وہ لوگ جو ایمان لائے کافروں پر ہنس رہے ہیں",
        "English" : "So, today those who believed will laugh at the disbelievers."
      },
      {
        "ayet_no" : 35,
        "arbi" : "عَلَي الْاَرَاۗىِٕكِ ۙ يَنْظُرُوْنَ",
        "Urdu" : "تختوں پر بیٹھے نظارہ کر رہے ہیں",
        "English" : "Reclining on couches, looking on."
      },
      {
        "ayet_no" : 36,
        "arbi" : "هَلْ ثُوِّبَ الْكُفَّارُ مَا كَانُوْا يَفْعَلُوْنَ",
        "Urdu" : "کیا بدلہ دے دیا گیا کافروں کو اس کا جو وہ کیاکرتے تھے",
        "English" : "Whether the disbelievers have been paid back for what they used to do."
      }
    ]
  }
]