[
  {
    "surah_no" : 35,
    "total_ayah" : 45,
    "name" : "Surah e Fatir",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "اَلْحَمْدُ لِلّٰهِ فَاطِرِ السَّمٰوٰتِ وَالْاَرْضِ جَاعِلِ الْمَلٰۗىِٕكَةِ رُسُلًا اُولِيْٓ اَجْنِحَةٍ مَّثْنٰى وَثُلٰثَ وَرُبٰعَ ۭ يَزِيْدُ فِي الْخَلْقِ مَا يَشَاۗءُ ۭ اِنَّ اللّٰهَ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
        "Urdu" : "ہر خوبی (اور تعریف) اللہ ہی کے لئے ہے جو (عدم محض سے) بنا نکالنے والا ہے آسمانوں اور زمین (کی اس عظیم الشان کائنات) کو جو پیغام رساں بنانے والا ہے ایسے فرشتوں کو جو دو دو تین تین اور چار چار پروں والے ہیں وہ اضافہ فرماتا ہےاپنی مخلوق میں جو چاہتا ہے بلاشبہ اللہ کو ہرچیز پر پوری پوری قدرت ہے",
        "English" : "All praise belongs to Allah, the Originator of the heavens and the earth, who appoints the angels as messengers having wings, in twos, threes and fours. He adds to the creation what He wills. Indeed, Allah is powerful to do every thing."
      },
      {
        "ayet_no" : 2,
        "arbi" : "مَا يَفْتَحِ اللّٰهُ لِلنَّاسِ مِنْ رَّحْمَةٍ فَلَا مُمْسِكَ لَهَا ۚ وَمَا يُمْسِكْ ۙ فَلَا مُرْسِلَ لَهٗ مِنْۢ بَعْدِهٖ ۭ وَهُوَ الْعَزِيْزُ الْحَكِيْمُ",
        "Urdu" : "اللہ اپنے بندوں کے لئے جو بھی کوئی رحمت کھول دے اسے کوئی روکنے والا نہیں اور جسے وہ بند کر دے اسے کوئی کھولنے والا نہیں (اس کے سوا) اور وہی ہے (سب پر) غالب نہایت ہی حکمت والا",
        "English" : "Whatever blessing Allah opens for the people, there is none to hold it back, and whatever He holds back, there is none to release it thereafter. He is the Mighty, the Wise."
      },
      {
        "ayet_no" : 3,
        "arbi" : "يٰٓاَيُّهَا النَّاسُ اذْكُرُوْا نِعْمَتَ اللّٰهِ عَلَيْكُمْ ۭ هَلْ مِنْ خَالِقٍ غَيْرُ اللّٰهِ يَرْزُقُكُمْ مِّنَ السَّمَاۗءِ وَالْاَرْضِ ۭ لَآ اِلٰهَ اِلَّا هُوَ ڮ فَاَنّٰى تُـؤْفَكُوْنَ",
        "Urdu" : "اے لوگوں یاد کرو تم اللہ کے ان (طرح طرح کے) احسانات کو جو اس نے تم پر فرمائے ہیں کیا اللہ کے سوا اور کوئی خالق ہے جو تمہیں رزق سے نوازتا ہو آسمان اور زمین سے کوئی بھی عبادت کے لائق نہیں سوائے اس (وحدہ لاشریک) کے پھر تم لوگ کہاں (اور کیسے) اوندھے ہوئے جا رہے ہو ؟ ف۱",
        "English" : "O mankind, remember Allah‘s blessing upon you. Is there any creator other than Allah who gives you provision from the sky and the earth? There is no god but He. So, to where are you being turned around (by your desires) ?"
      },
      {
        "ayet_no" : 4,
        "arbi" : "وَاِنْ يُّكَذِّبُوْكَ فَقَدْ كُذِّبَتْ رُسُلٌ مِّنْ قَبْلِكَ ۭ وَ اِلَى اللّٰهِ تُرْجَعُ الْاُمُوْرُ",
        "Urdu" : "اور اگر یہ لوگ جھٹلائیں آپ صلی اللہ علیہ وسلم کو (اے پیغمبر !) تو (یہ کوئی نئی بات نہیں کہ) بیشک جھٹلایا جا چکا ہے آپ صلی اللہ علیہ وسلم سے پہلے بھی بہت سے رسولوں کو اور اللہ ہی کی طرف لوٹائے جاتے ہیں (اور لوٹائے جائیں گے) سب کام",
        "English" : "(O Prophet,) if they reject you, (it is not something new, because) many messengers have been rejected before you. It is to Allah that all matters are to be referred."
      },
      {
        "ayet_no" : 5,
        "arbi" : "يٰٓاَيُّهَا النَّاسُ اِنَّ وَعْدَ اللّٰهِ حَقٌّ فَلَا تَغُرَّنَّكُمُ الْحَيٰوةُ الدُّنْيَا ۪ وَلَا يَغُرَّنَّكُمْ بِاللّٰهِ الْغَرُوْرُ",
        "Urdu" : "اے لوگوں بیشک اللہ کا وعدہ سچا ہے پس تم کو دھوکے میں نہ ڈالنے پائے دنیاوی زندگی (اور اس کی چمک دمک) اور تم کو دھوکے میں نہ ڈالنے پائے اللہ کے بارے میں وہ بڑا دھوکے باز ف۲",
        "English" : "O mankind, Allah‘s promise is definitely true, therefore, the worldly life must not deceive you, nor should you be deceived about Allah by the big deceiver (Satan)."
      },
      {
        "ayet_no" : 6,
        "arbi" : "اِنَّ الشَّيْطٰنَ لَكُمْ عَدُوٌّ فَاتَّخِذُوْهُ عَدُوًّا ۭ اِنَّمَا يَدْعُوْ احِزْبَهٗ لِيَكُوْنُوْا مِنْ اَصْحٰبِ السَّعِيْرِ",
        "Urdu" : "بلاشبہ شیطان دشمن ہے تم سب کا (اے لوگوں !) پس تم اس کو ہمیشہ اپنا دشمن ہی سمجھنا اس کا کام اس کے سوا کچھ نہیں کہ وہ بلاتا (اور دعوت دیتا) ہےاپنی پارٹی (اور اپنے یاروں) کو تاکہ وہ ہوجائیں (دوزخ کی دہکتی) بھڑکتی آگ کے یاروں میں سے",
        "English" : "Surely Shaitan (Satan) is an enemy for you. So, take him as an enemy. He only invites his group (to falsehood) so that they become inmates of the blazing fire."
      },
      {
        "ayet_no" : 7,
        "arbi" : "اَلَّذِيْنَ كَفَرُوْا لَهُمْ عَذَابٌ شَدِيْدٌ ڛ وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَهُمْ مَّغْفِرَةٌ وَّاَجْرٌ كَبِيْرٌ",
        "Urdu" : "جو لوگ اڑے رہے اپنے کفر (و باطل) پر ان کے لئے بڑا ہی سخت عذاب ہے اور جو ایمان لائے اور انہوں نے کام بھی نیک کئے انکے لئے عظیم الشان بخشش بھی ہے اور بہت بڑا اجر بھی",
        "English" : "Those who disbelieve will have a severe punishment; and those who believe and do righteous deeds will have forgiveness and a great reward."
      },
      {
        "ayet_no" : 8,
        "arbi" : "اَفَمَنْ زُيِّنَ لَهٗ سُوْۗءُ عَمَلِهٖ فَرَاٰهُ حَسَـنًا ۭ فَاِنَّ اللّٰهَ يُضِلُّ مَنْ يَّشَاۗءُ وَيَهْدِيْ مَنْ يَّشَاۗءُ ڮ فَلَا تَذْهَبْ نَفْسُكَ عَلَيْهِمْ حَسَرٰتٍ ۭ اِنَّ اللّٰهَ عَلِـيْمٌۢ بِمَا يَصْنَعُوْنَ",
        "Urdu" : "بھلا (اس شخص کی محرومی اور بدبختی کا کوئی ٹھکانا ہو سکتا ہے؟) جس کیلئے خوشنما بنا دیا گیا ہو اس کے برے عمل کو (اس کیاپنی بد نیتی اور سوء اختیار کی بناء پر) جس سے وہ اس کو اچھا ہی سمجھے جا رہا ہو؟ سو اللہ گمراہی (کے گڑھے) میں ڈالتا ہے جس کو چاہتا ہے اور (نور حق و) ہدایت سے نوازتا ہے جس کو چاہتا ہے پس گھلنے نہ پائے آپ کی جان (عزیز اے پیغمبر !) ان (بدبختوں کی حرمان نصیبی) پر افسوس کرتے ہوئے بیشک اللہ پوری طرح جانتا ہے ان سب کاموں کو جو یہ لوگ کر رہے ہیں",
        "English" : "Then, can the one whose evil deed is so much adorned for him that he deems it really good (be equal to the one who differentiates between good and evil)? The fact, therefore, is that Allah lets go astray whomsoever He wills, and leads to the right path whomsoever He wills. So, (O Prophet,) let not your soul collapse in grief for them. Surely Allah knows well what they are doing."
      },
      {
        "ayet_no" : 9,
        "arbi" : "وَاللّٰهُ الَّذِيْٓ اَرْسَلَ الرِّيٰحَ فَتُـثِيْرُ سَحَابًا فَسُقْنٰهُ اِلٰى بَلَدٍ مَّيِّتٍ فَاَحْيَيْنَا بِهِ الْاَرْضَ بَعْدَ مَوْتِهَا ۭ كَذٰلِكَ النُّشُوْرُ",
        "Urdu" : "اور اللہ وہی تو ہے جو بھیجتا ہے ہواؤں کو (اپنی قدرت کاملہ اور رحمت شاملہ سے) پھر وہ اٹھاتی ہیں بادل کو پھر اس کو ہم ہانک دیتے ہیں کسی مردہ زمین کی طرف پھر اس کے ذریعے ہم زندہ کر دیتے ہیں زمین کو اس کے بعد کہ وہ مر چکی ہوتی ہے اسی طرح ہوگا دوبارہ اٹھایا جانا",
        "English" : "Allah is the One who sends the winds, then they raise up the clouds, then We drive them to a dead land and revive the land through them after its death. In similar way shall be the Resurrection."
      },
      {
        "ayet_no" : 10,
        "arbi" : "مَنْ كَانَ يُرِيْدُ الْعِزَّةَ فَلِلّٰهِ الْعِزَّةُ جَمِيْعًا ۭاِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وَالْعَمَلُ الصَّالِحُ يَرْفَعُهٗ ۭ وَالَّذِيْنَ يَمْكُرُوْنَ السَيِّاٰتِ لَهُمْ عَذَابٌ شَدِيْدٌ ۭ وَمَكْرُ اُولٰۗىِٕكَ هُوَ يَبُوْرُ",
        "Urdu" : "جو کوئی عزت چاہتا ہو تو (وہ جان لے کہ) عزت تو سب اللہ ہی کے پاس ہے اسی کی طرف چڑھتے ہیں پاکیزہ کلمات اور عمل صالح اس کو اوپر اٹھاتا ہے اور جو لوگ بری چالیں چلتے ہیں (حق کے مقابلے میں) ان کیلئے بڑا سخت عذاب ہے اور ان کی یہ چال بازیاں خود نابود ہو کر رہیں گی ف۱",
        "English" : "Whoever desires honor, then all honor lies with Allah alone. Towards Him ascends the pure word, and the righteous deed uplifts it. As for those who plot evils, for them there is a severe punishment, and their plot itself will perish."
      },
      {
        "ayet_no" : 11,
        "arbi" : "وَاللّٰهُ خَلَقَكُمْ مِّنْ تُرَابٍ ثُمَّ مِنْ نُّطْفَةٍ ثُمَّ جَعَلَكُمْ اَزْوَاجًا ۭ وَمَا تَحْمِلُ مِنْ اُنْـثٰى وَلَا تَضَعُ اِلَّا بِعِلْمِهٖ ۭ وَمَا يُعَمَّرُ مِنْ مُّعَمَّرٍ وَّلَا يُنْقَصُ مِنْ عُمُرِهٖٓ اِلَّا فِيْ كِتٰبٍ ۭ اِنَّ ذٰلِكَ عَلَي اللّٰهِ يَسِيْرٌ",
        "Urdu" : "اور اللہ ہی نے پیدا فرمایا تم سب کو (اے لوگوں !) مٹی سے پھر نطفہ سے پھر اس نے تمہیں کر دیا جوڑے جوڑے اور (اس کے علم کا یہ عالم ہے کہ) نہ کوئی مادہ حاملہ ہوتی ہے اور نہ بچہ جنتی ہے مگر یہ سب کچھ اسکے علم میں ہوتا ہے اور (اسی طرح) نہ کوئی عمر پاتا ہے عمر پانے والا اور نہ کچھ کم کیا جاتا ہے اس کی عمر میں سے مگر یہ کہ یہ سب کچھ (ثبت و مندرج) ہے ایک عظیم الشان کتاب میں بلاشبہ یہ سب کچھ اللہ کے لیے بہت آسان ہے",
        "English" : "Allah has created you from dust, then from a drop of semen, then He made you couples. No female conceives (a baby) nor gives birth (to it) without His knowledge; and no aged person is made to advance in age, nor is a part curtailed from his age, but all this is (recorded) in a book. Surely all this is easy for Allah."
      },
      {
        "ayet_no" : 12,
        "arbi" : "وَمَا يَسْتَوِي الْبَحْرٰنِ ڰ ھٰذَا عَذْبٌ فُرَاتٌ سَاۗىِٕــغٌ شَرَابُهٗ وَھٰذَا مِلْحٌ اُجَاجٌ ۭ وَمِنْ كُلٍّ تَاْكُلُوْنَ لَحـْـمًا طَرِيًّا وَّتَسْتَخْرِجُوْنَ حِلْيَةً تَلْبَسُوْنَهَا ۚ وَتَرَى الْفُلْكَ فِيْهِ مَوَاخِرَ لِتَبْتَغُوْا مِنْ فَضْلِهٖ وَلَعَلَّكُمْ تَشْكُرُوْنَ",
        "Urdu" : "اور برابر نہیں ہو سکتے پانی کے یہ دونوں عظیم الشان ذخیرے ایک تو میٹھا پیاس بجھانے والا اور خوشگوار (و لذیذ) ہے پینے میں اور دوسرا سخت کھاری حلق چھیل دینے والا اور ہر ایک سے تم لوگ تازہ گوشت بھی کھاتے ہو اور وہ زیور بھی نکالتے ہو جس کو تم پہنتے ہو اور اسی پانی میں تم وہ (دیو پیکر) جہاز بھی چلتے دیکھتے ہو جو اس کو چیرتے ہوئے جاتے ہیں تاکہ تم لوگ تلاش کر سکو اس کے فضل سے (اپنی روزی) اور تاکہ تم شکر گزار بنو",
        "English" : "And two seas are not alike; this one is sweet, saturating, pleasant to drink, and that one is salt, bitter. But from each, you eat fresh meat, and derive ornaments that you wear. And you see the boats therein cleaving through water, so that you may search for His grace, and that you may be grateful."
      },
      {
        "ayet_no" : 13,
        "arbi" : "يُوْلِجُ الَّيْلَ فِي النَّهَارِ وَيُوْلِجُ النَّهَارَ فِي الَّيْلِ ۙ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ ڮ كُلٌّ يَّجْرِيْ لِاَجَلٍ مُّسَمًّى ۭ ذٰلِكُمُ اللّٰهُ رَبُّكُمْ لَهُ الْمُلْكُ ۭ وَالَّذِيْنَ تَدْعُوْنَ مِنْ دُوْنِهٖ مَا يَمْلِكُوْنَ مِنْ قِطْمِيْرٍ",
        "Urdu" : "وہ داخل کرتا ہے (حد درجہ پابندی اور باریکی کے ساتھ) رات کو دن میں اور دن کو رات میں اور اسی نے کام میں لگا رکھا ہے سورج اور چاند (کے ان دو عظیم الشان کُرُّوں) کو ہر ایک چلے جا رہا ہے (پوری پابندی کے ساتھ) ایک وقت مقرر تک یہ ہے اللہ رب تم سب کا (اے دنیا جہاں کے انسانو !) اسی کے لئے ہے بادشاہی اور اس کے سوا جن کو تم لوگ (پوجتے) پکارتے ہو وہ گھٹلی کے چھلکے تک کے بھی مالک نہیں ف۱",
        "English" : "He makes the night enter into the day and makes the day enter into the night, and He has subjugated the sun and the moon; each one of them is running towards an appointed time. That is Allah, your Lord. To Him belongs the kingdom. And those whom you invoke beside Him do not own even the membrane on a date-stone."
      },
      {
        "ayet_no" : 14,
        "arbi" : "اِنْ تَدْعُوْهُمْ لَا يَسْمَعُوْا دُعَاۗءَكُمْ ۚ وَلَوْ سَمِعُوْا مَا اسْتَجَابُوْا لَكُمْ ۭ وَيَوْمَ الْقِيٰمَةِ يَكْفُرُوْنَ بِشِرْكِكُمْ ۭ وَلَا يُنَبِّئُكَ مِثْلُ خَبِيْرٍ",
        "Urdu" : "اگر تم ان کو پکارو تو وہ تمہاری پکار کو سن نہیں سکتے اور اگر (بالفرض) سن بھی لیں تو وہ تمہاری پکار کا کوئی جواب نہیں دے سکتے اور قیامت کے روز وہ صاف طور پر انکار کر دیں گے تمہارے اس شرک کا اور تم کو کوئی خبر نہیں دے سکے گا (حق اور حقیقت کے بارے میں) ایک انتہائی باخبر ہستی کی طرح",
        "English" : "If you call Unto them, they hear not your calling, and even if they heard, they could not answer you. On the Day of Judgment they will deny your associating. And none can declare Unto thee the truth like Him who is Aware."
      },
      {
        "ayet_no" : 15,
        "arbi" : "يٰٓاَيُّهَا النَّاسُ اَنْتُمُ الْفُقَرَاۗءُ اِلَى اللّٰهِ ۚ وَاللّٰهُ هُوَ الْغَنِيُّ الْحَمِيْدُ",
        "Urdu" : "اے لوگوں تم سب محتاج ہو اللہ کے اور اللہ ہی ہے جو ہر طرح سے بےنیاز ہر تعریف کا حق دار ہے",
        "English" : "O mankind! it is you who stand in need of Allah, but Allah is Rich (Free of all wants and needs), Worthy of all praise."
      },
      {
        "ayet_no" : 16,
        "arbi" : "اِنْ يَّشَاْ يُذْهِبْكُمْ وَيَاْتِ بِخَلْقٍ جَدِيْدٍ",
        "Urdu" : "وہ اگر چاہے تو لے جائے تم سب کو اور لا بسائے تمہاری جگہ کسی اور نئی مخلوق کو",
        "English" : "If He so wills, He can do away with you and bring a new creation."
      },
      {
        "ayet_no" : 17,
        "arbi" : "وَمَا ذٰلِكَ عَلَي اللّٰهِ بِعَزِيْزٍ",
        "Urdu" : "اور ایسا کرنا اللہ کے لئے کچھ بھی دشوار نہیں ف۲",
        "English" : "For Allah, that is not something difficult."
      },
      {
        "ayet_no" : 18,
        "arbi" : "وَلَا تَزِرُ وَازِرَةٌ وِّزْرَ اُخْرٰى ۭ وَاِنْ تَدْعُ مُثْقَلَةٌ اِلٰى حِمْلِهَا لَا يُحْمَلْ مِنْهُ شَيْءٌ وَّلَوْ كَانَ ذَا قُرْبٰى ۭ اِنَّمَا تُنْذِرُ الَّذِيْنَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ وَاَقَامُوا الصَّلٰوةَ ۭ وَمَنْ تَزَكّٰى فَاِنَّمَا يَتَزَكّٰى لِنَفْسِهٖ ۭ وَاِلَى اللّٰهِ الْمَصِيْرُ",
        "Urdu" : "اور کوئی بوجھ اٹھانے والا کسی دوسرے کا بوجھ نہیں اٹھائے گا اور اگر کوئی ( گناہ کا) بوجھ لدا ہوا شخص اپنا بوجھ اٹھانے کے لئے کسی کو پکارے گا بھی تب بھی اس کے بوجھ کا کچھ بھی حصہ اٹھانے کیلئے کوئی تیار نہ ہوگا اگرچہ وہ اس کا کوئی (قریبی) رشتہ دار ہی کیوں نہ ہو آپ کے خبردار کرنے کا اثر تو انہی لوگوں پر ہو سکتا ہے جو ڈرتے ہیں اپنے رب سے بن دیکھے اور وہ نماز قائم کرتے ہیں اور جو کوئی پاکی اختیار کرے گا تو وہ اپنے ہی لئے کرے گا اور اللہ ہی کی طرف لوٹنا ہے (سب کو)",
        "English" : "No bearer will bear the burden of any other person. If a person carrying a heavy load calls (someone) to (share) his load, nothing from it shall be carried (by the latter), even though he be a near of kin. You can warn only those who fear their Lord, while He is unseen, and establish Salah. Whoever gets purified gets purified for his own benefit. And to Allah is the final return."
      },
      {
        "ayet_no" : 19,
        "arbi" : "وَمَا يَسْتَوِي الْاَعْمٰى وَالْبَصِيْرُ",
        "Urdu" : "اور آ پس میں برابر نہیں ہو سکتے اندھا اور انکھوں والا",
        "English" : "Not a like are the blind and the seeing."
      },
      {
        "ayet_no" : 20,
        "arbi" : "وَلَا الظُّلُمٰتُ وَلَا النُّوْرُ",
        "Urdu" : "اور نہ ہی اندھیرے اور روشنی",
        "English" : "Nor are (alike) the darkness (disbelief) and the light (Belief in Islmic Monotheism)."
      },
      {
        "ayet_no" : 21,
        "arbi" : "وَلَا الظِّلُّ وَلَا الْحَــرُوْرُ",
        "Urdu" : "اور نہ ہی سایہ اور دھوپ کی تپش",
        "English" : "Nor are (alike) the shade and the sun's heat."
      },
      {
        "ayet_no" : 22,
        "arbi" : "وَمَا يَسْتَوِي الْاَحْيَاۗءُ وَلَا الْاَمْوَاتُ ۭ اِنَّ اللّٰهَ يُسْمِعُ مَنْ يَّشَاۗءُ ۚ وَمَآ اَنْتَ بِمُسْمِعٍ مَّنْ فِي الْقُبُوْرِ",
        "Urdu" : "اور نہ ہی برابر ہو سکتے ہیں زندے اور مردے بلاشبہ اللہ سناتا ہے جسے چاہتا ہے اور آپ (اے پیغمبر !) ان لوگوں کو نہیں سنا سکتے جو قبروں میں (پڑے) ہیں ف۱",
        "English" : "And the living and the dead are not alike. Allah makes to hear whomsoever He wills. And you cannot make to hear those who are in the graves."
      },
      {
        "ayet_no" : 23,
        "arbi" : "اِنْ اَنْتَ اِلَّا نَذِيْرٌ",
        "Urdu" : "آپ کا کام تو بس خبردار کر دینا ہے (برے انجام سے)",
        "English" : "You are but a warner."
      },
      {
        "ayet_no" : 24,
        "arbi" : "اِنَّآ اَرْسَلْنٰكَ بِالْحَقِّ بَشِيْرًا وَّنَذِيْرًا ۭ وَاِنْ مِّنْ اُمَّةٍ اِلَّا خَلَا فِيْهَا نَذِيْرٌ",
        "Urdu" : "بلاشبہ ہم نے بھیجا آپ کو حق کے ساتھ خوشخبری دینے والا اور خبردار کرنے والا بنا کر (سب لوگوں کے لئے) حق کے ساتھ اور کوئی امت ایسی نہیں ہوئی جس میں کوئی نہ کوئی خبردار کرنے والا نہ گزرا ہو ۔",
        "English" : "Surely We have sent you with truth as a bearer of good news and as a warner, and there was no community without a warner having passed among them."
      },
      {
        "ayet_no" : 25,
        "arbi" : "وَاِنْ يُّكَذِّبُوْكَ فَقَدْ كَذَّبَ الَّذِيْنَ مِنْ قَبْلِهِمْ ۚ جَاۗءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنٰتِ وَبِالزُّبُرِ وَبِالْكِتٰبِ الْمُنِيْرِ",
        "Urdu" : "اگر یہ لوگ آپ صلی اللہ علیہ وسلم کی تکذیب کریں تو (یہ کوئی نئی اور انوکھی بات نہیں کہ) ان سے پہلے گزرے ہوئے لوگ بھی جھٹلا چکے ہیں (حق اور حقیقت کو) ان کے پاس بھی ان کے رسول آئے کھلے دلائل صحیفے اور روشنی بخشنے والی کتابیں لے کر ف۲",
        "English" : "If they reject you, (it is not something new, because) those before them have (also) rejected (messengers). Their messengers came to them with clear proofs and with scriptures and with the enlightening book."
      },
      {
        "ayet_no" : 26,
        "arbi" : "ثُمَّ اَخَذْتُ الَّذِيْنَ كَفَرُوْا فَكَيْفَ كَانَ نَكِيْرِ",
        "Urdu" : "مگر ان کی قوموں نے ان کو جھٹلایا پھر آخرکار میں نے پکڑا ان لوگوں کو جو اڑے رہے تھے اپنے کفر (و باطل) پر سو دیکھو کیسا تھا میرا عذاب",
        "English" : "In the end did I punish those who rejected Faith: and how (terrible) was My rejection (of them)!"
      },
      {
        "ayet_no" : 27,
        "arbi" : "اَلَمْ تَرَ اَنَّ اللّٰهَ اَنْزَلَ مِنَ السَّمَاۗءِ مَاۗءً ۚ فَاَخْرَجْنَا بِهٖ ثَمَرٰتٍ مُّخْتَلِفًا اَلْوَانُهَا ۭوَمِنَ الْجِبَالِ جُدَدٌۢ بِيْضٌ وَّحُمْرٌ مُّخْتَلِفٌ اَلْوَانُهَا وَغَرَابِيْبُ سُوْدٌ",
        "Urdu" : "کیا تم نے کبھی اس پر غور نہیں کیا کہ اللہ (کس طرح) اتارتا ہے آسمان سے پانی پھر اس کے ذریعے ہم نکالتے ہیں طرح طرح کے پھل (اور قسما قسم کی پیداواریں) جنکے مختلف رنگ ہوتے ہیں اور پہاڑوں کے بھی مختلف حصے ہیں سفید اور سرخ پھر ان میں بھی مختلف رنگوں والے اور بالکل سیاہ کالے (بھجنگے) بھی",
        "English" : "Did you not see that Allah has sent down water from the sky? Then We brought forth with it fruits having different colours. And among the mountains there are tracks, white and red— of different colours, and ( others) utterly black."
      },
      {
        "ayet_no" : 28,
        "arbi" : "وَمِنَ النَّاسِ وَالدَّوَاۗبِّ وَالْاَنْعَامِ مُخْتَلِفٌ اَلْوَانُهٗ كَذٰلِكَ ۭ اِنَّمَا يَخْشَى اللّٰهَ مِنْ عِبَادِهِ الْعُلَمٰۗؤُا ۭاِنَّ اللّٰهَ عَزِيْزٌ غَفُوْرٌ",
        "Urdu" : "اور انسانوں جانورں اور چوپایوں کے بھی اسی طرح مختلف رنگ ہیں اللہ سے تو اس کے وہی بندے ڈرتے ہیں جو علم رکھتے ہیں (حق اور حقیقت کا) بلاشبہ اللہ نہایت ہی زبردست بڑا ہی بخشنے والا ہے",
        "English" : "And among humans and beasts and cattle, there are those having different colours as well. Only those of His slaves fear Allah who are knowledgeable. Surely Allah is Mighty, Forgiving."
      },
      {
        "ayet_no" : 29,
        "arbi" : "اِنَّ الَّذِيْنَ يَتْلُوْنَ كِتٰبَ اللّٰهِ وَاَقَامُوا الصَّلٰوةَ وَاَنْفَقُوْا مِمَّا رَزَقْنٰهُمْ سِرًّا وَّعَلَانِيَةً يَّرْجُوْنَ تِجَارَةً لَّنْ تَـبُوْرَ",
        "Urdu" : "جو لوگ (صدق دل سے) پڑھتے ہیں اللہ کی کتاب اور وہ نماز قائم کرتے ہیں اور جو کچھ ہم نے انہیں دیا ہوتا ہے اس میں سے وہ خرچ کرتے ہیں (ہماری رضا کے لئے) پوشیدہ طور پر بھی اور کھلے عام بھی وہ بلاشبہ امید رکھتے ہیں ایک ایسی عظیم الشان تجارت کی جس میں ہرگز کوئی خسارہ نہیں ف۱",
        "English" : "Verily those Who read the book of Allah and establish prayer and expend of that wherewith We have provided them, secretly and in open, hope for a merchandise that shall not perish."
      },
      {
        "ayet_no" : 30,
        "arbi" : "لِيُوَفِّيَهُمْ اُجُوْرَهُمْ وَيَزِيْدَهُمْ مِّنْ فَضْلِهٖ ۭ اِنَّهٗ غَفُوْرٌ شَكُوْرٌ",
        "Urdu" : "تاکہ اللہ پورے پورے دے ان کو ان کے اجر اور ان کو نوازے اپنے مذید فضل (و کرم) سے بیشک وہ بڑا ہی بخشنے والا انتہائی قدر دان ہے",
        "English" : "So that He pays them their rewards in full, and gives them more out of His grace. Surely He is Most-Forgiving, Very-Appreciative."
      },
      {
        "ayet_no" : 31,
        "arbi" : "وَالَّذِيْٓ اَوْحَيْنَآ اِلَيْكَ مِنَ الْكِتٰبِ هُوَ الْحَــقُّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ ۭ اِنَّ اللّٰهَ بِعِبَادِهٖ لَخَبِيْرٌۢ بَصِيْرٌ",
        "Urdu" : "اور جو کتاب ہم نے آپ کی طرف وحی کے ذریعے بھیجی ہے (اے پیغمبر !) وہی حق ہے جو تصدیق کرنے والی ہے ان تمام کتابوں کی جو کہ آچکی ہیں اس سے پہلے بلاشبہ اللہ اپنے بندوں سے پوری طرح باخبر سب کچھ دیکھتا ہے",
        "English" : "The Book We have revealed to you is the Truth, confirming what was (revealed) before it. Surely Allah, in respect of His slaves, is All-Aware, All-Seeing."
      },
      {
        "ayet_no" : 32,
        "arbi" : "ثُمَّ اَوْرَثْنَا الْكِتٰبَ الَّذِيْنَ اصْطَفَيْنَا مِنْ عِبَادِنَا ۚ فَمِنْهُمْ ظَالِمٌ لِّنَفْسِهٖ ۚ وَمِنْهُمْ مُّقْتَصِدٌ ۚ وَمِنْهُمْ سَابِقٌۢ بِالْخَــيْرٰتِ بِاِذْنِ اللّٰهِ ۭ ذٰلِكَ هُوَ الْــفَضْلُ الْكَبِيْرُ",
        "Urdu" : "پھر ہم نےاپنی اس کتاب کا وارث بنا دیا ان لوگوں کو جن کو ہم نے چن لیا تھا (اس شرف کیلئے) اپنے بندوں میں سے پھر ان میں سے کوئی تو ظلم ڈھانے والا ہے خوداپنی جان پر کوئی میانہ رو ہے اور کوئی سبقت لیجانے والا ہے نی کیوں میں اس کے اذن (و عنایت) سے یہی ہے بڑا فضل",
        "English" : "Thereafter We made inheritors of the book those whom We chose of Our bondmen. Then of them are some who wrong themselves, and of them are some who keep the middle way, and of them are some who, by Allah's leave, go ahead in virtues. That! that is a great grace."
      },
      {
        "ayet_no" : 33,
        "arbi" : "جَنّٰتُ عَدْنٍ يَّدْخُلُوْنَهَا يُحَلَّوْنَ فِيْهَا مِنْ اَسَاوِرَ مِنْ ذَهَبٍ وَّلُــؤْلُــؤًا ۚ وَلِبَاسُهُمْ فِيْهَا حَرِيْرٌ",
        "Urdu" : "یعنی ہمیشہ رہنے کی وہ جنتیں جن میں یہ لوگ داخل ہوں گے وہاں ان کو آراستہ کیا جائے گا سونے کے کنگنوں سے اور عظیم الشان موتیوں سے اور لباس ان کا وہاں پر ریشم ہوگا",
        "English" : "Gardens of eternity they enter. They will be ornamented with bracelets of gold and with pearls, and their dress therein will be (of) silk."
      },
      {
        "ayet_no" : 34,
        "arbi" : "وَقَالُوا الْحـَمْدُ لِلّٰهِ الَّذِيْٓ اَذْهَبَ عَنَّا الْحَزَنَ ۭ اِنَّ رَبَّنَا لَغَفُوْرٌ شَكُوْرُۨ",
        "Urdu" : "اور یہ (خوش نصیب) لوگ (خوشیوں میں جھوم جھوم کر) کہیں گے کہ شکر ہے اس اللہ کا جس نے دور کر دیا ہم سے غم (اور ہر قسم کا فکر) بلاشبہ ہمارا رب بڑا ہی بخشنے والا انتہائی قدر داں ہے ف۲",
        "English" : "And they will Say: all praise Unto Allah who hath taken away grief from us. verily, our Lord is Forgiving, Appreciative."
      },
      {
        "ayet_no" : 35,
        "arbi" : "الَّذِيْٓ اَحَلَّنَا دَارَ الْمُقَامَةِ مِنْ فَضْلِهٖ ۚ لَا يَمَسُّنَا فِيْهَا نَصَبٌ وَّلَا يَمَسُّنَا فِيْهَا لُغُوْبٌ",
        "Urdu" : "جس نے اتار دیا ہمیں اپنے فضل (و کرم) سے سدا رہنے کی اس (عظیم الشان) جگہ میں جس میں ہمیں نہ کوئی تکلیف لاحق ہوتی ہے اور نہ کوئی تھکان",
        "English" : "Who hath, through His grace, lodged us in the abode of permanence, wherein there will not touch us tall, and wherein there will not touch us weariness."
      },
      {
        "ayet_no" : 36,
        "arbi" : "وَالَّذِيْنَ كَفَرُوْا لَهُمْ نَارُ جَهَنَّمَ ۚ لَا يُقْضٰى عَلَيْهِمْ فَيَمُوْتُوْا وَلَا يُخَـفَّفُ عَنْهُمْ مِّنْ عَذَابِهَا ۭ كَذٰلِكَ نَجْزِيْ كُلَّ كَفُوْرٍ",
        "Urdu" : "اور اس کے برعکس جو لوگ اڑے رہے ہوں گے اپنے کفر (و باطل) پر ان کے لئے جہنم کی آگ ہے نہ تو ان پر قضاء آئے گی کہ وہ مر ہی جائیں اور نہ ہی کسی طرح ان سے اس کے عذاب میں کوئی تخفیف کی جائے گی (کہ کچھ آرام پا سکیں) اسی طرح ہم بدلہ دیتے ہیں (اور دیں گے) ہر بڑے ناشکرے (کافر) کو",
        "English" : "And those who disbelieve-for them shall be Hell-Fire. It shall not be decreed to them that they should die, nor shall the torment thereof be lightened for them. Thus We requite Every ingrate."
      },
      {
        "ayet_no" : 37,
        "arbi" : "وَهُمْ يَصْطَرِخُوْنَ فِيْهَا ۚ رَبَّنَآ اَخْرِجْنَا نَعْمَلْ صَالِحًا غَيْرَ الَّذِيْ كُنَّا نَعْمَلُ ۭ اَوَلَمْ نُعَمِّرْكُمْ مَّا يَتَذَكَّرُ فِيْهِ مَنْ تَذَكَّرَ وَجَاۗءَكُمُ النَّذِيْرُ ۭ فَذُوْقُوْا فَمَا لِلظّٰلِمِيْنَ مِنْ نَّصِيْرٍ",
        "Urdu" : "اور وہ اس میں چیخ چیخ کر کہہ رہے ہوں گے کہ اے ہمارے رب ہمیں (ایک بار) نکال دے اس سے تاکہ ہم نیک کام کریں ان کاموں کے خلاف جو کہ ہم (اس سے پہلے) کرتے رہے تھے (جواب ملے گا) کیا ہم نے تمہیں اتنی عمر نہیں دی تھی کہ اس میں سبق لے لیتا جس نے سبق لینا ہوتا اور پہنچ چکا تھا تمہارے پاس ہماری طرف سے خبردار کرنے والا؟ پس اب تم لوگ مزہ چکھتے رہو (اپنے کئے کا) سو ظالموں کے لئے کوئی مددگار نہیں ف۱",
        "English" : "And they will be crying therein, :Our Lord, take us out (from here), and we will act righteously, not in the way we have been doing before. (Allah will say to them,) :Did We not give you an age in your life in which lesson could have been learnt by the one who wished to take lesson? And (furthermore) the warner had (also) come to you. So, have a taste, because the wrongdoers will have no supporter."
      },
      {
        "ayet_no" : 38,
        "arbi" : "اِنَّ اللّٰهَ عٰلِمُ غَيْبِ السَّمٰوٰتِ وَالْاَرْضِ ۭ اِنَّهٗ عَلِـيْمٌۢ بِذَاتِ الصُّدُوْرِ",
        "Urdu" : "بلاشبہ اللہ ہی ہے جاننے والا آسمانوں اور زمین کے غیب کا بلاشبہ وہ پوری طرح جانتا ہے سینوں کے بھیدوں کو ف۲",
        "English" : "Surely Allah is the Knower of the unseen in the heavens and the earth. Indeed He fully knows what lies in the hearts."
      },
      {
        "ayet_no" : 39,
        "arbi" : "هُوَ الَّذِيْ جَعَلَكُمْ خَلٰۗىِٕفَ فِي الْاَرْضِ ۭ فَمَنْ كَفَرَ فَعَلَيْهِ كُفْرُهٗ ۭ وَلَا يَزِيْدُ الْكٰفِرِيْنَ كُفْرُهُمْ عِنْدَ رَبِّهِمْ اِلَّا مَقْتًا ۚ وَلَا يَزِيْدُ الْكٰفِرِيْنَ كُفْرُهُمْ اِلَّا خَسَارًا",
        "Urdu" : "وہ وہی ہے جس نے تم لوگوں کو خلیفہ (اور جانشین) بنایااپنی زمین میں سو جس نے کفر کیا تو اس کے کفر کا وبال خود اسی پر ہوگا اور کافروں کا کفر ان کے رب کے یہاں ناراضگی ہی میں اضافہ کرتا ہے اور کافروں کے لئے ان کا کفر خسارے (اور گھاٹے) ہی میں اضافے کا باعث ہوتا ہے ف۳",
        "English" : "He is the One who has made you successors (of the past generations) on the earth. So the one who becomes infidel, his infidelity will go against himself. Their infidelity adds nothing to the infidels but anger from their Lord, and their infidelity adds nothing to the infidels but loss."
      },
      {
        "ayet_no" : 40,
        "arbi" : "قُلْ اَرَءَيْتُمْ شُرَكَاۗءَكُمُ الَّذِيْنَ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ ۭ اَرُوْنِيْ مَاذَا خَلَقُوْا مِنَ الْاَرْضِ اَمْ لَهُمْ شِرْكٌ فِي السَّمٰوٰتِ ۚ اَمْ اٰتَيْنٰهُمْ كِتٰبًا فَهُمْ عَلٰي بَيِّنَةٍ مِّنْهُ ۚ بَلْ اِنْ يَّعِدُ الظّٰلِمُوْنَ بَعْضُهُمْ بَعْضًا اِلَّا غُرُوْرًا",
        "Urdu" : "(ان سے) کہو کہ کیا تم لوگوں نے کبھی غور ( نہیں) کیا اپنے ان خود ساختہ شریکوں کے بارے میں؟ جن کو تم لوگ (پوجتے) پکارتے ہو اللہ (وحدہ لاشریک) کے سوا؟ مجھے دکھاؤ (اور بتاؤ) تو سہی کہ انہوں نے کیا پیدا کیا زمین میں سے یا ان کا کوئی حصہ ہے آسمانوں میں؟ یا ہم نے ان کو کوئی ایسی کتاب دے رکھی ہے جس کی بناء پر یہ لوگ کسی کھلی سند پر قائم ہوں؟ (کچھ بھی نہیں) بلکہ ظالم لوگ ایک دوسرے کو محض دھوکے (کے جھانسے) دئیے چلے جا رہے ہیں",
        "English" : "Say, :Tell me about your (presumed) co-gods whom you invoke beside Allah. Show me that part of the earth that they have created. Or do they have a share in the (creation) of the heavens? Or have We given them a book so that they are upon a clear proof from it? No, but the wrongdoers promise one another nothing but delusion."
      },
      {
        "ayet_no" : 41,
        "arbi" : "اِنَّ اللّٰهَ يُمْسِكُ السَّمٰوٰتِ وَالْاَرْضَ اَنْ تَزُوْلَا ڬ وَلَىِٕنْ زَالَتَآ اِنْ اَمْسَكَـهُمَا مِنْ اَحَدٍ مِّنْۢ بَعْدِهٖ ۭاِنَّهٗ كَانَ حَلِــيْمًا غَفُوْرًا",
        "Urdu" : "بلاشبہ اللہ ہی نے روک (اور تھام) رکھا ہے آسمانوں اور زمین (کی اس عظیم الشان کائنات) کو اس سے کہ یہ دونوں ٹل جائیںاپنیاپنی جگہ سے اور اگر کبھی یہ ٹل جائیں تو پھر کون ہے جو ان کو روک سکے اس کے بعد؟ بیشک وہ بڑا ہی بردبار نہایت ہی (درگزر اور) معاف کرنے والا ہے ف۱",
        "English" : "Undoubtedly, Allah holds back the heavens and the earth from leaving their existing state, and if they were to leave, there is none who can hold them back, except Him. Surely He is Forbearing, Most-Forgiving."
      },
      {
        "ayet_no" : 42,
        "arbi" : "وَاَقْسَمُوْا بِاللّٰهِ جَهْدَ اَيْمَانِهِمْ لَىِٕنْ جَاۗءَهُمْ نَذِيْرٌ لَّيَكُوْنُنَّ اَهْدٰى مِنْ اِحْدَى الْاُمَمِ ۚ فَلَمَّا جَاۗءَهُمْ نَذِيْرٌ مَّا زَادَهُمْ اِلَّا نُفُوْرَۨا",
        "Urdu" : "اور یہ لوگ تو بڑی زور دار قسمیں کھا (کر کہا کرتے) تھے کہ اگر ان کے پاس کوئی خبردار کرنے والا آگیا تو یہ ضرور بالضرور دوسری ہر امت سے بڑھ کر راست رو ہونگے مگر جب آپہنچا ان کے پاس ایک عظیم الشان خبردار کرنے والا تو اس کی آمد (اور تشریف آوری) سے ان کی نفرت (اور حق سے فرار) ہی میں اضافہ ہوا ف۲",
        "English" : "They swore their strongest oaths by Allah that if a warner came to them, they would follow his guidance better than any (other) of the Peoples: But when a warner came to them, it has only increased their flight (from righteousness),-"
      },
      {
        "ayet_no" : 43,
        "arbi" : " اسْـتِكْبَارًا فِي الْاَرْضِ وَمَكْرَ السَّــﮧ ۭ وَلَا يَحِيْقُ الْمَكْرُ السَّيِّئُ اِلَّا بِاَهْلِهٖ ۭۭ فَهَلْ يَنْظُرُوْنَ اِلَّا سُنَّتَ الْاَوَّلِيْنَ ۚ فَلَنْ تَجِدَ لِسُنَّتِ اللّٰهِ تَبْدِيْلًا ڬ وَلَنْ تَجِدَ لِسُنَّتِ اللّٰهِ تَحْوِيْلًا",
        "Urdu" : "اپنی بڑائی کے گھمنڈ کی بناء پر (اللہ کی) اس زمین میں اوراپنی بری چالوں کے نتیجے میں اور بری چالیں اپنے چلنے والوں ہی کو گھیر کر (اور پھانس کر) رہتی ہیں تو کیا یہ لوگ اب اسی برتاؤ (اور انجام) کے منتظر ہیں جو ان سے پہلے لوگوں کے ساتھ ہو چکا ہے؟ تو تم ہرگز اللہ کے قانون میں کوئی تبدیلی نہ پاؤ گے اور تم ہرگز اللہ کے قانون میں کوئی تبدیلی نہ پاؤ گے ف۳",
        "English" : "Because of their showing arrogance in the land and plotting of evil. And the evil plot engulfs none but its own people (who make it). So, they are looking for nothing but the (divine) practice with the earlier people. So you will never find in Allah‘s practice any change, and you will never find in Allah‘s practice any diversion."
      },
      {
        "ayet_no" : 44,
        "arbi" : "اَوَلَمْ يَسِيْرُوْا فِي الْاَرْضِ فَيَنْظُرُوْا كَيْفَ كَانَ عَاقِبَةُ الَّذِيْنَ مِنْ قَبْلِهِمْ وَكَانُوْٓا اَشَدَّ مِنْهُمْ قُوَّةً ۭ وَمَا كَانَ اللّٰهُ لِيُعْجِزَهٗ مِنْ شَيْءٍ فِي السَّمٰوٰتِ وَلَا فِي الْاَرْضِ ۭ اِنَّهٗ كَانَ عَلِــيْمًا قَدِيْرًا",
        "Urdu" : "کیا یہ لوگ چلے پھرے نہیں (عبرتوں بھری) اس زمین میں؟ تاکہ یہ دیکھتے کہ کیسا ہوا انجام ان لوگوں کا جو گزر چکے ہیں ان سے پہلے حالانکہ وہ طاقت میں ان سے کہیں زیادہ بڑھے ہوئے تھے اور اللہ ایسا نہیں کہ کوئی چیز اس کے قابو سے نکل جائے نہ آسمانوں (کی بلندیوں) میں اور نہ زمین (کی پستیوں) میں بیشک وہ سب کچھ جانتا پوری قدرت والا ہے",
        "English" : "Did they not travel in the land and see how was the end of those before them? They were stronger than these in power. Allah is not such that something in the heavens or the earth can frustrate Him. Surely He is All-Knowing, All-Powerful."
      },
      {
        "ayet_no" : 45,
        "arbi" : "وَلَوْ يُؤَاخِذُ اللّٰهُ النَّاسَ بِمَا كَسَبُوْا مَا تَرَكَ عَلٰي ظَهْرِهَا مِنْ دَاۗبَّةٍ وَّلٰكِنْ يُّؤَخِّرُهُمْ اِلٰٓى اَجَلٍ مُّسَمًّى ۚ فَاِذَا جَاۗءَ اَجَلُهُمْ فَاِنَّ اللّٰهَ كَانَ بِعِبَادِهٖ بَصِيْرًا",
        "Urdu" : "اور اگر کہیں اللہ پکڑنے لگتا لوگوں کو ان کے کئے کرائے پر تو وہ کسی متنفس کو بھی روئے زمین پر (زندہ) نہ چھوڑتا لیکن وہ ان کو ڈھیل دئیے جا رہا ہے ایک وقت مقرر تک پھر جب آپہنچے گا ان کا وہ وقت مقرر تو ان کا حساب پوری طرح چکا دیا جائے گا بیشک اللہ پوری طرح نگاہ رکھے ہوئے ہے اپنے بندوں پر ف۱",
        "English" : "If Allah were to take mankind to task for what they did, He would have not left a living creature on its back, but He delays them upto an appointed time. So when their time will come, then Allah is the One who will see His slaves."
      }
    ]
  }
]