[
  {
    "surah_no" : 72,
    "total_ayah" : 28,
    "name" : "Surah e AL-Jinn (Daemon)",
    "detail" : [

      {
        "ayet_no" :0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "قُلْ اُوْحِيَ اِلَيَّ اَنَّهُ اسْتَـمَعَ نَفَرٌ مِّنَ الْجِنِّ فَقَالُوْٓا اِنَّا سَمِعْنَا قُرْاٰنًا عَجَبًا",
        "Urdu" : "کہو (اے پیغمبر !) کہ وحی کی گئی ہے میری طرف اس بات کی کہ جنوں کے ایک گروہ نے (مجھے قران پڑھتے ہوئے) غور سے سنا پھر انہوں نے (جا کراپنی قوم سے) کہا کہ ہم نے ایک بڑا ہی عجیب قران سنا ہے ف۱",
        "English" : "Say: ‘It has been revealed to me that a party of the jinn listened to (my recitation) carefully and then (went back to their people and) said: Surely we have heard a wonderful Qur’an."
      },
      {
        "ayet_no" : 2,
        "arbi" : "يَّهْدِيْٓ اِلَى الرُّشْدِ فَاٰمَنَّا بِهٖ   ۭ وَلَنْ نُّشْرِكَ بِرَبِّنَآ اَحَدًا",
        "Urdu" : "جو راہنمائی کرتا ہے سیدھی (اور صحیح) راہ کی سو ہم (صدق دل سے) اس پر ایمان لے آئے اور اب ہم کسی کو بھی اپنے رب کے ساتھ شریک نہیں ٹھرائیں گے",
        "English" : "Guiding Unto rectitude; wherefore we have believed therein, and we shall by no means associate with our Lord anyone."
      },
      {
        "ayet_no" : 3,
        "arbi" : "وَّاَنَّهٗ تَعٰلٰى جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَةً وَّلَا وَلَدًا",
        "Urdu" : "اور یہ کہ بڑی بلند ہے شان ہمارے رب کی (سبحانہ و تعالیٰ) اس نے نہ تو کسی کو بیوی بنایا ہے اور نہ ہی کسی کو اولاد ٹھہرایا ہے",
        "English" : "And He - exalted be the majesty of our Lord!-hath taken neither a spouse nor a son."
      },
      {
        "ayet_no" : 4,
        "arbi" : "وَّاَنَّهٗ كَانَ يَقُوْلُ سَفِيْهُنَا عَلَي اللّٰهِ شَطَطًا",
        "Urdu" : "اور یہ کہ ہم میں سے جو احمق ہیں وہ اللہ کے بارے میں حد سے بڑھی ہوئی بات کہتے تھے ف۲",
        "English" : "And the foolish among us were wont to forge lie against Allah exceedingly."
      },
      {
        "ayet_no" : 5,
        "arbi" : "وَّاَنَّا ظَنَنَّآ اَنْ لَّنْ تَقُوْلَ الْاِنْسُ وَالْجِنُّ عَلَي اللّٰهِ كَذِبًا",
        "Urdu" : "اور یہ کہ (اس سے پہلے) ہم نے یہ سمجھ رکھا تھا کہ انسان اور جن کبھی اللہ کے بارے میں کوئی جھوٹی بات نہیں کہہ سکتے",
        "English" : "And verily we! we had imagined that humankind and Jinn would never forge against Allah a lie."
      },
      {
        "ayet_no" : 6,
        "arbi" : "وَّاَنَّهٗ كَانَ رِجَالٌ مِّنَ الْاِنْسِ يَعُوْذُوْنَ بِرِجَالٍ مِّنَ الْجِنِّ فَزَادُوْهُمْ رَهَقًا",
        "Urdu" : "اور یہ کہ انسانوں میں سے کچھ لوگ جنوں میں سے کچھ لوگوں کی پناہ مانگا کرتے تھے جس سے ان کی سرکشی (اور بددماغی) اور زیادہ بڑھ گئی تھی",
        "English" : "And persons among humankind have been seeking refuge with persons of the Jinn, so that they increased them in evil disposition."
      },
      {
        "ayet_no" : 7,
        "arbi" : "وَّاَنَّهُمْ ظَنُّوْا كَمَا ظَنَنْتُمْ اَنْ لَّنْ يَّبْعَثَ اللّٰهُ اَحَدًا",
        "Urdu" : "اور یہ کہ انہوں نے بھی یہی سمجھ رکھا تھا جیسا کہ تم نے سمجھ رکھا ہے کہ اللہ کبھی کسی کو بھی نہیں اٹھائے گا (رسول بنا کر)",
        "English" : "And indeed they imagined, even as ye imagined, that Allah will not raise any one."
      },
      {
        "ayet_no" : 8,
        "arbi" : "وَّاَنَّا لَمَسْنَا السَّمَاۗءَ فَوَجَدْنٰهَا مُلِئَتْ حَرَسًا شَدِيْدًا وَّشُهُبًا",
        "Urdu" : "اور یہ کہ ہم نے ٹٹولا آسمان کو تو اس کو بھرا ہوا پایا سخت پہرہ داروں اور شہابوں (کی بارش) سے",
        "English" : "And we have sought to reach the heaven; but found it filled with stern guards and flaming fires."
      },
      {
        "ayet_no" : 9,
        "arbi" : "وَّاَنَّا كُنَّا نَقْعُدُ مِنْهَا مَقَاعِدَ لِلسَّمْعِ ۭ فَمَنْ يَّسْتَمِعِ الْاٰنَ يَجِدْ لَهٗ شِهَابًا رَّصَدًا",
        "Urdu" : "اور یہ کہ (اس سے پہلے) ہم آسمان کے بعض ٹھکانوں میں بیٹھ جایا کرتے تھے (وہاں کی خبروں کے بارے میں) کچھ سن گن لینے کے لئے مگر اب (یہ حال ہے کہ) جو بھی کوئی سننے کے لئے کان دھرتا ہے تو وہ پاتا ہے اپنے لئے ایک شعلہ گھات میں لگا ہوا",
        "English" : "And that we used to sit on certain seats (in the heaven previously, to listen to the news) , but if someone now seeks to listen then he will find a flame of fire (waiting) for him in ambush."
      },
      {
        "ayet_no" : 10,
        "arbi" : "وَّاَنَّا لَا نَدْرِيْٓ اَشَرٌّ اُرِيْدَ بِمَنْ فِي الْاَرْضِ اَمْ اَرَادَ بِهِمْ رَبُّهُمْ رَشَدًا",
        "Urdu" : "اور یہ کہ ہم نہیں جانتے کہ زمین والوں کے ساتھ کسی برائی کا ارادہ کیا گیا ہے یا ان کے رب نے ان کے ساتھ کسی بھلائی کا ارادہ فرمایا ہے",
        "English" : "And we know not whether evil is boded for those who are on the earth, or whether their Lord intend for them a right direction."
      },
      {
        "ayet_no" : 11,
        "arbi" : "وَّاَنَّا مِنَّا الصّٰلِحُوْنَ وَمِنَا دُوْنَ ذٰلِكَ ۭ كُنَّا طَرَاۗىِٕقَ قِدَدًا",
        "Urdu" : "اور یہ کہ ہم سے کچھ لوگ نیک تھے اور کچھ اور طرح کے (غرض) ہم مختلف طریقوں میں بٹے ہوئے تھے ف۱",
        "English" : "And of us there are some righteous, and of us are some otherwise; we have been following very diverse."
      },
      {
        "ayet_no" : 12,
        "arbi" : "وَّاَنَّا ظَنَنَّآ اَنْ لَّنْ نُّعْجِزَ اللّٰهَ فِي الْاَرْضِ وَلَنْ نُّعْجِزَهٗ هَرَبًا",
        "Urdu" : "اور یہ کہ اب ہم نے یقین کر لیا ہے کہ ہم کسی بھی طرح عاجز نہیں کر سکتے اللہ کو نہ زمین میں (کہیں چھپ کر) اور نہ ہی (اور کہیں) بھاگ کر",
        "English" : "And we known that we cannot frustrate Allah in the earth, nor can we frustrate Him by flight."
      },
      {
        "ayet_no" : 13,
        "arbi" : "وَّاَنَّا لَمَّا سَمِعْنَا الْهُدٰٓى اٰمَنَّا بِهٖ ۭ فَمَنْ يُّؤْمِنْۢ بِرَبِّهٖ فَلَا يَخَافُ بَخْسًا وَّلَا رَهَقًا",
        "Urdu" : "اور یہ کہ جب ہم نے سنا اس (کلام) ہدایت کو تو ہم (بلا چون و چرا فوراً اور سچے دل سے) اس پر ایمان لے آئے پس جو کوئی (صدق دل سے) ایمان لائے گا اپنے رب پر تو نہ تو اس کو کوئی (اندیشہ و) خوف ہوگا کسی حق تلفی کا اور نہ کسی طرح کی زیادتی کا",
        "English" : "And when we heard the Message of guidance, we believed therein; and whosoever believe in his Lord, he shall fear neither diminution nor wrong."
      },
      {
        "ayet_no" : 14,
        "arbi" : "وَّاَنَّا مِنَّا الْمُسْلِمُوْنَ وَمِنَّا الْقٰسِطُوْنَ   ۭ فَمَنْ اَسْلَمَ فَاُولٰۗىِٕكَ تَحَرَّوْا رَشَدًا",
        "Urdu" : "اور یہ کہ ہم میں سے کچھ فرمانبردار ہیں اور کچھ (حسب سابق منحرف اور) بےراہ بھی پس جو کوئی فرمانبردار ہوگیا اپنے رب کا تو ایسے لوگوں نے ڈھونڈ لیا راستہ ہدایت (و نجات) کا",
        "English" : "And that (some) of us are obedient and (some) of us are wrongdoers as well. So he who becomes obedient, it is they who seek righteousness."
      },
      {
        "ayet_no" : 15,
        "arbi" : "وَاَمَّا الْقٰسِطُوْنَ فَكَانُوْا لِجَهَنَّمَ حَطَبًا",
        "Urdu" : "اور جو ظالم (و نافرمان) ہیں تو وہ جہنم کا ایندھن ہوں گے",
        "English" : "As for the unjust, they have become firewood for Hell."
      },
      {
        "ayet_no" : 16,
        "arbi" : "وَّاَنْ لَّوِ اسْتَــقَامُوْا عَلَي الطَّرِيْقَةِ لَاَسْقَيْنٰهُمْ مَّاۗءً غَدَقًا",
        "Urdu" : "اور یہ (کہو کہ میری طرف یہ وحی بھی کی گئی ہے) کہ اگر یہ لوگ سیدھے راستے پر قائم رہتے تو ہم ان کو ضرور سیراب کرتے بافراغت پانی سے",
        "English" : "And had they kept to the path surely We would have watered them with rain plenteous."
      },
      {
        "ayet_no" : 17,
        "arbi" : "لِّنَفْتِنَهُمْ فِيْهِ ۭ وَمَنْ يُّعْرِضْ عَنْ ذِكْرِ رَبِّهٖ يَسْلُكْهُ عَذَابًا صَعَدًا",
        "Urdu" : "تاکہ اس (ارزانی و فراوانی) میں ہم ان کی آزمائش کریں اور جو کوئی منہ موڑے گا اپنے رب کے ذکر (اور اس کی یاد دلشاد) سے تو وہ ڈال دے گا اس کو ایک (بڑھتے) چڑھتے ہولناک عذاب میں ف۲",
        "English" : "That We might try them thereby. And whosoever turns away from the Reminder of his Lord (i.e. this Qur'n, and practice not its laws and orders) , He will cause him to enter in a severe torment (i.e. Hell)."
      },
      {
        "ayet_no" : 18,
        "arbi" : "وَّاَنَّ الْمَسٰجِدَ لِلّٰهِ فَلَا تَدْعُوْا مَعَ اللّٰهِ اَحَدًا",
        "Urdu" : "اور یہ کہ مسجدیں اللہ ہی کے لئے ہیں پس تم لوگ مت پکارو اللہ (وحدہ لاشریک) کے ساتھ کسی کو بھی",
        "English" : "And the prostrations are for Allah; wherefore call not along with Allah anyone."
      },
      {
        "ayet_no" : 19,
        "arbi" : "وَّاَنَّهٗ لَمَّا قَامَ عَبْدُ اللّٰهِ يَدْعُوْهُ كَادُوْا يَكُوْنُوْنَ عَلَيْهِ لِبَدًا",
        "Urdu" : "اور یہ کہ جب کھڑا ہوتا ہے اللہ کا بندہ خاص اسی (وحدہ لاشریک) کو پکارنے کے لئے تو یہ لوگ تیار ہو جاتے ہیں اس پر ٹوٹ پڑنے کو",
        "English" : "And when the bondman of Allah stood calling upon Him, they well nigh pressed on him stifling."
      },
      {
        "ayet_no" : 20,
        "arbi" : "قُلْ اِنَّمَآ اَدْعُوْا رَبِّيْ وَلَآ اُشْرِكُ بِهٖٓ اَحَدًا",
        "Urdu" : "کہو (ان سے اے پیغمبر!) کہ میں تو بہرحال اپنے رب ہی کو پکارتا رہوں گا اور اس کے ساتھ کسی کو بھی (کسی بھی درجے میں) شریک نہیں ٹھہراؤں گا",
        "English" : "Say, :I invoke my Lord, and do not associate anyone with Him."
      },
      {
        "ayet_no" : 21,
        "arbi" : "قُلْ اِنِّىْ لَآ اَمْلِكُ لَكُمْ ضَرًّا وَّلَا رَشَدًا",
        "Urdu" : "(نیز ان سے یہ بھی) کہہ دو کہ میں نہ تو تمہارے لئے کسی نقصان کا اختیار رکھتا ہوں اور نہ کسی بھلائی کا ف۱",
        "English" : "Say, :I possess no power to cause you any harm or bring you to a right way."
      },
      {
        "ayet_no" : 22,
        "arbi" : "قُلْ اِنِّىْ لَنْ يُّجِيْرَنِيْ مِنَ اللّٰهِ اَحَدٌ  ڏ وَّلَنْ اَجِدَ مِنْ دُوْنِهٖ مُلْتَحَدًا",
        "Urdu" : "کہو (میرا تو خود یہ حال ہے) کہ نہ تو مجھے کوئی اللہ سے بچا سکتا ہے اور نہ ہی میں اس کے سوا کوئی پناہ گاہ پا سکتا ہوں",
        "English" : "Say, :No one can ever save me from Allah, and I can never find a refuge save with Him."
      },
      {
        "ayet_no" : 23,
        "arbi" : "اِلَّا بَلٰـغًا مِّنَ اللّٰهِ وَرِسٰلٰتِهٖ ۭ وَمَنْ يَّعْصِ اللّٰهَ وَرَسُوْلَهٗ فَاِنَّ لَهٗ نَارَ جَهَنَّمَ خٰلِدِيْنَ فِيْهَآ اَبَدًا",
        "Urdu" : "میرا کام تو بس اتنا (اور صرف اتنا) ہے کہ میں پہنچا دوں (بغیر کسی کمی و بیشی کے) اللہ کی بات اور اس کے پیغاموں کو اور جو کوئی نافرمانی کرے گا اللہ کی تو (وہ یقینا اپنا ہی نقصان کرے گا کہ) بیشک اس کے لئے جہنم کی (دہکتی) آگ ہے جس میں ایسے لوگوں کو ہمیشہ ہمیش رہنا ہوگا",
        "English" : "However, (I have been given power) of conveying (commands) from Allah, and His messages. The one who disobeys Allah and His Messenger, for him there is the fire of Hell, wherein such people will live forever."
      },
      {
        "ayet_no" : 24,
        "arbi" : "حَتّىٰٓ اِذَا رَاَوْا مَا يُوْعَدُوْنَ فَسَيَعْلَمُوْنَ مَنْ اَضْعَفُ نَاصِرًا وَّاَقَلُّ عَدَدًا",
        "Urdu" : "(یہ لوگاپنی اس ہٹ دھرمی ہی پر اڑے رہیں گے) یہاں تک کہ جب یہ خود دیکھ لیں گے اس چیز کو جس کا ان سے وعدہ کیا جا رہا ہے تو انہیں خود معلوم ہو جائے گا کہ کس کے مددگار کمزور ہیں",
        "English" : "(The disbelievers will continue denying the truth and mock at it) until when they will see what they are promised, they will know whose supporters are weaker, and whose numbers are less."
      },
      {
        "ayet_no" : 25,
        "arbi" : "قُلْ اِنْ اَدْرِيْٓ اَقَرِيْبٌ مَّا تُوْعَدُوْنَ اَمْ يَجْعَلُ لَهٗ رَبِّيْٓ اَمَدًا",
        "Urdu" : "اور کس (کے جتھے) کی تعداد کم ہے (ان سے صاف صاف) کہہ دو کہ میں نہیں جانتا کہ قریب ہے وہ چیز جس کا تم سے وعدہ کیا جا رہا ہے یا اس کے لئے مقرر فرما رکھی ہے میرے رب نے کوئی لمبی مدت",
        "English" : "Say (O Muhammad) : [I know not whether (the punishment) which you are promised is near or whether my Lord will appoint for it a distant term]."
      },
      {
        "ayet_no" : 26,
        "arbi" : "عٰلِمُ الْغَيْبِ فَلَا يُظْهِرُ عَلٰي غَيْبِهٖٓ اَحَدًا",
        "Urdu" : "و ہی ہے جاننے والا غیب کا پس وہ مطلع نہیں کرتا اپنے غیب پر کسی کو بجز اپنے",
        "English" : "He is the Knower of the unseen, and He disclose not His unseen Unto anyone."
      },
      {
        "ayet_no" : 27,
        "arbi" : "اِلَّا مَنِ ارْتَضٰى مِنْ رَّسُوْلٍ فَاِنَّهٗ يَسْلُكُ مِنْۢ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهٖ رَصَدًا",
        "Urdu" : "کسی ایسے رسول کے جس کو اس نے پسند فرما لیا ہو (غیب کی کوئی خبر دینے کے لئے) تو بیشک وہ (اس کو اس اہتمام کے ساتھ اس سے نوازتا ہے کہ) خاص پہرے دار مقرر فرما دیتا ہے اس کے آگے بھی اور اس کے پیچھے بھی ف۲",
        "English" : "Save Unto an apostle chosen. And then He cause to go before him and behind him a guard."
      },
      {
        "ayet_no" : 28,
        "arbi" : "لِّيَعْلَمَ اَنْ قَدْ اَبْلَغُوْا رِسٰلٰتِ رَبِّهِمْ وَاَحَاطَ بِمَا لَدَيْهِمْ وَاَحْصٰى كُلَّ شَيْءٍ عَدَدًا",
        "Urdu" : "تاکہ وہ جان لے وہ کہ ان فرشتوں نے (پوری حفاظت سے اور بتمام و کمال) پہنچا دیئے پیغامات اپنے رب کے اور اس نے محفوظ کر رکھا ہے ہرچیز کو گن کر ف۱",
        "English" : "That He may know that they have preached the message of their Lord. And He comprehend whatever is with them, and He keep count of everything numbered."
      }
    ]
  }
]