[
  {
    "surah_no" : 91,
    "total_ayah" : 15,
    "name" : "Surah e Ash-Shams",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "وَالشَّمْسِ وَضُحٰىهَا",
        "Urdu" : "قسم ہے سورج کی اور اس کی دھوپ کی",
        "English" : "By the sun and his brightness,"
      },
      {
        "ayet_no" : 2,
        "arbi" : "وَالْقَمَرِ اِذَا تَلٰىهَا",
        "Urdu" : "اور چاند کی قسم جب وہ پیچھے آئے اس کے",
        "English" : "By the moon, when she follow him,"
      },
      {
        "ayet_no" : 3,
        "arbi" : "وَالنَّهَارِ اِذَا جَلّٰىهَا",
        "Urdu" : "اور دن کی (قسم) جب وہ ظاہر کردے اس (سورج) کو",
        "English" : "By the day when it glorify him."
      },
      {
        "ayet_no" : 4,
        "arbi" : "وَاللَّيْلِ اِذَا يَغْشٰـىهَا",
        "Urdu" : "اور رات کی (قسم) جب وہ ڈھانپ لیتی ہے اس (سورج) کو",
        "English" : "By the night; when it envelop him,"
      },
      {
        "ayet_no" : 5,
        "arbi" : "وَالسَّمَاۗءِ وَمَا بَنٰىهَا",
        "Urdu" : "اور آسمان کی اور (اس ذات کی) جس نے بنایا ہے اسے",
        "English" : "By the heaven and Him Who built it,"
      },
      {
        "ayet_no" : 6,
        "arbi" : "وَالْاَرْضِ وَمَا طَحٰىهَا",
        "Urdu" : "اور زمین کی اور (اس کی) جس نے بچھایا ہے اسے",
        "English" : "By the earth and Him Who spread it forth,"
      },
      {
        "ayet_no" : 7,
        "arbi" : "وَنَفْسٍ وَّمَا سَوّٰىهَا",
        "Urdu" : "اور انسانی نفس کی (قسم) اور (اس کی) جس نے ٹھیک کیا ہے اسے",
        "English" : "And a soul and Him Who perfected it"
      },
      {
        "ayet_no" : 8,
        "arbi" : "فَاَلْهَمَهَا فُجُوْرَهَا وَتَقْوٰىهَا",
        "Urdu" : "پھر اس کے دل میں ڈال دی اس کی نافرمانی اور اس کی پرہیزگاری (کی پہچان)",
        "English" : "And inspired it with the wickedness thereof and the piety thereof,"
      },
      {
        "ayet_no" : 9,
        "arbi" : "قَدْ اَفْلَحَ مَنْ زَكّٰىهَا",
        "Urdu" : "یقینا کامیاب ہوگیا جس نے پاک کرلیا اسے",
        "English" : "Truly he succeeds that purifies it,"
      },
      {
        "ayet_no" : 10,
        "arbi" : "وَقَدْ خَابَ مَنْ دَسّٰـىهَا",
        "Urdu" : "اور یقینا ناکام ہوا وہ جس نے خاک میں ملادیا (آلودہ کرلیا) اسے",
        "English" : "And miserable is he who hath buried it."
      },
      {
        "ayet_no" : 11,
        "arbi" : "كَذَّبَتْ ثَمُوْدُ بِطَغْوٰىهَآ",
        "Urdu" : "جھٹلایا قوم ثمود نے صالح کواپنی سرکشی کی وجہ سے",
        "English" : "Thamud belied in their exorbitance."
      },
      {
        "ayet_no" : 12,
        "arbi" : "اِذِ انْۢبَعَثَ اَشْقٰىهَا",
        "Urdu" : "جب اٹھا اس کا سب سے بڑا بدبخت",
        "English" : "What time the greatest wretch of them rose up."
      },
      {
        "ayet_no" : 13,
        "arbi" : "فَقَالَ لَهُمْ رَسُوْلُ اللّٰهِ نَاقَةَ اللّٰهِ وَسُقْيٰهَا",
        "Urdu" : "تو کہا ان سے اللہ کے رسول نے خیال رکھو اللہ کی اونٹنی اور اس کے پانی کی باری کا",
        "English" : "So, the Messenger of Allah said to them, :Be careful of Allah‘s she-camel and her right to drink."
      },
      {
        "ayet_no" : 14,
        "arbi" : "فَكَذَّبُوْهُ فَعَقَرُوْهَا فَدَمْدَمَ عَلَيْهِمْ رَبُّهُمْ بِذَنْۢبِهِمْ فَسَوّٰىهَا",
        "Urdu" : "تو انہوں نے جھٹلایااسے پھر انہوں نے کونچیں کاٹ دیں اس کی (یعنی اسے مارڈالا) تو تباہی ڈالی ان پر ان کے رب نے ان کے گناہ کے سبب پھر برابر کردیااسے",
        "English" : "But they rejected him and killed her, so their Lord sent eradicating torment upon them because of their sin, and made it equal for all."
      },
      {
        "ayet_no" : 15,
        "arbi" : "وَلَا يَخَافُ عُقْبٰهَا",
        "Urdu" : "اور نہیں وہ ڈرتا اس سزا کے انجام سے",
        "English" : "And He (Allah) feared not the consequences thereof."
      }
    ]
  }
]