[
  {
    "surah_no" : 52,
    "total_ayah" : 49,
    "name" : "Surah e AL-Toor ",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "وَالطُّوْرِ",
        "Urdu" : "قسم ہے طور کی",
        "English" : "By the mount."
      },
      {
        "ayet_no" : 2,
        "arbi" : "وَكِتٰبٍ مَّسْطُوْرٍ",
        "Urdu" : "اور اس کتاب کی جو لکھی ہوئی ہے",
        "English" : "By the book inscribed."
      },
      {
        "ayet_no" : 3,
        "arbi" : "فِيْ رَقٍّ مَّنْشُوْرٍ",
        "Urdu" : "ایک کھلے ہوئے دفتر میں",
        "English" : "In parchment unrolled."
      },
      {
        "ayet_no" : 4,
        "arbi" : "وَّالْبَيْتِ الْمَعْمُوْرِ",
        "Urdu" : "اور اس آباد گھر کی",
        "English" : "By the House Frequented."
      },
      {
        "ayet_no" : 5,
        "arbi" : "وَالسَّقْفِ الْمَرْفُوْعِ",
        "Urdu" : "اور اس اونچی چھت کی",
        "English" : "By the roof elevated."
      },
      {
        "ayet_no" : 6,
        "arbi" : "وَالْبَحْرِ الْمَسْجُوْرِ",
        "Urdu" : "اور اس جوش مارتے ہوئے سمندر کی",
        "English" : "By the sea overflowing."
      },
      {
        "ayet_no" : 7,
        "arbi" : "اِنَّ عَذَابَ رَبِّكَ لَوَاقِعٌ",
        "Urdu" : "بیشک تمہارے رب کے عذاب نے بہرحال ہو کر رہنا ہے",
        "English" : "Surely the torment of your Lord will certainly take place."
      },
      {
        "ayet_no" : 8,
        "arbi" : "مَا لَهٗ مِنْ دَافِعٍ",
        "Urdu" : "اسے کوئی ٹالنے والا نہیں",
        "English" : "There is none that can ward it off."
      },
      {
        "ayet_no" : 9,
        "arbi" : "يَّوْمَ تَمُوْرُ السَّمَاۗءُ مَوْرًا",
        "Urdu" : "جس دن کہ لرز اٹھے گا آسمان کپکپا کر",
        "English" : "On the Day whereon the heaven will shake with an awful shaking."
      },
      {
        "ayet_no" : 10,
        "arbi" : "وَّتَسِيْرُ الْجِبَالُ سَيْرًا",
        "Urdu" : "اور چل پڑیں گے پہاڑاپنیاپنی جگہوں کو چھوڑ کر",
        "English" : "And the mountains will move away with an awful movement."
      },
      {
        "ayet_no" : 11,
        "arbi" : "فَوَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَ",
        "Urdu" : "سو اس دن بڑی ہی خرابی (اور ہلاکت) ہے ان جھٹلانے والوں کے لئے",
        "English" : "So, woe to those who reject (the true faith),"
      },
      {
        "ayet_no" : 12,
        "arbi" : "الَّذِيْنَ هُمْ فِيْ خَوْضٍ يَّلْعَبُوْنَ",
        "Urdu" : "جواپنی حجت بازیوں (کی دلدل) میں پڑے کھیل رہے ہیں ف۲",
        "English" : "Those who in wading sport themselves."
      },
      {
        "ayet_no" : 13,
        "arbi" : "يَوْمَ يُدَعُّوْنَ اِلٰى نَارِ جَهَنَّمَ دَعًّا",
        "Urdu" : "جس دن کہ ان کو دھکے مار مار کر لے جایا جائے گا دوزخ کی اس آتش (سوزاں) کی طرف",
        "English" : "On the Day whereon they will be pushed into Hell-Fire with a dreadful push."
      },
      {
        "ayet_no" : 14,
        "arbi" : "هٰذِهِ النَّارُ الَّتِيْ كُنْتُمْ بِهَا تُكَذِّبُوْنَ",
        "Urdu" : "(اور تحقیر و تذلیل مزید کے لئے ان سے کہا جائے گا کہ لو) یہ ہے وہ آگ جس کو تم لوگ جھٹلایا کرتے تھے",
        "English" : "This is the Fire which ye were wont to believe."
      },
      {
        "ayet_no" : 15,
        "arbi" : "اَفَسِحْرٌ ھٰذَآ اَمْ اَنْتُمْ لَا تُبْصِرُوْنَ",
        "Urdu" : "اب بتاؤ کیا یہ جادو ہے یا تمیہں سوجھتا نہیں ؟",
        "English" : "Is this magic, or do you not see ?"
      },
      {
        "ayet_no" : 16,
        "arbi" : "اِصْلَوْهَا فَاصْبِرُوْٓا اَوْ لَا تَصْبِرُوْا ۚ سَوَاۗءٌ عَلَيْكُمْ ۭ اِنَّمَا تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُوْنَ",
        "Urdu" : "اب داخل ہو جاؤ تم اس میں پس اب تم صبر کرو یا نہ کرو تم پر برابر ہے تمہیں تو بس ان ہی اعمال کا بدلہ دیا جا رہا ہے جو تم لوگ خود کرتے رہے تھے (اپنی دنیاوی زندگی میں)",
        "English" : "Enter it. Now, whether you endure (it) patiently or impatiently, it is all the same for you; you are merely rewarded for what you used to do."
      },
      {
        "ayet_no" : 17,
        "arbi" : "اِنَّ الْمُتَّقِيْنَ فِيْ جَنّٰتٍ وَّنَعِيْمٍ",
        "Urdu" : "اس کے برعکس متقی (و پرہیزگار) لوگ طرح طرح کے عظیم الشان باغوں اور قسما قسم کی نعمتوں میں (رہ بس رہے) ہوں گے",
        "English" : "Surely the God fearing people will be in the Gardens and Bliss."
      },
      {
        "ayet_no" : 18,
        "arbi" : "فٰكِهِيْنَ بِمَآ اٰتٰىهُمْ رَبُّهُمْ ۚ وَوَقٰىهُمْ رَبُّهُمْ عَذَابَ الْجَحِيْمِ",
        "Urdu" : "لطف اندوز ہو رہے ہوں گے وہ ان طرح طرح کی چیزوں سے جو ان کو وہاں عطا فرمائی ہوں گی ان کے رب نے اور بچا لیا ہوگا ان کو ان کے رب نے دوزخ کے عذاب سے",
        "English" : "Enjoying what their Lord will have given to them, and their Lord will have saved them from the punishment of Hell."
      },
      {
        "ayet_no" : 19,
        "arbi" : "كُلُوْا وَاشْرَبُوْا هَنِيْۗــــًٔـــۢا بِمَا كُنْتُمْ تَعْمَلُوْنَ",
        "Urdu" : "(اور ان کے لطف و سرور کو مزید دوبالا کرنے کے لئے ان سے کہا جائے گا کہ) کھاؤ پیو تم اپنے ان اعمال کے صلہ (و بدلہ) میں جو تم کرتے رہے تھے (اپنی فرصت حیات میں)",
        "English" : "Eat and drink with relish for that which ye have been working."
      },
      {
        "ayet_no" : 20,
        "arbi" : "مُتَّكِــــِٕيْنَ عَلٰي سُرُرٍ مَّصْفُوْفَةٍ ۚ وَزَوَّجْنٰهُمْ بِحُوْرٍ عِيْنٍ",
        "Urdu" : "وہ (نہایت آرام و سکون سے) ٹیک لگائے بیٹھے ہوں گے آمنے سامنے بچھے عظیم الشان تختوں پر اور ہم نے ان کو بیاہ دیا ہوگا خوبصورت انکھوں والی حوروں سے",
        "English" : "Reclining on couches ranged. And We shall couple them with maidens wide eyed."
      },
      {
        "ayet_no" : 21,
        "arbi" : "وَالَّذِيْنَ اٰمَنُوْا وَاتَّبَعَتْهُمْ ذُرِّيَّــتُهُمْ بِاِيْمَانٍ اَلْحَـقْنَا بِهِمْ ذُرِّيَّتَهُمْ وَمَآ اَلَتْنٰهُمْ مِّنْ عَمَلِهِمْ مِّنْ شَيْءٍ ۭ كُلُّ امْرِی بِمَا كَسَبَ رَهِيْنٌ",
        "Urdu" : "اور جو لوگ ایمان لائے اور ان کی اولاد بھی ان کے نقش قدم پر چلی (دولت) ایمان کے ساتھ تو ہم ان کی ایسی اولاد کو بھی ان کے ساتھ شامل کر دیں گے (جنت میں) اور ہم ان (متبوع اہل جنت) کے عمل میں سے کچھ بھی کم نہیں کریں گے ہر کوئی اپنے (زندگی بھر کے) کئے (کرائے) کے بدلے میں گروی ہے ف۱",
        "English" : "And those who believed and their children followed them in belief, We will join their children with them, and will not curtail (the reward of) any of their deeds at all. Every person will be pledged for what he earned."
      },
      {
        "ayet_no" : 22,
        "arbi" : "وَاَمْدَدْنٰهُمْ بِفَاكِهَةٍ وَّلَحْمٍ مِّمَّا يَشْتَهُوْنَ",
        "Urdu" : "اور ہم خوب دئیے چلے جائیں گے ان کو ہر طرح کے عمدہ پھل اور گوشت جیسا وہ چاہیں گے (اور جس کی وہ خواہش کریں گے)",
        "English" : "And We will go on giving them whatever they desire of fruits and meat."
      },
      {
        "ayet_no" : 23,
        "arbi" : "يَتَنَازَعُوْنَ فِيْهَا كَاْسًا لَّا لَغْوٌ فِيْهَا وَلَا تَاْثِيْمٌ",
        "Urdu" : "اور وہاں پر وہ ایک دوسرے سے لپک لپک کر لے رہے ہوں گے ایسی جام شراب جس میں نہ کوئی بےہودگی ہوگی اور نہ کوئی گنہگاری",
        "English" : "They will snatch from one another (in a friendly manner) a glass (of wine) carrying neither absurd talk, nor something leading to sin."
      },
      {
        "ayet_no" : 24,
        "arbi" : "وَيَطُوْفُ عَلَيْهِمْ غِلْمَانٌ لَّهُمْ كَاَنَّهُمْ لُؤْلُؤٌ مَّكْنُوْنٌ",
        "Urdu" : "اور ان کی خدمت گزاری کے لئے چل پھر رہے ہوں گے (ایسے خوب صورت) لڑکے جیسے کہ وہ ایسے موتی ہوں جن کو چھپا کر رکھا گیا ہو",
        "English" : "And their own serving boys will rotate around them, (who will be as neat and clean) as if they were hidden pearls."
      },
      {
        "ayet_no" : 25,
        "arbi" : "وَاَقْبَلَ بَعْضُهُمْ عَلٰي بَعْضٍ يَّتَسَاۗءَلُوْنَ",
        "Urdu" : "اور جنت والے آ پس میں ایک دوسرے کی طرف متوجہ ہو کر پوچھیں گے",
        "English" : "And they will advance to one another, asking (about each other‘s welfare)."
      },
      {
        "ayet_no" : 26,
        "arbi" : "قَالُوْٓا اِنَّا كُنَّا قَبْلُ فِيْٓ اَهْلِنَا مُشْفِقِيْنَ",
        "Urdu" : "کہیں گے کہ ہم تو اس سے پہلے (دنیا میں) اپنے گھر والوں میں ڈرتے رہا کرتے تھے (اپنے رب کی ناراضگی و پکڑ سے)",
        "English" : "They will say: verily we were a fore time, midst our household, ever in dread."
      },
      {
        "ayet_no" : 27,
        "arbi" : "فَمَنَّ اللّٰهُ عَلَيْنَا وَوَقٰىنَا عَذَابَ السَّمُوْمِ",
        "Urdu" : "پس اللہ نے ہم پر احسان فرما لیا اور بچا لیا ہمیں اس جھلسا دینے والی ہولناک آگ کے عذاب سے",
        "English" : "But Allah did favour to us and saved us from the torment of Fire‘s scorching breath."
      },
      {
        "ayet_no" : 28,
        "arbi" : "اِنَّا كُنَّا مِنْ قَبْلُ نَدْعُوْهُ ۭ اِنَّهٗ هُوَ الْبَرُّ الرَّحِيْمُ",
        "Urdu" : "ہم اس سے پہلے صرف اسی کو پکارا کرتے تھے بلاشبہ وہی ہے بڑا احسان کرنے والا انتہائی مہربان",
        "English" : "We used to pray to Him before. He is surely the Most-Kind, the Very-Merciful."
      },
      {
        "ayet_no" : 29,
        "arbi" : "فَذَكِّرْ فَمَآ اَنْتَ بِنِعْمَتِ رَبِّكَ بِكَاهِنٍ وَّلَا مَجْنُوْنٍ",
        "Urdu" : "پس آپ نصیحت کرتے رہیے کہ آپ اپنے رب کی مہربانی سے نہ تو کاہن ہیں نہ مجنون",
        "English" : "So keep reminding (them), because by the grace of your Lord, you are neither a soothsayer, nor a mad man."
      },
      {
        "ayet_no" : 30,
        "arbi" : "اَمْ يَقُوْلُوْنَ شَاعِرٌ نَّتَرَبَّصُ بِهٖ رَيْبَ الْمَنُوْنِ",
        "Urdu" : "کیا یہ لوگ یوں کہتے ہیں کہ یہ ایک شاعر ہے جس کے بارے میں ہم انتظار کرتے ہیں گردش ایام (کے چکر) کا",
        "English" : "Do they rather say, :He is a poet for whom we are awaiting the accident of death ?"
      },
      {
        "ayet_no" : 31,
        "arbi" : "قُلْ تَرَبَّصُوْا فَاِنِّىْ مَعَكُمْ مِّنَ الْمُتَرَبِّصِيْنَ",
        "Urdu" : "(سو ان سے) کہو کہ اچھا تو تم انتظار کرتے رہو میں بھی تمہارے ساتھ منتظر ہوں",
        "English" : "Say (unto them): Except (your fill)! Lo! I am with you among the expectant."
      },
      {
        "ayet_no" : 32,
        "arbi" : "اَمْ تَاْمُرُهُمْ اَحْلَامُهُمْ بِھٰذَآ اَمْ هُمْ قَوْمٌ طَاغُوْنَ",
        "Urdu" : "کیا ان کی عقلیں ان کو ایسی باتیں سکھاتی ہیں یا یہ حد سے گزرنے والے لوگ ہیں ؟",
        "English" : "Is it their intellects that direct them to (say) this, or are they a rebellious people ?"
      },
      {
        "ayet_no" : 33,
        "arbi" : "اَمْ يَقُوْلُوْنَ تَـقَوَّلَهٗ ۚ بَلْ لَّا يُؤْمِنُوْنَ",
        "Urdu" : "کیا یہ لوگ یوں کہتے ہیں کہ اس شخص نے خود ہی گھڑ لیا ہے اس (کتاب حکیم) کو ؟ ( نہیں) بلکہ اصل بات یہ ہے کہ یہ لوگ ایمان لانا ہی نہیں چاہتے",
        "English" : "Do they rather say, :He has forged it (the Qur‘an.) ? No, but they do not believe."
      },
      {
        "ayet_no" : 34,
        "arbi" : "فَلْيَاْتُوْا بِحَدِيْثٍ مِّثْلِهٖٓ اِنْ كَانُوْا صٰدِقِيْنَ",
        "Urdu" : "سو یہ لا دکھائیں اس (کلام محکم نظام) جیسا کوئی کلام اگر یہ سچے ہیں (اپنے اس قول و قرار میں)",
        "English" : "So, let them bring a discourse like this, if they are truthful."
      },
      {
        "ayet_no" : 35,
        "arbi" : "اَمْ خُلِقُوْا مِنْ غَيْرِ شَيْءٍ اَمْ هُمُ الْخٰلِقُوْنَ",
        "Urdu" : "کیا یہ لوگ بغیر کسی خالق کے یونہی از خود پیدا ہوگئے؟ یا یہ خود ہی خالق ہیں ؟",
        "English" : "Is it that they are created by none, or are they themselves the creators ?"
      },
      {
        "ayet_no" : 36,
        "arbi" : "اَمْ خَلَقُوا السَّمٰوٰتِ وَالْاَرْضَ ۚ بَلْ لَّا يُوْقِنُوْنَ",
        "Urdu" : "کیا انہوں نے پیدا کیا آسمانوں اور زمین (کی اس حکمتوں بھری کائنات) کو ؟ نہیں بلکہ یہ لوگ یقین نہیں رکھتے ف۱",
        "English" : "Or have they created the heavens and the earth ? No, but they are sure of nothing."
      },
      {
        "ayet_no" : 37,
        "arbi" : "اَمْ عِنْدَهُمْ خَزَاۗىِٕنُ رَبِّكَ اَمْ هُمُ الْمُصَۜيْطِرُوْنَ",
        "Urdu" : "کیا ان کے پاس تمہارے رب کے خزانے ہیں؟ یا یہ ان کے داروغے ہیں ؟",
        "English" : "Or do they have the treasures of your Lord, or have they acquired control (over them)?"
      },
      {
        "ayet_no" : 38,
        "arbi" : "اَمْ لَهُمْ سُلَّمٌ يَّسْتَمِعُوْنَ فِيْهِ ۚ فَلْيَاْتِ مُسْتَمِعُهُمْ بِسُلْطٰنٍ مُّبِيْنٍ",
        "Urdu" : "کیا ان کے پاس کوئی سیڑھی ہے جس پر چڑھ کر یہ لوگ (عالم بالا کی باتیں) سن لیتے ہیں؟ تو لے آئے ان کا سننے والا کوئی کھلی سند",
        "English" : "Or have they a stairway (to the heavens) by means of which they listen (to the divine decrees)? If so, their listener must bring a clear proof."
      },
      {
        "ayet_no" : 39,
        "arbi" : "اَمْ لَهُ الْبَنٰتُ وَلَكُمُ الْبَنُوْنَ",
        "Urdu" : "کیا اللہ کے لئے تو ہوں بیٹیاں اور خود تمہارے لئے ہوں بیٹے ؟",
        "English" : "Is it that He has daughters and you have sons ?"
      },
      {
        "ayet_no" : 40,
        "arbi" : "اَمْ تَسْـَٔــلُهُمْ اَجْرًا فَهُمْ مِّنْ مَّغْرَمٍ مُّثْقَلُوْنَ",
        "Urdu" : "کیا آپ ان سے کوئی اجر مانگتے ہیں؟ کہ یہ چٹی کے بوجھ سے دبے جا رہے ہیں ؟",
        "English" : "Or is it that you (O prophet) ask them for a fee, and therefore they are burdened with a liability ?"
      },
      {
        "ayet_no" : 41,
        "arbi" : "اَمْ عِنْدَهُمُ الْغَيْبُ فَهُمْ يَكْتُبُوْنَ",
        "Urdu" : "کیا ان کے پاس غیب (کے حقائق) کا علم ہے جس کی بناء پر یہ لکھ لیتے ہیں ؟",
        "English" : "Or have they the knowledge of the Unseen, and they are recording it ?"
      },
      {
        "ayet_no" : 42,
        "arbi" : "اَمْ يُرِيْدُوْنَ كَيْدًا ۭ فَالَّذِيْنَ كَفَرُوْا هُمُ الْمَكِيْدُوْنَ",
        "Urdu" : "کیا یہ لوگ کوئی داؤ چلنا چاہتے ہیں؟ تو (سن لیں کہ) جو لوگ اڑے ہوئے ہیں اپنے کفر (و باطل) پر وہ خود ہی شکار ہو رہے ہیںاپنی چال بازیوں کے ف۱",
        "English" : "Seek they to lay a plot ? Then those who disbelieve it is they who shall be plotted against."
      },
      {
        "ayet_no" : 43,
        "arbi" : "اَمْ لَهُمْ اِلٰهٌ غَيْرُ اللّٰهِ ۭ سُبْحٰنَ اللّٰهِ عَمَّا يُشْرِكُوْنَ",
        "Urdu" : "کیا ان کے لئے کوئی اور معبود ہے اللہ کے سوا؟ (سو واضح رہے کہ) اللہ پاک ہے اس شرک سے جو یہ لوگ کر رہے ہیں ف۲",
        "English" : "Or do they have a god other than Allah? Pure is Allah from what they associate with Him."
      },
      {
        "ayet_no" : 44,
        "arbi" : "وَاِنْ يَّرَوْا كِسْفًا مِّنَ السَّمَاۗءِ سَاقِـطًا يَّقُوْلُوْا سَحَابٌ مَّرْكُوْمٌ",
        "Urdu" : "اور (ان کی ہٹ دھرمی کا عالم یہ ہے کہ) اگر یہ آسمان کا کوئی ٹکڑا بھی گرتا ہوا دیکھ لیں تو کہیں گے کہ یہ تو ایک بادل ہے تہ بہ تہ جما ہوا",
        "English" : "And if they should see a fragment of the heaven falling down, they would say: it is only clouds piled up."
      },
      {
        "ayet_no" : 45,
        "arbi" : "فَذَرْهُمْ حَتّٰى يُلٰقُوْا يَوْمَهُمُ الَّذِيْ فِيْهِ يُصْعَقُوْنَ",
        "Urdu" : "پس چھوڑ دو ان کو (ان کے حال پر) یہاں تک کہ یہ پہنچ جائیں اپنے اس (ہولناک) دن کو جس میں ان کے ہوش اڑ جائیں گے",
        "English" : "Wherefore let them alone, till they meet their Day whereon they shall swoon."
      },
      {
        "ayet_no" : 46,
        "arbi" : "يَوْمَ لَا يُغْنِيْ عَنْهُمْ كَيْدُهُمْ شَيْــــًٔا وَّلَا هُمْ يُنْصَرُوْنَ",
        "Urdu" : "جس دن نہ تو ان کو اپنا داؤ کچھ کام آسکے گا اور نہ ان کو (اور کہیں سے) کوئی مدد مل سکے گی",
        "English" : "A Day whereon their plotting will avail them not at all, nor will they be succoured."
      },
      {
        "ayet_no" : 47,
        "arbi" : "وَاِنَّ لِلَّذِيْنَ ظَلَمُوْا عَذَابًا دُوْنَ ذٰلِكَ وَلٰكِنَّ اَكْثَرَهُمْ لَا يَعْلَمُوْنَ",
        "Urdu" : "اور ان لوگوں کے لئے جو اڑے ہوئے ہیں اپنے ظلم پر یقینا اس سے پہلے بھی ایک عذاب ہے مگر ان میں سے اکثر جانتے نہیں",
        "English" : "And for those who did wrong there is another punishment before that, but most of them do not know."
      },
      {
        "ayet_no" : 48,
        "arbi" : "وَاصْبِرْ لِحُكْمِ رَبِّكَ فَاِنَّكَ بِاَعْيُنِنَا وَسَبِّــحْ بِحَمْدِ رَبِّكَ حِيْنَ تَـقُوْمُ",
        "Urdu" : "اور آپ صبر (و برداشت) ہی سے کام لیتے رہیں اپنے رب کے حکم (و فیصلہ) تک کہ یقینا آپ ہماری انکھوں کے سامنے ہیں اور تسبیح کرتے رہیں اپنے رب کی حمد کے ساتھ جب آپ اٹھیں",
        "English" : "So wait patiently (O Muhammad) for the Decision of your Lord, for verily, you are under Our Eyes , and glorify the Praises of your Lord when you get up from sleep."
      },
      {
        "ayet_no" : 49,
        "arbi" : "وَمِنَ الَّيْلِ فَسَبِّحْهُ وَاِدْبَارَ النُّجُوْمِ",
        "Urdu" : "اور رات کو بھی اور ستاروں کے پیٹھ پھیرنے (اور ڈوبنے) کے بعد بھی",
        "English" : "And, in parts of night too, proclaim His purity, and at the time of setting of the stars."
      }
    ]
  }
]