[
  {
    "surah_no" : 57,
    "total_ayah" : 29,
    "name" : "Surah e AL-Hadid",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "سَبَّحَ لِلّٰهِ مَا فِي السَّمٰوٰتِ وَالْاَرْضِ ۭ وَهُوَ الْعَزِيْزُ الْحَكِيْمُ",
        "Urdu" : "اللہ کی پاکی بیان کرتا ہے وہ سب کچھ جو کہ آسمانوں اور زمین میں ہے اور وہی ہے بڑا زبردست نہایت حکمت والا",
        "English" : "All that is in the heavens and the earth proclaims Allah‘s purity, and He is the Mighty, the Wise."
      },
      {
        "ayet_no" : 2,
        "arbi" : "لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ ۚ يُـحْيٖ وَيُمِيْتُ ۚ وَهُوَ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
        "Urdu" : "اسی کے لئے ہے بادشاہی آسمانوں اور زمین کی وہی زندگی بخشتا اور موت دیتا ہے اور وہی ہے ہرچیز پر پوری قدرت رکھنے والا ف۲",
        "English" : "To Him belongs the Kingdom of the heavens and the earth. He gives life and brings death, and He is Powerful to do any thing."
      },
      {
        "ayet_no" : 3,
        "arbi" : "هُوَ الْاَوَّلُ وَالْاٰخِرُ وَالظَّاهِرُ وَالْبَاطِنُ ۚ وَهُوَ بِكُلِّ شَيْءٍ عَلِيْمٌ",
        "Urdu" : "وہی اول وہی آخر وہی ظاہر وہی باطن اور وہی ہے ہرچیز کو پوری طرح جاننے والا",
        "English" : "He is the First and the Last, and the Manifest and the Hidden, and He is All-Knowing about every thing."
      },
      {
        "ayet_no" : 4,
        "arbi" : "هُوَ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ فِيْ سِـتَّةِ اَيَّامٍ ثُمَّ اسْـتَوٰى عَلَي الْعَرْشِ ۭ يَعْلَمُ مَا يَـلِجُ فِي الْاَرْضِ وَمَا يَخْــرُجُ مِنْهَا وَمَا يَنْزِلُ مِنَ السَّمَاۗءِ وَمَا يَعْرُجُ فِيْهَا ۭ وَهُوَ مَعَكُمْ اَيْنَ مَا كُنْتُمْ ۭ وَاللّٰهُ بِمَا تَعْمَلُوْنَ بَصِيْرٌ",
        "Urdu" : "وہ (اللہ) وہی ہے جس نے پیدا فرمایا آسمانوں اور زمین (کی اس حکمتوں بھری کائنات) کو چھ دنوں (کی مدت) میں پھر وہ مستوی (و جلوہ افروز) ہوا عرش پر وہ جانتا ہے وہ سب کچھ جو کہ داخل ہوتا ہے زمین میں اور وہ سب کچھ بھی جو کہ اس سے نکلتا ہے اور جو کچھ کہ اترتا ہے آسمان سے اور جو چڑھتا ہے اس میں اور وہ بہرحال تمہارے ساتھ ہے جہاں بھی تم ہو گے اور اللہ پوری طرح دیکھ رہا ہے ان تمام کاموں کو جو تم لوگ کرتے ہو ۔",
        "English" : "He is the One who created the heavens and the earth in six days, then He positioned Himself on the Throne. He knows whatever goes into the earth and whatever comes out from it, and whatever descends from the sky, and whatever ascends thereto. He is with you wherever you are, and Allah is watchful of whatever you do."
      },
      {
        "ayet_no" : 5,
        "arbi" : "لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ ۭ وَاِلَى اللّٰهِ تُرْجَعُ الْاُمُوْرُ",
        "Urdu" : "اسی کے لئے ہے بادشاہی آسمانوں اور زمین کی اور اللہ ہی کی طرف لوٹائے جاتے ہیں سب امور",
        "English" : "To Him belongs the kingdom of the heavens and the earth, and to Allah all matters are returned."
      },
      {
        "ayet_no" : 6,
        "arbi" : "يُوْلِجُ الَّيْلَ فِي النَّهَارِ وَيُوْلِجُ النَّهَارَ فِي الَّيْلِ ۭ وَهُوَ عَلِيْمٌۢ بِذَاتِ الصُّدُوْرِ",
        "Urdu" : "وہی داخل کرتا ہے رات کو دن میں اور دن کو داخل کرتا ہے رات میں اور وہی ہے جاننے والا دلوں کے رازوں کو ف۱",
        "English" : "He makes the night enter into the day, and makes the day enter into the night, and He is All-Knowing about whatever lies in the hearts."
      },
      {
        "ayet_no" : 7,
        "arbi" : "اٰمِنُوْا بِاللّٰهِ وَرَسُوْلِهٖ وَاَنْفِقُوْا مِمَّا جَعَلَكُمْ مُّسْتَخْلَفِيْنَ فِيْهِ ۭ فَالَّذِيْنَ اٰمَنُوْا مِنْكُمْ وَاَنْفَقُوْا لَهُمْ اَجْرٌ كَبِيْرٌ",
        "Urdu" : "ایمان لاؤ تم لوگ اللہ پر اور اس کے رسول پر اور خرچ کرو اس مال میں سے جس میں اللہ نے تم کو جانشین بنایا ہے (اپنے فضل و کرم سے) پھر جو لوگ تم میں سے ایمان لے آئے اور انہوں نے خرچ بھی کیا تو ان کے لئے ایک بہت بڑا اجر ہے ف۲",
        "English" : "Believe in Allah and His Messenger, and spend out of that (wealth) in which He has appointed you as deputies. So, for those of you who have believed and spent (in Allah‘s way), there is a big reward."
      },
      {
        "ayet_no" : 8,
        "arbi" : "وَمَا لَكُمْ لَا تُؤْمِنُوْنَ بِاللّٰهِ ۚ وَالرَّسُوْلُ يَدْعُوْكُمْ لِتُؤْمِنُوْا بِرَبِّكُمْ وَقَدْ اَخَذَ مِيْثَاقَكُمْ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
        "Urdu" : "اور تمہیں کیا ہوا (اے لوگوں !) کہ تم ایمان نہیں لاتے اللہ پر جب کہ اس کا رسول تمہیں بلا رہا ہے کہ تم ایمان لاؤ اپنے رب پر اور وہ (وحدہ لاشریک) تم سے پختہ عہد بھی لے چکا ہے اگر تم واقعی ماننے والے ہو",
        "English" : "What is wrong with you that you do not believe in Allah, while the Messenger invites you to believe in your Lord, and He has taken your covenant, if you are to believe ?"
      },
      {
        "ayet_no" : 9,
        "arbi" : "هُوَ الَّذِيْ يُنَزِّلُ عَلٰي عَبْدِهٖٓ اٰيٰتٍۢ بَيِّنٰتٍ لِّيُخْرِجَكُمْ مِّنَ الظُّلُمٰتِ اِلَى النُّوْرِ ۭ وَاِنَّ اللّٰهَ بِكُمْ لَرَءُوْفٌ رَّحِيْمٌ",
        "Urdu" : "وہ (اللہ) وہی ہے جو نازل فرماتا ہے اپنے بندہ خاص پر کھلی کھلی آیتیں تاکہ وہ تمہیں نکالے (اپنے کرم سے) طرح طرح کے اندھیروں سے (حق و ہدایت کے) نور کی طرف اور بیشک اللہ تم سب پر (اے لوگوں !) یقنی طور پر بڑا ہی شفیق اور انتہائی مہربان ہے ف۳",
        "English" : "He is the One who reveals clear verses to His servant, so that He brings you out from layers of darkness into the light. And to you, Allah is Very-Kind indeed, Very-Merciful."
      },
      {
        "ayet_no" : 10,
        "arbi" : "وَمَا لَكُمْ اَلَّا تُنْفِقُوْا فِيْ سَبِيْلِ اللّٰهِ وَلِلّٰهِ مِيْرَاثُ السَّمٰوٰتِ وَالْاَرْضِ ۭ لَا يَسْتَوِيْ مِنْكُمْ مَّنْ اَنْفَقَ مِنْ قَبْلِ الْفَتْحِ وَقٰتَلَ ۭ اُولٰۗىِٕكَ اَعْظَمُ دَرَجَةً مِّنَ الَّذِيْنَ اَنْفَقُوْا مِنْۢ بَعْدُ وَقٰتَلُوْا ۭ وَكُلًّا وَّعَدَ اللّٰهُ الْحُسْنٰى ۭ وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرٌ",
        "Urdu" : "اور تمہیں کیا ہوگیا کہ تم خرچ نہیں کرتے اللہ کی راہ میں؟ حالانکہ اللہ ہی کے لئے ہے میراث آسمانوں اور زمین کی برابر نہیں ہو سکتے تم میں سے وہ لوگ (جو فتح کے بعد خرچ کریں گے اور جہاد کریں گے ان لوگوں کے) جنہوں نے خرچ کیا فتح سے پہلے اور وہ لڑے (راہ حق میں) ایسے لوگ درجہ کے اعتبار سے کہیں بڑھ کر ہیں ان لوگوں سے جنہوں نے خرچ کیا اس کے بعد اور وہ لڑے اور یوں اللہ نے ان سب سے وعدہ فرما رکھا ہے بھلائی کا اللہ پوری طرح باخبر ہے ان سب کاموں سے جو تم لوگ کرتے ہو ۔",
        "English" : "And what is wrong with you that you should not spend in the way of Allah, while to Allah belongs the inheritance of the heavens and the earth? Those who spent before the Conquest (of Makkah) and fought are not at par (with others). Those are much greater in rank than those who spent later and fought, though Allah has promised the good (reward) for each. Allah is well aware of what you do."
      },
      {
        "ayet_no" : 11,
        "arbi" : "مَنْ ذَا الَّذِيْ يُقْرِضُ اللّٰهَ قَرْضًا حَسَنًا فَيُضٰعِفَهٗ لَهٗ وَلَهٗٓ اَجْرٌ كَرِيْمٌ",
        "Urdu" : "کون ہے جو اللہ کو قرض دے اچھا قرض تاکہ اللہ اسے اس کے لئے بڑھاتا چلا جائے اور اس کے لئے ایک بڑا ہی عمدہ اجر ہے",
        "English" : "Who is there to advance a loan, a good loan, to Allah so that He multiplies it for him, and he may have a noble reward ?"
      },
      {
        "ayet_no" : 12,
        "arbi" : "يَوْمَ تَرَى الْمُؤْمِنِيْنَ وَالْمُؤْمِنٰتِ يَسْعٰى نُوْرُهُمْ بَيْنَ اَيْدِيْهِمْ وَبِاَيْمَانِهِمْ بُشْرٰىكُمُ الْيَوْمَ جَنّٰتٌ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَا ۭذٰلِكَ هُوَ الْفَوْزُ الْعَظِيْمُ",
        "Urdu" : "جس دن کہ تم ایماندار مردوں اور ایماندار عورتوں کو دیکھو گے کہ ان کا نور دوڑ رہا ہوگا ان کے آگے اور ان کے دائیں (اور ان سے کہا جائے گا کہ) خوشخبری ہو تمہیں آج کے دن ایسی عظیم الشان جنتوں کی جن کے نیچے سے بہہ رہی ہیں طرح طرح کی عظیم الشان نہریں ان میں تم ہمیشہ رہو گے یہی ہے سب سے بڑی کامیابی ۔",
        "English" : "On the Day when you will see the believing men and the believing women, their light proceeding in front of them and to their right hands, (it will be said to them,) :Good news for you today! Gardens beneath which rivers flow, to live therein forever! That is the great achievement,"
      },
      {
        "ayet_no" : 13,
        "arbi" : "يَوْمَ يَقُوْلُ الْمُنٰفِقُوْنَ وَالْمُنٰفِقٰتُ لِلَّذِيْنَ اٰمَنُوا انْظُرُوْنَا نَقْتَبِسْ مِنْ نُّوْرِكُمْ ۚ قِيْلَ ارْجِعُوْا وَرَاۗءَكُمْ فَالْتَمِسُوْا نُوْرًا ۭ فَضُرِبَ بَيْنَهُمْ بِسُوْرٍ لَّهٗ بَابٌ ۭ بَاطِنُهٗ فِيْهِ الرَّحْمَةُ وَظَاهِرُهٗ مِنْ قِبَلِهِ الْعَذَابُ",
        "Urdu" : "جس روز کہ منافق مرد اور منافق عورتیں اہل ایمان سے کہہ رہے ہوں گے کہ ذرا ہماری طرف بھی نظر کرو تاکہ ہم بھی آپ کے نور سے کچھ فائدہ اٹھا لیں جواب ملے گا کہ اپنے پیچھے لوٹ کر جاؤ اور وہاں کوئی نور تلاش کرو پھر ان کے درمیان حائل کر دی جائے گی ایک ایسی دیوار جس میں ایک دروازہ ہوگا اس کے اندر کی طرف تو رحمت ہوگی اور اس کے باہر کی طرف عذاب ہوگا ۔",
        "English" : "It shall be the Day whereon the hypocritical men and hypocritical women will say Unto those who believe: wait for us that we may borrow some of your light. Then betwixt them there will be set a high wall, wherein will be a door, the inside whereof hath mercy, while the outside thereof is toward the torment."
      },
      {
        "ayet_no" : 14,
        "arbi" : "يُنَادُوْنَهُمْ اَلَمْ نَكُنْ مَّعَكُمْ ۭ قَالُوْا بَلٰى وَلٰكِنَّكُمْ فَتَنْتُمْ اَنْفُسَكُمْ وَتَرَبَّصْتُمْ وَارْتَبْتُمْ وَغَرَّتْكُمُ الْاَمَانِيُّ حَتّٰى جَاۗءَ اَمْرُ اللّٰهِ وَغَرَّكُمْ بِاللّٰهِ الْغَرُوْرُ",
        "Urdu" : "وہ لوگ ایمان والوں کو پکار پکار کر کہیں گے کہ کیا ہم تمہارے ساتھ نہ تھے؟ وہ جواب دیں گے ہاں ضرور لیکن تم لوگوں نے خود فتنے میں ڈال رکھا تھا اپنے آپ کو تم (موقع اور فرصت کی) تاک میں لگے رہتے تھے تم شک میں مبتلا رہتے تھے اور تمہیں دھوکے میں ڈالے رکھا آرزؤوں نے یہاں تک کہ پہنچا اللہ کا حکم اور تم کو دھوکے میں ڈال رکھا تھا اللہ کے بارے میں اس بڑے دھوکے باز نے ۔",
        "English" : "They (the hypocrites) will call out to them (the believers), :Were we not with you? They will say, :Yes, (you were,) but you led your souls to a wrong way, and kept waiting (for an evil end to the Muslims), and remained in doubt, and were deluded by fancies, until Allah‘s command came to pass, and you were deceived about Allah by the Big Deceiver (Iblis)."
      },
      {
        "ayet_no" : 15,
        "arbi" : "فَالْيَوْمَ لَا يُؤْخَذُ مِنْكُمْ فِدْيَةٌ وَّلَا مِنَ الَّذِيْنَ كَفَرُوْا ۭ مَاْوٰىكُمُ النَّارُ ۭ هِىَ مَوْلٰىكُمْ ۭ وَبِئْسَ الْمَصِيْرُ",
        "Urdu" : "سو اب نہ تم سے کوئی فدیہ لیا جائے گا اور نہ ان لوگوں سے جو کھلم کھلا کفر کرتے رہے تھے تم سب کا ٹھکانا دوزخ ہے وہی تمہاری یار (اور تمہارا ٹھکانا) ہے اور بڑا ہی برا ٹھکانا ہے وہ ف۱",
        "English" : "So, no ransom will be accepted from you today, nor from those who disbelieved (openly). Your abode is the Fire, and it is an evil end."
      },
      {
        "ayet_no" : 16,
        "arbi" : "اَلَمْ يَاْنِ لِلَّذِيْنَ اٰمَنُوْٓا اَنْ تَخْشَعَ قُلُوْبُهُمْ لِذِكْرِ اللّٰهِ وَمَا نَزَلَ مِنَ الْحَقِّ ۙ وَلَا يَكُوْنُوْا كَالَّذِيْنَ اُوْتُوا الْكِتٰبَ مِنْ قَبْلُ فَطَالَ عَلَيْهِمُ الْاَمَدُ فَقَسَتْ قُلُوْبُهُمْ ۭ وَكَثِيْرٌ مِّنْهُمْ فٰسِقُوْنَ",
        "Urdu" : "کیا وقت نہیں آیا ان لوگوں کے لئے جو (زبانی کلامی) ایمان لائے اس بات کا کہ جھک جائیں ان کے دل اللہ کے ذکر کے آگے؟ اور اس حق (کی عظمت) کے سامنے جو نازل ہو چکا (ان کی ہدایت و راہنمائی کے لئے اللہ کی طرف سے؟) اور یہ کہ وہ ان لوگوں کی طرح نہ ہوجائیں جن کو ان سے پہلے کتاب دی گئی تھی پھر ان پر ایک لمبی مدت گزر گئی تو سخت ہوگئے ان کے دل اور ان میں زیادہ تر لوگ فاسق ہیں ۔",
        "English" : "Has the time not yet come for those who believe that their hearts should be humble for the remembrance of Allah and for the truth that has descended (through revelation)? They must not be like those to whom the Book was given before, but a long period passed on them (in which they did not repent), therefore their hearts became hard, and (thus) many of them are sinners."
      },
      {
        "ayet_no" : 17,
        "arbi" : "اِعْلَمُوْٓا اَنَّ اللّٰهَ يُـحْيِ الْاَرْضَ بَعْدَ مَوْتِهَا ۭ قَدْ بَيَّنَّا لَكُمُ الْاٰيٰتِ لَعَلَّكُمْ تَعْقِلُوْنَ",
        "Urdu" : "یقین جانو تم (اے لوگوں !) کہ اللہ زندہ کرتا ہے زمین کو اس کے مر چکنے کے بعد بیشک ہم نے کھول کر بیان کر دیں تمہارے لئےاپنی آیتیں تاکہ تم لوگ عقل سے کام لو",
        "English" : "Know well that Allah revives the land after its death. We have made the signs clear for you, so that you may understand."
      },
      {
        "ayet_no" : 18,
        "arbi" : "اِنَّ الْمُصَّدِّقِيْنَ وَالْمُصَّدِّقٰتِ وَاَقْرَضُوا اللّٰهَ قَرْضًا حَسَنًا يُّضٰعَفُ لَهُمْ وَلَهُمْ اَجْرٌ كَرِيْمٌ",
        "Urdu" : "بلاشبہ صدقہ دینے والے مرد اور صدقہ دینے والی عورتیں اور جنہوں نے قرض دیا اللہ (پاک سبحانہ و تعالٰی) کو اچھا قرض ان کو وہ کئی گنا بڑھا کر دیا جائے گا اور ان کے لئے ایک بڑا ہی عمدہ اجر ہے",
        "English" : "Surely those men who give Sadaqah (alms) and those women who give Sadaqah and have advanced a good loan to Allah, for them it will be multiplied, and for them there is a noble reward."
      },
      {
        "ayet_no" : 19,
        "arbi" : "وَالَّذِيْنَ اٰمَنُوْا بِاللّٰهِ وَرُسُلِهٖٓ اُولٰۗىِٕكَ هُمُ الصِّدِّيْقُوْنَ ڰ وَالشُّهَدَاۗءُ عِنْدَ رَبِّهِمْ ۭ لَهُمْ اَجْرُهُمْ وَنُوْرُهُمْ ۭ وَالَّذِيْنَ كَفَرُوْا وَكَذَّبُوْا بِاٰيٰتِنَآ اُولٰۗىِٕكَ اَصْحٰبُ الْجَحِيْمِ",
        "Urdu" : "اور جو لوگ (سچے دل سے) ایمان لائے اللہ پر اور اس کے رسولوں پر یہی لوگ ہیں صدیق اور شہید ان کے رب کے یہاں ان کے لئے ان کا اجر اور ان کا نور ہے اور جن لوگوں نے کفر کیا اور جھٹلایا ہماری آیتوں کو وہ دوزخی ہیں",
        "English" : "And those who believed in Allah and His messengers, — those are the Siddiqs (the most righteous after prophets) and the Shuhada‘ (martyrs) in the sight of your Lord. For them shall be their reward and their light. As for those who disbelieved and rejected Our verses, they are the inmates of Hell."
      },
      {
        "ayet_no" : 20,
        "arbi" : "اِعْلَمُوْٓا اَنَّمَا الْحَيٰوةُ الدُّنْيَا لَعِبٌ وَّلَهْوٌ وَّزِيْنَةٌ وَّتَفَاخُرٌۢ بَيْنَكُمْ وَتَكَاثُرٌ فِي الْاَمْوَالِ وَالْاَوْلَادِ ۭ كَمَثَلِ غَيْثٍ اَعْجَبَ الْكُفَّارَ نَبَاتُهٗ ثُمَّ يَهِيْجُ فَتَرٰىهُ مُصْفَرًّا ثُمَّ يَكُوْنُ حُطَامًا ۭوَفِي الْاٰخِرَةِ عَذَابٌ شَدِيْدٌ ۙ وَّمَغْفِرَةٌ مِّنَ اللّٰهِ وَرِضْوَانٌ ۭ وَمَا الْحَيٰوةُ الدُّنْيَآ اِلَّا مَتَاعُ الْغُرُوْرِ",
        "Urdu" : "یقین جانو (اے لوگوں !) کہ یہ دنیاوی زندگی تو محض ایک کھیل اور تماشا ہے اور ایک زیبائش اور تمہارا آ پس میں ایک دوسرے پر فخر جتانا اور مال و اولاد میں ایک دوسرے سے بڑھ جانے کی کوشش کرنا (اس کی مثال ایسے ہی ہے) جیسے بارش برستی ہے اور اس سے اگنے والی پیداوار دل موہ لیتی ہے کافروں کے پھر چندے بعد وہ خشک ہوجاتی ہے تم دیکھتے ہو کہ وہ زرد پڑگئی ہے پھر وہ چورا چورا ہو کر رہ جاتی ہے آخرت میں بڑا سخت عذاب بھی ہے اور اللہ کی طرف ایک عظیم الشان بخشش بھی، اور اس کی رضا بھی، اور دنیاوی زندگی تو دھوکے کے سوا کچھ نہیں ۔ ف۲",
        "English" : "Know well that the worldly life is but a play and an amusement, and a show of beauty, and exchange of boastful claims between you, and a competition of increase in riches and children. (All this is) like a rain, the growth of which attracts the farmers, then it withers, and you see it turning yellow, then it becomes straw. And in the Hereafter there is a severe punishment (for the disbelievers), and forgiveness from Allah and (Allah‘s) pleasure (for the believers and the righteous). The worldly life is nothing but a material of delusion."
      },
      {
        "ayet_no" : 21,
        "arbi" : "سَابِقُوْٓا اِلٰى مَغْفِرَةٍ مِّنْ رَّبِّكُمْ وَجَنَّةٍ عَرْضُهَا كَعَرْضِ السَّمَاۗءِ وَالْاَرْضِ ۙ اُعِدَّتْ لِلَّذِيْنَ اٰمَنُوْا بِاللّٰهِ وَرُسُلِهٖ ۭ ذٰلِكَ فَضْلُ اللّٰهِ يُؤْتِيْهِ مَنْ يَّشَاۗءُ ۭ وَاللّٰهُ ذُو الْفَضْلِ الْعَظِيْمِ",
        "Urdu" : "( پس) تم ایک دوسرے سے آگے بڑھنے کی کوشش کرو (اے لوگوں !) اپنے رب کی بخشش اور اس عظیم الشان جنت کی طرف جس کی چوڑائی آسمان اور زمین کے برابر ہے جسے تیار کیا گیا ہے ان لوگوں کے لئے جو ایمان لائے اللہ پر اور اس کے رسولوں پر یہ اللہ کا فضل ہے جسے وہ عطاء فرماتا ہے جس کو چاہتا ہے اور اللہ بڑا ہی فضل والا ہے ۔",
        "English" : "Compete each other in proceeding towards forgiveness from your Lord and to Paradise the width of which is like the width of the sky and the earth. It has been prepared for those who believe in Allah and His messengers. That is the bounty of Allah; He gives it to whomsoever He Wills and Allah is the Lord of the great bounty."
      },
      {
        "ayet_no" : 22,
        "arbi" : "مَآ اَصَابَ مِنْ مُّصِيْبَةٍ فِي الْاَرْضِ وَلَا فِيْٓ اَنْفُسِكُمْ اِلَّا فِيْ كِتٰبٍ مِّنْ قَبْلِ اَنْ نَّبْرَاَهَا ۭ اِنَّ ذٰلِكَ عَلَي اللّٰهِ يَسِيْرٌ",
        "Urdu" : "جو بھی کوئی مصیبت پیش آتی ہے خواہ وہ زمین کے (کسی حصے) میں ہو یا خود تمہاری جانوں میں پیش آئے وہ ثبت (و مندرج) ہے ایک عظیم الشان کتاب میں اس سے پہلے کہ ہم اس کو پیدا کریں ف۱ بیشک ایسا کرنا اللہ کے لئے کچھ بھی مشکل نہیں ف۲",
        "English" : "Naught of distress be fall the earth or your persons but it is inscribed in the Book even before We have created them. Verily with Allah's that is easy."
      },
      {
        "ayet_no" : 23,
        "arbi" : "لِّكَيْلَا تَاْسَوْا عَلٰي مَا فَاتَكُمْ وَلَا تَفْرَحُوْا بِمَآ اٰتٰىكُمْ ۭ وَاللّٰهُ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُـــوْرِۨ",
        "Urdu" : "(اور ہم نے یہ تمہیں اس لئے بتلا دیا کہ) تاکہ نہ تو تم لوگ کسی ایسی چیز پر غم کھاؤ جو تمہارے ہاتھ سے جاتی رہے اور نہ ہی کسی ایسی چیز پر اترانے لگو جو اللہ تمہیں عطا فرمائے اور اللہ تعالیٰ پسند نہیں کرتا کسی بھی خود پسند شیخی باز کو",
        "English" : "In order that you may not be sad over matters that you fail to get, nor rejoice because of that which has been given to you. AndAllah likes not prideful boasters."
      },
      {
        "ayet_no" : 24,
        "arbi" : "الَّذِيْنَ يَبْخَلُوْنَ وَيَاْمُرُوْنَ النَّاسَ بِالْبُخْلِ ۭ وَمَنْ يَّتَوَلَّ فَاِنَّ اللّٰهَ هُوَ الْغَنِيُّ الْحَمِيْدُ",
        "Urdu" : "جو خود بھی بخل کرتے ہیں اور دوسروں کو بھی بخل کی تعلیم دیتے ہیں اور جو کوئی اللہ سے منہ موڑے گا تو یقینا اللہ (کا اس سے کچھ بھی نہیں بگڑے گا کہ وہ یقینا) ہر کسی سے بےنیاز اور ہر طرح کی خوبی اور حمد کا سزاوار ہے",
        "English" : "Those who are misers and enjoin upon people miserliness (Allah is not in need of their charity). And whosoever turns away (from Faith Allah's Monotheism), then Allah is Rich (Free of all wants), Worthy of all praise."
      },
      {
        "ayet_no" : 25,
        "arbi" : "لَقَدْ اَرْسَلْنَا رُسُلَنَا بِالْبَيِّنٰتِ وَاَنْزَلْنَا مَعَهُمُ الْكِتٰبَ وَالْمِيْزَانَ لِيَقُوْمَ النَّاسُ بِالْقِسْطِ ۚ وَاَنْزَلْنَا الْحَدِيْدَ فِيْهِ بَاْسٌ شَدِيْدٌ وَّمَنَافِعُ لِلنَّاسِ وَلِيَعْلَمَ اللّٰهُ مَنْ يَّنْصُرُهٗ وَرُسُلَهٗ بِالْغَيْبِ ۭاِنَّ اللّٰهَ قَوِيٌّ عَزِيْزٌ",
        "Urdu" : "بلاشبہ ہم نے بھیجا اپنے رسولوں کو کھلی نشانیوں کے ساتھ اور ان کے ساتھ کتاب بھی اتاری اور میزان بھی تاکہ لوگ انصاف قائم کریں اور ہم نے لوہا اتارا جس میں بہت زور بھی ہے اور لوگوں کے لئے طرح طرح کے دوسرے فائدے بھی (تاکہ لوگ اس سے طرح طرح سے مستفید ہوں) اور تاکہ اللہ دیکھ لے کہ کون مدد کرتا ہے اللہ کی اور رسولوں کی بن دیکھے بیشک اللہ بڑا ہی قوت والا نہایت ہی زبردست ہے ۔",
        "English" : "We have indeed sent Our messengers with clear proofs, and sent down with them the Book and the Balance, so that people may uphold equity. And We sent down iron in which there is strong power, and benefits for the people; and (We did it) so that Allah knows the one who helps Him and His messengers without seeing (Him). Surely Allah is Strong, Mighty."
      },
      {
        "ayet_no" : 26,
        "arbi" : "وَلَقَدْ اَرْسَلْنَا نُوْحًا وَّاِبْرٰهِيْمَ وَجَعَلْنَا فِيْ ذُرِّيَّـتِهِمَا النُّبُوَّةَ وَالْكِتٰبَ فَمِنْهُمْ مُّهْتَدٍ ۚ وَكَثِيْرٌ مِّنْهُمْ فٰسِقُوْنَ",
        "Urdu" : "اور بلاشبہ ہم ہی نے بھیجا (اس سے پہلے) نوح اور ابراہیم کو پیغمبر بنا کر اور ان ہی دونوں کی نسل میں ہم نے نبوت بھی رکھ دی اور کتاب بھی پھر ان میں سے کچھ تو راہ راست پر رہے مگر ان میں سے زیادہ تر پھر بھی بدکار ہی رہے ف۱",
        "English" : "Indeed We sent NuH and Ibrahim, and kept the Book and prophet-hood (continuing) in their progeny. So, some of those (to whom they were sent) were on the right path, and many of them were sinners."
      },
      {
        "ayet_no" : 27,
        "arbi" : "ثُمَّ قَفَّيْنَا عَلٰٓي اٰثَارِهِمْ بِرُسُلِنَا وَقَفَّيْنَا بِعِيْسَى ابْنِ مَرْيَمَ وَاٰتَيْنٰهُ الْاِنْجِيْلَ ڏ وَجَعَلْنَا فِيْ قُلُوْبِ الَّذِيْنَ اتَّبَعُوْهُ رَاْفَةً وَّرَحْمَةً ۭ وَرَهْبَانِيَّةَۨ ابْتَدَعُوْهَا مَا كَتَبْنٰهَا عَلَيْهِمْ اِلَّا ابْتِغَاۗءَ رِضْوَانِ اللّٰهِ فَمَا رَعَوْهَا حَقَّ رِعَايَــتِهَا ۚ فَاٰتَيْنَا الَّذِيْنَ اٰمَنُوْا مِنْهُمْ اَجْرَهُمْ ۚ وَكَثِيْرٌ مِّنْهُمْ فٰسِقُوْنَ",
        "Urdu" : "پھر ان کے بعد ہم نے پے درپے اپنے رسول بھیجے اور ان سب کے بعد آخر میں ہم نے عیسیٰ بیٹے مریم کو بھیجا اور ان کو انجیل دی اور ان لوگوں کے دلوں میں کہ جنہوں نے آپ کی پیروی کی ہم نے ایک خاص قسم کی نرمی اور مہربانی رکھ دی اور ترک دنیا (رہبانیت) کی وہ بدعت جسے ان لوگوں نے خود ایجاد کرلیا تھا ہم نے ان پر مقرر نہیں کی تھی اللہ کی رضا حاصل کرنے کی خاطر ہی ایجاد کیا تھا مگر وہ خود اسے نباہ نہ سکے جیسا کہ اس کے نباہنے کا حق تھا پھر ان میں سے جو لوگ ایمان لائے ہوں تو ہم نے ان کا اجر دے دیا مگر ان میں سے زیادہ تر بدکار ہی رہے ۔",
        "English" : "Then We made Our messengers follow them one after the other, then We sent after them lsa,, the son of Maryam (Jesus, son of Mary), and gave him the Injil, and placed compassion and mercy in the hearts of his followers. As for monasticism, it was invented by them; We did not ordain it for them, but (they adopted it) to seek Allah‘s pleasure, then could not observe it as was due. So We gave the believers from among them their reward. And many of them are sinners."
      },
      {
        "ayet_no" : 28,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَاٰمِنُوْا بِرَسُوْلِهٖ يُؤْتِكُمْ كِفْلَيْنِ مِنْ رَّحْمَتِهٖ وَيَجْعَلْ لَّكُمْ نُوْرًا تَمْشُوْنَ بِهٖ وَيَغْفِرْ لَكُمْ ۭ وَاللّٰهُ غَفُوْرٌ رَّحِيْمٌ",
        "Urdu" : "اے وہ لوگوں جو ایمان لائے ہو ڈرو تم اللہ سے اور (سچے دل سے) ایمان لاؤ اس کے رسول پر اللہ عطا فرمائے گا تم کواپنی رحمت سے دوہرا حصہ اور وہ نوازے گا تم کو ایک ایسے عظیم الشان نور سے جس کے ذریعے تم چلو گے (حق و ہدایت کی سیدھی شاہراہ پر) اور (مزید یہ کہ) وہ تمہاری بخشش فرمائے گا اور اللہ بڑا ہی بخشنے والا انتہائی مہربان ہے ۔",
        "English" : "O you who believe, fear Allah, and believe in His Messenger, and He will give you two shares (of reward) out of His mercy, and will make for you a light whereby you will walk, and will forgive you,__ And Allah is Most-Forgiving, Very-Merciful."
      },
      {
        "ayet_no" : 29,
        "arbi" : "لِّئَلَّا يَعْلَمَ اَهْلُ الْكِتٰبِ اَلَّا يَــقْدِرُوْنَ عَلٰي شَيْءٍ مِّنْ فَضْلِ اللّٰهِ وَاَنَّ الْفَضْلَ بِيَدِ اللّٰهِ يُؤْتِيْهِ مَنْ يَّشَاۗءُ ۭ وَاللّٰهُ ذُو الْفَضْلِ الْعَظِيْمِ",
        "Urdu" : "(اور ایمان پر یہ انعامات اور ان کی اس طرح پیشگی خبر اس لئے دی جا رہی ہے کہ) تاکہ اہل کتاب یہ نہ سمجھیں کہ (اللہ کے فضل پر ان کا کوئی اجارہ ہے اور) مسلمان اللہ کے فضل میں سے کچھ بھی حاصل نہیں کر سکتے اور یہ کہ فضل تو بلاشبہ اللہ ہی کے ہاتھ میں ہے وہ جسے چاہتا ہے عطا فرماتا ہے اور اللہ بڑا ہی فضل والا ہے ۔",
        "English" : "This He will award that the people of the Book may know that they control naught of the grace of Allah, and that the grace is in Allah's hand; He vouchsafe it Unto whomsoever He wilt, And Allah is Owner of mighty grace."
      }
    ]
  }
]