[
  {
    "surah_no" : 58,
    "total_ayah" : 22,
    "name" : "Surah e AL-Majadil'lah",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "قَدْ سَمِعَ اللّٰهُ قَوْلَ الَّتِيْ تُجَادِلُكَ فِيْ زَوْجِهَا وَتَشْـتَكِيْٓ اِلَى اللّٰهِ ڰ وَاللّٰهُ يَسْمَعُ تَحَاوُرَكُمَا ۭ اِنَّ اللّٰهَ سَمِيْعٌۢ بَصِيْرٌ",
        "Urdu" : "بیشک سن لی اللہ نے بات اس عورت کی جو جھگڑا کر رہی ہے آپ سے (اے پیغمبر!) اپنے خاوند کے بارے میں اور شکایت کر رہی ہے (ا پنے معاملے کی) اللہ کے حضور اور اللہ سن رہا ہے گفتگو تم دونوں کی بیشک اللہ ہر کسی کی سنتا سب کچھ دیکھنے والا ہے ف۱",
        "English" : "Allah has heard the talk of the woman who was debating with you about her husband, and was complaining to Allah. Allah was hearing the conversation between both of you. Indeed, Allah is All-Hearing, All-Knowing."
      },
      {
        "ayet_no" : 2,
        "arbi" : "اَلَّذِيْنَ يُظٰهِرُوْنَ مِنْكُمْ مِّنْ نِّسَاۗىِٕــهِمْ مَّا هُنَّ اُمَّهٰتِهِمْ ۭاِنْ اُمَّهٰتُهُمْ اِلَّا اڿ وَلَدْنَهُمْ ۭ وَاِنَّهُمْ لَيَقُوْلُوْنَ مُنْكَرًا مِّنَ الْقَوْلِ وَزُوْرًا ۭ وَاِنَّ اللّٰهَ لَعَفُوٌّ غَفُوْرٌ",
        "Urdu" : "تم میں سے جو لوگ ظہار کرلیںاپنی بیویوں سے وہ (ان کے کہنے سے) ان کی مائیں نہیں بن جاتیں ان کی مائیں تو بس وہی ہیں جنہوں نے ان کو جنا ہے اور بلاشبہ ایسے لوگ ایک بڑی ہی نامعقول اور جھوٹی بات منہ سے نکالتے ہیں اور بیشک اللہ بڑا ہی معاف کرنے والانہایت ہی درگزر کرنے والا ہے",
        "English" : "Those of you who declare Zihar against their wives, they are not their mothers. Their mothers are none else but those who gave birth to them. Undoubtedly they utter an evil word and a lie; and Allah is surely Most-Forgiving, Very-Merciful."
      },
      {
        "ayet_no" : 3,
        "arbi" : "وَالَّذِيْنَ يُظٰهِرُوْنَ مِنْ نِّسَاۗىِٕهِمْ ثُمَّ يَعُوْدُوْنَ لِمَا قَالُوْا فَتَحْرِيْرُ رَقَبَةٍ مِّنْ قَبْلِ اَنْ يَّـتماۗسَّا ۭ ذٰلِكُمْ تُوْعَظُوْنَ بِهٖ ۭ وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرٌ",
        "Urdu" : "اور جو لوگاپنی بیویوں سے ظہار کرتے ہیں پھر وہاپنی کہی ہوئی بات سے پھرنا چاہتے ہیں تو ان کے ذمے ایک گردن (یعنی غلام یا لونڈی) کا آزاد کرنا ہے اس سے پہلے کہ وہ آ پس میں ایک دوسرے کو ہاتھ لگائیں اس حکم سے تم کو نصیحت کی جاتی ہے اور اللہ پوری طرح باخبر ہے ان تمام کاموں سے جو تم لوگ کرتے ہو",
        "English" : "Those who declare Zihar against their wives, then retract what they said, obligated on them is to free the neck (of a slave) before the two (spouses) touch one another. This is what you are advised, and Allah is well aware of what you do."
      },
      {
        "ayet_no" : 4,
        "arbi" : "فَمَنْ لَّمْ يَجِدْ فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ مِنْ قَبْلِ اَنْ يَّتَمَـاۗسَّا ۚ فَمَنْ لَّمْ يَسْتَطِعْ فَاِطْعَامُ سِـتِّيْنَ مِسْكِيْنًا ۭ ذٰلِكَ لِتُؤْمِنُوْا بِاللّٰهِ وَرَسُوْلِهٖ ۭ وَتِلْكَ حُدُوْدُ اللّٰهِ ۭ وَلِلْكٰفِرِيْنَ عَذَابٌ اَلِيْمٌ",
        "Urdu" : "پھر جس شخص کو یہ میسر نہ ہو تو اس کے ذمے روزے رکھنا ہے لگاتار دو ماہ کے اس سے قبل کہ وہ ایک دوسرے کو ہاتھ لگائیں پھر جس سے یہ بھی نہ ہو سکے تو اس کے ذمے ساٹھ مسکینوں کو کھانا کھلانا ہے یہ حکم اس لئے دیا جا رہا ہے کہ تم لوگ ایمان لاؤ اللہ پر اور اس کے رسول پر یہ اللہ کی مقرر کی ہوئی حدیں ہیں اور کافروں کے لئے ایک بڑا ہی دردناک عذاب ہے",
        "English" : "But whoever does not find (a slave) has to fast for two consecutive months before the two (spouses) touch one another. Then the one who is not able to do so has to feed sixty indigent persons. This is (laid down) so that you believe in Allah and His Messenger. These are the limits set by Allah; and for the disbelievers there is a painful punishment."
      },
      {
        "ayet_no" : 5,
        "arbi" : "اِنَّ الَّذِيْنَ يُحَاۗدُّوْنَ اللّٰهَ وَرَسُوْلَهٗ كُبِتُوْا كَمَا كُبِتَ الَّذِيْنَ مِنْ قَبْلِهِمْ وَقَدْ اَنْزَلْنَآ اٰيٰتٍۢ بَيِّنٰتٍ ۭ وَلِلْكٰفِرِيْنَ عَذَابٌ مُّهِيْنٌ",
        "Urdu" : "بلا شبہ جو لوگ مخالفت کرتے ہیں اللہ کی اور اس کے رسول کی وہ اسی طرح ذلیل و خوار ہوں گے جس طرح کہ ان سے پہلے والے لوگ ذلیل و خوار ہو چکے ہیں بلاشبہ ہم نے (حق و حقیقت کو واضح کرنے کے لئے) کھلی کھلی آیتیں نازل کر دی ہیں اور کافروں کے لئے ایک بڑا ہی رسوا کن عذاب ہے",
        "English" : "Verily, those who oppose Allah and His Messenger (Muhammad) will be disgraced, as those before them (among the past nation), were disgraced. And We have sent down clear Ayt (proofs, evidences, verses, lessons, signs, revelations, etc.). And for the disbelievers is a disgracing torment."
      },
      {
        "ayet_no" : 6,
        "arbi" : "يَوْمَ يَبْعَثُهُمُ اللّٰهُ جَمِيْعًا فَيُنَبِّئُهُمْ بِمَا عَمِلُوْا     ۭ اَحْصٰىهُ اللّٰهُ وَنَسُوْهُ     ۭ وَاللّٰهُ عَلٰي كُلِّ شَيْءٍ شَهِيْدٌ",
        "Urdu" : "جس دن کہ اللہ ان سب کو پھر سے زندہ کر کے اٹھائے گا پھر ان کو وہ سب کچھ (کھول کر) بتادے گا جو یہ لوگ (زندگی بھر) کرتے رہے تھے یہ تو اسے بھول گئے ہیں مگر اللہ نے ان کا سب کیا دھرا گن گن کر محفوظ کر رکھا ہے اور اللہ ہرچیز پر مطلع ہے",
        "English" : "On the Day whereon Allah will raise them all together and declare Unto them that which they have worked. Allah hath taken count thereof, whilst they forget it. And Allah is over everything a Witness."
      },
      {
        "ayet_no" : 7,
        "arbi" : "اَلَمْ تَرَ اَنَّ اللّٰهَ يَعْلَمُ مَا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ ۭ مَا يَكُوْنُ مِنْ نَّجوٰى ثَلٰثَةٍ اِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ اِلَّا هُوَ سَادِسُهُمْ وَلَآ اَدْنٰى مِنْ ذٰلِكَ وَلَآ اَكْثَرَ اِلَّا هُوَ مَعَهُمْ اَيْنَ مَا كَانوْا ۚ ثُمَّ يُنَبِّئُهُمْ بِمَا عَمِلُوْا يَوْمَ الْقِيٰمَةِ ۭاِنَّ اللّٰهَ بِكُلِّ شَيْءٍ عَلِيْمٌ",
        "Urdu" : "کیا تم نے اس پر غور نہیں کیا کہ اللہ کو قطعی طور پر معلوم ہے وہ سب کچھ جو کہ آسمانوں میں ہے اور وہ سب کچھ بھی جو کہ زمین میں ہے کوئی سرگوشی نہیں ہوتی تین آدمیوں کی مگر وہ ان کا چوتھا ہوتا ہے اور نہ پانچ کی مگر وہ ان کا چھٹا ہوتا ہے اور نہ کوئی اس سے کم اور نہ زیادہ مگر وہ ان کے ساتھ ہوتا ہے ف ۱وہ جہاں کہیں بھی ہوں پھر وہ خبر کردے گا ان کو قیامت کے دن ان کے ان تمام کاموں کی جو یہ لوگ (زندگی بھر) کرتے رہے تھے بلاشبہ اللہ ہرچیز کو پوری طرح جانتا ہے ف۲",
        "English" : "Have you not observed that Allah knows everything in the heavens and everything in the earth? No secret consulta-tion takes place between three, but He is fourth of them, nor between five, but He is sixth of them, nor between fewer than that or more, but He is with them wherever they may be. Then He will tell them on the Day of Judgment what they did. Surely Allah is All-Knowing about every thing."
      },
      {
        "ayet_no" : 8,
        "arbi" : "اَلَمْ تَرَ اِلَى الَّذِيْنَ نُهُوْا عَنِ النَّجْوٰى ثُمَّ يَعُوْدُوْنَ لِمَا نُهُوْا عَنْهُ وَيَتَنٰجَوْنَ بِالْاِثْمِ وَالْعُدْوَانِ وَمَعْصِيَتِ الرَّسُوْلِ ۡ وَاِذَا جَاۗءُوْكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ اللّٰهُ ۙوَيَقُوْلُوْنَ فِيْٓ اَنْفُسِهِمْ لَوْلَا يُعَذِّبُنَا اللّٰهُ بِمَا نَقُوْلُ ۭ حَسْبُهُمْ جَهَنَّمُ ۚ يَصْلَوْنَهَا ۚ فَبِئْسَ الْمَصِيْرُ",
        "Urdu" : "کیا تم نے ان لوگوں کو نہیں دیکھا جن کو سرگوشیاں کرنے سے منع کردیا گیا مگر وہ پھر وہی حرکت کئے جاتے ہیں جس سے انہیں روکا گیا ہے اور وہ سرگوشی کرتے ہیں گناہ کی اور (ظلم و) زیادتی کی اور (خدا کے) رسول کی نافرمانی کی اور جب وہ آپ کے پاس آتے ہیں تو آپ کو ان لفظوں سے سلام کرتے ہیں جن سے اللہ نے آپ کو سلام نہیں کیا اور وہ اپنے دلوں میں کہتے ہیں کہ اللہ ہمیں ہماری ان باتوں پر عذاب کیوں نہیں دیتا ان کے لئے کافی ہے جہنم جس میں ان کو داخل ہونا ہوگا سو بڑا ہی برا ٹھکانہ ہے وہ ف۱",
        "English" : "Did you not see those who were forbidden from holding secret talks; then they do again what they were forbidden to do? They whisper for sinful act and wrongdoing and disobedience of the prophet, and when they come to you, they greet you the way Allah does not greet you, and say to themselves, :Why does Allah not punish us for what we say? Enough for them is Jahannam (Hell); they will enter it, and it is an evil end."
      },
      {
        "ayet_no" : 9,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِذَا تَنَاجَيْتُمْ فَلَا تَتَـنَاجَوْا بِالْاِثْمِ وَالْعُدْوَانِ وَمَعْصِيَتِ الرَّسُوْلِ وَتَنَاجَوْا بِالْبِرِّ وَالتَّقْوٰى ۭ وَاتَّقُوا اللّٰهَ الَّذِيْٓ اِلَيْهِ تُحْشَرُوْنَ",
        "Urdu" : "اے وہ لوگوں جو ایمان لائے ہو جب تمہیں آ پس میں سرگوشی کرنا ہو تو گناہ زیادتی اور رسول کی نافرمانی کی سرگوشی مت کرنا بلکہ نیکی اور پرہیزگاری کی سرگوشی کیا کرو اور ہمیشہ ڈرتے رہا کرو اللہ سے جس کے حضور تم سب کو حشر میں پیش ہونا ہے",
        "English" : "O you who believe, when you hold secret counsel, do not whisper for sinful act and wrongdoing and disobedience of the prophet, and do whisper for righteousness and taqwa (piety). And fear Allah, before whom you will be gathered together."
      },
      {
        "ayet_no" : 10,
        "arbi" : "اِنَّمَا النَّجْوٰى مِنَ الشَّيْطٰنِ لِيَحْزُنَ الَّذِيْنَ اٰمَنُوْا وَلَيْسَ بِضَاۗرِّهِمْ شَـيْـــــًٔا اِلَّا بِاِذْنِ اللّٰهِ ۭ وَعَلَي اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُوْنَ",
        "Urdu" : "ایسی سرگوشی تو محض شیطان کی طرف سے ہوتی ہے تاکہ اس طرح وہ غم میں ڈالے ان لوگوں کو جو ایمان لائے حالانکہ وہ ان کا نقصان کچھ بھی نہیں کر سکتا مگر اللہ ہی کے اذن سے اور اللہ ہی پر بھروسہ کرنا چاہئے ایمان والوں کو",
        "English" : "Whispering (for sinful acts) comes from the ShaiTan (Satan), so that he may grieve those who believe, while it is not harmful to them in the least, except with Allah‘s permission. And in Allah the believers must place their trust."
      },
      {
        "ayet_no" : 11,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِذَا قِيْلَ لَكُمْ تَفَسَّحُوْا فِي الْمَجٰلِسِ فَافْسَحُوْا يَفْسَحِ اللّٰهُ لَكُمْ ۚ وَاِذَا قِيْلَ انْشُزُوْا فَانْشُزُوْا يَرْفَعِ اللّٰهُ الَّذِيْنَ اٰمَنُوْا مِنْكُمْ ۙ وَالَّذِيْنَ اُوْتُوا الْعِلْمَ دَرَجٰتٍ ۭ وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرٌ",
        "Urdu" : "اے وہ لوگوں جو ایمان لائے ہو جب تم سے کہا جایا کرے کہاپنی مجلسوں میں کشادگی پیدا کرو تو تم جگہ کشادہ کر دیا کرو اللہ تم کو کشادگی عطا فرمائے گا اور جب تم سے کہا جایا کرے کہ اٹھ جاؤ تو تم اٹھ جایا کرواللہ تم میں سے ان لوگوں کے درجے بلند فرمائے گا جو ایمان لائے اور جن کو علم (کا نور) بخشا گیا ہے اور اللہ پوری طرح باخبر ہے ان تمام کاموں سے جو تم لوگ کرتے ہو",
        "English" : "O you who believe, when it is said to you, :Make room (for others) in the sittings , then make room, and Allah will make room for you (in the Hereafter). And when it is said, :Rise up , then rise up, and Allah will raise those, in ranks, who have believed and are given knowledge. Allah is well-aware of what you do."
      },
      {
        "ayet_no" : 12,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِذَا نَاجَيْتُمُ الرَّسُوْلَ فَقَدِّمُوْا بَيْنَ يَدَيْ نَجْوٰىكُمْ صَدَقَةً ۭ ذٰلِكَ خَيْرٌ لَّكُمْ وَاَطْهَرُ ۭ فَاِنْ لَّمْ تَجِدُوْا فَاِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ",
        "Urdu" : "اے وہ لوگوں جو ایمان لائے ہو جب تمہیں اللہ کے رسول سے کوئی تخلیے میں کرنا ہو تو تماپنی اس بات سے پہلے کچھ صدقہ کرلیا کرویہ تمہارے لئے بہت اچھا اور بڑا پاکیزہ طریقہ ہے پس اگر تم (اس کی گنجائش) نہ پاؤ تو (کوئی حرج نہیں کہ) یقینا اللہ بڑا ہی معاف کرنے والا انتہائی مہربان ہے",
        "English" : "O you who believe, when you consult the Messenger in private, then offer something in charity before your consultation. That is better for you and purer. But if you find nothing (to offer), then Allah is Most-Forgiving, Very-Merciful."
      },
      {
        "ayet_no" : 13,
        "arbi" : "ءَاَشْفَقْتُمْ اَنْ تُقَدِّمُوْا بَيْنَ يَدَيْ نَجْوٰىكُمْ صَدَقٰتٍ ۭ فَاِذْ لَمْ تَفْعَلُوْا وَتَابَ اللّٰهُ عَلَيْكُمْ فَاَقِيْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَاَطِيْعُوا اللّٰهَ وَرَسُوْلَهٗ ۭوَاللّٰهُ خَبِيْرٌۢ بِمَا تَعْمَلُوْنَ",
        "Urdu" : "کیا تم لوگ اس بات سے ڈرگئے ہو کہ تمہیں تخلیے میں بات کرنے سے پہلے کچھ صدقات دینے ہوں گے؟ پس جب تم ایسا نہیں کر سکے اور اللہ نے بھی تمہارے حال پر عنایت فرمادی تو اب (تمہیں صرف یہ ہدایت ہے کہ) تم نماز قائم رکھو، زکوٰۃ ادا کرو، اور (صدقِ دل سے) اطاعت کرو اللہ کی اور اس کے رسول کی اور (یاد رکھو کہ) اللہ پوری طرح باخبر ہے ان سب کاموں سے جو تم لوگ کرتے ہو",
        "English" : "Have you become afraid of offering charities before your consultation ? So when you did not do so, and Allah has forgiven you, then establish Salah, and pay Zakah, and obey Allah and His Messenger. And Allah is well aware of what you do."
      },
      {
        "ayet_no" : 14,
        "arbi" : "اَلَمْ تَرَ اِلَى الَّذِيْنَ تَوَلَّوْا قَوْمًا غَضِبَ اللّٰهُ عَلَيْهِمْ ۭ مَا هُمْ مِّنْكُمْ وَلَا مِنْهُمْ ۙ وَيَحْلِفُوْنَ عَلَي الْكَذِبِ وَهُمْ يَعْلَمُوْنَ",
        "Urdu" : "کیا تم نے ان لوگوں کو نہیں دیکھاجو ایک ایسی قوم سے دوستی رکھتے ہیں جن پر اللہ کا غضب نازل ہوچکا ہے یہ لوگ نہ تمہارے ساتھ ہیں نہ ان کے ساتھ اور یہ (ایسے بدبخت ہیں کہ) قسمیں کھاتے ہیں جھوٹ پر جانتے بوجھتے",
        "English" : "Have you not seen those who have friendship with a people with whom Allah is angry. They are neither of you nor of them. They swear false oaths while they know."
      },
      {
        "ayet_no" : 15,
        "arbi" : "اَعَدَّ اللّٰهُ لَهُمْ عَذَابًا شَدِيْدًا ۭ اِنَّهُمْ سَاۗءَ مَا كَانُوْا يَعْمَلُوْنَ",
        "Urdu" : "اللہ نے تیار کر رکھا ہے ان کے لئے ایک بڑا ہی سخت (اور ہولناک) عذاب بیشک بڑے ہی برے ہیں وہ کام جو یہ لوگ کرتے ہیں",
        "English" : "Allah has prepared a severe punishment for them. Indeed, evil is what they have been doing."
      },
      {
        "ayet_no" : 16,
        "arbi" : "اِتَّخَذُوْٓا اَيْمَانَهُمْ جُنَّةً فَصَدُّوْا عَنْ سَبِيْلِ اللّٰهِ فَلَهُمْ عَذَابٌ مُّهِيْنٌ",
        "Urdu" : "انہوں نےاپنی قسموں کو (اپنے بچاؤ کے لئے) ایک ڈھال بنا رکھا ہے پھر وہ (دوسروں کو بھی) روکتے ہیں اللہ کی راہ سے سو ان کے لئے ایک بڑا ہی رسوا کن عذاب ہے",
        "English" : "They have taken their oaths as a shield, and then have prevented (people) from the way of Allah. Therefore, for them there is a humiliating punishment."
      },
      {
        "ayet_no" : 17,
        "arbi" : "لَنْ تُغْنِيَ عَنْهُمْ اَمْوَالُهُمْ وَلَآ اَوْلَادُهُمْ مِّنَ اللّٰهِ شَيْـــــًٔا ۭ اُولٰۗىِٕكَ اَصْحٰبُ النَّارِ ۭ هُمْ فِيْهَا خٰلِدُوْنَ",
        "Urdu" : "اللہ کے مقابلے میں نہ تو ان کے مال ان کے کچھ کام آسکیں گے اور نہ ہی ان کی اولادیں یہ جہنمی ہیں انہیں ہمیشہ اسی میں رہنا ہوگا",
        "English" : "Their children and their wealth will avail them nothing againstAllah. They will be (the) dwellers of the Fire, to dwell therein forever."
      },
      {
        "ayet_no" : 18,
        "arbi" : "يَوْمَ يَبْعَثُهُمُ اللّٰهُ جَمِيْعًا فَيَحْلِفُوْنَ لَهٗ كَمَا يَحْلِفُوْنَ لَكُمْ وَيَحْسَبُوْنَ اَنَّهُمْ عَلٰي شَيْءٍ ۭ اَلَآ اِنَّهُمْ هُمُ الْكٰذِبُوْنَ",
        "Urdu" : "جس دن اللہ ان سب کو دوبارہ اٹھا کھڑا کرے گا تو یہ اس کے سامنے بھی اس طرح قسمیں کھائیں گے جس طرح آج تمہارے سامنے کھاتے ہیں اور یہ اپنے طور پر سمجھیں گے کہ یہ کسی بنیاد پر ہیں آگاہ رہو کہ یہ پرلے درجے کے جھوٹے ہیں",
        "English" : "The Day Allah will raise all of them, and they will swear before Him as they swear before you, and will think that they have something to stand upon. Be assured that they are sheer liars."
      },
      {
        "ayet_no" : 19,
        "arbi" : "اِسْتَحْوَذَ عَلَيْهِمُ الشَّيْطٰنُ فَاَنْسٰـىهُمْ ذِكْرَ اللّٰهِ ۭ اُولٰۗىِٕكَ حِزْبُ الشَّيْطٰنِ ۭ اَلَآ اِنَّ حِزْبَ الشَّيْطٰنِ هُمُ الْخٰسِرُوْنَ",
        "Urdu" : "شیطان نے ان پر اس طرح قابو پالیا ہے کہ اس نے ان کو اللہ کی یاد (کی دولت) بھلا دی یہ لوگ شیطان کا گروہ ہیں آگاہ رہو کہ شیطانی گروہ کے لوگ ہی اصل میں نقصان اٹھانے والے ہیں",
        "English" : "The ShaiTan (Satan) has prevailed upon them; so he has made them neglect to remember Allah. They are the party of ShaiTan . Be assured that it is (the members of the) party of ShaiTan that are the losers."
      },
      {
        "ayet_no" : 20,
        "arbi" : "اِنَّ الَّذِيْنَ يُحَاۗدُّوْنَ اللّٰهَ وَرَسُوْلَهٗٓ اُولٰۗىِٕكَ فِي الْاَذَلِّيْنَ",
        "Urdu" : "جو لوگ مخالفت کرتے ہیں اللہ اور اس کے رسول کی وہ (خواہ بظاہر کچھ بھی بنے پھرتے ہوں حقیقت میں وہ) ذلیل ترین لوگوں میں سے ہیں",
        "English" : "Indeed, those who oppose Allah and His Messenger, they are among the lowest."
      },
      {
        "ayet_no" : 21,
        "arbi" : "كَتَبَ اللّٰهُ لَاَغْلِبَنَّ اَنَا وَرُسُلِيْ ۭ اِنَّ اللّٰهَ قَوِيٌّ عَزِيْزٌ",
        "Urdu" : "اللہ نے لکھ دیا ہے کہ غلبہ یقینی طور پر میرا اور میرے رسولوں ہی کا ہوگا بلاشبہ اللہ بڑا ہی قوت والا انتہائی زبردست ہے ف۱",
        "English" : "Allah has decreed: (It is I and My messengers who must prevail) : For Allah is One full of strength, able to enforce His Will."
      },
      {
        "ayet_no" : 22,
        "arbi" : "لَا تَجِدُ قَوْمًا يُّؤْمِنُوْنَ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِ يُوَاۗدُّوْنَ مَنْ حَاۗدَّ اللّٰهَ وَرَسُوْلَهٗ وَلَوْ كَانُوْٓا اٰبَاۗءَهُمْ اَوْ اَبْنَاۗءَهُمْ اَوْ اِخْوَانَهُمْ اَوْ عَشِيْرَتَهُمْ ۭ اُولٰۗىِٕكَ كَتَبَ فِيْ قُلُوْبِهِمُ الْاِيْمَانَ وَاَيَّدَهُمْ بِرُوْحٍ مِّنْهُ ۭ وَيُدْخِلُهُمْ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَا   ۭ رَضِيَ اللّٰهُ عَنْهُمْ وَرَضُوْا عَنْهُ    ۭ اُولٰۗىِٕكَ حِزْبُ اللّٰهِ ۭ اَلَآ اِنَّ حِزْبَ اللّٰهِ هُمُ الْمُفْلِحُوْنَ",
        "Urdu" : "تم ایسا نہیں پاؤ گے کہ جو لوگ (سچے دل سے) ایمان رکھتے ہوں اللہ پر اور قیامت کے دن پر وہ دوستی رکھتے ہوں ان لوگوں سے جو مخالفت کرتے ہیں اللہ اور اس کے رسول کی اگرچہ وہ ان کے باپ یا بیٹے یا بھائی یا کنبہ (قبیلہ) ہی کیوں نہ ہوں (کیونکہ) یہ وہ لوگ ہیں جن کے دلوں میں اللہ نے نقش فرمادیا (دولت) ایمان کو اور اس نے ان کی تائید (و تقویت) فرمادیاپنی طرف سے ایک عظیم الشان روح کے ذریعے اور وہ ان کو داخل فرمائے گا ایسی عظیم الشان جنتوں میں جن کے نیچے سے بہہ رہی ہوں گی طرح طرح کی نہریں جن میں ان کو ہمیشہ رہنا نصیب ہوگا اللہ ان سے راضی ہوگیا اور یہ اس سے راضی ہوگئے یہ لوگ ہیں اللہ کی جماعت آگاہ رہو کہ اللہ کی جماعت ہی یقینی طور پر فلاح پانے والی ہے ف۲",
        "English" : "You will not find those who believe in Allah and in the Hereafter having friendship with those who oppose Allah and His Messenger, even though they may be their fathers or their sons or their brothers or their clan. They are such that Allah has inscribed faith on their hearts, and has supported them with a spirit from Him. He will admit them to gardens beneath which rivers flow, in which they will live forever. Allah is pleased with them, and they are pleased with Allah. Those are the party of Allah. Be assured that it is (the members of) the party of Allah that are the successful."
      }
    ]
  }
]