[
  {
    "surah_no": 3,
    "total_ayah" : 200,
    "name" : "Surah e Imran",
    "detail" : [

      {
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "الۗـۗمَّ",
        "Urdu" : "الۗـۗمَّ",
        "English" : "Alif. Lam. Mim."
      },
      {
        "ayet_no" : 2,
        "arbi" : "اللّٰهُ لَآ اِلٰهَ اِلَّا ھُوَ ۙ الْـحَيُّ الْقَيُّوْمُ",
        "Urdu" : "ا للہ ہے(کہ)کوئی معبود نہیں اس کے سوا(وہ) زندہ ہے قائم رکھنے والا ہے ۔",
        "English" : "Allah: There is no god but He, the Alive, the All-Sustaining."
      },
      {
        "ayet_no" : 3,
        "arbi" : "نَزَّلَ عَلَيْكَ الْكِتٰبَ بِالْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ وَاَنْزَلَ التَّوْرٰىةَ وَالْاِنْجِيْلَ",
        "Urdu" : "اس نے اتاری آپ پر کتاب حق کے ساتھ(وہ) تصدیق کرنے والی ہے ان کتابوں کی جو اس سے پہلے تھیں اوراس نے اتاری تورات اور انجیل ۔",
        "English" : "He hath revealed unto thee the Book with truth confirming that which went before it; and He sent down the Taurat and Injil."
      },
      {
        "ayet_no" : 4,
        "arbi" : "مِنْ قَبْلُ ھُدًى لِّلنَّاسِ وَاَنْزَلَ الْفُرْقَانَ ڛ اِنَّ الَّذِيْنَ كَفَرُوْا بِاٰيٰتِ اللّٰهِ لَھُمْ عَذَابٌ شَدِيْدٌ ۭ وَاللّٰهُ عَزِيْزٌ ذُو انْتِقَامٍ",
        "Urdu" : "اس سے قبل ہدایت ہے لوگوں کے لیے اور اسی نے نازل کیا فرقان(قران مجید) بے شک وہ لوگ جنہوں نے انکار کیا اللہ کی آیات کا ان کے لیے سخت عذاب ہے اور اللہ تعالی غالب،انتقام لینے والا ہے ۔",
        "English" : "Then those who reject Faith in the Signs of Allah will suffer the severest penalty, and Allah is Exalted in Might, Lord of Retribution."
      },
      {
        "ayet_no" : 5,
        "arbi" : "اِنَّ اللّٰهَ لَا يَخْفٰى عَلَيْهِ شَيْءٌ فِي الْاَرْضِ وَلَا فِي السَّمَاۗءِ",
        "Urdu" : "بے شک اللہ(کہ) نہیں ہے مخفی اس پرکوئی چیز زمین میں اورنہ آسمان میں ۔",
        "English" : "Truly, nothing is hidden fromAllah, in the earth or in the heavens."
      },
      {
        "ayet_no" : 6,
        "arbi" : "ھُوَ الَّذِي يُصَوِّرُكُمْ فِي الْاَرْحَامِ كَيْفَ يَشَاۗءُ ۭ لَآ اِلٰهَ اِلَّا ھُوَ الْعَزِيْزُ الْحَكِيْمُ",
        "Urdu" : "وہی ہے جوتمہاری صورتیں بناتا ہے رحموں(ماؤ ں کے پیٹ)میں جیسے وہ چاہتا ہے نہیں ہے کوئی معبود مگروہی غالب حکمت والا ہے ۔",
        "English" : "He it is Who fashion You in the Wombs as He will: there is no god but He, the Mighty, the Wise."
      },
      {
        "ayet_no" : 7,
        "arbi" : "ھُوَ الَّذِيْٓ اَنْزَلَ عَلَيْكَ الْكِتٰبَ مِنْهُ اٰيٰتٌ مُّحْكَمٰتٌ ھُنَّ اُمُّ الْكِتٰبِ وَاُخَرُ مُتَشٰبِهٰتٌ ۭ فَاَمَّا الَّذِيْنَ فِيْ قُلُوْبِهِمْ زَيْغٌ فَيَتَّبِعُوْنَ مَا تَشَابَهَ مِنْهُ ابْتِغَاۗءَ الْفِتْنَةِ وَابْتِغَاۗءَ تَاْوِيْلِهٖ څ وَمَا يَعْلَمُ تَاْوِيْلَهٗٓ اِلَّا اللّٰهُ ڤ وَالرّٰسِخُوْنَ فِي الْعِلْمِ يَقُوْلُوْنَ اٰمَنَّا بِهٖ ۙ كُلٌّ مِّنْ عِنْدِ رَبِّنَا ۚ وَمَا يَذَّكَّرُ اِلَّآ اُولُوا الْاَلْبَابِ",
        "Urdu" : "اللہ) وہی ہے جس نے آپ پر کتاب اتاری اس کی کچھ آیات محکم ہیں،وہی اصل کتاب ہیں اور(کچھ)دوسری متشابہ ہیں پس رہے وہ لوگ جن کے دلوں میں کجی ہے تو وہ پیچھے پڑے رہتے ہیں اس کے جو متشابہ ہے اس میں سے فتنہ چاہنے کے لیے اور(حسب منشائ)اس کے معنی کی تلاش کے لیے حالانکہ نہیں جانتا اس کے(اصل)معنی مراد کو مگراللہ اور(جو)علم میں پختہ کار لوگ ہیں وہ کہتے ہیں ہم ایمان لائے اس پر(یہ)سب کچھ ہمارے رب کی طرف سے ہے اور نہیں نصیحت حاصل کرتے مگر عقل والے ۔",
        "English" : "He it is who hath sent down unto thee the Book, wherein some verses are firmly constructed they are the mother of the Book: and others similar. But those in whose hearts is and deviation follow that which is similar therein, seeking discord and seeking to misinterpret the same whereas none know the interpretation thereof a save Allah. And the firmly- grounded in knowledge Say: we believe therein, the whole is from our Lord. And none receive admonition save men of understanding."
      },
      {
        "ayet_no" : 8,
        "arbi" : "رَبَّنَا لَا تُزِغْ قُلُوْبَنَا بَعْدَ اِذْ ھَدَيْتَنَا وَھَبْ لَنَا مِنْ لَّدُنْكَ رَحْمَةً ۚ اِنَّكَ اَنْتَ الْوَھَّابُ",
        "Urdu" : "وہ دعامانگتے ہیں)اے ہمارے رب کجی پیدا نہ کر ہمارے دلوں میں اس کے بعد(کہ)جب تونے ہدایت دے دی ہمیں اورعطا فرما ہمیں اپنی طرف سے رحمت بے شک توہی سب کچھ عطاکرنے والا ہے ۔",
        "English" : "Our Lord, do not let our hearts deviate from the right path after You have given us guidance, and bestow upon us mercy from Your own. Surely, You, and You alone, are the One who bestows in abundance."
      },
      {
        "ayet_no" : 9,
        "arbi" : "رَبَّنَآ اِنَّكَ جَامِعُ النَّاسِ لِيَوْمٍ لَّا رَيْبَ فِيْهِ ۭ اِنَّ اللّٰهَ لَا يُخْلِفُ الْمِيْعَادَ",
        "Urdu" : "اے ہمارے رب بے شک تو جمع کرنے والا ہے لوگوں کواس دن(کہ)کوئی شک نہیں اس(کے انے)میں بے شک اللہ تعالی نہیں خلاف ورزی کرتا وعدہ کی ۔",
        "English" : "Our Lord! Verily, it is You Who will gather mankind together on the Day about which there is no doubt. Verily,Allah never breaks His Promise"
      },
      {
        "ayet_no" : 10,
        "arbi" : "اِنَّ الَّذِيْنَ كَفَرُوْا لَنْ تُغْنِىَ عَنْھُمْ اَمْوَالُھُمْ وَلَآ اَوْلَادُھُمْ مِّنَ اللّٰهِ شَـيْـــــًٔـا  وَاُولٰۗىِٕكَ ھُمْ وَقُوْدُ النَّارِ",
        "Urdu" : "بے شک وہ لوگ جنہوں نے کفر کیا ہرگز نہ بچا سکیں گے ان کوان کے مال اور نہ ان کی اولاد اللہ(کے عذاب)سے کچھ بھی اور وہی لوگ آگ کاایندھن ہیں ۔",
        "English" : "Verily, those who disbelieve, neither their properties nor their offspring will avail them what ever against Allah; and it is they who will be fuel of the Fire."
      },
      {
        "ayet_no" : 11,
        "arbi" : "كَدَاْبِ اٰلِ فِرْعَوْنَ ۙ وَالَّذِيْنَ مِنْ قَبْلِهِمْ ۭكَذَّبُوْا بِاٰيٰتِنَا ۚ فَاَخَذَھُمُ اللّٰهُ بِذُنُوْبِهِمْ وَاللّٰهُ شَدِيْدُ الْعِقَابِ",
        "Urdu" : "(اور ان لوگوں کا حال)آل فرعون کے حال کی طرح ہے اوران لوگوں کاجو ان سے پہلے ( گزر چکے ) انہوں نے جھٹلایا ہماری آیات کو تو پکڑ لیا ان کواللہ نے ان کے گناہوں کے سبب اوراللہ سخت سزادینے والا ہے ۔",
        "English" : "After the wont of the people of Fir'awn and those before them. They belied Our signs, wherefore Allah laid hold of them for their sins. And Allah is Severe in chastising."
      },
      {
        "ayet_no" : 12,
        "arbi" : "قُلْ لِّـلَّذِيْنَ كَفَرُوْا سَـتُغْلَبُوْنَ وَتُحْشَرُوْنَ اِلٰى جَهَنَّمَ ۭ وَبِئْسَ الْمِهَادُ",
        "Urdu" : "اے محمد)کہہ دیں ان لوگوں سے جنہوں نے کفر کیا عنقریب تم مغلوب ہوجاؤ گے اور تم اکٹھے کیے جاؤ گے جہنم کی طرف اور وہ بہت برا ٹھکانہ ہے ۔",
        "English" : "Say (O Muhammad ) to those who disbelieve: 'You will be defeated and gathered together to Hell, and worst indeed is that place to rest.'"
      },
      {
        "ayet_no" : 13,
        "arbi" : "قَدْ كَانَ لَكُمْ اٰيَةٌ فِيْ فِئَتَيْنِ الْتَقَتَا ۭ فِئَةٌ تُقَاتِلُ فِيْ سَبِيْلِ اللّٰهِ وَاُخْرٰى كَافِرَةٌ يَّرَوْنَھُمْ مِّثْلَيْهِمْ رَاْيَ الْعَيْنِ ۭ وَاللّٰهُ يُؤَيِّدُ بِنَصْرِهٖ مَنْ يَّشَاۗءُ ۭ اِنَّ فِيْ ذٰلِكَ لَعِبْرَةً لِّاُولِي الْاَبْصَارِ",
        "Urdu" : "بے شک ہے تمہارے لیے نشانی(عبرت) ان دوگروہوں میں (جو بدر کے دن)آپس میں مقابلے میں اترے،ایک گروہ لڑرہا تھا اللہ کی راہ میں اوردوسرا گروہ کافر تھا وہ (کافر)دیکھ رہے تھے ان (مسلمانوں)کو اپنے دگنا ،ظاہری(کھلی)انکھوں سے اوراللہ تعالی تائید کرتا ہےاپنی مدد سے جس کی چاہتا بلاشبہ اس(واقعہ) میں یقینا عبرت ہے آنکھوں والوں کے لیے ۔",
        "English" : "There has already been a sign for you (O Jews) in the two armies that met (in combat i.e. the battle of Badr) : One was fighting in the Cause ofAllah, and as for the other (they) were disbelievers. They (the believers) saw them (the disbelievers) with their own eyes twice their number (although they were thrice their number) . AndAllah supports with His Victory whom He pleases. Verily, in this is a lesson for those who understand. (See Verse 8:44) . (Tafsir At-Tabar)"
      },
      {
        "ayet_no" : 14,
        "arbi" : "زُيِّنَ لِلنَّاسِ حُبُّ الشَّهَوٰتِ مِنَ النِّسَاۗءِ وَالْبَنِيْنَ وَالْقَنَاطِيْرِ الْمُقَنْطَرَةِ مِنَ الذَّھَبِ وَالْفِضَّةِ وَالْخَيْلِ الْمُسَوَّمَةِ وَالْاَنْعَامِ وَالْحَرْثِ ۭ ذٰلِكَ مَتَاعُ الْحَيٰوةِ الدُّنْيَا ۚ وَاللّٰهُ عِنْدَهٗ حُسْنُ الْمَاٰبِ",
        "Urdu" : "مزین کردی گئی لوگوں کے لیے خواہشات نفس سے محبت(مثلا)عورتوں سے اوربیٹوں اورجمع کیے ہوئے خزانوں سے سونے اور چاندی اور نشان زدہ گھوڑوں سے اورچوپاؤں اورکھیتی سے یہ(سب کچھ)دنیوی زندگی کاسامان ہے اوراللہ اس کے پاس بہترین ٹھکانہ ہے ۔",
        "English" : "Fair-seeming is made unto men the love of pleasurable things from women and children and talents heaped-up of gold and silver and horses branded up and cattle and tilth. All that is the enjoyment of the life of the World, and Allah! with Him is the best resort."
      },
      {
        "ayet_no" : 15,
        "arbi" : "قُلْ اَؤُنَبِّئُكُمْ بِخَيْرٍ مِّنْ ذٰلِكُمْ ۭ لِلَّذِيْنَ اتَّقَوْا عِنْدَ رَبِّهِمْ جَنّٰتٌ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَا وَاَزْوَاجٌ مُّطَهَّرَةٌ وَّرِضْوَانٌ مِّنَ اللّٰهِ ۭ وَاللّٰهُ بَصِيْرٌۢ بِالْعِبَادِ",
        "Urdu" : "اے نبی)آپ کہہ دیں(کہ)کیامیں خبردوں تمہیں (ایسی چیزوں کی جو)اس(دنیوی سامان) سے بہتر ہیں ان لوگوں کے لیے جوتقوی اختیار کریں ان کے رب کے پاس باغات ہیں (کہ)ان کے نیچے سے نہریں جاری ہیں۔وہ ان میں ہمیشہ رہنے والے ہیں اور(ان کوملیں گی)پاکیزہ بیویاں اور(ان سب سے بڑھ کر)رضامندی اللہ کی طرف سے اوراللہ خوب دیکھ رہا ہے بندوں کو ۔",
        "English" : "Say: Shall I inform you of something better than that ? For those who keep from evil, with their Lord, are Gardens underneath which rivers flow wherein they will abide, and pure companions, and contentment from Allah. Allah is Seer of His bondmen,"
      },
      {
        "ayet_no" : 16,
        "arbi" : "اَلَّذِيْنَ يَقُوْلُوْنَ رَبَّنَآ اِنَّنَآ اٰمَنَّا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَقِنَا عَذَابَ النَّارِ",
        "Urdu" : "جو کہتے ہیں اے ہمارے رب بلاشبہ ہم ایمان لائے سوتو بخش دے ہمیں ہمارے گناہوں کو اورہمیں بچا آگ کے عذاب سے",
        "English" : "Those who say our Lord! verify we! we have believed, wherefore forgive us our sins, and protect us from the torment of the Fire."
      },
      {
        "ayet_no" : 17,
        "arbi" : "اَلصّٰبِرِيْنَ وَالصّٰدِقِيْنَ وَالْقٰنِتِيْنَ وَالْمُنْفِقِيْنَ وَالْمُسْـتَغْفِرِيْنَ بِالْاَسْحَارِ",
        "Urdu" : "(یہ لوگ)صبر کرنے والے اورسچ بولنے والے اور فرمانبردار اور ( اللہ کی راہ میں ) خرچ کرنے والے ہیں اور بخشش مانگنے والے ہیں رات کے آخری حصہ میں ۔",
        "English" : "The patient ones and the truthful ones and the devout ones and the expander and the praying ones at early dawn for forgiveness."
      },
      {
        "ayet_no" : 18,
        "arbi" : "شَهِدَ اللّٰهُ اَنَّهٗ لَآ اِلٰهَ اِلَّا ھُوَ ۙ وَالْمَلٰۗىِٕكَةُ وَاُولُوا الْعِلْمِ قَاۗىِٕمًۢا بِالْقِسْطِ ۭ لَآ اِلٰهَ اِلَّا ھُوَ الْعَزِيْزُ الْحَكِيْمُ",
        "Urdu" : "اورگواہی دی ہے (خود)اللہ نے کہ یہ یقینی بات ہے کہ کوئی معبود نہیں اس کے سوا اور(یہی گواہی دی ہے )فرشتوں نے اور تمام اہل علم نے انصاف پر قائم رہتے ہوئے(کہ)کوئی معبود نہیں اس کے سوا (جو)غالب ہے حکمت والا ہے ۔",
        "English" : "Allah bear witness - and also the angles and those endued with knowledge that there is no god but He, the Maintainer of equity : there is no god but He, the Mighty, the Wise."
      },
      {
        "ayet_no" : 19,
        "arbi" : " اِنَّ الدِّيْنَ عِنْدَ اللّٰهِ الْاِسْلَامُ ۣ وَمَا اخْتَلَفَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ اِلَّا مِنْۢ بَعْدِ مَا جَاۗءَھُمُ الْعِلْمُ بَغْيًۢا بَيْنَھُمْ ۭ وَمَنْ يَّكْفُرْ بِاٰيٰتِ اللّٰهِ فَاِنَّ اللّٰهَ سَرِيْعُ الْحِسَابِ",
        "Urdu" : "بے شک دین تواللہ کے نزدیک صرف اسلام ہے اور نہیں اختلاف کیاان لوگوں نے جنہیں دی گئی کتاب مگراس کے بعد کہ آچکا تھا ان کے پاس علم(وحی)(اس کی وجہ محض)ان کی باہمی ضد تھی اور جو انکار کرتا ہے اللہ کی آیات کا توبے شک اللہ جلد حساب چکانے والا ہے ۔",
        "English" : "Verily the religion with Allah is Islam and those Who Were vouchsafed the Book differed Not save after the knowledge had come unto them, out of spite among themselves. And whosoever disbelieve in the revelations of Allah, then Verily Allah swift at reckoning."
      },
      {
        "ayet_no" : 20,
        "arbi" : "فَاِنْ حَاۗجُّوْكَ فَقُلْ اَسْلَمْتُ وَجْهِيَ لِلّٰهِ وَمَنِ اتَّبَعَنِ ۭ وَقُلْ لِّلَّذِيْنَ اُوْتُوا الْكِتٰبَ وَالْاُمِّيّٖنَ ءَاَسْلَمْتُمْ ۭ فَاِنْ اَسْلَمُوْا فَقَدِ اھْتَدَوْا ۚ وَاِنْ تَوَلَّوْا فَاِنَّمَا عَلَيْكَ الْبَلٰغُ ۭ وَاللّٰهُ بَصِيْرٌۢ بِالْعِبَادِ",
        "Urdu" : "پھراگریہ اہل کتاب آپ سے جھگڑا کریں توآپ کہہ دیں میں نے توجھکا دیا ہے اپناچہرہ اللہ کے لیے اور(اس نے بھی)جس نے میری پیروی کی اور کہیے ان لوگوں سےجنہیں دی گئی کتاب اور ان پڑھوں سے(کہ)کیاتم بھی فرمانبردار بنتے ہو پس اگروہ فرمانبردار بن جائیں تویقینا ہدایت پاجائیں اور اگر وہ منہ پھیر لیں تو بے شک آپ پر (توذمہ داری ہے) پیغام پہنچا دینے کی اوراللہ خوب دیکھ رہا ہے (اپنے) بندوں کو ۔",
        "English" : "So if they dispute with you (Muhammad ) say: 'I have submitted myself toAllah (in Islm) , and (so have) those who follow me.' And say to those who were given the Scripture (Jews and Christians) and to those who are illiterates (Arab pagans) : 'Do you (also) submit yourselves (toAllah in Islm) ?' If they do, they are rightly guided; but if they turn away, your duty is only to convey the Message; andAllah is All-Seer of (His ) slaves."
      },
      {
        "ayet_no" : 21,
        "arbi" : "اِنَّ الَّذِيْنَ يَكْفُرُوْنَ بِاٰيٰتِ اللّٰهِ وَيَقْتُلُوْنَ النَّـبِيّٖنَ بِغَيْرِ حَقٍّ ۙ وَّيَقْتُلُوْنَ الَّذِيْنَ يَاْمُرُوْنَ بِالْقِسْطِ مِنَ النَّاسِ ۙ فَبَشِّرْھُمْ بِعَذَابٍ اَلِيْمٍ",
        "Urdu" : "بے شک وہ لوگ جو انکار کرتے ہیں اللہ کی آیات کا اورقتل کرتے ہیں انبیا کوناحق اورقتل کرتے ہیں ان لوگوں کوجوحکم دیتے ہیں عدل وانصاف کا لوگوں میں سے توخوش خبری سنادیجیے ا نہیں درد ناک عذاب کی ۔",
        "English" : "Verily! Those who disbelieve in the Ayt (proofs, evidences, verses, lessons, signs, revelations, etc.) ofAllah and kill the Prophets without right, and kill those men who order just dealings, announce to them a painful torment."
      },
      {
        "ayet_no" : 22,
        "arbi" : "اُولٰۗىِٕكَ الَّذِيْنَ حَبِطَتْ اَعْمَالُھُمْ فِي الدُّنْيَا وَالْاٰخِرَةِ ۡ وَمَا لَھُمْ مِّنْ نّٰصِرِيْنَ",
        "Urdu" : "یہی وہ لوگ ہیں جو (کہ)ضائع ہوگئے ان کے اعمال دنیاوآخرت میں اور نہیں ہوگا ان کا کوئی مددگار ۔",
        "English" : "These are they whose works have Come to naught in the world and the Hereafter, nor have they helpers."
      },
      {
        "ayet_no" : 23,
        "arbi" : "اَلَمْ تَرَ اِلَى الَّذِيْنَ اُوْتُوا نَصِيْبًا مِّنَ الْكِتٰبِ يُدْعَوْنَ اِلٰى كِتٰبِ اللّٰهِ لِيَحْكُمَ بَيْنَھُمْ ثُمَّ يَتَوَلّٰى فَرِيْقٌ مِّنْھُمْ وَھُمْ مُّعْرِضُوْنَ",
        "Urdu" : "کیا آپ نے دیکھا نہیں ان لوگوں کی طرف جنہیں دیاگیا کچھ حصہ کتاب سے (یعنی تورات کاکچھ علم) وہ بلائے جاتے ہیں اللہ کی کتاب کی طرف تاکہ وہ(کتاب) فیصلہ کردے ان کے درمیان پھر منہ پھیر لیتاہے ایک گروہ ان میں سے اور وہ اعراض کرنے لگتے ہیں ۔",
        "English" : "Have you not seen those who were given a portion of (the knowledge of) the Book ? They are invited towards the Book of Allah, so that it (the Book) gives judgment (on disputes) among them Then, a party of them turn away and it is they who deviate."
      },
      {
        "ayet_no" : 24,
        "arbi" : "ذٰلِكَ بِاَنَّھُمْ قَالُوْا لَنْ تَمَــسَّنَا النَّارُ اِلَّآ اَيَّامًا مَّعْدُوْدٰتٍ ۠ وَغَرَّھُمْ فِيْ دِيْــنِهِمْ مَّا كَانُوْا يَفْتَرُوْنَ",
        "Urdu" : "یہ اس وجہ سے ہے کہ بے شک وہ کہتے ہیں ہرگز نہیں چھوئے گی ہمیں آگ مگرچند دن گنے چنے ہوئے اوردھوکے میں ڈال رکھا ہے ا نہیں اپنے دین کے بارے میں (ان باتوں نے) جو وہ گھڑتے رہتے ہیں ۔",
        "English" : "This is because they say: ' The Fire shall not touch us but for a number of days.' And that which they used to invent regarding their religion has deceived them."
      },
      {
        "ayet_no" : 25,
        "arbi" : "فَكَيْفَ اِذَا جَمَعْنٰھُمْ لِيَوْمٍ لَّا رَيْبَ فِيْهِ ۣ وَوُفِّيَتْ كُلُّ نَفْسٍ مَّا كَسَبَتْ وَھُمْ لَا يُظْلَمُوْنَ",
        "Urdu" : "پھر اس وقت کیا حال ہوگا جب جمع کریں گے ہم انہیں اس دن(کہ)کوئی شک نہیں اس ( کے انے ) میں اور پورا پورا بدلہ دے دیا جائے گا ہر نفس کو جو اس نے کمایا ہو گا اور وہ ظلم نہیں کے جائیں گے ۔",
        "English" : "But how (will they fare) when we gather them together against a day about which there is no doubt, and each soul will be paid out just what it has earned, without (favour or) injustice ?"
      },
      {
        "ayet_no" : 26,
        "arbi" : "قُلِ اللّٰهُمَّ مٰلِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَنْ تَشَاۗءُ وَتَنْزِعُ الْمُلْكَ مِمَّنْ تَشَاۗءُ ۡ وَتُعِزُّ مَنْ تَشَاۗءُ وَتُذِلُّ مَنْ تَشَاۗءُ ۭبِيَدِكَ الْخَيْرُ ۭ اِنَّكَ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
        "Urdu" : "آپ کہہ دیں اے اللہ ملک کے مالک توہی دیتا ہے بادشاہی جسے توچاہتا ہے اورتوچھین لیتاہے بادشاہی جس سے توچاہتا ہے اورتوعزت دیتا ہے جسے تو چاہتا ہے اور تو ذلیل کرتا ہے جسے تو چاہتا ہے تیرے ہی ہاتھ میں ہے بھلائی یقینا تو ہر چیز پر قادر ہے ۔",
        "English" : "Say (O Muhammad ) : ' O Allah! Possessor of the kingdom, You give the kingdom to whom You will, and You take the kingdom from whom You will, and You endue with honour whom You will, and You humiliate whom You will. In Your Hand is the good. Verily, You are Able to do all things'."
      },
      {
        "ayet_no" : 27,
        "arbi" : "تُوْلِجُ الَّيْلَ فِي النَّهَارِ وَتُوْلِجُ النَّهَارَ فِي الَّيْلِ ۡ وَتُخْرِجُ الْـحَيَّ مِنَ الْمَيِّتِ وَتُخْرِجُ الْمَيِّتَ مِنَ الْـحَيِّ ۡ وَتَرْزُقُ مَنْ تَشَاۗءُ بِغَيْرِ حِسَابٍ",
        "Urdu" : "توداخل کرتاہے رات کودن میں اور تو داخل کرتا ہے دن کورات میں اورتونکالتا ہے جاندار کوبے جان سے اورتو نکالتا ہے بے جان کوجاندار سے اورتو رزق دیتا ہے جسے توچاہتا ہے بغیر حساب کے ۔",
        "English" : "You make the night to enter into the day, and You make the day to enter into the night (i.e. increase and decrease in the hours of the night and the day during winter and summer) , You bring the living out of the dead, and You bring the dead out of the living. And You give wealth and sustenance to whom You will, without limit (measure or account)."
      },
      {
        "ayet_no" : 28,
        "arbi" : "لَا يَتَّخِذِ الْمُؤْمِنُوْنَ الْكٰفِرِيْنَ اَوْلِيَاۗءَ مِنْ دُوْنِ الْمُؤْمِنِيْنَ ۚ وَمَنْ يَّفْعَلْ ذٰلِكَ فَلَيْسَ مِنَ اللّٰهِ فِيْ شَيْءٍ اِلَّآ اَنْ تَتَّقُوْا مِنْھُمْ تُقٰىةً ۭ وَيُحَذِّرُكُمُ اللّٰهُ نَفْسَهٗ ۭ وَاِلَى اللّٰهِ الْمَصِيْرُ",
        "Urdu" : "نہ بنائیں مومن کافروں کو(دلی)دوست مومنوں کوچھوڑ کر اورجوایسا کرے گاتو نہیں ہے اللہ سے(اس کاکوئی واسطہ)کسی معاملے میں مگریہ کہ تم بچنا چاہو ان (کے شر)سے (توکوئی مضائقہ نہیں ہے)اور ڈراتا ہے اللہ تمہیں اپنے آپ سے اور اللہ ہی کی طرف لوٹ کر جانا ہے ۔",
        "English" : "Let not the believers take unto themselves the infidels as friends, beside the believers: and whosoever doth that, then he is not in respect of Allah in aught, unless indeed ye fear from them a danger. And Allah make ye beware of Himself; and unto Allah is the last wending."
      },
      {
        "ayet_no" : 29,
        "arbi" : "قُلْ اِنْ تُخْفُوْا مَا فِيْ صُدُوْرِكُمْ اَوْ تُبْدُوْهُ يَعْلَمْهُ اللّٰهُ ۭوَيَعْلَمُ مَا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ ۭ وَاللّٰهُ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
        "Urdu" : "آپ کہہ دیں اگر تم چھپاؤ جو تمہارے دلوں میں ہے یا تم ظاہر کرو اسے جانتا ہے اسے اللہ اور وہ جانتا ہے جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے اور اللہ تعالی ہر چیز پر قادر ہے ۔",
        "English" : " Say: ‘Whether you hide what is in your breasts or make it known, Allah knows it and He thoroughly knows what is in the heavens and what is in the earth And Allah has Mighty Control over everything.’"
      },
      {
        "ayet_no" : 30,
        "arbi" : "يَوْمَ تَجِدُ كُلُّ نَفْسٍ مَّا عَمِلَتْ مِنْ خَيْرٍ مُّحْضَرًا ٻ وَّمَا عَمِلَتْ مِنْ سُوْۗءٍ ڔ تَوَدُّ لَوْ اَنَّ بَيْنَهَا وَبَيْنَهٗٓ اَمَدًۢا بَعِيْدًا ۭ وَيُحَذِّرُكُمُ اللّٰهُ نَفْسَهٗ ۭوَاللّٰهُ رَءُوْفٌۢ بِالْعِبَادِ",
        "Urdu" : "وہ دن (آنے والاہے)جب پالے گاہرنفس جواس نے اچھا عمل کیا ہوگا سامنے موجود اوراسے بھی جواس نے براعمل کیاہوگا وہ آرزو کرے گا کاش کہ بے شک اس کے درمیان اوراس کے برے اعمال درمیان دوردراز کا فاصلہ ہوتا ہے اوراللہ ڈراتا ہے تم کواپنے آپ سے اوراللہ تعالی (اپنے) بندوں پر بہت شفیق ہے ۔",
        "English" : "The Day whereon each soul shall find presented whatsoever it hath worked of good and whats over it hath worked of evil, it would fain that there were betwixt it and that Day a wide space. And Allah make you beware of Himself: Allah is Tender unto His bondsmen."
      },
      {
        "ayet_no" : 31,
        "arbi" : "قُلْ اِنْ كُنْتُمْ تُحِبُّوْنَ اللّٰهَ فَاتَّبِعُوْنِيْ يُحْبِبْكُمُ اللّٰهُ وَيَغْفِرْ لَكُمْ ذُنُوْبَكُمْ ۭوَاللّٰهُ غَفُوْرٌ رَّحِيْمٌ",
        "Urdu" : "آپ کہہ دیں اگرہوتم محبت کرتے اللہ سے تومیری پیروی کرو اللہ تم سے محبت کرنے لگے گا اوروہ معاف کردے گا تمہارے لیے تمہارے گناہ اوراللہ بہت بخشنے والا بہت مہربان ہے ۔",
        "English" : "Say thou: if ye, are wont to love Allah, then follow me, and Allah shall rove you and forgive you your sins; and Allah is Forgiving, Merciful."
      },
      {
        "ayet_no" : 32,
        "arbi" : "قُلْ اَطِيْعُوا اللّٰهَ وَالرَّسُوْلَ ۚ فَاِنْ تَوَلَّوْا فَاِنَّ اللّٰهَ لَا يُحِبُّ الْكٰفِرِيْنَ",
        "Urdu" : "آپ کہہ دیں اطاعت کرو اللہ اوراس کے رسول کی پھراگر وہ منہ پھیر لیں توبے شک اللہ (ایسے) کافروں کو پسند نہیں کرتا ۔",
        "English" : "Say (O Muhammad ) : 'Obey Allah and the Messenger (Muhammad S.A.W) .' But if they turn away, thenAllah does not like the disbelievers."
      },
      {
        "ayet_no" : 33,
        "arbi" : "اِنَّ اللّٰهَ اصْطَفٰٓي اٰدَمَ وَنُوْحًا وَّاٰلَ اِبْرٰهِيْمَ وَاٰلَ عِمْرٰنَ عَلَي الْعٰلَمِيْنَ",
        "Urdu" : "بے شک اللہ نے ( رسالت کے لیے ) منتخب فرمایا آدم کو اور نوح کو اور آل ابراہیم کو اورآل عمران کو تمام جہان والوں میں سے ۔",
        "English" : "Allah did choose Adam and Noah, the family of Abraham, and the family of 'Imran above all people."
      },
      {
        "ayet_no" : 34,
        "arbi" : "ذُرِّيَّةًۢ بَعْضُهَا مِنْۢ بَعْضٍ ۭ وَاللّٰهُ سَمِيْعٌ عَلِيْمٌ",
        "Urdu" : "ان میں بعض بعض کی اولاد تھی اوراللہ سب کچھ سننے والا،خوب جاننے والا ہے ۔",
        "English" : "Offspring, one of the other: And Allah hear and know all things."
      },
      {
        "ayet_no" : 35,
        "arbi" : "اِذْ قَالَتِ امْرَاَتُ عِمْرٰنَ رَبِّ اِنِّىْ نَذَرْتُ لَكَ مَا فِيْ بَطْنِىْ مُحَرَّرًا فَتَقَبَّلْ مِنِّىْ ۚ اِنَّكَ اَنْتَ السَّمِيْعُ الْعَلِيْمُ",
        "Urdu" : "جب کہاعمران کی بیوی نے اے میرے رب بے شک میں تیری نذر کرتی ہوں جوبچہ میرے پیٹ میں ہے(کہ وہ دنیا کے کاموں سے)آزاد ہوگا تو توقبول فرما مجھ سے بے شک تو ہی سب کچھ سننے والا خوب جاننے والا ہے۔",
        "English" : "Recall what time the wife of 'lmran said my Lord verily have vowed unto Thee that which is in my belly to be dedicated; accept Thou then of me. Verily Thou! Thou art the Hearer, the Knower."
      },
      {
        "ayet_no" : 36,
        "arbi" : "فَلَمَّا وَضَعَتْهَا قَالَتْ رَبِّ اِنِّىْ وَضَعْتُهَآ اُنْثٰى ۭ وَاللّٰهُ اَعْلَمُ بِمَا وَضَعَتْ ۭ وَلَيْسَ الذَّكَرُ كَالْاُنْثٰى ۚ وَاِنِّىْ سَمَّيْتُهَا مَرْيَمَ وَاِنِّىْٓ اُعِيْذُھَابِكَ وَذُرِّيَّتَهَا مِنَ الشَّيْطٰنِ الرَّجِيْمِ",
        "Urdu" : "پھرجب اس نے جنا اسے کہنے لگی اے میرے رب بے شک میں نے اسے جنا ہے لڑکی اوراللہ کوخوب معلوم تھا جو اس نے جنا اور نہیں ہوتا لڑکا لڑکی کی طرح اوربے شک میں نے نام رکھا ہے اس کا مریم،اوربے شک میں اسے تیری پناہ میں دیتی ہوں اوراس کی اولاد کو (بھی) شیطان مردود (کے شر) سے ۔",
        "English" : "When she was delivered, she said: 'O my Lord! Behold! I am delivered of a female child!'- and Allah knew best what she brought forth- 'And no wise is the male Like the female. I have named her Mary, and I commend her and her offspring to Thy protection from the Evil One, the Rejected.'"
      },
      {
        "ayet_no" : 37,
        "arbi" : "فَتَقَبَّلَهَا رَبُّهَا بِقَبُوْلٍ حَسَنٍ وَّاَنْۢبَتَهَا نَبَاتًا حَسَـنًا ۙ وَّكَفَّلَهَا زَكَرِيَّا ڝ كُلَّمَا دَخَلَ عَلَيْهَا زَكَرِيَّا الْمِحْرَابَ ۙ وَجَدَ عِنْدَھَا رِزْقًا ۚ قَالَ يٰمَرْيَـمُ اَنّٰى لَكِ ھٰذَا ۭ قَالَتْ ھُوَ مِنْ عِنْدِ اللّٰهِ ۭ اِنَّ اللّٰهَ يَرْزُقُ مَنْ يَّشَاۗءُ بِغَيْرِ حِسَابٍ",
        "Urdu" : "توقبول کرلیا اسے اس کے رب نے احسن طریقے سے اورپروان چڑھایا اسے بہترین (انداز میں)اورسرپرست بنایااس کا زکریا کو جب کبھی داخل ہوتے زکریااس کے پاس حجرے می ن(موجود )پاتے اس کے پاس کھانے پینے کی اشیاء(یہ دیکھ کر ایک مرتبہ پوچھا)اے مریم کہاں سے (آتاہے)تیرے پاس یہ(سب کچھ)وہ بولیں وہ اللہ کی طرف سے ہے بے شک اللہ رزق دیتا ہے جسے چاہتا ہے بے حساب کے ۔",
        "English" : "So her Lord (Allah) accepted her with goodly acceptance. He made her grow in a good manner and put her under the care of Zakariy (Zachariya) . Every time he entered Al-Mihrb to (visit) her , he found her supplied with sustenance. He said: 'O Maryam (Mary) ! From where have you got this ? ' She said, 'This is fromAllah.' Verily,Allah provides sustenance to whom He wills, without limit.'"
      },
      {
        "ayet_no" : 38,
        "arbi" : "ھُنَالِكَ دَعَا زَكَرِيَّا رَبَّهٗ ۚ قَالَ رَبِّ ھَبْ لِيْ مِنْ لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً ۚ اِنَّكَ سَمِيْعُ الدُّعَاۗءِ",
        "Urdu" : "اسی جگہ(اسی موقع پر)دعا کی زکریا نے اپنے رب اور (کہا) اے میرے رب عطا کرمجھےاپنی طرف سے پاکیزہ (صالح) اولاد بلاشبہ تو دعا کو سننے ( قبول کرنے ) والا ہے ۔",
        "English" : "Forth with Zakariyya prayed unto his Lord my Lord bestow on me from Thine presence a goodly offspring; verily Thou! Thou art the Hearer of prayer."
      },
      {
        "ayet_no" : 39,
        "arbi" : "فَنَادَتْهُ الْمَلٰۗىِٕكَةُ وَھُوَ قَاۗىِٕمٌ يُّصَلِّيْ فِي الْمِحْرَابِ ۙ اَنَّ اللّٰهَ يُبَشِّرُكَ بِيَحْيٰى مُصَدِّقًۢـا بِكَلِمَةٍ مِّنَ اللّٰهِ وَسَيِّدًا وَّحَصُوْرًا وَّنَبِيًّا مِّنَ الصّٰلِحِيْنَ",
        "Urdu" : "توآواز دی اسے فرشتوں نے اس حال میں کہ وہ کھڑے ہوئے نماز پڑھ رہے تھے عبادت گاہ میں کہ بے شک اللہ خوش خبری دیتاہے آپ کو یحییٰ کی (جو)تصدیق کرنے والے ہیں اللہ کے ایک کلمہ (عیسی) کی اوروہ سردار اور عورتوں سے بے رغبت ہوں گے اور نبی ہوں گے نیک لوگوں میں سے ۔",
        "English" : "Then the angels called unto him even while he stood Praying in the apartment: verily Allah announceth unto thee Yahya confessing to a word from Allah, and a leader, and a chaste and a prophet of the righteous one."
      },
      {
        "ayet_no" : 40,
        "arbi" : "قَالَ رَبِّ اَنّٰى يَكُوْنُ لِيْ غُلٰمٌ وَّقَدْ بَلَغَنِىَ الْكِبَرُ وَامْرَاَتِيْ عَاقِرٌ ۭ قَالَ كَذٰلِكَ اللّٰهُ يَفْعَلُ مَا يَشَاۗءُ",
        "Urdu" : "کہا زکریا نے اے میرے رب کیسے ہوگامیرے ہاں لڑکا اوریقینا مجھے پہنچا ہے بڑھاپا اور میری بیوی (بھی) بانجھ ہے (اللہ نے) فرمایا اسی طرح (ہی ہوگا) اللہ کرتا ہے جو وہ چاہتا ہے۔",
        "English" : "He said: 'O my Lord! How can I have a son when I am very old, and my wife is barren ?' Allah said: 'ThusAllah does what He wills.'"
      },
      {
        "ayet_no" : 41,
        "arbi" : "قَالَ رَبِّ اجْعَلْ لِّيْٓ اٰيَةً ۭ قَالَ اٰيَتُكَ اَلَّا تُكَلِّمَ النَّاسَ ثَلٰــثَةَ اَيَّامٍ اِلَّا رَمْزًا ۭوَاذْكُرْ رَّبَّكَ كَثِيْرًا وَّسَبِّحْ بِالْعَشِيِّ وَالْاِبْكَارِ",
        "Urdu" : "کہازکریا نے اے میرے رب مقرر فرما میرے لیے کوئی نشانی فرمایا تیری نشانی یہ ہے کہ نہ تم بات چیت کرسکو گے لوگوں سے تین دن مگراشارے سے اورذکر کرو اپنے رب کا کثرت سے (ان تین دنوں میں)اور تسبیح بیان کرو صبح وشام ۔",
        "English" : "He said: my Lord! appoint unto me a sign. Allah said: thy sign is that thou shalt not speak unto mankind for three days save by beckoning; and remember thy Lord much and hallow Him in the evening and morning."
      },
      {
        "ayet_no" : 42,
        "arbi" : "وَاِذْ قَالَتِ الْمَلٰۗىِٕكَةُ يٰمَرْيَمُ اِنَّ اللّٰهَ اصْطَفٰىكِ وَطَهَّرَكِ وَاصْطَفٰىكِ عَلٰي نِسَاۗءِ الْعٰلَمِيْنَ",
        "Urdu" : "اور(وہ وقت یاد کرو)جب کہافرشتوں نے اے مریم!ے شک اللہ نے تجھے برگزیدہ کیا ہے اورتجھے پاکیزگی عطا کی ہے اورتجھے منتخب کیا ہے جہان کی عورتوں پر (ترجیح دے کر) ۔",
        "English" : "And recall what time the angels said: O Maryam! verily Allah chose thee and purified thee and chose thee above the women of the worlds."
      },
      {
        "ayet_no" : 43,
        "arbi" : "يٰمَرْيَمُ اقْنُتِىْ لِرَبِّكِ وَاسْجُدِيْ وَارْكَعِيْ مَعَ الرّٰكِعِيْنَ",
        "Urdu" : "اے مریم فرمانبردار رہنا اپنے رب کی اورسجدہ کرو اوررکوع کرو رکوع کرنے والوں کے ساتھ ۔",
        "English" : "Maryam! be devout unto thy Lord, prostrate thyself, and bow down with them that bow down."
      },
      {
        "ayet_no" : 44,
        "arbi" : "ذٰلِكَ مِنْ اَنْۢبَاۗءِ الْغَيْبِ نُوْحِيْهِ اِلَيْكَ ۭ وَمَا كُنْتَ لَدَيْهِمْ اِذْ يُلْقُوْنَ اَقْلَامَھُمْ اَيُّھُمْ يَكْفُلُ مَرْيَمَ ۠وَمَا كُنْتَ لَدَيْهِمْ اِذْ يَخْتَصِمُوْنَ",
        "Urdu" : "یہ غیب کی خبریں ہی ہم وحی کررہے ہیں اسے آپ کی طرف اور نہیں تھے آپ ان کے پاس جب وہ ڈال رہے تھے اپنے قلم(قرعہ کے طور پر) ان میں سے کون کفالت کرے گا مریم کی اور نہیں تھے آپ ان کے پاس جب وہ جھگڑا کر رہے تھے ۔",
        "English" : "This is of the tidings of things hidden which We reveal unto thee and thou wast not with them when they cast their reeds as to which of them should take care of Maryam, nor wast thou with them when they disputed."
      },
      {
        "ayet_no" : 45,
        "arbi" : "اِذْ قَالَتِ الْمَلٰۗىِٕكَةُ يٰمَرْيَمُ اِنَّ اللّٰهَ يُبَشِّرُكِ بِكَلِمَةٍ مِّنْهُ ڰ اسْمُهُ الْمَسِيْحُ عِيْسَى ابْنُ مَرْيَمَ وَجِيْهًا فِي الدُّنْيَا وَالْاٰخِرَةِ وَمِنَ الْمُقَرَّبِيْنَ",
        "Urdu" : "اوروہ وقت بھی یاد کرو)جب کہافرشتوں نے اے مریم!بے شک اللہ بشارت دیتا ہے تجھے ایک کلمہ کی اپنی طرف سے اس کا نام مسیح عیسی بن مریم ہوگامعزز ہوگا دنیا اورآخرت میں اور(اللہ کے)مقرب بندوں میں سے (شمار) ہو گا۔",
        "English" : "(Remember) when the angels said: 'O Maryam (Mary) ! Verily,Allah gives you the glad tidings of a Word ['Be!' - and he was! i.e. 'Iesa (Jesus) the son of Maryam (Mary) ] from Him, his name will be the Messiah 'Iesa (Jesus) , the son of Maryam (Mary) , held in honour in this world and in the Hereafter, and will be one of those who are near toAllah.'"
      },
      {
        "ayet_no" : 46,
        "arbi" : "وَيُكَلِّمُ النَّاسَ فِي الْمَهْدِ وَكَهْلًا وَّمِنَ الصّٰلِحِيْنَ",
        "Urdu" : "اوروہ کلام کرے گا لوگوں سے گہوارے میں اور پختہ عمر میں(بھی)اورنیک لوگوں میں سے ہو گا ۔",
        "English" : "And he shall speak unto mankind from the cradle and in maturity; and be one of the righteous."
      },
      {
        "ayet_no" : 47,
        "arbi" : "قَالَتْ رَبِّ اَنّٰى يَكُوْنُ لِيْ وَلَدٌ وَّلَمْ يَمْسَسْنِىْ بَشَرٌ ۭقَالَ كَذٰلِكِ اللّٰهُ يَخْلُقُ مَا يَشَاۗءُ ۭ اِذَا قَضٰٓى اَمْرًا فَاِنَّمَا يَقُوْلُ لَهٗ كُنْ فَيَكُوْنُ",
        "Urdu" : "کہا(مریم نے)اے میرے رب کیسے ہوگا میرے ہاں بچہ اس حال میں کہ نہیں چھوا مجھے کسی انسان نے فرمایا ایساہی ہوگا اللہ پیدا کرتا ہے جوچاہتا ہے جب وہ فیصلہ کرلے کسی کام کا توبے شک وہ کہتا ہے اس کو ”ہو جا“ تو وہ ہو جاتا ہے ۔",
        "English" : "She said: My Lord! How can I have a child when no mortal hath touched me? He said: So (it will be) . Allah create what He will. If He decree a thing, He saith unto it only: Be! and it is."
      },
      {
        "ayet_no" : 48,
        "arbi" : "وَيُعَلِّمُهُ الْكِتٰبَ وَالْحِكْمَةَ وَالتَّوْرٰىةَ وَالْاِنْجِيْلَ",
        "Urdu" : "اوروہ تعلیم دے گااسے کتاب وحکمت کی اور تورات اور انجیل کی ۔",
        "English" : "He shall teach him the Book and the Wisdom, and the Torah and the Injil,"
      },
      {
        "ayet_no" : 49,
        "arbi" : "وَرَسُوْلًا اِلٰى بَنِىْٓ اِسْرَاۗءِيْلَ ڏ اَنِّىْ قَدْ جِئْتُكُمْ بِاٰيَةٍ مِّنْ رَّبِّكُمْ ۙ اَنِّىْٓ اَخْلُقُ لَكُمْ مِّنَ الطِّيْنِ كَهَيْــــَٔــةِ الطَّيْرِ فَاَنْفُخُ فِيْهِ فَيَكُوْنُ طَيْرًۢ ا بِاِذْنِ اللّٰهِ ۚ وَاُبْرِئُ الْاَكْمَهَ وَالْاَبْرَصَ وَاُحْىِ الْمَوْتٰى بِاِذْنِ اللّٰهِ ۚ وَاُنَبِّئُكُمْ بِمَا تَاْكُلُوْنَ وَمَا تَدَّخِرُوْنَ ۙفِيْ بُيُوْتِكُمْ ۭ اِنَّ فِيْ ذٰلِكَ لَاٰيَةً لَكُمْ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
        "Urdu" : "اور(اسے)رسول بنائے بنی اسرائیل کی طرف(جب وہ رسول بن کرآئے گا توکہے گا)بے شک میں یقینا آیاہوں تمہارے پاس نشانی لے کر تمہارے رب کی طرف سے کہ بے شک میں بناتا ہوں تمہارے سامنے مٹی سے پرندے جیسی شکل پھرمیں پھونک مارتاہوں اس میں تووہ بن جاتا ہے(واقعی)پرندہ اللہ کے حکم سے اورمیں درست کردیتاہوں مادرزاد اندھے کو اورکوڑی کو اورمیں زندہ کرتاہوں مردوں کو اللہ کے حکم سے اورمیں خبر دیتا ہوں تم کواس کی جوتم کھاتے ہو اورجوتم ذخیرہ کرتے ہو اپنے گھروں میں بے شک اس میں یقینا نشانی ہے تمہارے لیے اگر ہو تم مومن ۔",
        "English" : "And (make him) a messenger to the children of Israel: That I have come to you with a sign from your Lord, that I determine for you out of dust like the form of a bird, then I breathe into it and it becomes a bird with Allah's permission and I heal the blind and the leprous, and bring the dead to life with Allah's permission and I inform you of what you should eat and what you should store in your houses; most surely there is a sign in this for you, if you are believers."
      },
      {
        "ayet_no" : 50,
        "arbi" : "وَمُصَدِّقًا لِّمَا بَيْنَ يَدَيَّ مِنَ التَّوْرٰىةِ وَلِاُحِلَّ لَكُمْ بَعْضَ الَّذِيْ حُرِّمَ عَلَيْكُمْ وَجِئْتُكُمْ بِاٰيَةٍ مِّنْ رَّبِّكُمْ ۣ فَاتَّقُوا اللّٰهَ وَاَطِيْعُوْنِ",
        "Urdu" : "اورتصدیق کرنے والاہوں اس کی جومیرے سامنے موجود ہے تورات کی اور(میں اس لیے آیاہوں)تاکہ میں حلال کردوں تمہارے لیے بعض وہ چیزیں جوحرام کی گئی ہیں تم پر اور میں آیا ہوں تمہارے پاس نشانی لے کر تمہارے رب کی طرف سے پس اللہ سے ڈرو اور میری اطاعت کرو ۔",
        "English" : "And I have come confirming that which was before me of the Taurt (Torah) , and to make lawful to you part of what was forbidden to you, and I have come to you with a proof from your Lord. So fearAllah and obey me."
      },
      {
        "ayet_no" : 51,
        "arbi" : "اِنَّ اللّٰهَ رَبِّيْ وَرَبُّكُمْ فَاعْبُدُوْهُ ۭھٰذَا صِرَاطٌ مُّسْتَقِيْمٌ",
        "Urdu" : "بے شک اللہ میرا رب ہے اورتمہارا(بھی) رب ہے توعبادت کرو اسی کی یہی سیدھا راستہ ہے ۔",
        "English" : "Verily Allah is my Lord; and your Lord, wherefore worship Him; this is the straight path."
      },
      {
        "ayet_no" : 52,
        "arbi" : "فَلَمَّآ اَحَسَّ عِيْسٰى مِنْھُمُ الْكُفْرَ قَالَ مَنْ اَنْصَارِيْٓ اِلَى اللّٰهِ ۭ قَالَ الْحَوَارِيُّوْنَ نَحْنُ اَنْصَارُ اللّٰهِ ۚ اٰمَنَّا بِاللّٰهِ ۚ وَاشْهَدْ بِاَنَّا مُسْلِمُوْنَ",
        "Urdu" : "پھرجب محسوس کیا عیسی نے ان سے کفر وانکارکہنے لگے کون ہیں میرے مددگار اللہ(کے دین)کی طرف حواریوں نے کہا ہم مددگار ہیں اللہ کے(دین کے)ہم ایمان لائے ہیں اللہ پر اورآپ گواہ رہیے کہ بے شک ہم فرمانبردار ہیں ۔",
        "English" : "Then when 'Isa perceived in them infidelity, he said: who will be my helpers unto Allah! The disciples said; we are helpers of Allah; we believe in Allah and bear thou witness that verily we are Muslims."
      },
      {
        "ayet_no" : 53,
        "arbi" : "رَبَّنَآ اٰمَنَّا بِمَآ اَنْزَلْتَ وَاتَّبَعْنَا الرَّسُوْلَ فَاكْتُبْنَا مَعَ الشّٰهِدِيْنَ",
        "Urdu" : "اے ہمارے رب ہم ایمان لائے اس پرجو تونے نازل کیاہے اورہم نے پیروی کی رسول کی پس تولکھ لے ہمیں گواہی دینے والوں کے ساتھ۔",
        "English" : "O our Lord! We have believed in the Book which You have sent down and we have become the followers of this Messenger So register us among those who bear witness (to the Truth) .’"
      },
      {
        "ayet_no" : 54,
        "arbi" : "وَمَكَرُوْا وَمَكَرَ اللّٰهُ ۭ وَاللّٰهُ خَيْرُ الْمٰكِرِيْنَ",
        "Urdu" : "اورانہوں نے خفیہ تدبیر کی(عیسی کے قتل کی)اوراللہ نے تدبیر کی(ان کوبچانے کی)اوراللہ تدبیر کرنے والوں میں سب سے بہتر ہے۔",
        "English" : "And they plotted, and Allah plotted, and Allah is the Best of plotters."
      },
      {
        "ayet_no" : 55,
        "arbi" : "اِذْ قَالَ اللّٰهُ يٰعِيْسٰٓى اِنِّىْ مُتَوَفِّيْكَ وَرَافِعُكَ اِلَيَّ وَمُطَهِّرُكَ مِنَ الَّذِيْنَ كَفَرُوْا وَجَاعِلُ الَّذِيْنَ اتَّبَعُوْكَ فَوْقَ الَّذِيْنَ كَفَرُوْٓا اِلٰى يَوْمِ الْقِيٰمَةِ ۚثُمَّ اِلَيَّ مَرْجِعُكُمْ فَاَحْكُمُ بَيْنَكُمْ فِيْمَا كُنْتُمْ فِيْهِ تَخْتَلِفُوْنَ",
        "Urdu" : "وہ بھی اللہ کی تدبیر تھی کہ)جب کہا اللہ نے اے عیسی بے شک میں پورا پورا لینے والاہوں تجھے اور تجھے اٹھانے والاہوں اپنی طرف اورتجھے پاک کرنے والا ہوں ان لوگوں سے جنہوں نے کفر کیا اوررکھنے والا ہوں ان لوگوں کوجنہوں نے تیری پیروی کی،فائق(وغالب)ان لوگوں پر جنہوں نے کفر کیا،قیامت کے دن تک پھربالآخر میری طرف ہی تمہارا لوٹنا ہے تومیں فیصلہ کروں گا تمہارے درمیان(اس بات) میں جوتم تھے اس میں اختلاف کرتے ۔",
        "English" : "Recall what time Allah said: O 'Isa! verily I shall make thee die, and am lifting thee to myself and am purifying thee from those who disbelieve, and shall place those who follow thee above those who disbelieve until the Day of Resurrection; thereafter unto Me shall be the return of you all, then I shall judge between you of that wherein ye were wont to differ."
      },
      {
        "ayet_no" : 56,
        "arbi" : "فَاَمَّا الَّذِيْنَ كَفَرُوْا فَاُعَذِّبُھُمْ عَذَابًا شَدِيْدًا فِي الدُّنْيَا وَالْاٰخِرَةِ ۡ وَمَا لَھُمْ مِّنْ نّٰصِرِيْنَ",
        "Urdu" : "پس رہے وہ لوگ جنہوں نے کفر کیا تومیں عذاب دوں گا انہیں سخت عذاب دنیااورآخرت میں اور نہیں ہوگا ان کاکوئی مددگار ۔",
        "English" : "Then as for those who disbelieved I shall torment them with a severe torment in the world and the Hereafter, nor shall have they any helpers."
      },
      {
        "ayet_no" : 57,
        "arbi" : "وَاَمَّا الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ فَيُوَفِّيْهِمْ اُجُوْرَھُمْ ۭ وَاللّٰهُ لَا يُحِبُّ الظّٰلِمِيْنَ",
        "Urdu" : "اوررہے وہ لوگ جوایمان لائے اورنیک عمل کیے تو وہ پورا پورا دے گاا نہیں ان کے اجر اوراللہ تعالی نہیں پسند کرتا ظالموں کو۔",
        "English" : "And as for those who believe ( in the Oneness of Allah ) and do righteous good deeds, Allah will pay them their reward in full. And Allah does not like the Zlimn (polytheists and wrong-doers) ."
      },
      {
        "ayet_no" : 58,
        "arbi" : "ذٰلِكَ نَتْلُوْهُ عَلَيْكَ مِنَ الْاٰيٰتِ وَالذِّكْرِ الْحَكِيْمِ",
        "Urdu" : "یہ (جو)ہم تلاوت کررہے ہیں اس کی آپ پر آیتیں ہیں اورحکمت والی نصیحت ہے ۔",
        "English" : "This which we recite unto thee is of the signs and of the wise admonition."
      },
      {
        "ayet_no" : 59,
        "arbi" : "اِنَّ مَثَلَ عِيْسٰى عِنْدَ اللّٰهِ كَمَثَلِ اٰدَمَ ۭخَلَقَهٗ مِنْ تُرَابٍ ثُمَّ قَالَ لَهٗ كُنْ فَيَكُوْنُ",
        "Urdu" : "بے شک عیسی کی مثال اللہ کے ہاں آدم کی مثال کی طرح ہے(کہ)اس نے پیدا کیا اسے مٹی سے ،پھر کہااس کو ”ہوجا“تووہ ہو گیا ۔",
        "English" : "Verily the likeness of 'lsa with Allah is as the likeness of Adam: him He created out of dust, thereafter He said unto him: Be, and lo! he becometh."
      },
      {
        "ayet_no" : 60,
        "arbi" : "اَلْحَقُّ مِنْ رَّبِكَ فَلَا تَكُنْ مِّنَ الْمُمْتَرِيْنَ",
        "Urdu" : "یہ بات)حق ہے تیرے رب کی طرف سے تونہ تم ہونا شک کرنے والوں میں سے ۔",
        "English" : "(This is) the truth from your Lord, so be not of those who doubt."
      },
      {
        "ayet_no" : 61,
        "arbi" : "فَمَنْ حَاۗجَّكَ فِيْهِ مِنْۢ بَعْدِ مَا جَاۗءَكَ مِنَ الْعِلْمِ فَقُلْ تَعَالَوْا نَدْعُ اَبْنَاۗءَنَا وَاَبْنَاۗءَكُمْ وَنِسَاۗءَنَا وَنِسَاۗءَكُمْ وَاَنْفُسَنَا وَاَنْفُسَكُمْ ۣ ثُمَّ نَبْتَهِلْ فَنَجْعَلْ لَّعْنَتَ اللّٰهِ عَلَي الْكٰذِبِيْنَ",
        "Urdu" : "پس جوجھگڑا کرے آپ سے اس (بارے)میں اس کے بعد کہ آیاآپ کے پاس علم توکہوآؤ ہم بلالیں اپنے بیٹوں کو اور(تم)اپنے بیٹوں کواور(ہم بلالیں)اپنی عورتوں کواور(تم)اپنی عورتوں کو اورہم خود(بھی آئیں)اورتم خود(بھی آؤ )پھرہم گڑ گڑا کردعا (مباہلہ)کریں پھرہم ڈالیں اللہ کی لعنت جھوٹوں پر۔",
        "English" : "And whoso dispute with thee concerning him, after the knowledge which hath come unto thee, say (unto him) : Come! We will summon our sons and your sons, and our women and your women, and ourselves and yourselves, then we will pray humbly (to our Lord) and (solemnly) invoke the curse of Allah upon those who lie."
      },
      {
        "ayet_no" : 62,
        "arbi" : "اِنَّ ھٰذَا لَھُوَ الْقَصَصُ الْحَقُّ ۚ وَمَا مِنْ اِلٰهٍ اِلَّا اللّٰهُ ۭ وَاِنَّ اللّٰهَ لَھُوَ الْعَزِيْزُ الْحَكِيْمُ",
        "Urdu" : "بے شک یقینا یہ ہی سچا بیان ہے اور نہیں کوئی معبود(برحق)اللہ کے سوا اوربے شک اللہ ہی یقینا غالب حکمت والا ہے ۔",
        "English" : "Verily this! it is the true recital; and God there is none save Allah, and Verily Allah! He is the Mighty, the Wise."
      },
      {
        "ayet_no" : 63,
        "arbi" : "فَاِنْ تَوَلَّوْا فَاِنَّ اللّٰهَ عَلِيْمٌۢ بِالْمُفْسِدِيْنَ",
        "Urdu" : "پھر اگر یہ پھر جائیں ( اور مقابلہ میں نہ آئیں ) تو بے شک اللہ خوب جاننے والا ہے ( ایسے )فسادیوں کو ۔",
        "English" : "But if they turn away, then Allah is Knower of the corrupter."
      },
      {
        "ayet_no" : 64,
        "arbi" : "قُلْ يٰٓاَھْلَ الْكِتٰبِ تَعَالَوْا اِلٰى كَلِمَةٍ سَوَاۗءٍۢ بَيْنَنَا وَبَيْنَكُمْ اَلَّا نَعْبُدَ اِلَّا اللّٰهَ وَلَا نُشْرِكَ بِهٖ شَيْـــًٔـا وَّلَا يَتَّخِذَ بَعْضُنَا بَعْضًا اَرْبَابًا مِّنْ دُوْنِ اللّٰهِ ۭ فَاِنْ تَوَلَّوْا فَقُوْلُوا اشْهَدُوْا بِاَنَّا مُسْلِمُوْنَ",
        "Urdu" : "کہہ دیں اے اہل کتاب آؤ (ایسی)بات کی طرف (جو)یکساں(مسلم)ہے ہمارے اور تمہارے درمیان یہ کہ نہ ہم عبادت کریں اللہ کے سوا(کسی کی)اورہم شریک نہ بنائیں اس کے ساتھ کسی کو نہ بنائے ہم میں سے کوئی کسی کی رب اللہ کے علاوہ پھراگروہ منہ موڑ لیں(اس بات سے)تو تم کہہ دو گواہ رہو کہ بے شک ہم تومسلمان ہیں ۔",
        "English" : "Say (O Muhammad ) : ' O people of the Scripture (Jews and Christians) : Come to a word that is just between us and you, that we worship none butAllah, and that we associate no partners with Him, and that none of us shall take others as lords besidesAllah. Then, if they turn away, say: 'Bear witness that we are Muslims.'"
      },
      {
        "ayet_no" : 65,
        "arbi" : "يٰٓاَھْلَ الْكِتٰبِ لِمَ تُحَاۗجُّوْنَ فِيْٓ اِبْرٰهِيْمَ وَمَآ اُنْزِلَتِ التَّوْرٰىةُ وَالْاِنْجِيْلُ اِلَّا مِنْۢ بَعْدِهٖ ۭاَفَلَا تَعْقِلُوْنَ",
        "Urdu" : "اے اہل کتاب کیوں تم جھگڑا کرتے ہو ابراہیم کے بارے میں (کہ وہ یہودی تھے یاعیسائی)حالانکہ نہیں اتاری گئی تورات اورانجیل مگراس کے بعد ،کیا پس تم عقل نہیں رکھتے۔",
        "English" : "O people of the Book! wherefore contend ye concerning Ibrahim, whereas the Taurat and the Injil were not sent down save after him! Will ye not then under stand ?"
      },
      {
        "ayet_no" : 66,
        "arbi" : "ھٰٓاَنْتُمْ ھٰٓؤُلَاۗءِ حَاجَجْتُمْ فِيْمَا لَكُمْ بِهٖ عِلْمٌ فَلِمَ تُحَاۗجُّوْنَ فِيْمَا لَيْسَ لَكُمْ بِهٖ عِلْمٌ ۭ وَاللّٰهُ يَعْلَمُ وَاَنْتُمْ لَا تَعْلَمُوْنَ",
        "Urdu" : "سنوتم وہی لوگ ہو(جو)جھگڑا کرچکے ہو (اس بات)میں (کہ)تمہیں اس کاعلم تھا توکیوں تم جھگڑا کرتے ہو اس(بات) میں جو نہیں ہے تمہیں اس کاعلم اوراللہ جانتا ہے اور تم نہیں جانتے ۔",
        "English" : "Verily, you are those who have disputed about that of which you have knowledge. Why do you then dispute concerning that which you have no knowledge? It isAllah Who knows, and you know not."
      },
      {
        "ayet_no" : 67,
        "arbi" : "مَا كَانَ اِبْرٰهِيْمُ يَهُوْدِيًّا وَّلَا نَصْرَانِيًّا وَّلٰكِنْ كَانَ حَنِيْفًا مُّسْلِمًا ۭ وَمَا كَانَ مِنَ الْمُشْرِكِيْنَ",
        "Urdu" : "نہیں تھے ابراہیم یہودی اورنہ عیسائی اورلیکن وہ تھے یکسو(خالص)مسلمان اور نہیں تھے وہ مشرکوں میں سے۔",
        "English" : "Ibrahim was neither a Jew nor a Christian. But he was upright, a Muslim, and was not one of those who associate partners with Allah."
      },
      {
        "ayet_no" : 68,
        "arbi" : "اِنَّ اَوْلَى النَّاسِ بِاِبْرٰهِيْمَ لَلَّذِيْنَ اتَّبَعُوْهُ وَھٰذَا النَّبِىُّ وَالَّذِيْنَ اٰمَنُوْا ۭوَاللّٰهُ وَلِيُّ الْمُؤْمِنِيْنَ",
        "Urdu" : "بے شک لوگوں میں سے ابراہیم کے قریب ترین یقینا وہ لوگ ہیں جنہوں نے پیروی کی اس کی اور(پھر ان کے بعد) یہ نبی اوروہ لوگ جو ایمان لائے اوراللہ حامی ومددگار ہے مومنون کا۔",
        "English" : "Verily the nearest of mankind to Ibrahim, surely those who followed him, and this prophet, and those who believe; and Allah is the Patron of the believers."
      },
      {
        "ayet_no" : 69,
        "arbi" : "وَدَّتْ طَّاۗىِٕفَةٌ مِّنْ اَھْلِ الْكِتٰبِ لَوْ يُضِلُّوْنَكُمْ ۭ وَمَا يُضِلُّوْنَ اِلَّآ اَنْفُسَھُمْ وَمَا يَشْعُرُوْنَ",
        "Urdu" : "چاہتی ہے ایک جماعت اہل کتاب میں سے کاش !وہ گمراہ کرسکیں تمہیں حالانکہ نہیں وہ گمراہ کررہے مگر اپنے آپ کو اور وہ شعور نہیں رکھتے ۔",
        "English" : "Pain would a party of the people of the Book lead you astray, and none they lead astray save themselves, and they perceive not."
      },
      {
        "ayet_no" : 70,
        "arbi" : "يٰٓاَھْلَ الْكِتٰبِ لِمَ تَكْفُرُوْنَ بِاٰيٰتِ اللّٰهِ وَاَنْتُمْ تَشْهَدُوْنَ",
        "Urdu" : "اے اہل کتاب کیوں تم انکار کرتے ہو اللہ کی آیات کا حالانکہ تم(خود)گواہی دیتے ہو ۔",
        "English" : "O people of the Book! wherefore disbelieve ye in the revelations of Allah whereas ye bear witness ?"
      },
      {
        "ayet_no" : 71,
        "arbi" : "يٰٓاَھْلَ الْكِتٰبِ لِمَ تَلْبِسُوْنَ الْحَقَّ بِالْبَاطِلِ وَتَكْتُمُوْنَ الْحَقَّ وَاَنْتُمْ تَعْلَمُوْنَ",
        "Urdu" : "اے اہل کتاب کیوں تم خلط ملط کرتے ہو حق کو باطل کے ساتھ اور ( کیوں ) تم چھپاتے ہو حق کو حالانکہ تم ( سب کچھ ) جانتے ہو ۔",
        "English" : "O people of the Book! wherefore confound ye the truth with falsehood, and hide the truths While ye know ?"
      },
      {
        "ayet_no" : 72,
        "arbi" : "وَقَالَتْ طَّاۗىِٕفَةٌ مِّنْ اَھْلِ الْكِتٰبِ اٰمِنُوْا بِالَّذِيْٓ اُنْزِلَ عَلَي الَّذِيْنَ اٰمَنُوْا وَجْهَ النَّهَارِ وَاكْفُرُوْٓا اٰخِرَهٗ لَعَلَّھُمْ يَرْجِعُوْنَ",
        "Urdu" : "اورکہا اہل کتاب میں سے ایک جماعت نے (آ پس میں سازش تیار کی کہ)تم ایمان لے آیا کرو اس پرجونازل کیا گیا ہے ان لوگوں پر جو ایمان لائے ہیں دن چڑھے اورانکار کردیا کرو اس کے آخر میں تاکہ وہ ( شک میں پڑیں اور اسلام سے ) پھر جائیں ۔",
        "English" : "And a Party of the people of the Book say: believe in that which hath been sent down unto those who have believed, at the break of day, and disbelieve at the close thereof, haply they may turn away;"
      },
      {
        "ayet_no" : 73,
        "arbi" : "وَلَا تُؤْمِنُوْٓا اِلَّا لِمَنْ تَبِعَ دِيْنَكُمْ ۭ قُلْ اِنَّ الْهُدٰى ھُدَى اللّٰهِ ۙ اَنْ يُّؤْتٰٓى اَحَدٌ مِّثْلَ مَآ اُوْتِيْتُمْ اَوْ يُحَاۗجُّوْكُمْ عِنْدَ رَبِّكُمْ ۭ قُلْ اِنَّ الْفَضْلَ بِيَدِ اللّٰهِ ۚ يُؤْتِيْهِ مَنْ يَّشَاۗءُ ۭوَاللّٰهُ وَاسِعٌ عَلِيْمٌ",
        "Urdu" : "اور(وہ یہ بھی کہتے ہیں کہ کسی کی بات)مت مانو سوائے ان کے جو پیروکار ہیں تمہارے دین کے کہہ دو کہ بے شک (اصل)ہدایت تواللہ کی ہدایت ہے(اورکہتے ہیں یہ بھی نہ مانو)کہ دیاجائیگا کسی کواس کی مثل جو تمہیں دیا گیا ہے یا(یہ کہ)وہ جھگڑا کریں گے تم سے تمہارے رب کے پاس کہہ دیجیے کہ بے شک فضل تواللہ کے پاس ہے وہ دیتا ہے اسے جس کوچاہتا ہے اوراللہ وسعت والا ،بہت علم والا ہے ۔",
        "English" : "And believe not save one who follow your religion. Say thou: verily the guidance of Allah - that is the guidance. Envy ye that any one should be vouchsafed the like of that which was vouchsafed unto you or fear ye that those others may overcome you in Contention before your Lord! Say thou: verily the grace is in the hand of Allah He vouch safe it unto whomsoever He will; and Allah is Bounteous, Knowing."
      },
      {
        "ayet_no" : 74,
        "arbi" : "يَّخْتَصُّ بِرَحْمَتِهٖ مَنْ يَّشَاۗءُ ۭ وَاللّٰهُ ذُو الْفَضْلِ الْعَظِيْمِ",
        "Urdu" : "وہ مختص کر لیتا ہے اپنی رحمت سے جسے چاہتا ہے اور اللہ تعالی بڑے فضل والا ہے ۔",
        "English" : "He singleth out for His mercy Whomsoever He will; And Allah is the Owner of mighty Grace."
      },
      {
        "ayet_no" : 75,
        "arbi" : "وَمِنْ اَھْلِ الْكِتٰبِ مَنْ اِنْ تَاْمَنْهُ بِقِنْطَارٍ يُّؤَدِّهٖٓ اِلَيْكَ ۚ وَمِنْھُمْ مَنْ اِنْ تَاْمَنْهُ بِدِيْنَارٍ لَّا يُؤَدِّهٖٓ اِلَيْكَ اِلَّا مَا دُمْتَ عَلَيْهِ قَاۗىِٕمًا ۭ ذٰلِكَ بِاَنَّھُمْ قَالُوْا لَيْسَ عَلَيْنَا فِي الْاُمِّيّٖنَ سَبِيْلٌ ۚ وَيَقُوْلُوْنَ عَلَي اللّٰهِ الْكَذِبَ وَھُمْ يَعْلَمُوْنَ",
        "Urdu" : "اوراہل کتاب میں سے (کچھ ایسے ہیں)جسے اگرآپ اسے بطور امانت دے دیں ایک خزانہ وہ اسے واپس لوٹا دے گا آپ کو اور ان میں سے (کچھ ایسے ہیں)جوکہ اگر آپ اس کے پاس امانت رکھیں ایک دینار تووہ اسے ادا نہیں کرے گا آپ کو الایہ کہ آپ رہیں اس(کے سر) پرسوار یہ اس لیے ہے کہ بے شک انہوں نے کہہ رکھا ہے نہیں ہم پران پڑھوں(غیر یہود) کے بارے میں کوئی راستہ(مواخذہ)اورکہتے ہیں اللہ کے بارے میں جھوٹ حالانکہ وہ جانتے ہیں ۔",
        "English" : " And among the People of the Book there are a type that if you trust him with a heap of wealth, he will return it to you And some among them are such that if you trust him with one dinar (a gold coin) , he will not return it to you unless you keep standing"
      },
      {
        "ayet_no" : 76,
        "arbi" : "بَلٰي مَنْ اَوْفٰى بِعَهْدِهٖ وَاتَّقٰى فَاِنَّ اللّٰهَ يُحِبُّ الْمُتَّقِيْنَ",
        "Urdu" : "ہاں کیوں نہیں جس نے پورا کیا اس ( اللہ ) سے کیے ہوئے عہد کو اور وہ ( اللہ سے ) ڈر گیا تو بے شک اللہ پسند کرتا ہے ( ایسے ) پرہیزگاروں کو۔",
        "English" : "Why (will they) not (be blamed) ? Whoever fulfils his pledge and fears Allah, then, Allah loves the God-fearing."
      },
      {
        "ayet_no" : 77,
        "arbi" : "اِنَّ الَّذِيْنَ يَشْتَرُوْنَ بِعَهْدِ اللّٰهِ وَاَيْمَانِهِمْ ثَـمَنًا قَلِيْلًا اُولٰۗىِٕكَ لَا خَلَاقَ لَھُمْ فِي الْاٰخِرَةِ وَلَا يُكَلِّمُھُمُ اللّٰهُ وَلَا يَنْظُرُ اِلَيْهِمْ يَوْمَ الْقِيٰمَةِ وَلَا يُزَكِّيْهِمْ ۠ وَلَھُمْ عَذَابٌ اَلِيْمٌ",
        "Urdu" : "بے شک وہ لوگ جو بیچ ڈالتے ہیں اللہ کے عہد کو اوراپنی قسموں کوتھوڑی قیمت میں وہی لوگ ہیں (کہ) نہیں ہے کوئی حصہ ان کے لیے آخرت میں اوراللہ ان سے بات تک نہیں کرے گا اورنہ وہ دیکھے گا ان کی طرف قیامت کے دن اورنہ ا نہیں( گناہوں سے)پاک کرے گا اور ان کے لیے دردناک عذاب ہے ۔",
        "English" : "Surely, those who take a small price by (breaking) the covenant of Allah and their oaths, for them there is no share in the Hereafter, and Allah will neither speak to them, nor will He look towards them on the Day of Judgment, nor will He purify them. For them there is a painful punishment."
      },
      {
        "ayet_no" : 78,
        "arbi" : "وَاِنَّ مِنْھُمْ لَفَرِيْقًا يَّلْوٗنَ اَلْسِنَتَھُمْ بِالْكِتٰبِ لِتَحْسَبُوْهُ مِنَ الْكِتٰبِ وَمَا ھُوَ مِنَ الْكِتٰبِ ۚ وَيَقُوْلُوْنَ ھُوَ مِنْ عِنْدِ اللّٰهِ وَمَا ھُوَ مِنْ عِنْدِ اللّٰهِ ۚ وَيَـقُوْلُوْنَ عَلَي اللّٰهِ الْكَذِبَ وَھُمْ يَعْلَمُوْنَ",
        "Urdu" : "اوربے شک ان میں سے یقینا ایک گروہ (ایسا ہے کہ)وہ مڑورتے ہیں اپنی زبانوں کوکتاب کو(پڑھتے ہوئے)تاکہ آپ گمان کریں اسے کتاب(تورات)سے حالانکہ نہیں ہوتی وہ (عبارت)کتاب سے اوروہ کہتے ہیں (کہ)وہ اللہ کی طرف سے (نازل شدہ) ہے حالانکہ نہیں ہوتی وہ (عبارت)اللہ کی طرف سے اورکہتے ہیں اللہ کے بارے میں جھوٹ حالانکہ وہ جانتے ہیں ۔",
        "English" : "Among them there is indeed a group who twist their tongues while (reading) the Book, so that you may deem it to be from the Book, while it is not from the Book. They say, :It is from Allah , while it is not from Allah; and they tell lies about Allah knowingly."
      },
      {
        "ayet_no" : 79,
        "arbi" : "مَا كَانَ لِبَشَرٍ اَنْ يُّؤْتِيَهُ اللّٰهُ الْكِتٰبَ وَالْحُكْمَ وَالنُّبُوَّةَ ثُمَّ يَقُوْلَ لِلنَّاسِ كُوْنُوْا عِبَادًا لِّيْ مِنْ دُوْنِ اللّٰهِ وَلٰكِنْ كُوْنُوْا رَبّٰـنِيّٖنَ بِمَا كُنْتُمْ تُعَلِّمُوْنَ الْكِتٰبَ وَبِمَا كُنْتُمْ تَدْرُسُوْنَ",
        "Urdu" : "نہیں ہے (مناسب)کسی انسان کے لیے کہ عطاکرے اللہ اسے کتاب اورحکمت اورنبوت پھر وہ کہے لوگوں سے(کہ)بن جاؤ میرے بندے اللہ کوچھوڑ کر اورلیکن(وہ توکہے گا)ہوجاؤ تم اللہ والے اس وجہ سے کہ جو کتاب تم سکھاتے ہو ( لوگوں کو ) اور اس وجہ سے جو تم خود پڑھتے ہو ( اس کاتقاضا یہی ہے )",
        "English" : "It is not Possible for a human being unto whom Allah hath vouchsafed the Book and Wisdom and prophethood that he should thereafter say unto men: be ye worshippers of me, beside Allah; but be ye faithful servants of the Lord, seeing that ye are wont to teach the Books and seeing that ye are wont to exercise yourselves therein."
      },
      {
        "ayet_no" : 80,
        "arbi" : "وَلَا يَاْمُرَكُمْ اَنْ تَتَّخِذُوا الْمَلٰۗىِٕكَةَ وَالنَّبِيّٖنَ اَرْبَابًا ۭ اَيَاْمُرُكُمْ بِالْكُفْرِ بَعْدَ اِذْ اَنْتُمْ مُّسْلِمُوْنَ",
        "Urdu" : "اورنہ وہ نبی تمہیں کبھی حکم دے گا کہ تم بنالو فرشتوں کو اور نبیوں کو رب ( بھلا ) کیا وہ حکم دے گا تمہیں کفر کا اس کے بعد کہ جب تم مسلمان ہو چکے ہو ۔",
        "English" : "And he would not command you that ye should take the angels and the prophets for lords. Would he command you to infidelity after ye are become Muslims ?"
      },
      {
        "ayet_no" : 81,
        "arbi" : "وَاِذْ اَخَذَ اللّٰهُ مِيْثَاقَ النَّبِيّٖنَ لَمَآ اٰتَيْتُكُمْ مِّنْ كِتٰبٍ وَّحِكْمَةٍ ثُمَّ جَاۗءَكُمْ رَسُوْلٌ مُّصَدِّقٌ لِّمَا مَعَكُمْ لَتُؤْمِنُنَّ بِهٖ وَلَتَنْصُرُنَّهٗ ۭ قَالَ ءَاَقْرَرْتُمْ وَاَخَذْتُمْ عَلٰي ذٰلِكُمْ اِصْرِيْ ۭ قَالُوْٓا اَقْرَرْنَا ۭ قَالَ فَاشْهَدُوْا وَاَنَا مَعَكُمْ مِّنَ الشّٰهِدِيْنَ",
        "Urdu" : "اور جب اللہ نے پختہ عہد لیانبیوں سے(کہ)البتہ جو میں دوں تمہیں کتاب وحکمت پھرآجائے تمہارے پاس (ایسا)رسول (جو)تصدیق کرنے والا ہو اس(کتاب) کی جوتمہارے پاس ہے تم ضرور ایمان لانا اس پر اور ضرور مدد کرنا اس کی (عہد لینے کے بعد)فرمایا کیا تم نے اقرار کر لیا اور تم نے لے لیا اس پر میرا ذمہ(یعنی مجھے ضامن ٹھہرایا)(تو)انہوں نے کہا ہم نے اقرار کرلیا فرمایا تو تم گواہ رہو اور میں خود بھی تمہارے ساتھ گواہوں میں سے ہوں ۔",
        "English" : "And recall what time Allah took a bond from the prophets saying whatever I vouchsafed unto you of Book and Wisdom, end, thereafter there cometh unto you an apostle confessing to that which is with you, ye shall surely believe in him and succour him. He said: assent ye, and take ye My burthen thereunto They said: we assent. He said: then bear Witness, and I, with you among the witnesses."
      },
      {
        "ayet_no" : 82,
        "arbi" : "فَمَنْ تَوَلّٰى بَعْدَ ذٰلِكَ فَاُولٰۗىِٕكَ ھُمُ الْفٰسِقُوْنَ",
        "Urdu" : "پھرجو(اس عہدسے)پھر گیا اس کے بعد،تو وہی لوگ ہی نافرمان ہیں ۔",
        "English" : "Wherefore whosoever shall turn away thereafter -those then! they are the transgressors."
      },
      {
        "ayet_no" : 83,
        "arbi" : "اَفَغَيْرَ دِيْنِ اللّٰهِ يَبْغُوْنَ وَلَهٗٓ اَسْلَمَ مَنْ فِي السَّمٰوٰتِ وَالْاَرْضِ طَوْعًا وَّكَرْھًا وَّاِلَيْهِ يُرْجَعُوْنَ",
        "Urdu" : "توکیا اللہ کے دین کے علاوہ (کوئی اوردین)چاہتے ہیں حالانکہ اسی کاتابع فرماں ہے جو(بھی)آسمانوں میں اورزمین میں ہے خوشی سے ہواور(یا)ناخوشی سے اوراسی کی طرف لوٹائے جائیں گے ۔",
        "English" : "Seek they then other than the religion of Allah Whereas unto Him hath submitted whosoever is in the heavens and the earth willingly or unwillingly, and unto Him shall they all be returned."
      },
      {
        "ayet_no" : 84,
        "arbi" : "قُلْ اٰمَنَّا بِاللّٰهِ وَمَآ اُنْزِلَ عَلَيْنَا وَمَآ اُنْزِلَ عَلٰٓى اِبْرٰهِيْمَ وَاِسْمٰعِيْلَ وَاِسْحٰقَ وَيَعْقُوْبَ وَالْاَسْبَاطِ وَمَآ اُوْتِيَ مُوْسٰى وَعِيْسٰى وَالنَّبِيُّوْنَ مِنْ رَّبِّهِمْ ۠ لَا نُفَرِّقُ بَيْنَ اَحَدٍ مِّنْھُمْ ۡ وَنَحْنُ لَهٗ مُسْلِمُوْنَ",
        "Urdu" : "اے نبی)آپ کہہ دیں ہم ایمان لائے ہیں اللہ پر اور جواتارا گیا ہے ہم پر اورجواتاراگیا ابراہیم پر اوراسماعیل(پر)اوراسحاق اوریعقوب(پر)اور(ان کی )اولاد(پر)اورجودیاگیا موسی اورعیسی کو اور(دوسرے)نبیوں کوان کے رب کی طرف سے ہم فرق نہیں کرتے کسی ایک کے درمیان ان میں سے اور ہم اسی(اللہ)کے فرمانبردار ہیں ۔",
        "English" : "Say, :We believe in Allah and in what has been revealed to us and in what was revealed to Ibrahim, Ismai'l, IsHaq , Ya'qub and the descendants, and in what has been given to Musa, lsa, and the prophets, from their Lord: We do not differentiate between any of them; and to Him we submit ourselves."
      },
      {
        "ayet_no" : 85,
        "arbi" : "وَمَنْ يَّبْتَـغِ غَيْرَ الْاِسْلَامِ دِيْنًا فَلَنْ يُّقْبَلَ مِنْهُ ۚ وَھُوَ فِي الْاٰخِرَةِ مِنَ الْخٰسِرِيْنَ",
        "Urdu" : "اورجوتلاش کرے اسلام کے سوا(کوئی اور)دین توہرگز قبول نہیں کیاجائیگا اس سے اوروہ آخرت میں خسارہ پانے والے لوگوں میں سے ہو گا ۔",
        "English" : "And whosoever will seek a religion other than Islam, it shall not be accepted of Him, and he shall be of the losers in the Hereafter."
      },
      {
        "ayet_no" : 86,
        "arbi" : "كَيْفَ يَهْدِي اللّٰهُ قَوْمًا كَفَرُوْا بَعْدَ اِيْمَانِهِمْ وَشَهِدُوْٓا اَنَّ الرَّسُوْلَ حَقٌّ وَّجَاۗءَھُمُ الْبَيِّنٰتُ ۭوَاللّٰهُ لَايَهْدِي الْقَوْمَ الظّٰلِمِيْنَ",
        "Urdu" : "کیونکر ہدایت دے گا اللہ اس قوم کو (جنہوں نے)کفر کیا اپنے ایمان(لانے)کے بعد حالانکہ وہ(خود)گواہی دے چکے ہیں کہ بے شک رسول برحق ہیں اورآچکے ہیں ان کے پاس(اس بات پر)واضح دلائل اوراللہ نہیں راہ راست پرلاتا ناانصاف قوم کو۔",
        "English" : "How shall Allah guide a people who disbelieved after their belief and after they bore witness that the apostle was true and after evidences had come unto them! And Allah guide not a wrong-doing people."
      },
      {
        "ayet_no" : 87,
        "arbi" : "اُولٰۗىِٕكَ جَزَاۗؤُھُمْ اَنَّ عَلَيْهِمْ لَعْنَةَ اللّٰهِ وَالْمَلٰۗىِٕكَةِ وَالنَّاسِ اَجْمَعِيْنَ",
        "Urdu" : "یہ(ایسے)لوگ ہیں (کہ)ان کی سزایہ ہے کہ بے شک ان پراللہ کی لعنت ہے اورفرشتوں اورتمام لوگوں کی ( لعنت ہو ) ۔",
        "English" : "They are those whose recompense is that on them (rests) the Curse ofAllah, of the angels, and of all mankind."
      },
      {
        "ayet_no" : 88,
        "arbi" : "خٰلِدِيْنَ فِيْهَا ۚ لَا يُخَفَّفُ عَنْھُمُ الْعَذَابُ وَلَا ھُمْ يُنْظَرُوْنَ",
        "Urdu" : "ہمیشہ رہنے والے ہیں اس(لعنت)میں نہ ہلکا کیاجائے گا ان سے عذاب اور نہ وہ مہلت دیے جائیں گے ۔",
        "English" : "They will remain under it forever. Neither will the punishment be lightened for them, nor will they be given respite"
      },
      {
        "ayet_no" : 89,
        "arbi" : "اِلَّا الَّذِيْنَ تَابُوْا مِنْۢ بَعْدِ ذٰلِكَ وَاَصْلَحُوْا ۣ فَاِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ",
        "Urdu" : "مگرجنہوں نے توبہ کرلی اس کے بعد اور(اپنی)اصلاح کرلی توبے شک اللہ بخشنے والا بہت مہربان ہے ۔",
        "English" : "Save such shall repent thereafter and amend; verily Allah is Forgiving, Merciful."
      },
      {
        "ayet_no" : 90,
        "arbi" : "اِنَّ الَّذِيْنَ كَفَرُوْا بَعْدَ اِيْمَانِهِمْ ثُمَّ ازْدَادُوْا كُفْرًا لَّنْ تُقْبَلَ تَوْبَتُھُمْ ۚ وَاُولٰۗىِٕكَ ھُمُ الضَّاۗلُّوْنَ",
        "Urdu" : "بے شک وہ لوگ جو کافر ہوگئے اپنے ایمان ( لانے ) کے بعد پھر بڑھتے گئے کفر میں ( تو ) ہرگز نہیں قبول کی جائے گی ان کی توبہ اور وہی لوگ ہی گمراہ ہیں ۔",
        "English" : "Verily those who disbelieve after they have believed and thereafter wax in infidelity, their- repentance shall by no means be accepted. These! they are the straying ones."
      },
      {
        "ayet_no" : 91,
        "arbi" : "اِنَّ الَّذِيْنَ كَفَرُوْا وَمَاتُوْا وَھُمْ كُفَّارٌ فَلَنْ يُّقْبَلَ مِنْ اَحَدِھِمْ مِّلْءُ الْاَرْضِ ذَھَبًا وَّلَوِ افْتَدٰى بِهٖ ۭ اُولٰۗىِٕكَ لَھُمْ عَذَابٌ اَلِيْمٌ وَّمَا لَھُمْ مِّنْ نّٰصِرِيْنَ",
        "Urdu" : "بے شک وہ لوگ جنہوں نے کفرکیا اورمرگئے اس حال میں کہ وہ کافر تھے توہرگز نہیں قبول کیاجائے گا ان میں سے کسی ایک سے (اپنے بچاؤ کے لیے )زمین بھرسونا اور اگرچہ وہ بطور فدیہ دے اسے یہی لوگ ہیں (کہ)ان کے لیے درد نا ک عذاب ہے اور نہیں ہوگا ان کا کوئی مددگار۔",
        "English" : "Those who disbelieve and die as disbelievers, even an Earth-full of gold shall never be accepted from any of them, even if one were to offer it as ransom. They are the ones for whom there is a painful punishment, and for them there are no helpers."
      },
      {
        "ayet_no" : 92,
        "arbi" : "لَنْ تَنَالُوا الْبِرَّ حَتّٰى تُنْفِقُوْا مِمَّا تُحِبُّوْنَ ڛ وَمَا تُنْفِقُوْا مِنْ شَيْءٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيْمٌ",
        "Urdu" : "ہرگز نہ تم حاصل کرسکوگے نیکی یہاں تک کہ تم خرچ (نہ) کرلو اس سے جو تم پسند کرتے ہو اور جو (بھی) تم خرچ کروگے کوئی چیز تو یقینا اللہ تعالی اسے خوب جاننے والا ہے ۔",
        "English" : "You shall never attain righteousness unless you spend from what you love. Whatsoever you spend, Allah is fully aware of it."
      },
      {
        "ayet_no" : 93,
        "arbi" : "كُلُّ الطَّعَامِ كَانَ حِلًّا لِّبَنِىْٓ اِ سْرَاۗءِيْلَ اِلَّا مَا حَرَّمَ اِسْرَاۗءِيْلُ عَلٰي نَفْسِھٖ مِنْ قَبْلِ اَنْ تُنَزَّلَ التَّوْرٰىةُ ۭ قُلْ فَاْتُوْا بِالتَّوْرٰىةِ فَاتْلُوْھَآ اِنْ كُنْتُمْ صٰدِقِيْنَ",
        "Urdu" : "تمام کھانے بنی اسرائیل کے لیے حلال تھے، مگر جو خود اسرائیل (یعقوب ) نے اپنے آپ پر حرام کر لیے تھے اس سے قبل کہ اتاری جاتی تورات (اے نبی!) آپ کہہ دیں کہ تم لے آؤ تورات پھر اس کو (میرے سامنے) پڑھو، اگر تم سچے ہو ۔",
        "English" : "Every (kind of) food was lawful for the children of Isra‘il, except what Isra‘il had made unlawful for himself, well before the Torah was revealed. Say, :Then, bring the Torah and recite it, if you are true."
      },
      {
        "ayet_no" : 94,
        "arbi" : "فَمَنِ افْتَرٰى عَلَي اللّٰهِ الْكَذِبَ مِنْۢ بَعْدِ ذٰلِكَ فَاُولٰۗىِٕكَ ھُمُ الظّٰلِمُوْنَ",
        "Urdu" : "پھر جو جھوٹ باندھے اللہ تعالی پر اس کے بعد تو وہی لوگ ہی ظلم کرنے والے ہیں ۔",
        "English" : "Then whosoever fabricateth after this, lie against Allah -these! they are the wrong-doers."
      },
      {
        "ayet_no" : 95,
        "arbi" : "قُلْ صَدَقَ اللّٰهُ ۣفَاتَّبِعُوْا مِلَّــةَ اِبْرٰهِيْمَ حَنِيْفًا ۭ وَمَا كَانَ مِنَ الْمُشْرِكِيْنَ",
        "Urdu" : "اے نبی!) آپ کہہ دیں: اللہ نے سچ کہا ہے، تو تم پیروی کرو ابراہیم کے طریقے کی جو یکسو تھے اور نہیں تھے وہ مشرکوں میں سے ۔",
        "English" : "Say, :Allah has told the truth. So, follow the Faith of Ibrahim, the upright one. He was not one of those who ascribe partners to Allah."
      },
      {
        "ayet_no" : 96,
        "arbi" : "اِنَّ اَوَّلَ بَيْتٍ وُّضِــعَ لِلنَّاسِ لَلَّذِيْ بِبَكَّةَ مُبٰرَكًا وَّھُدًى لِّـلْعٰلَمِيْنَ",
        "Urdu" : "بے شک پہلا گھر (جو) لوگوں کے لیے بنایا گیا یقینا وہی ہے جو مکہ میں ہے، وہ برکت دیا گیاہے اور باعث ہدایت ہے تمام جہان والوں کے لیے ۔",
        "English" : "Verily the first House set apart unto mankind was that at Bakka, blest, and a guidance unto the worlds."
      },
      {
        "ayet_no" : 97,
        "arbi" : "فِيْهِ اٰيٰتٌۢ بَيِّنٰتٌ مَّقَامُ اِبْرٰهِيْمَ ڬ وَمَنْ دَخَلَهٗ كَانَ اٰمِنًا ۭ وَلِلّٰهِ عَلَي النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْـتَـطَاعَ اِلَيْهِ سَبِيْلًا ۭ وَمَنْ كَفَرَ فَاِنَّ اللّٰهَ غَنِىٌّ عَنِ الْعٰلَمِيْنَ",
        "Urdu" : "اس (بیت اللہ) میں کئی کھلی نشانیاں ہیں (ان میں سے) مقام ابراہیم ہے اور جو داخل ہوا اس میں وہ امن میں ہو گیا۔ اور اللہ کیلئے لوگوں کے ذمے ہے بیت اللہ کا حج کرنا جو اس کی طرف راستے کی طاقت رکھے اور جو نہ مانے تو بے شک اللہ تعالی بے پروا ہے تمام جہان والوں سے ۔",
        "English" : "In it there are clear signs: The Station of Ibrahim! Whoever enters it is secure. As a right of Allah, it is obligatory on the people to perform Hajj of the House – on everyone who has the ability to manage (his) way to it. If one disbelieves, then Allah is independent of all the worlds."
      },
      {
        "ayet_no" : 98,
        "arbi" : "قُلْ يٰٓاَھْلَ الْكِتٰبِ لِمَ تَكْفُرُوْنَ بِاٰيٰتِ اللّٰهِ ڰ وَاللّٰهُ شَهِيْدٌ عَلٰي مَا تَعْمَلُوْنَ",
        "Urdu" : "کہد یجیے اے اہل کتاب! کیوں تم انکار کرتے ہو اللہ کی آیات کا حالانکہ اللہ گواہ ہے۔ اس پر جو تم کرتے ہو ۔",
        "English" : "Say thou: O People of the Book! wherefore disbelieve ye in the revelations of Allah, whereas Allah is witness of that which ye work!"
      },
      {
        "ayet_no" : 99,
        "arbi" : "قُلْ يٰٓاَھْلَ الْكِتٰبِ لِمَ تَصُدُّوْنَ عَنْ سَبِيْلِ اللّٰهِ مَنْ اٰمَنَ تَبْغُوْنَھَا عِوَجًا وَّاَنْتُمْ شُهَدَاۗءُ  ۭوَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعْمَلُوْنَ",
        "Urdu" : "کہہ دیجئے اے اہل کتاب! کیوں تم روکتے ہو اللہ کے راستے سے (اسے) جو ایمان لایا (کیا) تم چاہتے ہو اس میں کجی حالانکہ تم (خود)گواہ ہو (کہ وہ راہ راست پر ہے) اور اللہ غافل نہیں ہے اس سے جو تم کر رہے ہو ۔",
        "English" : "Say, :O people of the Book, why do you hinder the believers from the way of Allah, trying to create crookedness in it, while you yourselves are witnesses (to its being the right way)? Allah is not oblivious of what you do."
      },
      {
        "ayet_no" : 100,
        "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوْٓا اِنْ تُطِيْعُوْا فَرِيْقًا مِّنَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ يَرُدُّوْكُمْ بَعْدَ اِيْمَانِكُمْ كٰفِرِيْنَ",
        "Urdu" : "اے وہ لوگو جو ایمان لائے ہو! اگر تم مان لو گے ایک گروہ کی بات ان لوگوں میں سے جو دیے گئے کتاب وہ تمہیں لوٹا دیں گے۔ تمہارے ایمان لانے کے بعد کفر کی کی حالت میں",
        "English" : "O you who believe, if you obey a group from those who have been given the Book (i.e. the Christians and the Jews), they will turn you into infidels after you have embraced the faith."
      },
      {
        "ayet_no" : 101,
        "arbi" : "وَكَيْفَ تَكْفُرُوْنَ وَاَنْتُمْ تُتْلٰى عَلَيْكُمْ اٰيٰتُ اللّٰهِ وَفِيْكُمْ رَسُوْلُهٗ ۭ وَمَنْ يَّعْتَصِمْ بِاللّٰهِ فَقَدْ ھُدِيَ اِلٰى صِرَاطٍ مُّسْتَـقِيْمٍ",
        "Urdu" : "اور کیسے تم کفر کرو گے حالانکہ تم (وہ ہو کہ) تلاوت کی جاتی ہیں تم پر اللہ کی آیات اور تم میں اس کا رسول (موجود) ہے اور جو مضبوطی سے تھام لے گا اللہ (کے دامن)کو تو ضرور اسکو ہدایت مل جائے گی سیدھے راستے تک ۔",
        "English" : "How could you disbelieve while you are the ones to whom the verses of Allah are recited, and present amidst you is His Messenger? Whoever holds on to Allah, is surely led to the straight path."
      },
      {
        "ayet_no" : 102,
        "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوا اتَّقُوا اللّٰهَ حَقَّ تُقٰتِھٖ وَلَا تَمُوْتُنَّ اِلَّا وَاَنْتُمْ مُّسْلِمُوْنَ",
        "Urdu" : "اے وہ لوگو جو ایمان لائےءہو! اللہ سے (ایسے) ڈرو (جیسا کہ) اس سے ڈرنے کا حق ہے اور تمہیں ہرگز موت نہ آئے مگر اس حال میں کہ تم مسلمان ہو ۔",
        "English" : "O Ye who believe! fear Allah with fear due to Him, and die not except ye be Muslims."
      },
      {
        "ayet_no" : 103,
        "arbi" : "وَاعْتَصِمُوْا بِحَبْلِ اللّٰهِ جَمِيْعًا وَّلَا تَفَرَّقُوْا ۠وَاذْكُرُوْا نِعْمَتَ اللّٰهِ عَلَيْكُمْ اِذْ كُنْتُمْ اَعْدَاۗءً فَاَلَّفَ بَيْنَ قُلُوْبِكُمْ فَاَصْبَحْتُمْ بِنِعْمَتِھٖٓ اِخْوَانًا ۚ وَكُنْتُمْ عَلٰي شَفَا حُفْرَةٍ مِّنَ النَّارِ فَاَنْقَذَكُمْ مِّنْھَا ۭ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَكُمْ اٰيٰتِھٖ لَعَلَّكُمْ تَھْتَدُوْنَ",
        "Urdu" : "اور مضبوطی سے تھام لو اللہ کی رسی کو سب (مل کر) اور تفرقے میں نہ پڑواور اللہ کی نعمت کو یاد کروجو اس نے) تم پر کی جب تم (ایک دوسرے کے) دشمن تھے تو اس نے الفت ڈال دی تمہارے دلوں میں تو تم ہوگئے اس کی نعمت (مہربانی) سے بھائی بھائی اور تم (کھڑے) تھے آگ کے گڑھے کے کنارے پر تو اس نے بچالیا تمہیں اس (دوزخ)سے اسی طرح اللہ بیان کرتا ہے تمہارے لیےاپنی آیتیں تاکہ تم ہدایت پا جاؤ ۔",
        "English" : "And hold ye fast, all of you, to the cord of Allah, so and separate not. And remember Allah's favour unto you in that ye were enemies and He joined your hearts together, so ye became by His favour brethren; and ye were on the brink of an abyss of the Fire and He rescued you therefrom. In this wise Allah expound unto you His revelations that haply ye may remain guided."
      },
      {
        "ayet_no" : 104,
        "arbi" : "وَلْتَكُنْ مِّنْكُمْ اُمَّةٌ يَّدْعُوْنَ اِلَى الْخَيْرِ وَيَاْمُرُوْنَ بِالْمَعْرُوْفِ وَيَنْهَوْنَ عَنِ الْمُنْكَرِ ۭوَاُولٰۗىِٕكَ ھُمُ الْمُفْلِحُوْنَ",
        "Urdu" : "اور چاہیے کہ ہو تم میں سے ایک گروہ وہ دعوت دیتے ہوں بھلائی کی طرف اور وہ حکم دیتے ہوں نیکی کا اور وہ روکتے ہوں برائی سے اور وہی لوگ ہی فلاح پانے والے ہیں ۔",
        "English" : "And let there be of you a community calling others to good and commanding that which is reputable and prohibiting that which is disreputable. And these they are the blissful."
      },
      {
        "ayet_no" : 105,
        "arbi" : "وَلَا تَكُوْنُوْا كَالَّذِيْنَ تَفَرَّقُوْا وَاخْتَلَفُوْا مِنْۢ بَعْدِ مَا جَاۗءَھُمُ الْبَيِّنٰتُ ۭ وَاُولٰۗىِٕكَ لَھُمْ عَذَابٌ عَظِيْمٌ",
        "Urdu" : "اور تم مت ہو ان لوگوں کی طرح جو فرقوں میں بٹ گئے اور وہ اختلاف کرنے لگے اس کے بعد کہ آگئے ان کے پاس رشن دلائل اور وہی لوگ ہیں کہ ان کے لیے بڑا عذاب ہے۔",
        "English" : "Do not be like those who became divided and fell into disputes after the clear signs had come to them. Those are the ones for whom there is a grave punishment"
      },
      {
        "ayet_no" : 106,
        "arbi" : "يَّوْمَ تَبْيَضُّ وُجُوْهٌ وَّتَسْوَدُّ وُجُوْهٌ ۚ فَاَمَّا الَّذِيْنَ اسْوَدَّتْ وُجُوْھُھُمْ ۣاَكَفَرْتُمْ بَعْدَ اِيْمَانِكُمْ فَذُوْقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْفُرُوْنَ",
        "Urdu" : "اس دن روشن ہوں گے کچھ چہرے اور سیاہ ہوں کچھ چہرے پس رہے وہ لوگ سیاہ ہوں گے جن کے چہرے (ان سے کہا جائے گا) کیا تم ہی نے کفر کیا تھا اپنے ایمان لانے کے بعد، تو مزہ چکھو عذاب کا اس وجہ سے جو تم کفر کرتے تھے ۔",
        "English" : "On a day whereon faces become whitened and faces become blackened. Then as for those whose faces shall have become blackened: disbelieved ye after your profession of belief! taste the torment for that ye have been disbelieving."
      },
      {
        "ayet_no" : 107,
        "arbi" : "وَاَمَّا الَّذِيْنَ ابْيَضَّتْ وُجُوْھُھُمْ فَفِيْ رَحْمَةِ اللّٰهِ ۭ ھُمْ فِيْھَا خٰلِدُوْنَ",
        "Urdu" : "اور رہے وہ لوگ روشن ہوں گے جن کے چہرے تو (یہ) اللہ کی رحمت میں ہوں گےوہ اس میں ہمیشہ رہنے والے ہیں",
        "English" : "And for those whose faces will become white, they will be inAllah's Mercy (Paradise), therein they shall dwell forever."
      },
      {
        "ayet_no" : 108,
        "arbi" : "تِلْكَ اٰيٰتُ اللّٰهِ نَتْلُوْھَا عَلَيْكَ بِالْحَقِّ ۭوَمَا اللّٰهُ يُرِيْدُ ظُلْمًا لِّلْعٰلَمِيْنَ",
        "Urdu" : "یہ اللہ کی آیات ہیں(کہ)ہم تلاوت کرتےہیں ان کو(جبریل کی زبانی آپ پر حق کے ساتھ اوراللہ نہیں چاہتا ظلم کرنا جہان والوں پر ۔",
        "English" : "These are revelations of Allah; We rehearse them unto thee with truth, and Allah intend not wrong unto the worlds."
      },
      {
        "ayet_no" : 109,
        "arbi" : "وَلِلّٰهِ مَا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ ۭ وَاِلَى اللّٰهِ تُرْجَعُ الْاُمُوْرُ",
        "Urdu" : "اوراللہ ہی کے لیے ہیں ہے جوکچھ آسمانوں میں ہے اورجوکچھ زمین میں ہے اوراللہ ہی کی طرف لوٹائے جاتے ہیں تمام معاملات۔",
        "English" : "Allah's is whatsoever is in the heavens and in the earth; and unto Allah shall be committed all affairs."
      },
      {
        "ayet_no" : 110,
        "arbi" : "كُنْتُمْ خَيْرَ اُمَّةٍ اُخْرِجَتْ لِلنَّاسِ تَاْمُرُوْنَ بِالْمَعْرُوْفِ وَتَنْهَوْنَ عَنِ الْمُنْكَرِ وَتُؤْمِنُوْنَ بِاللّٰهِ ۭ وَلَوْ اٰمَنَ اَھْلُ الْكِتٰبِ لَكَانَ خَيْرًا لَّھُمْ ۭمِنْھُمُ الْمُؤْمِنُوْنَ وَ اَكْثَرُھُمُ الْفٰسِقُوْنَ",
        "Urdu" : "ہو تم بہترین امت جسے نکالاگیا لوگوں کی اصلاح کےلیے کہ تم حکم دیتے ہونیکی کا اورتم روکتے ہو برائی سے اورتم ایمان لاتے ہو اللہ پر اور اگر ایمان لے آتے اہل کتاب (تو) یقینا بہتر ہوتا ان کے لیے ان میں سے کچھ ایمان لے آئے ہیں اور ان کی اکثریت نافرمان ہی ہے ۔",
        "English" : "You are the best  Ummah ever raised for mankind. You bid the Fair and forbid the Unfair, and you believe in Allah. If the people of the Book had believed, it would have been better for them. Among them, there are believers, while most of them are sinners."
      },
      {
        "ayet_no" : 111,
        "arbi" : "لَنْ يَّضُرُّوْكُمْ اِلَّآ اَذًى ۭ وَاِنْ يُّقَاتِلُوْكُمْ يُوَلُّوْكُمُ الْاَدْبَارَ ۣ ثُمَّ لَا يُنْصَرُوْنَ",
        "Urdu" : "وہ (یہودی) ہرگز نہیں تمہارا نقصان کرسکتے سوائے (معمولی) تکلیف کے اور اگر یہ تم سے لڑیں(تو) تم سے پیٹھ پھیر (کر بھاگ) جائیں گے پھر ان کی مدد بھی نہیں کی جائے گی ۔",
        "English" : "They shall not be able to harm you save with small hurt, and if they fight you, they shall turn upon you their backs; then they shall be succoured not."
      },
      {
        "ayet_no" : 112,
        "arbi" : "ضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ اَيْنَ مَا ثُـقِفُوْٓا اِلَّا بِحَبْلٍ مِّنَ اللّٰهِ وَحَبْلٍ مِّنَ النَّاسِ وَبَاۗءُوْ بِغَضَبٍ مِّنَ اللّٰهِ وَضُرِبَتْ عَلَيْهِمُ الْمَسْكَنَةُ ۭذٰلِكَ بِاَنَّھُمْ كَانُوْا يَكْفُرُوْنَ بِاٰيٰتِ اللّٰهِ وَيَقْتُلُوْنَ الْاَنْۢبِيَاۗءَ بِغَيْرِ حَقٍّ ۭ ذٰلِكَ بِمَا عَصَوْا وَّكَانُوْا يَعْتَدُوْنَ",
        "Urdu" : "مسلط کردی گئی ان پر ذلت جہاں بھی وہ پائے جائیں مگر پناہ لینے کی وجہ سے اللہ کی اور پناہ لینے (کی وجہ سے) لوگوں کی اور وہ حقدار بن چکے ہیں اللہ کے غضب کے اور ان پر مسلط کردی گئی ہے محتاجی، یہ اس لیے کہ بےشک وہ انکار کرتے تھے اللہ کی آیتوں کا اور انبیا کو قتل کرتے تھے ناحق یہ اس وجہ سے (تھا) کہ وہ نافرمانی کرتے (تھے) اور حدود سے نکل جاتے تھے ۔",
        "English" : "Stuck upon them is abjection wheresoever they may be come upon, except in a compact with Allah and a compact with men; and they drew upon themselves indignation from Allah; and stuck upon them is poverty. That is because they have been disbelieving in the signs of Allah, and slaying the prophets without justice. That is because they disobeyed and have been trespassing."
      },
      {
        "ayet_no" : 113,
        "arbi" : "لَيْسُوْا سَوَاۗءً ۭ مِنْ اَھْلِ الْكِتٰبِ اُمَّةٌ قَاۗىِٕمَةٌ يَّتْلُوْنَ اٰيٰتِ اللّٰهِ اٰنَاۗءَ الَّيْلِ وَھُمْ يَسْجُدُوْنَ",
        "Urdu" : "یہ سب ایک جیسے نہیں (بلکہ) اہل کتاب میں سے وہ اللہ کی آیات پڑھتے ہیں رات کے اوقات میں اس حال میں کہ وہ (اس کے آگے) سجدہ کرتے ہیں",
        "English" : "Not are they all alike. Of the people of the Book there are a community steadfast, reciting the revelations of Allah in the hours of night while they prostrate themselves."
      },
      {
        "ayet_no" : 114,
        "arbi" : "يُؤْمِنُوْنَ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِ وَيَاْمُرُوْنَ بِالْمَعْرُوْفِ وَيَنْهَوْنَ عَنِ الْمُنْكَرِ وَيُسَارِعُوْنَ فِي الْخَيْرٰتِ ۭوَاُولٰۗىِٕكَ مِنَ الصّٰلِحِيْنَ",
        "Urdu" : "وہ ایمان رکھتے ہیں اللہ پر اور روز آخرت پر اور وہ نیکی کا حکم دیتے ہیں اور وہ برائی سے روکتے ہیں اور جلدی کرتے ہیں بھلائی کے کاموں میں اور یہی لوگ صالحین میں سے ہیں ۔",
        "English" : "And they believe in Allah and the Last Day and command that which is reputable and prohibit that which is disreputable, and vie with each other to virtues. And these are of the righteous."
      },
      {
        "ayet_no" : 115,
        "arbi" : "وَمَا يَفْعَلُوْا مِنْ خَيْرٍ فَلَنْ يُّكْفَرُوْهُ ۭوَاللّٰهُ عَلِيْمٌۢ بِالْمُتَّقِيْنَ",
        "Urdu" : "اور جو بھلائی کا کام وہ کریں گے پس ہرگز نہ کی جائے گی ناقدری اس کی اور اللہ پرہیزگاروں کو خوب جاننے والا ہے ۔",
        "English" : "And whatsoever they do of virtue shall not be denied. And Allah is Knower of the God-fearing."
      },
      {
        "ayet_no" : 116,
        "arbi" : "اِنَّ الَّذِيْنَ كَفَرُوْا لَنْ تُغْنِىَ عَنْھُمْ اَمْوَالُھُمْ وَلَآ اَوْلَادُھُمْ مِّنَ اللّٰهِ شَـيْــــًٔـا ۭ وَاُولٰۗىِٕكَ اَصْحٰبُ النَّارِ ۚ ھُمْ فِيْھَا خٰلِدُوْنَ",
        "Urdu" : "بے شک وہ لوگ جنہوں نے کفر کیا ہرگز نہیں فائدہ دیں گے ان کو ان کے مال اور نہ انکی اولاد اللہ (کے ع۴ذاب) سے کچھ بھی اور یہی لوگ اہل دوزخ ہیں (اور) وہ اس میں ہمیشہ رہنے والے ہیں ۔",
        "English" : "Verily those who disbelieve, neither their riches nor their progeny shall avail them aught against Allah. And these are the fellows of the Fire; thereinto they shall be abiders."
      },
      {
        "ayet_no" : 117,
        "arbi" : "مَثَلُ مَا يُنْفِقُوْنَ فِيْ ھٰذِهِ الْحَيٰوةِ الدُّنْيَا كَمَثَلِ رِيْحٍ فِيْھَا صِرٌّ اَصَابَتْ حَرْثَ قَوْمٍ ظَلَمُوْٓا اَنْفُسَھُمْ فَاَھْلَكَتْهُ ۭوَمَا ظَلَمَھُمُ اللّٰهُ وَلٰكِنْ اَنْفُسَھُمْ يَظْلِمُوْنَ",
        "Urdu" : "اس کی مثال جو وہ (کافر لوگ) خرچ کرتے ہیں اس دنیوی زندگی میں اس ہوا کی مثال کی طرح ہے (کہ) اس میں سخت سردی ہو وہ جاپہنچے (ایسے) لوگوں کی کھیتی پر (کہ) انہوں نے ظلم کیا ہو اپنے آپ پر تو وہ تباہ کر ڈالے اس (کھتی) کو اور اللہ نے ان پر کچھ ظلم نہیں کیا اور لیکن اپنے آپ پر وہ خود ظلم کر رہے ہیں ۔",
        "English" : "The example of what they spend in this worldly life is just like a wind that, having chill within, struck the tillage of those who wronged themselves, and destroyed it. Allah has not wronged them; rather, they did wrong to themselves."
      },
      {
        "ayet_no" : 118,
        "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوْا لَا تَتَّخِذُوْا بِطَانَةً مِّنْ دُوْنِكُمْ لَا يَاْلُوْنَكُمْ خَبَالًا  ۭ وَدُّوْا مَا عَنِتُّمْ ۚ قَدْ بَدَتِ الْبَغْضَاۗءُ مِنْ اَفْوَاهِھِمْ ښ وَمَا تُخْفِيْ صُدُوْرُھُمْ اَكْبَرُ  ۭ قَدْ بَيَّنَّا لَكُمُ الْاٰيٰتِ اِنْ كُنْتُمْ تَعْقِلُوْنَ",
        "Urdu" : "اے وہ لوگو جو ایمان لائے ہو! مت بناؤ رازدان اپنے سوا کسی (غیر مسلم) کو نہیں وہ کوتاہی کرتے تمہیں خراب کرنے میں وہ تو (وہ کچھ ) چاہتے ہیں جس سے تمہیں تکلیف پہنچے یقینا دشمنی ظاہر ہوچکی ہے انکے منہ (زبانوں) سے اور جو (کینے) چھپائے ہوے ہیں ان کے سینے وہ اس سے بھی بہت زیادہ ہیں۔ تحقیق ہم نے بیان کردی ہیں تمہارے لیے واضح نشانیاں اگر تم سمجھ بوجھ رکھتے ہو ۔",
        "English" : "O Ye who believe! take not for an intimate anyone besides yourselves; they shall not be remiss in doing you mischief. Fain would they that which distresseth you. Surely their malice hath shewn itself by their mouths, and that which their breasts conceal is greater still. Surely We have expounded unto you the signs, if ye will but reflect."
      },
      {
        "ayet_no" : 119,
        "arbi" : "ھٰٓاَنْتُمْ اُولَاۗءِ تُحِبُّوْنَھُمْ وَلَا يُحِبُّوْنَكُمْ وَتُؤْمِنُوْنَ بِالْكِتٰبِ كُلِّھٖ ۚوَاِذَا لَقُوْكُمْ قَالُوْٓا اٰمَنَّا ۑ وَاِذَا خَلَوْا عَضُّوْا عَلَيْكُمُ الْاَنَامِلَ مِنَ الْغَيْظِ ۭ قُلْ مُوْتُوْا بِغَيْظِكُمْ ۭ اِنَّ اللّٰهَ عَلِيْمٌۢ بِذَاتِ الصُّدُوْرِ",
        "Urdu" : "سنو! تم وہ لوگ ہو (کہ) تم دوستی رکھتے ہو ان سے اور وہ تم سے دوستی نہیں رکھتے حالانکہ تم ایمان رکھتے ہو ان تمام کتابوں پر اور جب وہ تمہیں ملتے ہیں (تو) کہتے ہیں ہم ایمان لائے ہیں اور جب وہ علیحدہ ہوتے ہیں (تو) کاٹنے لگتے ہیں تم پر (اپنی) انگلیاں غصے سے آپ (ان سے) کہہ دیں کہ (جل) مرو اپنے غصے میں بیشک اللہ خوب جاننے والا ہے سینوں والی (بات) کو ۔",
        "English" : "Look, you are the ones who love them and they do not love you. You believe in all the books; (On the other hand,) when they meet you, they say, :We believe , and when they are alone, they bite their finger-tips out of rage against you. Say, :May you perish in your rage. Surely, Allah is All-Aware of what lies in the hearts."
      },
      {
        "ayet_no" : 120,
        "arbi" : "اِنْ تَمْسَسْكُمْ حَسَنَةٌ تَـسُؤْھُمْ ۡ وَاِنْ تُصِبْكُمْ سَيِّئَةٌ يَّفْرَحُوْا بِھَا ۭ وَاِنْ تَصْبِرُوْا وَتَتَّقُوْا لَا يَضُرُّكُمْ كَيْدُھُمْ شَـيْـــًٔـا ۭاِنَّ اللّٰهَ بِمَا يَعْمَلُوْنَ مُحِيْطٌ",
        "Urdu" : "اگر تمہیں پہنچے کوئی بھلائی (تو) بری لگتی ہے ان کو اور اگر تمہیں پہنچے کوئی تکلیف تو) خوش ہوتے ہیں اس سے اور اگر تم صبر کرلو اور (اللہ سے) ڈرتے رہو (تو) تمہارا نہ بگاڑ سکے گی ان کی مکاری کچھ بھی بے شک اللہ اسے جو یہ کر رہے ہیں احاطہ کیے ہوئے ہے ۔",
        "English" : "If something good happens to you, it annoys them, and if something evil befalls you, they are delighted with it. If you keep patience and fear Allah, their cunning shall not harm you at all. Allah is All-Encompassing of what they do."
      },
      {
        "ayet_no" : 121,
        "arbi" : "وَاِذْ غَدَوْتَ مِنْ اَھْلِكَ تُبَوِّئُ الْمُؤْمِنِيْنَ مَقَاعِدَ لِلْقِتَالِ ۭ وَاللّٰهُ سَمِيْعٌ عَلِيْمٌ",
        "Urdu" : "اور جب آپ صبح کو نکلے اپنے گھر والوں اور آپ متعین فرما رہے تھے سب مومنوں کو مورچوں پر لڑائی کے لیے  اور اللہ خوب سننے والا ہے خوب جاننے والا ہے",
        "English" : "Recall the time when you left your house in the morning in order to place the believers in positions for fighting. Allah is All-Hearing, All-Knowing."
      },
      {
        "ayet_no" : 122,
        "arbi" : "اِذْ ھَمَّتْ طَّاۗىِٕفَتٰنِ مِنْكُمْ اَنْ تَفْشَلَا ۙوَاللّٰهُ وَلِيُّهُمَا ۭ وَعَلَي اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُوْنَ",
        "Urdu" : "جب آمادہ ہوئے دو گروہ تم میں سے کہ وہ بزدلی دکھائیں حالانکہ اللہ ان کا مددگار (موجود) تھا۔ اور اللہ پر ہی پس مومنوں کو توکل کرنا چاہیے ۔",
        "English" : "Recall what time two sections of you bethought that they should flag whereas Allah was the Patron of the twain. In Allah, then, let the believers trust."
      },
      {
        "ayet_no" : 123,
        "arbi" : "وَلَقَدْ نَصَرَكُمُ اللّٰهُ بِبَدْرٍ وَّاَنْتُمْ اَذِلَّةٌ ۚ فَاتَّقُوا اللّٰهَ لَعَلَّكُمْ تَشْكُرُوْنَ",
        "Urdu" : "اور البتہ تحقیق اللہ نے تمہاری مدد کی (جنگ ) بدر میں اس حال میں کہ تم کمزور تھے پس اللہ سے ڈرو تاکہ تم شکر گزار بن جاؤ ۔",
        "English" : "And assuredly Allah had succoured you at Badr While ye were humble. Wherefore fear Allah that haply ye may return thanks."
      },
      {
        "ayet_no" : 124,
        "arbi" : "اِذْ تَقُوْلُ لِلْمُؤْمِنِيْنَ اَلَنْ يَّكْفِيَكُمْ اَنْ يُّمِدَّكُمْ رَبُّكُمْ بِثَلٰثَةِ اٰلٰفٍ مِّنَ الْمَلٰۗىِٕكَةِ مُنْزَلِيْنَ",
        "Urdu" : "جب آپ کہہ رہے تھے مومنوں سے کیا تمہیں کافی نہیں ہے کہ تمہاری مدد کرے تمہارا رب تین ہزار فرشتوں کے ذریعے ( جو ) اتارے جائیں ( آسمان سے )",
        "English" : "When you were saying to the believers, :Shall it not suffice you that your Lord should help you with three thousand of the angels sent down (for you) ?"
      },
      {
        "ayet_no" : 125,
        "arbi" : "بَلٰٓى ۙاِنْ تَصْبِرُوْا وَتَتَّقُوْا وَيَاْتُوْكُمْ مِّنْ فَوْرِھِمْ ھٰذَا يُمْدِدْكُمْ رَبُّكُمْ بِخَمْسَةِ اٰلٰفٍ مِّنَ الْمَلٰۗىِٕكَةِ مُسَوِّمِيْنَ",
        "Urdu" : "کیوں نہیں اگر تم صبر کرو گے اور (اللہ سے) ڈرتے رہو اور وہ (کافر) چڑھ آئیں تم پر اپنے جوش سے اسی دم (تو) تمہارا راب تمہاری مدد کرے گا پانچ ہزار خاص نشان رکھنے والے فرشتوں سے ۔",
        "English" : "O Yea! if ye but remain persevering and God-fearing, and they should come upon you in this rush of theirs, your Lord shall reinforce you with five thousand angels marked."
      },
      {
        "ayet_no" : 126,
        "arbi" : "وَمَا جَعَلَهُ اللّٰهُ اِلَّا بُشْرٰى لَكُمْ وَلِتَطْمَىِٕنَّ قُلُوْبُكُمْ بِهٖ ۭوَمَا النَّصْرُ اِلَّا مِنْ عِنْدِ اللّٰهِ الْعَزِيْزِ الْحَكِيْمِ",
        "Urdu" : "اور نہیں بنایا اللہ نے اس کو مگر خوشخبری (کا ذریعہ) تمہارے لیے اور تاکہ مطمئن ہوجائیں تمہارے دل اس سے اور نہیں ہوتی مدد مگر اللہ ہی کی طرف سے (جو) غالب، حکمت والا ہے",
        "English" : "And this Allah made not except as a joyful enunciation unto you, and that thereby your hearts might be set at rest--and no succour is there but from before Allah, the Mighty, the Wise."
      },
      {
        "ayet_no" : 127,
        "arbi" : "لِيَقْطَعَ طَرَفًا مِّنَ الَّذِيْنَ كَفَرُوْٓا اَوْ يَكْبِتَھُمْ فَيَنْقَلِبُوْا خَاۗىِٕــبِيْنَ",
        "Urdu" : "(یہ اس لیے ہے کہ) تاکہ وہ کاٹ ڈاے ایک گروہ کو ان لوگوں سے جنہوں نے کفر کیا یا ذلیل ومغلوب کردے ا نہیں پس وہ نامراد وا پس لوٹیں ۔",
        "English" : "That He may cut: off a portion of those who disbelieve, or abase them so that they may go back disappointed."
      },
      {
        "ayet_no" : 128,
        "arbi" : "لَيْسَ لَكَ مِنَ الْاَمْرِ شَيْءٌ اَوْ يَتُوْبَ عَلَيْھِمْ اَوْ يُعَذِّبَھُمْ فَاِنَّھُمْ ظٰلِمُوْنَ",
        "Urdu" : "(اے نبی) آ پ کا (اس) معاملے میں کچھ (اختیار) نہیں (کہ) یا وہ ان پر مہربانی کرے یا انہیں عذاب دے بے شک وہ ظالم تو ہیں ہی ۔",
        "English" : "Not with thee is aught of the affair: He shall either relent toward them or torment them, for verily they are wrong-doers."
      },
      {
        "ayet_no" : 129,
        "arbi" : "وَلِلّٰهِ مَا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ ۭ يَغْفِرُ لِمَنْ يَّشَاۗءُ وَيُعَذِّبُ مَنْ يَّشَاۗءُ ۭ وَاللّٰهُ غَفُوْرٌ رَّحِيْمٌ",
        "Urdu" : "اور اللہ ہی کا ہے جو کچھ آسمانوں می ہے اور جو زمین میں ہے، وہ بخشش دیتا ہے جس کو چاہتا ہے اور وہ عذاب دیتا ہے جسے چاہتا ہے اور اللہ تعالی بخشنے والا نہایت رحم کرنیوالا ہے ۔",
        "English" : "Allah's is whatsoever is in the heavens and whatsoever is in the earth. He forgive whomsoever He listen, and tormenteth whomsoever He listeth. And Allah is Forgiving, Merciful."
      },
      {
        "ayet_no" : 130,
        "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوْا لَا تَاْ كُلُوا الرِّبٰٓوا اَضْعَافًا مُّضٰعَفَةً ۠ وَاتَّقُوا اللّٰهَ لَعَلَّكُمْ تُفْلِحُوْنَ",
        "Urdu" : "اے وہ لوگو جو ایمان لائے ہو! مت کھاؤ سود کئی گنا بڑھا چڑھا کر اور اللہ سے ڈرتے رہو تاکہ تم نجات پا سکو۔",
        "English" : "O Ye who believe! devour not multiplied manifold; and fear usury, Allah, haply ye may fare well."
      },
      {
        "ayet_no" : 131,
        "arbi" : "وَاتَّقُوا النَّارَ الَّتِىْٓ اُعِدَّتْ لِلْكٰفِرِيْنَ",
        "Urdu" : "اور بچو اس آگ سے جو تیار کی گئی ہے کافروں کے لیے ۔",
        "English" : "And beware of the Fire gotten ready for the infidels."
      },
      {
        "ayet_no" : 132,
        "arbi" : "وَاَطِيْعُوا اللّٰهَ وَالرَّسُوْلَ لَعَلَّكُمْ تُرْحَمُوْنَ",
        "Urdu" : "اور اطاعت کرو اللہ اور (اس کے) رسول کی تاکہ تم پر رحم کیا جائے ۔",
        "English" : "And obey Allah and the apostle, haply ye may be shewn mercy."
      },
      {
        "ayet_no" : 133,
        "arbi" : "وَسَارِعُوْٓا اِلٰى مَغْفِرَةٍ مِّنْ رَّبِّكُمْ وَجَنَّةٍ عَرْضُھَا السَّمٰوٰتُ وَالْاَرْضُ ۙ اُعِدَّتْ لِلْمُتَّقِيْنَ",
        "Urdu" : "اور جلدی کرو (لپکو) اپنے رب کی بخشش اور اس جنت کی طرف (کہ اس کا عرض آسمانوں اور زمین (کے برابر) ہے وہ تیار کی گئی ہے پرہیز گاروں کے لیے ۔",
        "English" : "And vie with each other in hastening to obtain forgiveness from your Lord and toward the Garden whereof the width equal the heavens and the earth, gotten ready for the God- fearing"
      },
      {
        "ayet_no" : 134,
        "arbi" : "الَّذِيْنَ يُنْفِقُوْنَ فِي السَّرَّاۗءِ وَالضَّرَّاۗءِ وَالْكٰظِمِيْنَ الْغَيْظَ وَالْعَافِيْنَ عَنِ النَّاسِ ۭ وَاللّٰهُ يُحِبُّ الْمُحْسِنِيْنَ",
        "Urdu" : "جو خرچ کرتے ہیں خوشحالی اور تنگدستی (ہر حال) میں اور غصہ پی جانے والے ہیں۔اور درگزر کرنے والے ہیں لوگوں سے اور اللہ پسند کرتا ہے نیکی کرنے والوں کو ۔",
        "English" : "__the ones who spend (for Allah‘s sake) in prosperity and adversity, and those who control anger and forgive people. And Allah loves those who are good in their deeds."
      },
      {
        "ayet_no" : 135,
        "arbi" : "وَالَّذِيْنَ اِذَا فَعَلُوْا فَاحِشَةً اَوْ ظَلَمُوْٓا اَنْفُسَھُمْ ذَكَرُوا اللّٰهَ فَاسْتَغْفَرُوْا لِذُنُوْبِھِمْ ۠ وَ مَنْ يَّغْفِرُ الذُّنُوْبَ اِلَّا اللّٰهُ ڞ وَلَمْ يُصِرُّوْا عَلٰي مَا فَعَلُوْا وَھُمْ يَعْلَمُوْنَ",
        "Urdu" : "اور یہ وہ لوگ ہیں جو جب کوئی براکام کر بیٹھیں یا ظلم کر بیٹھیں اپنے آپ پر (تو فورا) اللہ کو یاد کرتے ہیں پس معافی مانگتے ہیں اپنے گناہوں کی اور کون معاف کرسکتا ہے گناہوں کو اللہ کے سوا اور وہ اصرار نہیں کرتے اس پر جو انہوں نے کیا حالانکہ وہ جانتے ہوں ( یعنی جان بوجھ کر اڑے نہیں رہتے ) ۔",
        "English" : "And those, who, when they have done an ill-deed or wronged themselves, remember Allah and ask forgiveness of their sins - and who forgive sins save Allah! Is --and persist not in that which they have done, while they know."
      },
      {
        "ayet_no" : 136,
        "arbi" : "اُولٰۗىِٕكَ جَزَاۗؤُھُمْ مَّغْفِرَةٌ مِّنْ رَّبِھِمْ وَجَنّٰتٌ تَجْرِيْ مِنْ تَحْتِھَا الْاَنْھٰرُ خٰلِدِيْنَ فِيْھَا ۭ وَنِعْمَ اَجْرُ الْعٰمِلِيْنَ",
        "Urdu" : "یہی لوگ ہیں کہ ان کی جزا بخشش ہے ان کے رب کی طرف سے اور باغات ہیں (کہ) بہتی ہوں گی ان کے نیچے سے نہریں (وہ) ہمیشہ ہمیشہ رہنے والے ہیں ان میں۔ اور (بہت) اچھا بدلہ ہے ( اچھے ) کام کرنیوالوں کا ۔",
        "English" : "Their reward is forgiveness from their Lord and gardens beneath which rivers flow where they shall live forever. And excellent is the reward of those who work."
      },
      {
        "ayet_no" : 137,
        "arbi" : "قَدْ خَلَتْ مِنْ قَبْلِكُمْ سُنَنٌ ۙ فَسِيْرُوْا فِي الْاَرْضِ فَانْظُرُوْا كَيْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِيْنَ",
        "Urdu" : "یقینا گزر چکے ہیں تم سے پہلے بہت سے واقعات تو چلو پھرو زمین میں پس دیکھو (کہ) کیسا ہو اجھٹلانے والوں کا انجام ۔",
        "English" : "Many patterns of behavior have passed before you. So, traverse the land and see what was the fate of those who rejected (the prophets)."
      },
      {
        "ayet_no" : 138,
        "arbi" : "ھٰذَا بَيَانٌ لِّلنَّاسِ وَھُدًى وَّمَوْعِظَةٌ لِّلْمُتَّقِيْنَ",
        "Urdu" : "(یہ(عام) لوگوں کے لیے واضح بیان ہے اور ہدایت اور نصیحت ہے ڈرنے والوں کے لیے ۔",
        "English" : "This is a declaration for mankind, and guidance, and a lesson for the God-fearing."
      },
      {
        "ayet_no" : 139,
        "arbi" : "وَلَا تَهِنُوْا وَلَا تَحْزَنُوْا وَاَنْتُمُ الْاَعْلَوْنَ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
        "Urdu" : "اور تم ہمت نہ ہارو اور نہ غم کرو اور تم ہی غالب ہوگے اگر تم ہو (سچے) مومن ۔",
        "English" : "And faint not, nor grieve; ye shall overcome, if ye are believers."
      },
      {
        "ayet_no" : 140,
        "arbi" : "اِنْ يَّمْسَسْكُمْ قَرْحٌ فَقَدْ مَسَّ الْقَوْمَ قَرْحٌ مِّثْلُهٗ ۭ وَتِلْكَ الْاَيَّامُ نُدَاوِلُھَا بَيْنَ النَّاسِ ۚ وَلِيَعْلَمَ اللّٰهُ الَّذِيْنَ اٰمَنُوْا وَيَتَّخِذَ مِنْكُمْ شُهَدَاۗءَ ۭ وَاللّٰهُ لَا يُحِبُّ الظّٰلِمِيْنَ",
        "Urdu" : "اگر پہنچااہے تمہیں (شکست کا) صدمہ تو یقینا پہنچ چکا ہے (اس سے قبل کافر) قوم کو بھی اس جیسا صدمہ اور یہ (فتح وشکست کے) دن ہم بدلتے رہتے ہیں انہیں لوگوں کے درمیان اور اس لیے (بھی کہ) اللہ جاننا چاہتا ہے ان لوگوں کو جو ایمان لائے اور وہ بنانا چاہتا ہے تم میں سے (کچھ کو) شہید اور اللہ تعالی ظالموں کو پسند نہیں کرتا ۔",
        "English" : "If you have received a wound, they have received a similar wound. Such days We rotate among the people, so that Allah may know those who believe and let some of you be martyrs — and Allah does not like the unjust"
      },
      {
        "ayet_no" : 141,
        "arbi" : "وَلِيُمَحِّصَ اللّٰهُ الَّذِيْنَ اٰمَنُوْا وَيَمْحَقَ الْكٰفِرِيْنَ",
        "Urdu" : "اور اس لیے (بھی کہ) اللہ چھانٹ لے ان لوگوں کو جو ایمان لائے اورملیا میٹ کردے کافروں کو۔",
        "English" : "And that Allah may purge those who believe and destroy the infidels."
      },
      {
        "ayet_no" : 142,
        "arbi" : "اَمْ حَسِبْتُمْ اَنْ تَدْخُلُوا الْجَنَّةَ وَلَمَّا يَعْلَمِ اللّٰهُ الَّذِيْنَ جٰهَدُوْا مِنْكُمْ وَيَعْلَمَ الصّٰبِرِيْنَ",
        "Urdu" : "کیا تم نے یہ سمجھ لیا ہے کہ تم جنت میں ایسے ہی داخل ہوجاؤ گے اور (جبکہ) ابھی تک نہیں دیکھا اللہ نے ان لوگوں کو جنہوں نے جہاد کیا ہو تم میں سے اور (اس لیے) کہ وہ معلوم کرلے صبر کرنیوالوں کو ۔",
        "English" : "Or, deem ye that ye shall enter the Garden while yet Allah hath not known those of you who have striven hard nor yet known the steadfast!"
      },
      {
        "ayet_no" : 143,
        "arbi" : "وَلَقَدْ كُنْتُمْ تَـمَنَّوْنَ الْمَوْتَ مِنْ قَبْلِ اَنْ تَلْقَوْهُ ۠ فَقَدْ رَاَيْتُمُوْهُ وَاَنْتُمْ تَنْظُرُوْنَ",
        "Urdu" : "اور البتہ تحقیق تم تھے تمنا کرتے موت (شہادت) کی اس سے قبل کہ تمہیں نصیب ہو وہ پس تحقیق اب تو تم نے دیکھ لیا اسے اس حال میں کہ تم (کھلی انکھوں سے) دیکھ رہے ہو ۔",
        "English" : "And assuredly ye were wont to long for death ere ye had met it. Now ye are beholding it even while ye are looking on."
      },
      {
        "ayet_no" : 144,
        "arbi" : "وَمَا مُحَمَّدٌ اِلَّا رَسُوْلٌ ۚ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ ۭ اَفَا۟ىِٕنْ مَّاتَ اَوْ قُتِلَ انْقَلَبْتُمْ عَلٰٓى اَعْقَابِكُمْ ۭ وَمَنْ يَّنْقَلِبْ عَلٰي عَقِبَيْهِ فَلَنْ يَّضُرَّ اللّٰهَ شَـيْـــًٔـا ۭ وَسَيَجْزِي اللّٰهُ الشّٰكِرِيْنَ",
        "Urdu" : "اور نہیں ہیں محمد مگر ایک رسول یقینا گزرچکے ہیں ان سے پہلے بہت رسول کیا پس اگر وہ وفات پاجائیں یا شہید کردیے جائیں (توکیا) تم پھر جاؤ گےاپنی ایڑھیوں کے بل (الٹے پاؤ ں) اور جو پھر جائےاپنی ایڑھیوں کے (الٹے پاؤ ں) تو ہرگز نہیں وہ بگاڑ سکے گا اللہ کا کچھ بھی اور عنقریب اللہ (اچھا) بدلہ دے گا شکر گزاروں کو ۔",
        "English" : "And Muhammad is naught but an apostle; apostles have surely passed away before him. Will ye then, if he dieth or be slain, turn round on your heels! And whosoever turn round on his heels, hurt not Allah at all. And anon shall Allah recompense the grateful."
      },
      {
        "ayet_no" : 145,
        "arbi" : "وَمَا كَانَ لِنَفْسٍ اَنْ تَمُوْتَ اِلَّا بِاِذْنِ اللّٰهِ كِتٰبًا مُّؤَجَّلًا ۭ وَمَنْ يُّرِدْ ثَوَابَ الدُّنْيَا نُؤْتِھٖ مِنْھَا ۚ وَمَنْ يُّرِدْ ثَوَابَ الْاٰخِرَةِ نُؤْتِھٖ مِنْھَا ۚ وَ سَنَجْزِي الشّٰكِرِيْنَ",
        "Urdu" : "اور نہیں ہے (کوئی اختیار) کسی جان کو کہ وہ مرے مگر اللہ کے اذن سے (موت کا) مقررہ وقت لکھا ہوا ہے اور جو چاہے بدلہ (اپنے اعمال کا) دنیا (میں تو) ہم دے دیتے ہیں اسے اس (دنیا میں )سے اور جو آخرت کا بدلہ چاہتا ہو (تو) ہم دیں گے اسے اس (آخرت) میں اور عنقریب ہم (اچھا) بدلہ دیں گے شکر گزاروں کو ۔",
        "English" : "It is not the choice of a person to die without the will of Allah, death being a time-bound destiny. Whoever seeks a reward in this world, We shall give him out of it, and whoever seeks a reward in the Hereafter, We shall give him out of it. We shall soon reward the grateful."
      },
      {
        "ayet_no" : 146,
        "arbi" : "وَكَاَيِّنْ مِّنْ نَّبِيٍّ قٰتَلَ ۙ مَعَهٗ رِبِّيُّوْنَ كَثِيْرٌ ۚ فَمَا وَهَنُوْا لِمَآ اَصَابَھُمْ فِيْ سَبِيْلِ اللّٰهِ وَمَا ضَعُفُوْا وَمَا اسْتَكَانُوْا ۭ وَاللّٰهُ يُحِبُّ الصّٰبِرِيْنَ",
        "Urdu" : "ور کتنے ہی نبی (یاسے گزرے ہیں کہ) جہاد کیا ان کے ساتھ (مل کر) بہت سے اللہ والوں نے پس نہ تو انہوں نے ہمت ہاری اس پر جو مصائب درپیش ہوئے انہیں اللہ کے راستے میں اور نہ انہوں نے کمزوری دکھائی اور نہ وہ (کافروں سے) دبے اور اللہ پسند کرتا ہے صبر کرنے والونکو ۔",
        "English" : "There have been many prophets with whom many men of Allah have fought; they did not lose heart for what they suffered in the way of Allah, nor did they become weak, nor did they yield. Allah loves the steadfast."
      },
      {
        "ayet_no" : 147,
        "arbi" : "وَمَا كَانَ قَوْلَھُمْ اِلَّآ اَنْ قَالُوْا رَبَّنَا اغْفِرْ لَنَا ذُنُوْبَنَا وَ اِسْرَافَنَا فِيْٓ اَمْرِنَا وَثَبِّتْ اَقْدَامَنَا وَانْصُرْنَا عَلَي الْقَوْمِ الْكٰفِرِيْنَ",
        "Urdu" : "اور نہیں تھا انکا قول (اس موقع پر) مگر یہ کہ انہوں نے کہا اے ہمارے رب! معاف فرما ہمارے گناہوں کو اور ہماری زیادتیوں کو اپنے کام میں اور ہمیں ثابت قدم رکھ اور ہماری مدد فرما کافر قوم پر ۔",
        "English" : "They had nothing else to say except that they said: :Our Lord, forgive us our sins and our excesses in our conduct, make firm our feet and help us against the disbelieving people."
      },
      {
        "ayet_no" : 148,
        "arbi" : "فَاٰتٰىھُمُ اللّٰهُ ثَوَابَ الدُّنْيَا وَحُسْنَ ثَوَابِ الْاٰخِرَةِ ۭ وَاللّٰهُ يُحِبُّ الْمُحْسِـنِيْنَ",
        "Urdu" : "پس دیا انہیں اللہ نے دنیا کا بدلہ اور بہترین اجر آخرت کا (بھی)اور اللہ تعالی محبت رکھتا ہے نیکی کرنیوالوں سے",
        "English" : "So, Allah gave them the return in this world and also the better rewards in the Hereafter. Allah loves those who do good."
      },
      {
        "ayet_no" : 149,
        "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوْٓا اِنْ تُطِيْعُوا الَّذِيْنَ كَفَرُوْا يَرُدُّوْكُمْ عَلٰٓي اَعْقَابِكُمْ فَتَنْقَلِبُوْا خٰسِرِيْنَ",
        "Urdu" : "اے وہ لوگو جو ایمان لائے ہو اگر تم کہا مانوگے ان کا جنہوں نے کفر کیا (تو) وہ پھیردیں گے تمہیں (اسلام سے) تمہاری ایڑھیوں کے بل (الٹے پاؤ ں) تو تم پلٹوگے خسارہ پانے والے ( بن کر ) ۔",
        "English" : "O you who believe! If you obey those who disbelieve, they will send you back on your heels, and you will turn back (from Faith) as losers."
      },
      {
        "ayet_no" : 150,
        "arbi" : "بَلِ اللّٰهُ مَوْلٰىكُمْ ۚ وَھُوَ خَيْرُ النّٰصِرِيْنَ",
        "Urdu" : "بلکہ (حقیقت یہ ہے کہ )اللہ ہی تمہارا سر پرست ہے اور وہ بہترین مددگار ہے ۔",
        "English" : "But: Allah is your Friend, and He is the Best of helpers."
      },
      {
        "ayet_no" : 151,
        "arbi" : "سَـنُلْقِيْ فِيْ قُلُوْبِ الَّذِيْنَ كَفَرُوا الرُّعْبَ بِمَآ اَشْرَكُوْا بِاللّٰهِ مَا لَمْ يُنَزِّلْ بِهٖ سُلْطٰنًا ۚ وَمَاْوٰىھُمُ النَّارُ ۭ وَبِئْسَ مَثْوَى الظّٰلِمِيْنَ",
        "Urdu" : "عنقریب ہم ڈال دیں گے (ان کے) دلوں میں جنہوں نے کفرکیا (تمہارا )رعب اس وجہ سے کہ انہوں نے شریک بنایا ہے اللہ کا جو (کہ) اس نے نہیں اتاری اس کی کوئی دلیل اور ان کا ٹھکانا آگ ہے اور ظالموں کا برا ٹھکانا ہے ۔",
        "English" : "We shall put awe into the hearts of those who disbelieve, since they have associated with Allah something for which He has not sent any authority. Their ultimate place is the Fire; and evil is the abode of the unjust."
      },
      {
        "ayet_no" : 152,
        "arbi" : "وَلَقَدْ صَدَقَكُمُ اللّٰهُ وَعْدَهٗٓ اِذْ تَحُسُّوْنَھُمْ بِاِذْنِھٖ ۚ حَتّٰى اِذَا فَشِلْتُمْ وَ تَنَازَعْتُمْ فِي الْاَمْرِ وَعَصَيْتُمْ مِّنْۢ بَعْدِ مَآ اَرٰىكُمْ مَّا تُحِبُّوْنَ ۭ مِنْكُمْ مَنْ يُّرِيْدُ الدُّنْيَا وَمِنْكُمْ مَنْ يُّرِيْدُ الْاٰخِرَةَ ۚ ثُمَّ صَرَفَكُمْ عَنْھُمْ لِيَبْتَلِيَكُمْ ۚ وَلَقَدْ عَفَا عَنْكُمْ ۭ وَاللّٰهُ ذُوْ فَضْلٍ عَلَي الْمُؤْمِنِيْنَ",
        "Urdu" : "اور البتہ تحقیق اللہ نے تمہیں سچا کر دکھایا اپنا وعدہ جب تم قتل کر رہے تھے انہیں اس کے حکم سے یہاں تک کہ جب تم نے ہمت ہار دی اور باہم جھگڑنے لگے (پیغمبر کے) حکم میں اور تم نے نافرمانی کی اس کے بعد کہ اس نے دکھا دیا تمہیں وہ (مال غنیمت) جو تم پسند کرتے تھے تم میں سے (کچھ ایسے تھے) جو دنیا چاہتے تھے اور تم میں سے (کچھ ایسے تھے) جو آخرت چاہتے تھے پھر اس نے تمہیں پھیردیا ان سے ( پسپا کردیا) تاکہ وہ آزمائش کرے تمہاری اور البتہ تحقیق (پھر) اس نے معاف کردیا تمہیں اور اللہ ممومنوں پر فضل کرنے والا ہے ۔",
        "English" : "Allah has surely fulfilled His promise to you when you, with His will, were killing them off, until you showed weakness and disputed in the matter and disobeyed after He had shown you what you liked. Among you there were some who were seeking the mundane, and among you there were others who were seeking the Hereafter. After that, He reversed your position against them, so that He may test you. Of course, He has forgiven you. Allah is All-Gracious to the believers."
      },
      {
        "ayet_no" : 153,
        "arbi" : "اِذْ تُصْعِدُوْنَ وَلَا تَلْوٗنَ عَلٰٓي اَحَدٍ وَّالرَّسُوْلُ يَدْعُوْكُمْ فِيْٓ اُخْرٰىكُمْ فَاَثَابَكُمْ غَمًّـۢا بِغَمٍّ لِّكَيْلَا تَحْزَنُوْا عَلٰي مَا فَاتَكُمْ وَلَا مَآ اَصَابَكُمْ ۭ وَاللّٰهُ خَبِيْرٌۢ بِمَا تَعْمَلُوْنَ",
        "Urdu" : "وہ وقت یاد کرو) جب تم چڑھے جا رہے تھے (پہاڑ پر) اور نہیں پلٹ کر دیکھتے تھے کسی کو اور رسول تمہیں بلا رہے تھے تمہارے پیچھے تو پہنچایا تمہیں (بدلے میں ) غم پر غم تاکہ تم غم نہ کرو اس چیز پر جو تم سے چن گئی ہے اور نہ (اس مصیبت پر) جو تمہیں پہنچی ہ اور خوب خبردار ہے اس سے جو تم عمل کرتے ہو۔",
        "English" : "When you were going away, not even turning to look at anyone, and the Messenger was calling you from behind you. He awarded you sorrow for sorrow, so that you should not grieve (in future) over what you lost, or for what you suffered. Allah is All-Aware of what you do."
      },
      {
        "ayet_no" : 154,
        "arbi" : "ثُمَّ اَنْزَلَ عَلَيْكُمْ مِّنْۢ بَعْدِ الْغَمِّ اَمَنَةً نُّعَاسًا يَّغْشٰى طَاۗىِٕفَةً مِّنْكُمْ ۙ وَطَاۗىِٕفَةٌ قَدْ اَهَمَّتْھُمْ اَنْفُسُھُمْ يَظُنُّوْنَ بِاللّٰهِ غَيْرَ الْحَقِّ ظَنَّ الْجَاهِلِيَّةِ ۭ يَقُوْلُوْنَ ھَلْ لَّنَا مِنَ الْاَمْرِ مِنْ شَيْءٍ ۭ قُلْ اِنَّ الْاَمْرَ كُلَّهٗ لِلّٰهِ ۭ يُخْفُوْنَ فِيْٓ اَنْفُسِھِمْ مَا لَا يُبْدُوْنَ لَكَ ۭ يَقُوْلُوْنَ لَوْ كَانَ لَنَا مِنَ الْاَمْرِ شَيْءٌ مَّا قُتِلْنَا ھٰهُنَا ۭقُلْ لَّوْ كُنْتُمْ فِيْ بُيُوْتِكُمْ لَبَرَزَ الَّذِيْنَ كُتِبَ عَلَيْهِمُ الْقَتْلُ اِلٰى مَضَاجِعِھِمْ ۚ وَلِيَبْتَلِيَ اللّٰهُ مَا فِيْ صُدُوْرِكُمْ وَلِيُمَحِّصَ مَا فِيْ قُلُوْبِكُمْ ۭ وَاللّٰهُ عَلِيْمٌۢ بِذَاتِ الصُّدُوْرِ",
        "Urdu" : "پھر اس نے نازل فرمائی تم پر اس غم کے بعد اونگھ (کی صورت میں جو ) طاری ہوئی ایک گروہ پر تم میں سے ، اور ایک گروہ تھا (کہ)تحقیق فکر پڑی تھی ان کواپنی جانوں کی وہ گمان رکھتے تھے اللہ پر ناحق جاہلیت جیسا گمان، وہ کہہ رہے تھے کہ کیا اس معاملے ہمارا بھی کچھ (اختیار) ہے؟ کہہ دیجیے کہ بے شک وہ سب کام اللہ کے اختیار میں ہیں وہ مخفی رکھتے ہیں (بہت سی باتیں) اپنے دلوں میں جو ظاہر نہیں کرتے آپ پر، وہ کہتے ہیں اگر ہوتا ہمارا اس معاملے (جنگ احد) میں کچھ (اختیار) (تو) ہم نہ مارے جاتے یہاں، کہدیجیےاگر تم ہوتے اپنے گھروں میں (تو) ضرور نکل آتے وہ لوگ (کہ) لکھا جا چک اتھا ان پر (ان کے مقدر میں) قتل ہونا اپنی قتل گاہوں کی طرف اور (یہ شکست اس لیے ہوئی) تاکہ اللہ تعالی پرکھے اسے جو تمہارے سینوں میں ہے اور تاکہ پاک صاف کردے (وہ کھوٹ) جو تمہارے دلوں میں ہے اور اللہ خوب جاننے والا ہے دلوں کی باتوں کو ۔",
        "English" : "Then, after the grief, He poured tranquility upon you - a drowsiness overtaking a group of you. Another group was worrying about their own selves, harboring thoughts about Allah that were untrue - thoughts of ignorance. They were saying, :Is there anything in our hands? Say, :The whole thing belongs to Allah. They conceal in their hearts what they do not disclose to you. They say, :If we had any say in the matter, we would not have been killed here. Say, :If you were in your homes, those destined to be killed would have come out all the way to their (final) resting -places. (All this was done) so that Allah may test your inner qualities and may purify what is in your hearts. Allah is All-Aware of what lies in the hearts."
      },
      {
        "ayet_no" : 155,
        "arbi" : "اِنَّ الَّذِيْنَ تَوَلَّوْا مِنْكُمْ يَوْمَ الْتَقَى الْجَمْعٰنِ ۙ اِنَّمَا اسْتَزَلَّھُمُ الشَّـيْطٰنُ بِبَعْضِ مَا كَسَبُوْا ۚ وَ لَقَدْ عَفَا اللّٰهُ عَنْھُمْ ۭ اِنَّ اللّٰهَ غَفُوْرٌ حَلِيْمٌ",
        "Urdu" : "بے شک وہ لوگ جو تم میں سے پیٹھ پھیر گئے جس دن آ پس میں ٹکرائی دو فوجیں بلا شبہ پھسلادیا ان کو شیطان نے اس وجہ سے جو بعض لغزشیں انہوں نے کیں اور البتہ تحقیق اللہ نے در گزر کردیا ہے ان سے بے شک اللہ بخشنے والا ، نہایت بردبار ہے۔",
        "English" : "Surely, those of you who turned back on the day when the two troops faced each other, Satan had but made them slip for some of their deeds. Of course, Allah has forgiven them. Certainly, Allah is Most-Forgiving, Very-Forbearing."
      },
      {
        "ayet_no" : 156,
        "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوْا لَا تَكُوْنُوْا كَالَّذِيْنَ كَفَرُوْا وَقَالُوْا لِاِخْوَانِھِمْ اِذَا ضَرَبُوْا فِي الْاَرْضِ اَوْ كَانُوْا غُزًّى لَّوْ كَانُوْا عِنْدَنَا مَا مَاتُوْا وَمَا قُتِلُوْا ۚ لِيَجْعَلَ اللّٰهُ ذٰلِكَ حَسْرَةً فِيْ قُلُوْبِھِمْ ۭ وَاللّٰهُ يُـحْيٖ وَيُمِيْتُ ۭ وَاللّٰهُ بِمَا تَعْمَلُوْنَ بَصِيْرٌ",
        "Urdu" : "اے وہ لوگو جو ایمان لائے ہو! مت ہوجانا ان لوگوں کی نطرح جنہوں نے کفر کیا اور انہوں نے کہا اپنے بھائی بندوں کے بارے میں جب وہ سفر کرتے زمیں میں یا جنگ پر ہوتے اگر یہ ہمارے پاس ہوتے (تو)نہ مرتے اور نہ قتل کیے جاتے (ان باتوں سے مقوصود یہ ہے) تاکہ اللہ بنادے اسے حسرت ان کے دلوں میں اور اللہ ہی زندگی دیتا ہے اور وہی موت دیتا ہے اور اللہ اس کو جو تم کر رہے ہو خوب دیکھ رہا ہے ۔",
        "English" : "O you who believe, do not be like those who disbelieved and said about their brethren while they travelled on the earth or had to fight, :Had they been with us, they would have not died, nor would they have been killed. The result is that Allah makes it a remorse resting in their hearts. Allah gives life and brings death; Allah is watchful of what you do."
      },
      {
        "ayet_no" : 157,
        "arbi" : "وَلَىِٕنْ قُتِلْتُمْ فِيْ سَبِيْلِ اللّٰهِ اَوْ مُتُّمْ لَمَغْفِرَةٌ مِّنَ اللّٰهِ وَرَحْمَةٌ خَيْرٌ مِّمَّا يَجْمَعُوْنَ",
        "Urdu" : "اور البتہ اگر تم اللہ کی راہ میں قلت کیے جاؤ یا (ویسے)فوت ہوجاؤ یقینا اللہ کی طرف سے بخشش اور رحمت (کہیں) بہتر ہے اس سے جو یہ جمع کر رہے ہیں۔",
        "English" : "Verily if ye be slain in the way of Allah or die, forgiveness from Allah and mercy are surely better than that which they amass."
      },
      {
        "ayet_no" : 158,
        "arbi" : "وَلَىِٕنْ مُّتُّمْ اَوْ قُتِلْتُمْ لَاِالَى اللّٰهِ تُحْشَرُوْنَ",
        "Urdu" : "اور البتہ اگر تم مرجاؤ یا قتل کیے جاؤ تو) یقینا اللہ ہی کی طرف تم اکٹھے کیے جاا گے۔",
        "English" : "And whether ye die or be slain, assuredly unto Allah shall ye be gathered."
      },
      {
        "ayet_no" : 159,
        "arbi" : "فَبِمَا رَحْمَةٍ مِّنَ اللّٰهِ لِنْتَ لَھُمْ ۚ وَلَوْ كُنْتَ فَظًّا غَلِيْظَ الْقَلْبِ لَانْفَضُّوْا مِنْ حَوْلِكَ فَاعْفُ عَنْھُمْ وَاسْتَغْفِرْ لَھُمْ وَشَاوِرْھُمْ فِي الْاَمْرِ ۚ فَاِذَا عَزَمْتَ فَتَوَكَّلْ عَلَي اللّٰهِ ۭ اِنَّ اللّٰهَ يُحِبُّ الْمُتَوَكِّلِيْنَ",
        "Urdu" : "پس اللہ کی رحمت سے آپ نرم واقع ہوئے ہیں ان کے لیے اور اگر آپ ہوتے سخت مزاج، سنگ دل (تو) ضرور وہ منتشر ہوجاتے تمہارے گردوپیش سے ( پس درگزر کیجیے ان سے اور بخشش طلب کیجیے ان کے لیے اور مشورہ کرو ان سے (اپنے) کاموں میں پھر جب پختہ ارادہ کرلیں تو اللہ پر بھروسہ کرو، بے شک اللہ بھروسہ کرنیوالوں کو پسند کرتا ہے ۔",
        "English" : "So, (O Prophet) it is through mercy from Allah that you are gentle to them. Had you been rough and hard-hearted, they would have dispersed from around you. So, pardon them, and seek Forgiveness for them. Consult them in the matter and, once you have taken a decision, place your trust in Allah. Surely, Allah loves those who place their trust in Him."
      },
      {
        "ayet_no" : 160,
        "arbi" : "اِنْ يَّنْصُرْكُمُ اللّٰهُ فَلَا غَالِبَ لَكُمْ ۚ وَاِنْ يَّخْذُلْكُمْ فَمَنْ ذَا الَّذِي يَنْصُرُكُمْ مِّنْۢ بَعْدِھٖ ۭوَعَلَي اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُوْنَ",
        "Urdu" : "اگر اللہ تمہاری مدد کرے تو تم پر کوئی غالب نہیں آسکتا اور اگر وہ چھوڑدے تمہیں (تو) پھر کون ہے وہ جو تمہاری مدد کرسکے اس کے بعد اور اللہ پر ہی پس بھروسہ کرنا چاہیے مومنون کو ۔",
        "English" : "If Allah helps you, there is none to overcome you. And if He abandons you, then, who is there to help you after that? In Allah the believers should place their trust."
      },
      {
        "ayet_no" : 161,
        "arbi" : "وَمَا كَانَ لِنَبِيٍّ اَنْ يَّغُلَّ ۭ وَمَنْ يَّغْلُلْ يَاْتِ بِمَا غَلَّ يَوْمَ الْقِيٰمَةِ ۚ ثُمَّ تُوَفّٰي كُلُّ نَفْسٍ مَّا كَسَبَتْ وَھُمْ لَا يُظْلَمُوْنَ",
        "Urdu" : "اور نہیں (لائق) ہوسکتا کسی نبی کے لیے کہ وہ خیانت کرے اور جو خیانت کرے گا وہ لے کر آئے گا(وہ چیز) جس میں اس نے خیانت کی ہوگی قیامت کے دن پھر پورا پورا بدلہ دیا جائے گا ہر نفس کو جو اس نے کمایا ہوگااس حال میں کہ وہ ظلم نہیں کیے جائیں گے ۔",
        "English" : "It is not conceivable from a prophet to misappropriate the spoils. Whoever misappropriates shall bring forth, on Doomsday, what he misappropriated. Then, everybody shall be paid, in full, for what he has earned, and they shall not be wronged."
      },
      {
        "ayet_no" : 162,
        "arbi" : "اَفَمَنِ اتَّبَعَ رِضْوَانَ اللّٰهِ كَمَنْۢ بَاۗءَ بِسَخَطٍ مِّنَ اللّٰهِ وَمَاْوٰىهُ جَهَنَّمُ ۭوَبِئْسَ الْمَصِيْرُ",
        "Urdu" : "کیا پس جو تلاش کرے اللہ کی خوشنودی کو (وہ اسکی) طرح ہوسکتا ہے جو گرفتار ہو اللہ کی ناراضگی میں اور اس کا ٹھکانا جہنم ہو اور وہ بہت برا ٹھکانا ہے۔",
        "English" : "How then, could one who submits to the pleasure of Allah be equal to him who returns with displeasure from Allah? His ultimate place is the Fire; and what an evil end it is!"
      },
      {
        "ayet_no" : 163,
        "arbi" : "ھُمْ دَرَجٰتٌ عِنْدَ اللّٰهِ ۭ وَاللّٰهُ بَصِيْرٌۢ بِمَا يَعْمَلُوْنَ",
        "Urdu" : "ان کے (مختلف) درجات ہیں اللہ کے ، اور اللہ خوب دیکھنے والا ہے اسے جو وہ عمل کرتے ہیں ۔",
        "English" : "They are of various ranks with Allah. Allah is watchful of what they do."
      },
      {
        "ayet_no" : 164,
        "arbi" : "لَقَدْ مَنَّ اللّٰهُ عَلَي الْمُؤْمِنِيْنَ اِذْ بَعَثَ فِيْھِمْ رَسُوْلًا مِّنْ اَنْفُسِھِمْ يَتْلُوْا عَلَيْھِمْ اٰيٰتِھٖ وَيُزَكِّيْھِمْ وَيُعَلِّمُھُمُ الْكِتٰبَ وَالْحِكْمَةَ ۚ وَاِنْ كَانُوْا مِنْ قَبْلُ لَفِيْ ضَلٰلٍ مُّبِيْنٍ",
        "Urdu" : "البتہ تحقیق احسان کیا ہے اللہ نے مومنوں پر جب بھیجا ان میں ایک رسول انہی میں سے (جو) پڑھتا ہے ان پر اس کی آیات اور انہیں پاک کرتا ہے (شرک سے) اور تعلیم دیتا ہے انہیں کتاب وحکمت کی اور اگرچہ تھے وہ اس سے قبل یقینا واضح گمراہی میں ۔",
        "English" : "Allah has surely conferred favor on the believers when He raised in their midst a messenger from among themselves who recites to them His verses and makes them pure and teaches them the Book and the Wisdom, while earlier, they were in open error."
      },
      {
        "ayet_no" : 165,
        "arbi" : "اَوَلَمَّآ اَصَابَتْكُمْ مُّصِيْبَةٌ قَدْ اَصَبْتُمْ مِّثْلَيْھَا ۙ قُلْتُمْ اَنّٰى هٰذَا ۭ قُلْ ھُوَ مِنْ عِنْدِ اَنْفُسِكُمْ ۭ اِنَّ اللّٰهَ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
        "Urdu" : "اور یہ کیا بات ہوئی جب واقع ہوئی تم پر مصیبت یقینا تم بھی تو پہنچا چکے ہو دشمنوں کو اس سے دگنی۔ تم نے کہا: یہ کہاں سے (آگئی)کہہ دو وہ تمہاری اپنی طرف سے ہے۔ بے شک اللہ ہر چیز پر قادر ہے ۔",
        "English" : "How is it that, when you suffered a hardship the twice of which you had inflicted upon them, you say, :Where did this come from? Say, :This is from your own selves. Allah is surely Powerful over everything."
      },
      {
        "ayet_no" : 166,
        "arbi" : "وَمَآ اَصَابَكُمْ يَوْمَ الْتَقَى الْجَمْعٰنِ فَبِاِذْنِ اللّٰهِ وَلِيَعْلَمَ الْمُؤْمِنِيْنَ",
        "Urdu" : "اور جو تکلیف تمہیں پہنچی جس دن مڈبھیڑ ہوئی دو جماعتوں کی تو (وہ) اللہ کے حکم سے تھی اور اس لیے بھی کہ وہ مومنوں کو معلوم کرلے",
        "English" : "And that which befell you on the day whereon the two hosts met was by Allah's leave, and that he might know the believers."
      },
      {
        "ayet_no" : 167,
        "arbi" : "وَلِيَعْلَمَ الَّذِيْنَ نَافَقُوْا ښ وَقِيْلَ لَھُمْ تَعَالَوْا قَاتِلُوْا فِيْ سَبِيْلِ اللّٰهِ اَوِ ادْفَعُوْا ۭ قَالُوْا لَوْ نَعْلَمُ قِتَالًا لَّااتَّبَعْنٰكُمْ ۭھُمْ لِلْكُفْرِ يَوْمَىِٕذٍ اَقْرَبُ مِنْھُمْ لِلْاِيْمَان ۚ يَقُوْلُوْنَ بِاَفْوَاهِھِمْ مَّا لَيْسَ فِيْ قُلُوْبِھِمْ ۭوَاللّٰهُ اَعْلَمُ بِمَا يَكْتُمُوْنَ",
        "Urdu" : "اور تاکہ ان کو بھی معلوم کر لے جنہوں نے منافقت کی اور کہا گیا ان سے، آؤ جنگ کرو اللہ کی راہ میں یا (دشمنوں کو) ہٹاؤ ، کہنے لگے اگر ہم جانتے (کہ) لڑائی ہوگی ضرور ہم اتباع کرتے تمہاری وہ اس دن کفر کے زیادہ قریب تھے ان سے ایمان کی نسبت، وہ کہتے ہیں اپنے مونہوں سے جو نہیں (ہوتا) ان کے دلوں میں اور اللہ خوب جاننے والا ہے اسے جو وہ چھپاتے ہیں ۔",
        "English" : "And that he might know those who played the hypocrite. And it was said unto them: come ye, fight in the way of Allah or defend. They said: if we knew it was to be a fair fight We would surely have followed you. Nearer were they on that day to infidelity than to belief. They say with their mouths that which is not in their hearts and Allah know best that which they conceal."
      },
      {
        "ayet_no" : 168,
        "arbi" : "اَلَّذِيْنَ قَالُوْا لِاِخْوَانِھِمْ وَقَعَدُوْا لَوْ اَطَاعُوْنَا مَا قُتِلُوْا ۭ قُلْ فَادْرَءُوْا عَنْ اَنْفُسِكُمُ الْمَوْتَ اِنْ كُنْتُمْ صٰدِقِيْنَ",
        "Urdu" : "(یہ وہ لوگ ہیں)جنہوں نے کہا اپنے بھائیوں کے بارے میں اور (خود گھر) بیٹھے رہے اگر ہماری مانتے (تو)قتل نہ کیے جاتے کہہ دیجیے پس ٹال کر دکھلانااپنی جانوں سے موت کو اگر تم سچے ہو۔",
        "English" : "Those who said about their brethren, while themselves sitting, :Had they obeyed us, they would have not been killed. Say, :Then avert death from yourselves if you are true."
      },
      {
        "ayet_no" : 169,
        "arbi" : "وَلَا تَحْسَبَنَّ الَّذِيْنَ قُتِلُوْا فِيْ سَبِيْلِ اللّٰهِ اَمْوَاتًا ۭ بَلْ اَحْيَاۗءٌ عِنْدَ رَبِّھِمْ يُرْزَقُوْنَ",
        "Urdu" : "اور ہر گز نہ سمجھنا ان لوگوں کو جو قتل کیے جاتے ہیں اللہ کیر اہ میں (کہ وہ) مردہ ہیں بلکہ وہ تو زندہ ہیں اپنے رب کے پاس وہ رزق دیے جاتے ہیں ۔",
        "English" : "Never take those killed in the way of Allah as dead. Rather, they are alive with their Lord, well-provided,"
      },
      {
        "ayet_no" : 170,
        "arbi" : "فَرِحِيْنَ بِمَآ اٰتٰىھُمُ اللّٰهُ مِنْ فَضْلِھٖ ۙ وَيَسْـتَبْشِرُوْنَ بِالَّذِيْنَ لَمْ يَلْحَقُوْا بِھِمْ مِّنْ خَلْفِھِمْ ۙ اَلَّا خَوْفٌ عَلَيْھِمْ وَلَا ھُمْ يَحْزَنُوْنَ",
        "Urdu" : "خوش ہیں اس پر جو اللہ نے ان کو دیا اپنے فضل سے اور وہ خوش ہورہے ہیں ان لوگوں سے جو (ابھی) نہیں پہنچے ان کے پاس ان کے پچھلوں میں سے یہ کہ (قیامت کے دن) ان پر نہ کوئی خوف ہوگا اور نہ وہ غمناک ہوں گے ۔",
        "English" : "Exulting in that which Allah hath vouchsafed them of His grace. And they rejoice in those who have not yet joined them from behind them, in the thought that unto them no fear shall come, nor shall they grieve."
      },
      {
        "ayet_no" : 171,
        "arbi" : "يَسْتَبْشِرُوْنَ بِنِعْمَةٍ مِّنَ اللّٰهِ وَفَضْلٍ ۙ وَّاَنَّ اللّٰهَ لَا يُضِيْعُ اَجْرَ الْمُؤْمِنِيْنَ",
        "Urdu" : "وہ خوش ہو رہے ہیں اللہ کے انعام اور فضل سے اور (یہ) کہ بے شک اللہ مومنوں کا اجر ضائع نہیں کرتا ۔",
        "English" : "They rejoice at the favour of Allah and His grace, and that verily Allah wasteth not the hire of the believers."
      },
      {
        "ayet_no" : 172,
        "arbi" : "اَلَّذِيْنَ اسْتَجَابُوْا لِلّٰهِ وَالرَّسُوْلِ مِنْۢ بَعْدِ مَآ اَصَابَھُمُ الْقَرْحُ لِلَّذِيْنَ اَحْسَنُوْا مِنْھُمْ وَاتَّقَوْا اَجْرٌ عَظِيْمٌ",
        "Urdu" : "جنہوں نے قبول کیا اللہ اور اس کے رسول (کے حکم)کو اس کے بعد کہ انہیں زخم (صدمہ) پہنچا (ان) کے لیے جنہوں نے نیکی کی ان مین سے اورپرہیز گاری اختیار کی اجر عظیم ہے ۔",
        "English" : "Those who responded to the call of Allah and the Messenger, even after they had received the wound, for those of them who did good deeds and feared Allah there is a great reward"
      },
      {
        "ayet_no" : 173,
        "arbi" : "اَلَّذِيْنَ قَالَ لَھُمُ النَّاسُ اِنَّ النَّاسَ قَدْ جَمَعُوْا لَكُمْ فَاخْشَوْھُمْ فَزَادَھُمْ اِيْمَانًا ڰ وَّقَالُوْا حَسْبُنَا اللّٰهُ وَنِعْمَ الْوَكِيْلُ",
        "Urdu" : "وہ لوگ (کہ) ان سے کہا لوگوں نے بے شک (کافر) لوگوں نے یقینا جمع کیا ہے تمہارے لیے (بڑا لشکر) تو تم ان سے ڈر جاؤ تو (اس بات نے مزید) بڑھا دیا ان کے ایمان کو اور وہ کہنے لگے ہمیں اللہ ہی کافی ہے اور وہ بہترین کارساز ہے ۔",
        "English" : "(that is) those to whom people said, :The people have gathered against you; so, fear them. It increased them in Faith and they said, :Allah is fully sufficient for us, and the best One in whom to trust."
      },
      {
        "ayet_no" : 174,
        "arbi" : "فَانْقَلَبُوْا بِنِعْمَةٍ مِّنَ اللّٰهِ وَفَضْلٍ لَّمْ يَمْسَسْھُمْ سُوْۗءٌ ۙ وَّاتَّبَعُوْا رِضْوَانَ اللّٰهِ ۭ وَاللّٰهُ ذُوْ فَضْلٍ عَظِيْمٍ",
        "Urdu" : "پھر وہ لوٹے اللہ کی نعمتوں اور فضل کے ساتھ نہ چھوا انہیں کسی تکلیف نے اور وہ تابع رہے اللہ کی خوشنودی کے اور اللہ تعالی بڑے فضل والا ہے ۔",
        "English" : "So, they returned with bounty from Allah, and grace, with no evil having even touched them, and submitted to the pleasure of Allah. Allah is the Lord of great bounty."
      },
      {
        "ayet_no" : 175,
        "arbi" : "اِنَّمَا ذٰلِكُمُ الشَّيْطٰنُ يُخَوِّفُ اَوْلِيَاۗءَهٗ ۠ فَلَا تَخَافُوْھُمْ وَخَافُوْنِ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
        "Urdu" : "بے شک وہ شیطان ہی تو ہے (جو) ڈراتا ہے اپنے دوستوں (کافر) سے تو مت ڈرو ان سے اور مجھ ہی سے ڈرو اگر ہو تم مومن ۔",
        "English" : "It is none but Satan who frightens (you) of his friends. So, do not fear them; but fear Me, if you are believers."
      },
      {
        "ayet_no" : 176,
        "arbi" : "وَلَا يَحْزُنْكَ الَّذِيْنَ يُسَارِعُوْنَ فِي الْكُفْرِ  ۚ اِنَّھُمْ لَنْ يَّضُرُّوا اللّٰهَ شَـيْــــًٔـا  ۭ يُرِيْدُ اللّٰهُ اَلَّا يَجْعَلَ لَھُمْ حَظًّا فِي الْاٰخِرَةِ  ۚ وَلَھُمْ عَذَابٌ عَظِيْمٌ",
        "Urdu" : "اور آپ کو غمزدہ نہ کریں وہ لوگ جو جلدی کرتے ہیں کفر میں بے شک وہ ہرگز نہیں بگاڑ سکتے اللہ کا کچھ بھی اللہ چاہتا ہے کہ وہ نہ دے ان کو کچھ حصہ آخرت میں اور ان کے لیے بڑا عذاب ہے۔",
        "English" : "Those who hasten towards disbelief should not make you grieve. They cannot harm Allah at all. Allah intends not to spare for them any share in the Hereafter. For them there is a mighty punishment."
      },
      {
        "ayet_no" : 177,
        "arbi" : "اِنَّ الَّذِيْنَ اشْتَرَوُا الْكُفْرَ بِالْاِيْمَانِ لَنْ يَّضُرُّوا اللّٰهَ شَـيْـــًٔـا ۚ وَلَھُمْ عَذَابٌ اَلِيْمٌ",
        "Urdu" : "بے شک جنہوں نے خریدا کفر کو ایمان کے بدلے وہ ہرگز نہیں نقصان کرسکتے اللہ کا کچھ بھی اور ان کے لیے دردناک عذاب ہے ۔",
        "English" : "Certainly, those who bought disbelief in exchange for Belief cannot harm Allah at all. For them there is a painful punishment."
      },
      {
        "ayet_no" : 178,
        "arbi" : "وَلَا يَحْسَبَنَّ الَّذِيْنَ كَفَرُوْٓا اَنَّمَا نُمْلِيْ لَھُمْ خَيْرٌ لِّاَنْفُسِھِمْ ۭ اِنَّمَا نُمْلِيْ لَھُمْ لِيَزْدَادُوْٓا اِثْمًا ۚ وَلَھُمْ عَذَابٌ مُّهِيْنٌ",
        "Urdu" : "اور ہرگز نہ خیال کریں وہ جنہوں نے کفر اختیار کیا کہ بے شک (جو) ہم مہلت دے رہے ہیں ان کو (وہ) بہتر ہے ان کے نفسوں کے لیے بے شک ہم ڈھیل دیتے ہیں انہیں تاکہ وہ اضافہ کرلیں گناہوں میں اور ان کے لیے ذلیل کرنے والا عذاب ہوگا ۔",
        "English" : "Those who disbelieve should not think that the respite We give them is good for them. In fact, We give them respite only that they may increase in sin, and for them there is a humiliating punishment."
      },
      {
        "ayet_no" : 179,
        "arbi" : "مَا كَانَ اللّٰهُ لِيَذَرَ الْمُؤْمِنِيْنَ عَلٰي مَآ اَنْتُمْ عَلَيْهِ حَتّٰى يَمِيْزَ الْخَبِيْثَ مِنَ الطَّيِّبِ ۭ وَمَا كَانَ اللّٰهُ لِيُطْلِعَكُمْ عَلَي الْغَيْبِ وَلٰكِنَّ اللّٰهَ يَجْتَبِىْ مِنْ رُّسُلِھٖ مَنْ يَّشَاۗءُ ۠ فَاٰمِنُوْا بِاللّٰهِ وَرُسُلِھٖ ۚ وَاِنْ تُؤْمِنُوْا وَتَتَّقُوْا فَلَكُمْ اَجْرٌ عَظِيْمٌ",
        "Urdu" : "نہیں ہے اللہ(ایسا) کہ چھوڑے مومنوں کو (اس حالت) پر کہ جس پر تم ہو یہاں تک کہ وہ جدا نہ کردے ناپاک کو پاک سے اور نہیں اللہ کہ مطلع کردے تمہیں غیب پر اور لیکن اللہ (اس کام کے لیے ) منتخب کرلیتا ہے اپنے رسول میں سے جسے چاہتا ہے۔ تو ایمان لاؤ اللہ پر اور اس کے رسولوں پر اور اگرتم ایمان لے آئے اور تقوی اختیار کیا تو تمہارے لیے بہت بڑا اجر ہے ۔",
        "English" : "Allah is not to leave the believers in the state you are in, unless He separates the impure from the pure. Allah is not to inform you of the Unseen. But Allah selects from His messengers whom He wills. So, believe in Allah and His messengers. If you believe, and fear Allah, you will deserve a great reward."
      },
      {
        "ayet_no" : 180,
        "arbi" : "وَلَا يَحْسَبَنَّ الَّذِيْنَ يَبْخَلُوْنَ بِمَآ اٰتٰىھُمُ اللّٰهُ مِنْ فَضْلِھٖ ھُوَ خَيْرًا لَّھُمْ ۭ بَلْ ھُوَ شَرٌّ لَّھُمْ ۭ سَيُطَوَّقُوْنَ مَا بَخِلُوْا بِهٖ يَوْمَ الْقِيٰمَةِ ۭ وَلِلّٰهِ مِيْرَاثُ السَّمٰوٰتِ وَالْاَرْضِ ۭ وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرٌ",
        "Urdu" : "اور ہرگز نہ گمان کریں وہ لوگ جو بخل کرتے ہیں۔ اس پر جو دیا ہے ان کو اللہ نے اپنے فضل سے (کہ) وہ (بخل) ان کے لیے بہتر ہے بلکہ وہ برا ہے ان کے لیے۔ عنقریب طوق بنا کر ڈالا جائے گا (اس مال کا) جو (کہ ) اس میں بخل کرتے تھے قیامت کے دن اور اللہ ہی کے لیے میراث آسمانوں اور زمین کی اور اللہ اسے سے جو تم عمل کرتے ہو خبردار ہے ۔",
        "English" : "Those who withhold in miserliness what Allah has given them out of His grace should not take it as good for them. Instead, it is bad for them. They shall be forced, on the Doomsday, to put on what they withheld, as iron-collars round their necks. To Allah belongs the inheritance of the heavens and the earth. Allah is All-Aware of what you do."
      },
      {
        "ayet_no" : 181,
        "arbi" : "لَقَدْ سَمِعَ اللّٰهُ قَوْلَ الَّذِيْنَ قَالُوْٓا اِنَّ اللّٰهَ فَقِيْرٌ وَّنَحْنُ اَغْنِيَاۗءُ ۘسَنَكْتُبُ مَا قَالُوْا وَقَتْلَھُمُ الْاَنْۢبِيَاۗءَ بِغَيْرِ حَقٍّ ۙ وَّنَقُوْلُ ذُوْقُوْا عَذَابَ الْحَرِيْقِ",
        "Urdu" : "بے شک اللہ نے سن لی (ان کی) بات جنہوں نے کہا ہے بے شک اللہ محتاج ہے اور ہم غنی ہیں عنقریب ہم لکھ لیں گے جو انہوں نے کہا اور ان کا قتل کرنا نبیو کو ناحق اور (قیامت کے دن) ہم (ان سے) کہیں گے چکھو دہکتی (آگ ) کا عذاب ۔",
        "English" : "Allah has surely heard the words of those who said, :Allah is poor, and we are rich. We shall write down what they said, and their killing of the prophets unjustly; and We shall say, :Taste the punishment of the flaming fire."
      },
      {
        "ayet_no" : 182,
        "arbi" : "ذٰلِكَ بِمَا قَدَّمَتْ اَيْدِيْكُمْ وَاَنَّ اللّٰهَ لَيْسَ بِظَلَّامٍ لِّلْعَبِيْدِ",
        "Urdu" : "یہ (اس کا) بدلہ ہے جو آگے بھیجا ہے تمہارے ہاتھوں نے اور بے شک اللہ تو نہیں ہے بندوں پر ظلم کرنے والا۔",
        "English" : "This is due to what your hands sent ahead and that Allah is not cruel to His servants."
      },
      {
        "ayet_no" : 183,
        "arbi" : "اَلَّذِيْنَ قَالُوْٓا اِنَّ اللّٰهَ عَهِدَ اِلَيْنَآ اَلَّا نُؤْمِنَ لِرَسُوْلٍ حَتّٰى يَاْتِيَنَا بِقُرْبَانٍ تَاْكُلُهُ النَّارُ ۭ قُلْ قَدْ جَاۗءَكُمْ رُسُلٌ مِّنْ قَبْلِيْ بِالْبَيِّنٰتِ وَبِالَّذِيْ قُلْتُمْ فَلِمَ قَتَلْتُمُوْھُمْ اِنْ كُنْتُمْ صٰدِقِيْنَ",
        "Urdu" : "وہ لوگ جنہوں نے کہا بے شک اللہ نے پختہ عہد لیا ہے ہم سے کہ ہم ایمان نہ لائیں کسی رسول پر یہاں تک کہ وہ لائے ہمارے پاس ایسی قربانی (کہ) کھاجائے اسے آگ ، کہہ دیجیے تحقیق آچکے ہیں کئی رسول تمہارے پاس مجھ سے پہلے واضح دلائل کے ساتھ اور اس معجزے کے ساتھ جو تم نے کہا پھر تم نے انہیں کیوں قتل کیا اگر تم سچے ہو ۔",
        "English" : "There are those who say. verily God hath covenanted with us that we should believe not in an apostle until he bring unto us a sacrifice which a fire shall devour. Say thou: surety there came unto you apostles before me with evidences and with that which ye speak of, wherefore then did ye slay them, if ye say sooth ?"
      },
      {
        "ayet_no" : 184,
        "arbi" : "فَاِنْ كَذَّبُوْكَ فَقَدْ كُذِّبَ رُسُلٌ مِّنْ قَبْلِكَ جَاۗءُوْ بِالْبَيِّنٰتِ وَالزُّبُرِ وَالْكِتٰبِ الْمُنِيْرِ",
        "Urdu" : "پھر بھی اگر وہ آپکو جھٹلادیں تو یقینا جھٹلائے گئے ہیں کوئی رسول آپ سے پہلے (جو) لاچکے ہیں واضح دلائل اور صحیفے اور روشن کتاب ۔",
        "English" : "Then if they reject you, then messengers have been rejected before you. They came with clear signs and the Scriptures and the enlightening Book."
      },
      {
        "ayet_no" : 185,
        "arbi" : "كُلُّ نَفْسٍ ذَاۗىِٕقَةُ الْمَوْتِ ۭ وَاِنَّمَا تُوَفَّوْنَ اُجُوْرَكُمْ يَوْمَ الْقِيٰمَةِ ۭ فَمَنْ زُحْزِحَ عَنِ النَّارِ وَاُدْخِلَ الْجَنَّةَ فَقَدْ فَازَ ۭ وَمَا الْحَيٰوةُ الدُّنْيَآ اِلَّا مَتَاعُ الْغُرُوْرِ",
        "Urdu" : "ہر شخص کو موت کا مزہ چکھناہے۔اور بے شک تمہیں پورا پورا دیا جائے گا تمہارے اعمال کا بدلہ قیامت کے دن پس جو بچا لیا گیا (جہنم کی) آگ سے اور داخل کردیا گیا جنت میں تو یقینا وہ کامیاب ہوگیا اور نہیں ہے دنیوی زندگی مگر دھوکے کا سامان ۔",
        "English" : "Every soul Shall taste of death and only on the Day of Resurrection ye will be repaid your hire in full. Then whosoever shall be removed far away from the Fire and made to enter into the Garden, he indeed hath achieved the goal; and the life of the world is naught but an illusory enjoyment."
      },
      {
        "ayet_no" : 186,
        "arbi" : "لَتُبْلَوُنَّ فِيْٓ اَمْوَالِكُمْ وَاَنْفُسِكُمْ ۣوَلَتَسْمَعُنَّ مِنَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ مِنْ قَبْلِكُمْ وَمِنَ الَّذِيْنَ اَشْرَكُوْٓا اَذًى كَثِيْرًا ۭ وَاِنْ تَصْبِرُوْا وَتَتَّقُوْا فَاِنَّ ذٰلِكَ مِنْ عَزْمِ الْاُمُوْرِ",
        "Urdu" : "اے ایمان والو!) البتہ ضرور تم آزمائے جاؤ گے اپنے مالوں میں اوراپنی جانوں میں اور البتہ ضرور تم سنوگے ان لوگوں سے جو دیے گیے کتاب تم سے پہلے اور ان لوگوں سے جنہوں نے شرک کیا بہت سی تکلیف دہ باتیں اور اگر تم صبر کرو گے اور (اللہ تعالی سے ڈرتے رہو گے تو بے شک یہ (بڑی) ہمت کے کام ہیں ۔",
        "English" : "O Ye shall surely be proven in your riches and in your lives; and will surely bear much hurt from those who were vouchsafed the Book before you and from those who associate gods, and if ye endure and fear, then verily that is of the commandments determined."
      },
      {
        "ayet_no" : 187,
        "arbi" : "وَاِذْ اَخَذَ اللّٰهُ مِيْثَاقَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ لَتُبَيِّنُنَّهٗ لِلنَّاسِ وَلَاتَكْتُمُوْنَهٗ ۡ فَنَبَذُوْهُ وَرَاۗءَ ظُهُوْرِھِمْ وَاشْتَرَوْا بِهٖ ثَمَـــنًا قَلِيْلًا ۭ فَبِئْسَ مَا يَشْتَرُوْنَ",
        "Urdu" : "ور جب لیا االلہ نے پختہ عہد ان لوگوں سے جو کتاب دیے گئے (کہ) البتہ ضرور تم بیان کرتے رہو گے اس (کتاب) کو لوگوں کے سامنے اور نہیں چھپاؤ گے اسے پھر انہوں نے ڈال دیا اسےاپنی پشتوں کے پیچھے اور بیچ ڈالا اس کو تھوڑی قیمت میں پس برا ہے جو وہ کاروبار کر رہے ہیں ۔",
        "English" : "When Allah took a pledge from those who were given the Book: :You shall make it known to people, and you shall not conceal it, they threw it away behind their backs, and acquired a small price for it. So, evil is what they acquire."
      },
      {
        "ayet_no" : 188,
        "arbi" : "لَا تَحْسَبَنَّ الَّذِيْنَ يَفْرَحُوْنَ بِمَآ اَتَوْا وَّيُحِبُّوْنَ اَنْ يُّحْمَدُوْا بِمَا لَمْ يَفْعَلُوْا فَلَا تَحْسَبَنَّھُمْ بِمَفَازَةٍ مِّنَ الْعَذَابِ ۚ وَلَھُمْ عَذَابٌ اَلِيْمٌ",
        "Urdu" : "تم ہرگز خیال نہ کرنا (کہ) جو لوگ خوش ہو رہے ہیں اس پر جو وہ (نا پسندیدہ کام) کر رہے ہیں اور وہ چاہتے ہیں کہ ان کی تعریف کی جائے ان (کاموں ) پر جو انہوں نے نہیں کیے تو ہرگز خیال نہ کرنا ان کے بارے میں عذاب سے بچنے کا اور ان کے لیے تو دردناک عذاب ہے ۔",
        "English" : "Do not think of those who are delighted with what they did, and love to be praised for what they never did - do not think they are secure from the punishment. For them there is a painful punishment."
      },
      {
        "ayet_no" : 189,
        "arbi" : "وَلِلّٰهِ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ ۭوَاللّٰهُ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ",
        "Urdu" : "اور اللہ ہی کیلئے بادشاہت آسمانوں اور زمین کی اور اللہ ہرچیز پر قادر ہے ۔",
        "English" : "To Allah belongs the Kingdom of the heavens and the earth. Allah is powerful to do every thing."
      },
      {
        "ayet_no" : 190,
        "arbi" : "اِنَّ فِيْ خَلْقِ السَّمٰوٰتِ وَالْاَرْضِ وَاخْتِلَافِ الَّيْلِ وَالنَّھَارِ لَاٰيٰتٍ لِّاُولِي الْاَلْبَابِ",
        "Urdu" : "بے شک آسمانوں اور زمین کے پیدا کرنے میں اور رات اور دن کے انے جانے میں یقینا نشانیاں ہیں عقل والوں کے لیے ۔",
        "English" : "Verily in the creation of the heavens and the earth and in the alter nation of the night and the day are signs Unto the men of understanding."
      },
      {
        "ayet_no" : 191,
        "arbi" : "الَّذِيْنَ يَذْكُرُوْنَ اللّٰهَ قِيٰمًا وَّقُعُوْدًا وَّعَلٰي جُنُوْبِھِمْ وَيَتَفَكَّرُوْنَ فِيْ خَلْقِ السَّمٰوٰتِ وَالْاَرْضِ ۚ رَبَّنَا مَا خَلَقْتَ هٰذَا بَاطِلًا  ۚ سُبْحٰنَكَ فَقِنَا عَذَابَ النَّارِ",
        "Urdu" : "وہ لوگ جو ذکر کرتے ہیں اللہ کا کھڑے ہوکر اور بیٹھ کر اور اپنے پہلوؤ ں کے بل اور غور وفکر کرتے ہیں آسمانوں اور زمین کی تخلیق (اور کہتے ہیں)اے ہمارے رب! نہیں پیدا کیا تونے یہ (سب کچھ) بیکار، تو پاک ہے (ہر عیب سے) پس بچا ہمیں آگ کے عذاب سے ۔",
        "English" : "Who remember Allah standing and sitting, and (lying) on their sides, and ponder on the creation of the heavens and the earth (and say) :Our Lord, You have not created all this in vain. We proclaim Your purity. So, save us from the punishment of Fire."
      },
      {
        "ayet_no" : 192,
        "arbi" : "رَبَّنَآ اِنَّكَ مَنْ تُدْخِلِ النَّارَ فَقَدْ اَخْزَيْتَهٗ ۭ وَمَا لِلظّٰلِمِيْنَ مِنْ اَنْصَارٍ",
        "Urdu" : "اے ہمارے رب!بے شک تو جسے داخل کردے آگ میں تو یقینا تونے رسوا کردیا اسے اور نہیں ہے ظالموں کا کوئی مدگار ۔",
        "English" : "Our Lord, whomsoever You admit into the Fire, he is disgraced by You indeed, and for the unjust there are no supporters."
      },
      {
        "ayet_no" : 193,
        "arbi" : "رَبَّنَآ اِنَّنَا سَمِعْنَا مُنَادِيًا يُّنَادِيْ لِلْاِيْمَانِ اَنْ اٰمِنُوْا بِرَبِّكُمْ فَاٰمَنَّاڰ رَبَّنَا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَكَفِّرْ عَنَّا سَيِّاٰتِنَا وَتَوَفَّنَا مَعَ الْاَبْرَارِ",
        "Urdu" : "اے ہمارے رب!بے شک ہم نے سنا ایک پکارنے والے کو جو ایمان کی منادی کر رہا تھا کہ ایمان لاؤ اپنے رب پر تو ہم ایمان لے آئے اے اہمارے رب! پس معاف کر ہمیں ہمارے گناہ اور دور کردے ہم سے ہماری برائیاں اور ہمیں موت دے نیک لوگوں کے ساتھ",
        "English" : "Our Lord, We heard a herald calling towards Faith: _Believe in your Lord.‘ So we believed. Our Lord, forgive us, then, our sins, and write off our evil deeds, and make us die only when we have joined the righteous."
      },
      {
        "ayet_no" : 194,
        "arbi" : "رَبَّنَا وَاٰتِنَا مَا وَعَدْتَّنَا عَلٰي رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيٰمَةِ ۭاِنَّكَ لَا تُخْلِفُ الْمِيْعَادَ",
        "Urdu" : "اے ہمارے رب! اور دے ہمیں وہ جس کا تو نے وعدہ کیا ہم سے اپنے رسول کی زبان پر اور ہمیں رسوا نہ کرنا قیامت کے دن بے شک تو وعدے کے خلاف نہیں کرتا",
        "English" : "Our Lord, give us what You have promised us through Your messengers, and do not put us to disgrace on the Day of Judgement. Surely you do not go back on Your promise."
      },
      {
        "ayet_no" : 195,
        "arbi" : "فَاسْتَجَابَ لَھُمْ رَبُّھُمْ اَنِّىْ لَآ اُضِيْعُ عَمَلَ عَامِلٍ مِّنْكُمْ مِّنْ ذَكَرٍ اَوْ اُنْثٰى ۚ بَعْضُكُمْ مِّنْۢ بَعْضٍ ۚ فَالَّذِيْنَ ھَاجَرُوْا وَاُخْرِجُوْا مِنْ دِيَارِھِمْ وَاُوْذُوْا فِيْ سَبِيْلِيْ وَقٰتَلُوْا وَقُتِلُوْا لَاُكَفِّرَنَّ عَنْھُمْ سَيِّاٰتِھِمْ وَلَاُدْخِلَنَّھُمْ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِھَا الْاَنْھٰرُ ۚ ثَوَابًا مِّنْ عِنْدِ اللّٰهِ ۭوَاللّٰهُ عِنْدَهٗ حُسْنُ الثَّوَابِ",
        "Urdu" : "پھر قبول کرلی ان کی دعا ان کے رب نے فرمایا کہ بے شک میں ضائع نہیں کروں گا کسی عمل کرنیوالے کا عمل تم میں سے مرد ہو یا عورت تم ایک دوسرے سے ہو (یعنی سب برابر ہیں) پس جنہوں نے ہجرت کی اور نکالے گئے اپنے گھروں سے اور ستائے گئے میری راہ میں اور انہوں نے جنگ کی اللہ کی راہ میں اور مارے گئے البتہ ضرور میں مٹادوں گا ان سے انکے گناہ اور البتہ ضرور میں داخل کرونگا انہیں ایسی جنتوں میں کہ بہتی ہیں ان باغات کے نیچے سے نہریں بدلہ ہے اللہ کی طرف سے اور اللہ وہ ہے کہ اس کے پاس بہترین بدلہ ہے ۔",
        "English" : "Then their Lord hearkened unto them saying: I let not the work of a worker amongst you to waste, man or woman, one of you from the other. So those who emigrated and were driven forth from their homes and persecuted in My cause, and who fought and were slain, surely I shall expiate from them their misdeeds and surely I shall make them enter Gardens whereunder rivers flow; a reward from before Allah! And Allah! with Him is the excellent reward."
      },
      {
        "ayet_no" : 196,
        "arbi" : "لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِيْنَ كَفَرُوْا فِي الْبِلَادِ",
        "Urdu" : "ہرگز دھوکے میں نہ ڈالے آپ کو(ادھر ادھر)پھرنا ان لوگوں کاجنہوں نے کفر کیا ملکوں میں ۔",
        "English" : "The strutting of the disbelievers about the land should not deceive you."
      },
      {
        "ayet_no" : 197,
        "arbi" : "مَتَاعٌ قَلِيْلٌ ۣ ثُمَّ مَاْوٰىھُمْ جَهَنَّمُ ۭوَبِئْسَ الْمِھَادُ",
        "Urdu" : "یہ فائدہ ہے تھوڑا سا پھر ان کاٹھکانہ جہنم ہے اوروہ بہت برا ٹھکانہ ہے ۔",
        "English" : "It is just a little enjoyment. After that, their resort is Hell; and it is an evil abode."
      },
      {
        "ayet_no" : 198,
        "arbi" : "لٰكِنِ الَّذِيْنَ اتَّقَوْا رَبَّھُمْ لَھُمْ جَنّٰتٌ تَجْرِيْ مِنْ تَحْتِھَا الْاَنْھٰرُ خٰلِدِيْنَ فِيْھَا نُزُلًا مِّنْ عِنْدِ اللّٰهِ ۭ وَمَا عِنْدَ اللّٰهِ خَيْرٌ لِّلْاَبْرَارِ",
        "Urdu" : "لیکن وہ لوگ جوڈرتے ہیں اپنےرب سے ان کے لیے جنتیں ہیں کہ بہتی ہیں انکے نیچے سے نہریں وہ ہمیشہ رہنے والے ہیں ان میں مہمانی ہے اللہ کی طرف سے اورجوکچھ اللہ کے پاس ہے وہ سب سے بہتر ہے نیکوں کے لیے ۔",
        "English" : "But those who fear their Lord, for them there are Gardens beneath which rivers flow, where they will live forever – as hospitality from Allah. What is with Allah is best for the righteous."
      },
      {
        "ayet_no" : 199,
        "arbi" : "وَاِنَّ مِنْ اَھْلِ الْكِتٰبِ لَمَنْ يُّؤْمِنُ بِاللّٰهِ وَمَآ اُنْزِلَ اِلَيْكُمْ وَمَآ اُنْزِلَ اِلَيْھِمْ خٰشِعِيْنَ لِلّٰهِ ۙ لَا يَشْتَرُوْنَ بِاٰيٰتِ اللّٰهِ ثَـمَنًا قَلِيْلًا ۭ اُولٰۗىِٕكَ لَھُمْ اَجْرُھُمْ عِنْدَ رَبِّھِمْ ۭ اِنَّ اللّٰهَ سَرِيْعُ الْحِسَابِ",
        "Urdu" : "اوربے شک اہل کتاب میں سے البتہ جو ایمان لاتا ہے اللہ پر اور جو نازل کیا گیا تمہاری طرف (قران مجید) او جو نازل کیا گیا ان کی طرف تورات، انجیل ، عاجزی کرنے ہیں اللہ کے لیے وہ نہیں سودا کرتے اللہ کی آیات کا تھوڑی قیمت میں وہی لوگ ہیں کہ ان کے لیے ان کا اجر ہے ان کے رب کے پاس بے شک اللہ جلد حساب لینے والا ہے ۔",
        "English" : "Surely, among the people of the Book there are those who believe in Allah, and in what has been sent down to you and what has been sent down to them, humbling themselves before Allah. They do not barter away the verses of Allah for paltry (worldly) gains. They have their reward with their Lord. Surely, Allah is swift at reckoning."
      },
      {
        "ayet_no" : 200,
        "arbi" : "يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوا اصْبِرُوْا وَصَابِرُوْا وَرَابِطُوْا ۣوَاتَّقُوا اللّٰهَ لَعَلَّكُمْ تُفْلِحُوْنَ",
        "Urdu" : "اے وہ لوگو جو ایمان لائے ہو! صبر کرو(ثابت قدم رہو) اور ایک دوسرے کو تھامے رکھو اور (جہاد کے لیے ) کمر بستہ رہو اور اللہ سے ڈرتے رہو تاکہ تم کامیاب ہوجاؤ ۔",
        "English" : "O you who believe, be patient, compete with each other in patience, and guard your frontiers and fear Allah, so that you may be successful."
      }

    ]
  }
]