[
  {
    "surah_no" : 7,
    "total_ayah" : 206,
    "name" : "Surah e Araaf",
    "detail" : [

      {
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے",
        "English" : "With the name of Allah, the All-Merciful, the Very-Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "الۗمّۗصۗ",
        "Urdu" : "المص",
        "English" : "Alif, Lam, Mim, Sad."
      },
      {
        "ayet_no" : 2,
        "arbi" : "كِتٰبٌ اُنْزِلَ اِلَيْكَ فَلَا يَكُنْ فِيْ صَدْرِكَ حَرَجٌ مِّنْهُ لِتُنْذِرَ بِهٖ وَذِكْرٰي لِلْمُؤْمِنِيْنَ",
        "Urdu" : "یہ ایک کتاب ہے جو نازل کی گئی آپ کی طرف تو نہ ہو آپ کے سینے میں کوئی تنگی اس سے تاکہ آپ ڈرائیں اس کے زریعے اور نصیحت ہے مومنوں کے لیے ۔",
        "English" : "(This is) a book sent down to you. Therefore, your heart must not be straitened because of it. (It is revealed to you) so that you may warn through it, and it may be an advice for the believers."
      },
      {
        "ayet_no" : 3,
        "arbi" : "اِتَّبِعُوْا مَآ اُنْزِلَ اِلَيْكُمْ مِّنْ رَّبِّكُمْ وَلَا تَتَّبِعُوْا مِنْ دُوْنِهٖٓ اَوْلِيَاۗءَ ۭ قَلِيْلًا مَّا تَذَكَّرُوْنَ",
        "Urdu" : "تم پیروی کرو اس کی جو نازل کیا گیا ہے تمہاری طرف تمہارے رب کی طرف سے اور نہ پیروی کرو اس کے علاوہ اور دوستوں کی بہت ہی کم تم نصیحت حاصل کرتے ہو ۔",
        "English" : "(O humankind,) follow what has been sent down to you from your Lord, and do not follow any masters other than Him. Little you heed to advice!"
      },
      {
        "ayet_no" : 4,
        "arbi" : "وَكَمْ مِّنْ قَرْيَةٍ اَهْلَكْنٰهَا فَجَاۗءَهَا بَاْسُنَا بَيَاتًا اَوْ هُمْ قَاۗىِٕلُوْنَ",
        "Urdu" : "اور کتنی ہی بستیاں ہیں کہ ہم نے ہلاک کردیا انہیں تو آیا ان پر ہمارا عذاب راتوں رات یا جب وہ دوبپہر کو آرام کرنے والے تھے",
        "English" : "How many a town We have destroyed! Our punishment came upon them at night or when they were having a nap at midday."
      },
      {
        "ayet_no" : 5,
        "arbi" : "فَمَا كَانَ دَعْوٰىهُمْ اِذْ جَاۗءَهُمْ بَاْسُنَآ اِلَّآ اَنْ قَالُوْٓا اِنَّا كُنَّا ظٰلِمِيْنَ",
        "Urdu" : "پھر نہ تھی ان کی پکار جب آیا ان کے پاس ہمارا عذاب مگر یہ کہ انہوں نے کہا بیشک ہم ہی ظالم تھے",
        "English" : "So, when Our punishment came upon them, they could say nothing but cry, :We were wrongdoers indeed."
      },
      {
        "ayet_no" : 6,
        "arbi" : "فَلَنَسْــــَٔـلَنَّ الَّذِيْنَ اُرْسِلَ اِلَيْهِمْ وَلَنَسْــــَٔـلَنَّ الْمُرْسَلِيْنَ",
        "Urdu" : "تو ضرور ہم پوچھیں گے ان لوگوں سے کہ بھیجے گئے ان کی طرف رسول اور ضرور ہم پوچھیں گے رسولوں سے بھی",
        "English" : "So, We shall ask those to whom the messengers were sent, and We shall ask the messengers (how they conveyed the message)."
      },
      {
        "ayet_no" : 7,
        "arbi" : "فَلَنَقُصَّنَّ عَلَيْهِمْ بِعِلْمٍ وَّمَا كُنَّا غَاۗىِٕبِيْنَ",
        "Urdu" : "پھر ضرور ہم بیان کریں گے ان پر علم کے ساتھ اور نہیں تھے ہم غائب",
        "English" : "Then, having full knowledge, We shall tell them the whole story, as We were never far from them."
      },
      {
        "ayet_no" : 8,
        "arbi" : "وَالْوَزْنُ يَوْمَىِٕذِۨ الْحَقُّ ۚ فَمَنْ ثَقُلَتْ مَوَازِيْنُهٗ فَاُولٰۗىِٕكَ هُمُ الْمُفْلِحُوْنَ",
        "Urdu" : "اور وزن اس دن برحق ہے پھر جو شخص کہ بھاری ہوگئے اس کے اعمال کے پلڑے تو وہی لوگ ہی کامیاب ہونے والے ہیں ۔",
        "English" : "The Weighing (of deeds) on that day is definite. As for those whose scales are heavy, they will be the successful ones."
      },
      {
        "ayet_no" : 9,
        "arbi" : "وَمَنْ خَفَّتْ مَوَازِيْنُهٗ فَاُولٰۗىِٕكَ الَّذِيْنَ خَسِرُوْٓا اَنْفُسَهُمْ بِمَا كَانُوْا بِاٰيٰتِنَا يَظْلِمُوْنَ",
        "Urdu" : "اور جو شخص کہ ہلکے ہوگئے اس کے پلڑے تو وہی لوگ ہیں جنہوں نے خسارے میں ڈالا اپنے نفسوں کو اس وجہ سے جو تھے وہ ہماری آیتوں کے ساتھ بے انصافی کرتے ۔",
        "English" : "But those whose scales are light, they are the ones who have brought loss to themselves, because they did not do justice to Our verses."
      },
      {
        "ayet_no" : 10,
        "arbi" : "وَلَقَدْ مَكَّنّٰكُمْ فِي الْاَرْضِ وَجَعَلْنَا لَكُمْ فِيْهَا مَعَايِشَ ۭقَلِيْلًا مَّا تَشْكُرُوْنَ",
        "Urdu" : "اور بلا شبہ ہم نے ٹھکانا دیا تمہیں زمین میں اور ہم نے بنائے تمہارے لیے اس میں زندگی کے سامان بہت ہی کم تم شکر کرتے ہو",
        "English" : "We established you on earth, and created in it means of living for you. Little you appreciate."
      },
      {
        "ayet_no" : 11,
        "arbi" : "وَلَقَدْ خَلَقْنٰكُمْ ثُمَّ صَوَّرْنٰكُمْ ثُمَّ قُلْنَا لِلْمَلٰۗىِٕكَةِ اسْجُدُوْا لِاٰدَمَ ڰ فَسَجَدُوْٓا اِلَّآ اِبْلِيْسَ ۭ لَمْ يَكُنْ مِّنَ السّٰجِدِيْنَ",
        "Urdu" : "اور بلاشبہ ہم نے پیدا کیا تمہیں پھر ہم نے شکلیں بنائیں تمہاری پھر ہم نے کہا فرشتوں سے کہ سجدہ کرو آدم کو تو انہوں نے سجدہ کیا سوائے ابلیس کے نہ ہوا وہ سجدہ کرنے والوں میں سے ۔",
        "English" : "We created you, then gave you a shape, then We said to the angels, :Prostrate yourselves before ‘Adam. So, they all prostrated themselves, except Iblis (Satan). He did not join those who fell prostrate."
      },
      {
        "ayet_no" : 12,
        "arbi" : "قَالَ مَا مَنَعَكَ اَلَّا تَسْجُدَ اِذْ اَمَرْتُكَ  ۭ قَالَ اَنَا خَيْرٌ مِّنْهُ   ۚ خَلَقْتَنِيْ مِنْ نَّارٍ وَّخَلَقْتَهٗ مِنْ طِيْنٍ",
        "Urdu" : "کہا اللہ نے کس چیز نے روکا تجھے کہ نہ تو سجدہ کرے جبکہ میں نے حکم دیا تجھے؟ اس نے کہا میں بہتر ہوں اس سے تو نے پیدا کیا مجھے آگ سے اور تو نے پیدا کیا اسے مٹی سے ۔",
        "English" : "Allah said, :What has prevented you from prostrating when I ordered you? He said, :I am better than him. You have created me of fire, and created him of clay."
      },
      {
        "ayet_no" : 13,
        "arbi" : "قَالَ فَاهْبِطْ مِنْهَا فَمَا يَكُوْنُ لَكَ اَنْ تَتَكَبَّرَ فِيْهَا فَاخْرُجْ اِنَّكَ مِنَ الصّٰغِرِيْنَ",
        "Urdu" : "فرمایا پھر اترجا اس بہشت سے پس نہ تھا لائق تیرے لیے کہ تو تکبر کرے اس میں پس نکل جا بیشک تو ذلیل ہونے والوں میں سے ہے ۔",
        "English" : "He said, :Then, get you down from here, it is not for you to show arrogance here. So, get out. You are one of the degraded."
      },
      {
        "ayet_no" : 14,
        "arbi" : "قَالَ اَنْظِرْنِيْٓ اِلٰي يَوْمِ يُبْعَثُوْنَ",
        "Urdu" : "اس (ابلیس) نے کہا تو مہلت دے مجھے اس دن تک کہ وہ اٹھائے جائیں گے ۔",
        "English" : "He said, :Then give me respite until a day when all will be resurrected."
      },
      {
        "ayet_no" : 15,
        "arbi" : "قَالَ اِنَّكَ مِنَ الْمُنْظَرِيْنَ",
        "Urdu" : "فرمایا بیشک تو مہلت دیے جانیوالوں میں سے ہے ۔",
        "English" : "Allah said: verily thou art of the respited."
      },
      {
        "ayet_no" : 16,
        "arbi" : "قَالَ فَبِمَآ اَغْوَيْتَنِيْ لَاَقْعُدَنَّ لَهُمْ صِرَاطَكَ الْمُسْتَقِيْمَ",
        "Urdu" : "اس نے کہا تو اس وجہ سے کہ تونے گمراہ کیا مجھے لازما میں بیٹھوں گا ان کو گمراہ کرنے کے لیے تیرے سیدھے راستے پر ۔",
        "English" : "He said, :Now that You have led me astray, I will certainly sit for them (in ambush) on Your straight path."
      },
      {
        "ayet_no" : 17,
        "arbi" : "ثُمَّ لَاٰتِيَنَّهُمْ مِّنْۢ بَيْنِ اَيْدِيْهِمْ وَمِنْ خَلْفِهِمْ وَعَنْ اَيْمَانِهِمْ وَعَنْ شَمَاۗىِٕلِهِمْ ۭ وَلَا تَجِدُ اَكْثَرَهُمْ شٰكِرِيْنَ",
        "Urdu" : "پھر ضرور میں آؤ ں گا ان کے پاس ان کے آگے سے اور ان کے پیچھے سے اور ان کے دائیں سے اور ان کے بائیں سے اور نہیں پائیں گے آپ ان کی اکثریت کو شکر کرنیوالے ۔",
        "English" : "Then I will come upon them from their front side and from their behind, and from their right and from their left. You will not find most of them grateful."
      },
      {
        "ayet_no" : 18,
        "arbi" : "قَالَ اخْرُجْ مِنْهَا مَذْءُوْمًا مَّدْحُوْرًا  ۭ لَمَنْ تَبِعَكَ مِنْهُمْ لَاَمْلَئَنَّ جَهَنَّمَ مِنْكُمْ اَجْمَعِيْنَ",
        "Urdu" : "فرمایا نکل جا اس سے مذمت کیا ہوا دھتکارا ہوا یقینا جس نے تیری پیروی کی ان میں سے ضرور میں بھردوں گا جہنم کو تم سب سے ۔",
        "English" : "He (Allah) said, :Get out of here, condemned, rejected. Indeed, whosoever will follow you from among them, I will fill Hell with all of you together."
      },
      {
        "ayet_no" : 19,
        "arbi" : "وَيٰٓاٰدَمُ اسْكُنْ اَنْتَ وَزَوْجُكَ الْجَنَّةَ فَكُلَا مِنْ حَيْثُ شِـئْتُمَا وَلَا تَقْرَبَا هٰذِهِ الشَّجَرَةَ فَتَكُوْنَا مِنَ الظّٰلِمِيْنَ",
        "Urdu" : "اور اے آدم رہو تم اور تمہاری بیوی جنت میں پس دونوں کھاؤ جہاں سے تم دونوں چاہو اور مت تم دونوں قریب جانا اس درخت کے پس دونوں ہوجاؤ گے ظالموں میں سے",
        "English" : "O ‘Adam, dwell, you and your wife, in Paradise, and eat from wherever you like, but do not go near this tree, otherwise you shall join the transgressors."
      },
      {
        "ayet_no" : 20,
        "arbi" : "فَوَسْوَسَ لَهُمَا الشَّيْطٰنُ لِيُبْدِيَ لَهُمَا مَا وٗرِيَ عَنْهُمَا مِنْ سَوْاٰتِهِمَا وَقَالَ مَا نَهٰىكُمَا رَبُّكُمَا عَنْ هٰذِهِ الشَّجَرَةِ اِلَّآ اَنْ تَكُوْنَا مَلَكَيْنِ اَوْ تَكُوْنَا مِنَ الْخٰلِدِيْنَ",
        "Urdu" : "تو وسوسہ ڈالا ان دونوں کو بہکانے کے لیے شیطان نے تاکہ ظاہر کرے ان دونوں کے لیے جو چھپائی گئی تھیں ان دونوں سے ان دونوں کے ستر اور کہا نہیں روکا تم دونوں کو تمہارے رب نے اس درخت سے مگر اس لیے کہ تم دونوں ہوجاؤ فرشتے یا ہوجاؤ ہمیشہ رہنے والوں میں سے",
        "English" : "Then Satan whispered to them, so that he might expose to them their shame that was hidden from them; and said, :Your Lord has not prohibited this tree for you, but to avoid your becoming angels or your becoming eternal."
      },
      {
        "ayet_no" : 21,
        "arbi" : "وَقَاسَمَهُمَآ اِنِّىْ لَكُمَا لَمِنَ النّٰصِحِيْنَ",
        "Urdu" : "اور اس نے قسم کھا کر کہا ان دونوں سے کہ بیشک میں تم دونوں کیلئے یقینا خیرخواہوں میں سے ہوں",
        "English" : "He swore an oath, :I am one of your well-wishers."
      },
      {
        "ayet_no" : 22,
        "arbi" : "فَدَلّٰىهُمَا بِغُرُوْرٍ ۚ فَلَمَّا ذَاقَا الشَّجَرَةَ بَدَتْ لَهُمَا سَوْاٰتُهُمَا وَطَفِقَا يَخْصِفٰنِ عَلَيْهِمَا مِنْ وَّرَقِ الْجَنَّةِ  ۭوَنَادٰىهُمَا رَبُّهُمَآ اَلَمْ اَنْهَكُمَا عَنْ تِلْكُمَا الشَّجَرَةِ وَاَقُلْ لَّكُمَآ اِنَّ الشَّيْطٰنَ لَكُمَا عَدُوٌّ مُّبِيْنٌ",
        "Urdu" : "پس اس نے کھنیچ لیا ان دونوں کو دھوکے سے پھر جب ان دونوں نے چکھ لیا درخت کو تو ظاہر ہوگئے ان دونوں کے لیے ان کے ستر اور دونوں چپکانے لگے اپنے اوپر ستر ڈھانپنے کے لیے جنت کے پتوں سے اور آواز دی ان دونوں کے ان کے رب نے کیا نہیں میں نے روکا تھا تم دونوں کو اس درخت سے اور میں نے کہا نہ تھا تم دونوں سے کہ بیشک شیطان تم دونوں کا کھلا دشمن ہے ۔",
        "English" : "Thus, he cast both of them down by deception. When they tasted (the fruit of) the tree, their shame was exposed to them, and they began to patch together some leaves of Paradise upon themselves, and their Lord called them, :Did I not forbid you from that tree? Did I not tell you that Satan is your declared enemy ?"
      },
      {
        "ayet_no" : 23,
        "arbi" : "قَالَا رَبَّنَا ظَلَمْنَآ اَنْفُسَنَا ۫وَاِنْ لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ",
        "Urdu" : "دونوں نے کہا اے ہمارے رب۔ ہم نے ظلم کیااپنی جانوں پر اور اگرنہ معاف کیا تو نے ہمیں اور نہ تونے رحم کیا ہم پر تو ضرور ہم ہوجائیں گے خسارہ پانیوالوں میں سے ۔",
        "English" : "They said, :Our Lord, we have wronged ourselves, and if You do not forgive us and do not bless us with mercy, we shall, indeed, be among the losers."
      },
      {
        "ayet_no" : 24,
        "arbi" : "قَالَ اهْبِطُوْا بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ ۚ وَلَكُمْ فِي الْاَرْضِ مُسْتَقَرٌّ وَّمَتَاعٌ اِلٰي حِيْنٍ",
        "Urdu" : "فرمایا اترجاؤ تمہارا بعض بعض کا دشمن ہے اور تمہارے لیے زمین میں ٹھکانا ہے اور فائدہ اٹھانا ہے ایک وقت تک ۔",
        "English" : "He said, :Go down, some of you enemies of some; and for you on the earth there will be a dwelling place and enjoyment for a time."
      },
      {
        "ayet_no" : 25,
        "arbi" : "قَالَ فِيْهَا تَحْيَوْنَ وَفِيْهَا تَمُوْتُوْنَ وَمِنْهَا تُخْرَجُوْنَ",
        "Urdu" : "فرمایا اس میں تم زندگی گزارو گے اور اسی میں تم مرو گے اور اسی سے تم (قیامت کے دن) نکالے جاؤ گے",
        "English" : "(Further) He said, :There you shall live and there you shall die, and from there you shall be raised again."
      },
      {
        "ayet_no" : 26,
        "arbi" : " يٰبَنِيْٓ اٰدَمَ قَدْ اَنْزَلْنَا عَلَيْكُمْ لِبَاسًا يُّوَارِيْ سَوْاٰتِكُمْ وَرِيْشًا  ۭوَلِبَاسُ التَّقْوٰى ۙ ذٰلِكَ خَيْرٌ  ۭذٰلِكَ مِنْ اٰيٰتِ اللّٰهِ لَعَلَّهُمْ يَذَّكَّرُوْنَ",
        "Urdu" : "اے آدم کی اولا! بلاشبہ ہم نے اتارا تم پر لباس جو چھپاتا ہے تمہارے ستر کو اور زینت بنادیا اور تقوی کا لباس وہ سب سے بہتر ہے، یہ اللہ کی نشانیوں میں سے ہے تاکہ وہ نصیحت حاصل کریں ۔",
        "English" : "O children of ‘Adam, We have sent down to you the dress that covers your shame and provides adornment. As for the dress of Taqwa (piety), that is the best. That is one of the signs of Allah, so that they may learn a lesson."
      },
      {
        "ayet_no" : 27,
        "arbi" : "يٰبَنِيْٓ اٰدَمَ لَا يَفْتِنَنَّكُمُ الشَّيْطٰنُ كَمَآ اَخْرَجَ اَبَوَيْكُمْ مِّنَ الْجَنَّةِ يَنْزِعُ عَنْهُمَا لِبَاسَهُمَا لِيُرِيَهُمَا سَوْاٰتِهِمَا ۭاِنَّهٗ يَرٰىكُمْ هُوَ وَقَبِيْلُهٗ مِنْ حَيْثُ لَا تَرَوْنَهُمْ ۭاِنَّا جَعَلْنَا الشَّيٰطِيْنَ اَوْلِيَاۗءَ لِلَّذِيْنَ لَا يُؤْمِنُوْنَ",
        "Urdu" : "اے آدم کی اولاد! کہیں فتنے میں نہ ڈالے تمہیں شیطان جس طرح اس نے نکلوادیا تھا تمہارے ماں باپ کو جنت سے وہ اترواتا تھا ان دونوں سے ان کا لباس تاکہ وہ دکھائے انہیں ان کے ستر ، بیشک وہ دیکھتا ہے تمہیں وہ اور اس کا قبیلہ جہاں سے نہیں تم دیکھتے انہیں بیشک ہم نے بنایا ہے شیطان کو دوست ان لوگوں کا جو ایمان نہیں لاتے",
        "English" : "O children of ‘Adam, :Do not let Satan put you in trouble the way he had your parents expelled from Paradise, having their dress removed from them, so that he could show them their shame. Indeed, he sees you _ he and his company _ from where you do not see them. Surely, We have made the devils friends to those who do not believe."
      },
      {
        "ayet_no" : 28,
        "arbi" : "وَاِذَا فَعَلُوْا فَاحِشَةً قَالُوْا وَجَدْنَا عَلَيْهَآ اٰبَاۗءَنَا وَاللّٰهُ اَمَرَنَا بِهَا  ۭقُلْ اِنَّ اللّٰهَ لَا يَاْمُرُ بِالْفَحْشَاۗءِ  ۭاَتَقُوْلُوْنَ عَلَي اللّٰهِ مَا لَا تَعْلَمُوْنَ",
        "Urdu" : "اور جب وہ کریں کوئی بے حیائی کا کام تو کہتے ہیں ہم نے پایا اس پر اپنے باپ دادا کو اور اللہ نے حکم دیا ہے ہمیں اس کا کہہ دیجیے بیشک اللہ نہیں حکم دیتا بے حیائی کا کیا تم کہتے ہو اللہ پر وہ بات جو نہیں تم جانتے ۔",
        "English" : "When they do a shameful act, they say, :We have found our fathers doing it, and Allah has ordered us to do so. Say, :Allah never orders anything shameful. Do you say about Allah what you do not know ?"
      },
      {
        "ayet_no" : 29,
        "arbi" : "قُلْ اَمَرَ رَبِّيْ بِالْقِسْطِ ۣوَاَقِيْمُوْا وُجُوْهَكُمْ عِنْدَ كُلِّ مَسْجِدٍ وَّادْعُوْهُ مُخْلِصِيْنَ لَهُ الدِّيْنَ ڛ كَمَا بَدَاَكُمْ تَعُوْدُوْنَ",
        "Urdu" : "کہہ دیجیے حکم دیا ہے میرے رب نے انصاف کا اور سیدھا رکھو اپنے چہروں کے رخ کو ہر نماز کے وقت اور پکارو اسے خالص کرتے ہوئے اس کے لیے دین کو، جیسا کہ اس نے ابتدا کی تمہاری ویسے ہی تم لوٹو گے( یعنی دوبارہ پیدا ہوگے) ۔",
        "English" : "Say, :My Lord has ordered me to do justice. Set your faces aright on each occasion of prostration, and pray to Him with pure faith in Him. Just as He has originated you, so you will be raised again."
      },
      {
        "ayet_no" : 30,
        "arbi" : "فَرِيْقًا هَدٰي وَفَرِيْقًا حَقَّ عَلَيْهِمُ الضَّلٰلَةُ   ۭاِنَّهُمُ اتَّخَذُوا الشَّيٰطِيْنَ اَوْلِيَاۗءَ مِنْ دُوْنِ اللّٰهِ وَيَحْسَبُوْنَ اَنَّهُمْ مُّهْتَدُوْنَ",
        "Urdu" : "ایک فریق کو اس نے ہدایت دی اور ایک فریق کہ ثابت ہوگئی ان پر گمراہی، بیشک انہوں نے بنالیاشیطانوں کو دوست اللہ کے سوا اور وہ گمان کرتے ہیں کہ بیشک وہ ہدایت یافتہ ہیں ۔",
        "English" : "He has led a group to guidance; and established for another group is misguidance. Indeed, they have taken the devils for their friends, instead of Allah, and they think that they are on the right path."
      },
      {
        "ayet_no" : 31,
        "arbi" : "يٰبَنِيْٓ اٰدَمَ خُذُوْا زِيْنَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ وَّكُلُوْا وَاشْرَبُوْا وَلَا تُسْرِفُوْا ۚ اِنَّهٗ لَا يُحِبُّ الْمُسْرِفِيْنَ",
        "Urdu" : "اے آدم کی اولاد، پکڑو (اختیار کرو)اپنی زینت ہر نما زکے وقت اور کھاؤ پیو اور نہ اسراف کرو، بیشک وہ نہیں پسند کرتا اسراف کرنے والوں کو ۔",
        "English" : "O children of ‘Adam, take on your adornment at every mosque. Eat and drink and do not be extravagant. Surely, He does not like the extravagant."
      },
      {
        "ayet_no" : 32,
        "arbi" : "قُلْ مَنْ حَرَّمَ زِيْنَةَ اللّٰهِ الَّتِيْٓ اَخْرَجَ لِعِبَادِهٖ وَالطَّيِّبٰتِ مِنَ الرِّزْقِ  ۭقُلْ هِىَ لِلَّذِيْنَ اٰمَنُوْا فِي الْحَيٰوةِ الدُّنْيَا خَالِصَةً يَّوْمَ الْقِيٰمَةِ ۭكَذٰلِكَ نُفَصِّلُ الْاٰيٰتِ لِقَوْمٍ يَّعْلَمُوْنَ",
        "Urdu" : "کہہ دیجیے کس نے حرام کی ہے اللہ کی زینت جو اس نے نکالی (پیدا کی) اپنے بندوں کے لیے اور پاکیزہ چیزیں رزق سے؟ کہہ دیجیے وہ ان لوگوں کے لیے ہیں جو ایمان لائے دنیوی زندگی میں اور خالص ہوں گے ان کے لیے قیامت کے دن، اسی طرح ہم تفصیل سے بیان کرتے ہیں آیات کو اس قوم کے لیے جو جانتے ہیں ۔",
        "English" : "Say, :Who has prohibited the adornment Allah has brought forth for His servants, and the wholesome things of sustenance? Say, :They are for the believers during this worldly life (though shared by others), while they are purely for them on the day of Resurrection. This is how We elaborate the verses for people who understand."
      },
      {
        "ayet_no" : 33,
        "arbi" : "قُلْ اِنَّمَا حَرَّمَ رَبِّيَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَالْاِثْمَ وَالْبَغْيَ بِغَيْرِ الْحَقِّ وَاَنْ تُشْرِكُوْا بِاللّٰهِ مَا لَمْ يُنَزِّلْ بِهٖ سُلْطٰنًا وَّاَنْ تَقُوْلُوْا عَلَي اللّٰهِ مَا لَا تَعْلَمُوْنَ",
        "Urdu" : "کہہ دیجیے درحقیقت حرام کیا ہے میرے رب نے بے حیائی کی باتوں کو جو ظاہر ہیں ان میں سے اور جو چھپی ہوئی ہیں اور گناہ کو اور بغاوت کو ناحق طریقے سے اور یہ کہ تم شریک ٹھہراؤ اللہ کے ساتھ جو کہ نہیں اس نے اتاری اس کی کوئی دلیل اور یہ کہ تم کہو اللہ پر وہ بات جو تم نہیں جانتے ہو ۔",
        "English" : "Say, :My Lord has prohibited only the shameful acts, whether open or secret, and (every) sinful act, and unjust aggression, and that you associate with Allah anything for which He has not sent any authority, and that you attribute to Allah any thing about which you do not have sure knowledge."
      },
      {
        "ayet_no" : 34,
        "arbi" : "وَلِكُلِّ اُمَّةٍ اَجَلٌ  ۚ فَاِذَا جَاۗءَ اَجَلُهُمْ لَا يَسْـتَاْخِرُوْنَ سَاعَةً وَّلَا يَسْتَقْدِمُوْنَ",
        "Urdu" : "اور ہر امت کے لیے ایک وقت مقرر ہے پھر جب آجاتا ہے ان کا وقت تو نہیں پیچھے ہوتے ایک لحظہ کے لیے اور وہ آگے ہوتے ہیں ۔",
        "English" : "For every people there is an appointed time. So, when their appointed time will come, they cannot be late for a moment, nor will they get ahead."
      },
      {
        "ayet_no" : 35,
        "arbi" : "يٰبَنِيْٓ اٰدَمَ اِمَّا يَاْتِيَنَّكُمْ رُسُلٌ مِّنْكُمْ يَـقُصُّوْنَ عَلَيْكُمْ اٰيٰتِيْ ۙ فَمَنِ اتَّقٰى وَاَصْلَحَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُوْنَ",
        "Urdu" : "اے آدم کی اولاد اگر واقعی آئیں تمہارے پاس رسول تم میں سے جو بیان کریں تم پر میری آیات تو جس نے تقوی اختیار کیا اور اصلاح کرلی تونہیں کوئی خوف ہوگا ان پر اور نہ وہ غمگین ہوں گے",
        "English" : "O children of ‘Adam, if messengers from among you come to you conveying My verses to you, then, those who fear Allah and correct themselves will have no fear, nor shall they grieve."
      },
      {
        "ayet_no" : 36,
        "arbi" : "وَالَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَا وَاسْتَكْبَرُوْا عَنْهَآ اُولٰۗىِٕكَ اَصْحٰبُ النَّارِ ۚ هُمْ فِيْهَا خٰلِدُوْنَ",
        "Urdu" : "اور وہ لوگ جنہوں نے جھٹلایا ہماری آیات کو اور تکبر کیا ان کو ماننے سے وہی ہیں دوزخ والے وہ اس میں ہمیشہ رہنے والے ہیں",
        "English" : "Those who reject Our verses and stand arrogant against them, – they are the inmates of the Fire. There they shall live forever."
      },
      {
        "ayet_no" : 37,
        "arbi" : "فَمَنْ اَظْلَمُ مِمَّنِ افْتَرٰي عَلَي اللّٰهِ كَذِبًا اَوْ كَذَّبَ بِاٰيٰتِهٖ ۭاُولٰۗىِٕكَ يَنَالُهُمْ نَصِيْبُهُمْ مِّنَ الْكِتٰبِ ۭ حَتّٰى اِذَا جَاۗءَتْهُمْ رُسُلُنَا يَتَوَفَّوْنَهُمْ ۙ قَالُوْٓا اَيْنَ مَا كُنْتُمْ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ ۭ قَالُوْا ضَلُّوْا عَنَّا وَشَهِدُوْا عَلٰٓي اَنْفُسِهِمْ اَنَّهُمْ كَانُوْا كٰفِرِيْنَ",
        "Urdu" : "پھر کون بڑا ظالم ہے اس سے جس نے باندھا اللہ پر جھوٹ یا جھٹلایا اس کی آیات کو،یہ وہ لوگ ہیں کہ پہنچے گا ان کو ان کا حصہ لکھے ہوئے سے یہاں تک کہ جب آئیں گے ان کے پاس ہمارے فرشتے فوت کریں گے انہیں تو وہ کہیں گے کہاں ہیں جنہیں تھے تم پکارتے اللہ کے سوا؟ وہ کہیں گے وہ گم ہوگئے ہم سے اور وہ گواہی دیں گے اپنے نفسوں پر یعنی اپنے خلاف کہ بیشک وہ تھے کفر کرنے والے",
        "English" : "So, who is more unjust than the one who coins a lie against Allah or rejects His signs? They shall receive their share from that (sustenance) which is written (for them in their destiny) until, when Our envoys (angels) shall come to them to take their souls away, they (the angels) will say, :Where are those (so-called gods) whom you used to invoke besides Allah? They (the unbelievers) will say, :They all have vanished from us , and they shall testify against themselves that they were unbelievers."
      },
      {
        "ayet_no" : 38,
        "arbi" : "قَالَ ادْخُلُوْا فِيْٓ اُمَمٍ قَدْ خَلَتْ مِنْ قَبْلِكُمْ مِّنَ الْجِنِّ وَالْاِنْسِ فِي النَّارِ  ۭكُلَّمَا دَخَلَتْ اُمَّةٌ لَّعَنَتْ اُخْتَهَا ۭ حَتّٰى اِذَا ادَّارَكُوْا فِيْهَا جَمِيْعًا  ۙ قَالَتْ اُخْرٰىهُمْ لِاُوْلٰىهُمْ رَبَّنَا هٰٓؤُلَاۗءِ اَضَلُّوْنَا فَاٰتِهِمْ عَذَابًا ضِعْفًا مِّنَ النَّارِ ڛ قَالَ لِكُلٍّ ضِعْفٌ وَّلٰكِنْ لَّا تَعْلَمُوْنَ",
        "Urdu" : "فرمائے گا داخل ہوجاؤ ان امتوں کی ہمراہی میں جو تحقیق گزر چکیں تم سے قبل جنوں سے اور انسانوں سے آگ میں، جب داخل ہوگی کوئی امت تو وہ لعنت کرے گی اپنی مذہبی بہن (دوسری امت) کو یہاں تک کہ جب اکٹھے ہونگے اس میں سب تو کہے گی ان کی پچھلی جماعت اپنے سے پہلی کے متعلق اے ہمارے رب یہ ہیں جنہوں نے گمراہ کیا تھا ہمیں پس دے انہیں دگنا عذاب آگ سے، فرمائے گا ہر ایک کے لیے دگنا عذاب ہے۔ اور لیکن تم نہیں جانتے",
        "English" : "He (Allah) will say, :Enter the Fire along with the peoples who passed before you from the Jinn and the human beings. Whenever a group will enter it, they will curse their fellows, until when all of them will have joined each other in it, the latter ones will say about the former ones :Our Lord, they misguided us; so, give them a double punishment of the Fire. He will say, :For each there is a double, but you do not know."
      },
      {
        "ayet_no" : 39,
        "arbi" : "وَقَالَتْ اُوْلٰىهُمْ لِاُخْرٰىهُمْ فَمَا كَانَ لَكُمْ عَلَيْنَا مِنْ فَضْلٍ فَذُوْقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْسِبُوْنَ",
        "Urdu" : "اور کہے گی ان کی پہلی اپنی پچھلی جماعت سے پس نہیں ہے تمہارے لیے ہم پر کوئی فضل برتری تو چکھو عذاب اس وجہ سے جو تھے تم کماتے",
        "English" : "The former ones will say to the latter ones, :So, you have no privilege against us. Now, taste the punishment for what you have been earning."
      },
      {
        "ayet_no" : 40,
        "arbi" : "اِنَّ الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَا وَاسْتَكْبَرُوْا عَنْهَا لَا تُفَتَّحُ لَهُمْ اَبْوَابُ السَّمَاۗءِ وَلَا يَدْخُلُوْنَ الْجَنَّةَ حَتّٰي يَلِجَ الْجَمَلُ فِيْ سَمِّ الْخِيَاطِ ۭوَكَذٰلِكَ نَجْزِي الْمُجْرِمِيْنَ",
        "Urdu" : "بیشک وہ لوگ جنہوں نے جھٹلایا ہماری آیتوں کو اور تکبر کیا ان کو قبول کرنے سے نہیں کھولے جائیں گے ان کے لیے آسمان کے دروازے اور نہ وہ داخل ہوں گے جنت میں یہاں تک کہ داخل ہوجائے اونٹ سوائی کے ناکے میں اور اسی طرح ہم بدلہ دیتے ہیں مجرموں کو",
        "English" : "Surely, those who have rejected Our signs and stood arrogant against them, the gates of the heavens shall not be opened for them, and they shall not enter Paradise unless a camel passes through the eye of a needle. This is how We recompense the sinners."
      },
      {
        "ayet_no" : 41,
        "arbi" : "لَهُمْ مِّنْ جَهَنَّمَ مِهَادٌ وَّمِنْ فَوْقِهِمْ غَوَاشٍ ۭوَكَذٰلِكَ نَجْزِي الظّٰلِمِيْنَ",
        "Urdu" : "ان کے لیے جہنم ہی کا بچھونا ہوگا اور ان کے اوپر اسی کا اوڑھنا ہوگا اور اسی طرح ہم بدلہ دیتے ہیں ظالموں کو",
        "English" : "For them there is a bed from the Jahannam, and over them there are coverings. This is how We recompense the transgressors."
      },
      {
        "ayet_no" : 42,
        "arbi" : "وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَا نُكَلِّفُ نَفْسًا اِلَّا وُسْعَهَآ   ۡ اُولٰۗىِٕكَ اَصْحٰبُ الْجَنَّةِ ۚ هُمْ فِيْهَا خٰلِدُوْنَ",
        "Urdu" : "اور وہ لوگ جو ایمان لائے اور انہوں نے عمل کیے نیک، نہیں ہم تکلیف دیتے کسی جان کو مگر اس کی طاقت کے مطابق، وہی لوگ ہیں جنت والے وہ اس میں ہمیشہ رہنے والے ہیں",
        "English" : "Those who believe and do good deeds,__We do not obligate anyone beyond his capacity___they are the people of Paradise; they shall remain there for ever."
      },
      {
        "ayet_no" : 43,
        "arbi" : "وَنَزَعْنَا مَا فِيْ صُدُوْرِهِمْ مِّنْ غِلٍّ تَجْرِيْ مِنْ تَحْتِهِمُ الْاَنْھٰرُ ۚ وَقَالُوا الْحَمْدُ لِلّٰهِ الَّذِيْ هَدٰىنَا لِھٰذَا ۣ وَمَا كُنَّا لِنَهْتَدِيَ لَوْلَآ اَنْ هَدٰىنَا اللّٰهُ ۚ لَقَدْ جَاۗءَتْ رُسُلُ رَبِّنَا بِالْحَقِّ ۭ وَنُوْدُوْٓا اَنْ تِلْكُمُ الْجَنَّةُ اُوْرِثْتُمُوْهَا بِمَا كُنْتُمْ تَعْمَلُوْنَ",
        "Urdu" : "اور ہم نکال دیں جو ان کے سینوں میں کوئی کینہ ہوگا بہتی ہوں گی ان کے نیچے سے نہریں اور وہ کہیں گے سب تعریف اللہ کے لیے جس نے ہدایت دی ہمیں اس کی اور نہ تھے ہم کہ ہدایت پاتے اگر نہ یہ کہ اللہ ہمیں ہدایت دیتا بلاشبہ آئے ہمارے رب کے رسول حق کے ساتھ اور وہ آواز دیے جائیں گے کہ یہ جنت ہے تم وارث بنائے گئے ہو اس کے اس وجہ سے جو تھے تم عمل کرتے",
        "English" : "We will remove whatever amount of malice they had in their hearts. Rivers will flow beneath them, and they will say, :All praise is to Allah who has guided us to this. We would not have been able to find the way, had Allah not guided us. Surely, the messengers of our Lord came with the truth. Then they will receive a call, :Here is the Paradise which you have been made to inherit because of the deeds you have been doing."
      },
      {
        "ayet_no" : 44,
        "arbi" : "وَنَادٰٓي اَصْحٰبُ الْجَنَّةِ اَصْحٰبَ النَّارِ اَنْ قَدْ وَجَدْنَا مَا وَعَدَنَا رَبُّنَا حَقًّا فَهَلْ وَجَدْتُّمْ مَّا وَعَدَ رَبُّكُمْ حَقًّا   ۭقَالُوْا نَعَمْ ۚ فَاَذَّنَ مُؤَذِّنٌۢ بَيْنَهُمْ اَنْ لَّعْنَةُ اللّٰهِ عَلَي الظّٰلِمِيْنَ",
        "Urdu" : "اور آواز دیں گے جنت والے دوزخ والوں کو کہ واقعی ہم نے پایا ہے جو عدہ کیا تھا ہم سے ہمارے رب نے اس کو سچ تو کیا تم نے بھی پایا ہے جو وعدہ کیا تھا تمہارے رب نے سچا، وہ کہیں گے ہاں! تو اعلان کرے گا ایک اعلان کرنے والا ان کے درمیان کہ اللہ کی لعنت ہو ظالموں پر ۔",
        "English" : "The inmates of Paradise will call out to the inmates of the Fire: :We have found true what our Lord had promised to us. Have you, too, found true what your Lord had promised? They will say, :Yes. Then, an announcer between them will call out, :The curse of Allah is on the wrongdoers"
      },
      {
        "ayet_no" : 45,
        "arbi" : "الَّذِيْنَ يَصُدُّوْنَ عَنْ سَبِيْلِ اللّٰهِ وَيَبْغُوْنَهَا عِوَجًا ۚ وَهُمْ بِالْاٰخِرَةِ كٰفِرُوْنَ",
        "Urdu" : "وہ لوگ جو روکتے تھے اللہ کے راستے سے اور تلاش کرتے تھے اس میں کجی اور وہ آخرت کا انکار کرنے والے تھے",
        "English" : "Who used to turn themselves away from the way of Allah, seeking to make it crooked, while they were the deniers of the Hereafter."
      },
      {
        "ayet_no" : 46,
        "arbi" : " وَبَيْنَهُمَا حِجَابٌ ۚ وَعَلَي الْاَعْرَافِ رِجَالٌ يَّعْرِفُوْنَ كُلًّاۢ بِسِيْمٰىهُمْ ۚ وَنَادَوْا اَصْحٰبَ الْجَنَّةِ اَنْ سَلٰمٌ عَلَيْكُمْ   ۣ لَمْ يَدْخُلُوْهَا وَهُمْ يَطْمَعُوْنَ",
        "Urdu" : "اور ان دونوں کے درمیان ایک پردہ ہوگا اور اعراف پر کچھ آدمی ہوں گے وہ پہچانتے ہوں گے ہر ایک کو ان کی نشانی سے اور وہ آواز دیں گے جنت والوں کہ سلامتی ہو تم پر نہ داخل ہوئے ہوں گے اس بہشت میں اور وہ جنت میں داخل ہونیکی امید رکھتے ہوں گے ۔",
        "English" : "Between the two groups there will be a barrier. And on A_raf (the Heights) there shall be people who will recognize each group through their signs, and they will call out to the people of Paradise, :Peace on you. They will not have entered it, yet they will hope to."
      },
      {
        "ayet_no" : 47,
        "arbi" : "وَاِذَا صُرِفَتْ اَبْصَارُهُمْ تِلْقَاۗءَ اَصْحٰبِ النَّارِ ۙ قَالُوْا رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظّٰلِمِيْنَ",
        "Urdu" : "اور جب پھیری جائیں گی ان کی نگاہیں آگ والوں کی طرف تو کہیں گے اے ہمارے رب نہ شامل کر ہمیں ظالم قوم کے ساتھ",
        "English" : "When their eyes will be turned to the people of the Fire, they will say, :Our Lord, do not join us with the unjust people."
      },
      {
        "ayet_no" : 48,
        "arbi" : " وَنَادٰٓي اَصْحٰبُ الْاَعْرَافِ رِجَالًا يَّعْرِفُوْنَهُمْ بِسِيْمٰىهُمْ قَالُوْا مَآ اَغْنٰى عَنْكُمْ جَمْعُكُمْ وَمَا كُنْتُمْ تَسْتَكْبِرُوْنَ",
        "Urdu" : "اور آواز دیں گے اعراف والے کچھ مردوں کو وہ پہچانتے ہوں گے انہیں ان کی نشانی سے کہیں گے نہ کام آئی تمہیں تمہاری جماعت اور نہ وہ جو تھے تم تکبر کرتے",
        "English" : "The people of A_raf will call out to the people (of Fire) whom they will recognize through their signs: :Your masses were not of any help to you, nor was the arrogance you used to show."
      },
      {
        "ayet_no" : 49,
        "arbi" : "اَهٰٓؤُلَاۗءِ الَّذِيْنَ اَقْسَمْتُمْ لَا يَنَالُهُمُ اللّٰهُ بِرَحْمَةٍ ۭ اُدْخُلُوا الْجَنَّةَ لَا خَوْفٌ عَلَيْكُمْ وَلَآ اَنْتُمْ تَحْزَنُوْنَ",
        "Urdu" : "کیا یہی ہیں جن کے متعلق تم نے قسمیں کھائیں کہ نہیں پہنچائے گا انہیں اللہ کوئی رحمت مومنو داخل ہوجاؤ جنت میں نہ کوئی خوف تم پر اور نہ تم غمگین ہوگے ۔",
        "English" : "Is it these (people of Paradise) about whom you swore that Allah would not allow His mercy to reach them? (It will be said to such people,) :Enter Paradise; there will be no fear for you, nor shall you grieve."
      },
      {
        "ayet_no" : 50,
        "arbi" : "وَنَادٰٓي اَصْحٰبُ النَّارِ اَصْحٰبَ الْجَنَّةِ اَنْ اَفِيْضُوْا عَلَيْنَا مِنَ الْمَاۗءِ اَوْ مِمَّا رَزَقَكُمُ اللّٰهُ  ۭ قَالُوْٓا اِنَّ اللّٰهَ حَرَّمَهُمَا عَلَي الْكٰفِرِيْنَ",
        "Urdu" : "اور آواز دیں گے دوزخ والے جنت والوں کو کہ ڈالو ہم پر کچھ پانی یا اس سے جو رزق دیا ہے تمہیں اللہ نے، وہ کہیں گے بیشک اللہ نے حرام کردیا ہے ان دونوں کو کافروں پر",
        "English" : "The people of the Fire will call out to the people of Paradise, :Pour on us some water, or some of what Allah has provided you. They will say, :Allah has prohibited these for disbelievers,"
      },
      {
        "ayet_no" : 51,
        "arbi" : "الَّذِيْنَ اتَّخَذُوْا دِيْنَهُمْ لَهْوًا وَّلَعِبًا وَّغَرَّتْهُمُ الْحَيٰوةُ الدُّنْيَا ۚ فَالْيَوْمَ نَنْسٰىهُمْ كَمَا نَسُوْا لِقَاۗءَ يَوْمِهِمْ ھٰذَا ۙ وَمَا كَانُوْا بِاٰيٰتِنَا يَجْحَدُوْنَ",
        "Urdu" : "وہ لوگ جنہوں نے بنالیا اپنے دین کو تماشا اور کھیل اور دھوکے میں ڈالے رکھا انہیں دنیو زندگی نے تو آج ہم بھلادیں گے انہیں جیسا کہ انہوں بھلادیا تھا اپنے اس دن ملاقات کو اور جو تھے وہ ہماری آیتوں کا انکار کرتے",
        "English" : "Who took their religion as a sport and a play and whom the life of the world beguiled. So today We will forget them even as they forget the meeting of this their Day and as they were ever gainsaying Our signs."
      },
      {
        "ayet_no" : 52,
        "arbi" : "وَلَقَدْ جِئْنٰهُمْ بِكِتٰبٍ فَصَّلْنٰهُ عَلٰي عِلْمٍ هُدًى وَّرَحْمَةً لِّقَوْمٍ يُّؤْمِنُوْنَ",
        "Urdu" : "اور البتہ تحقیق ہم لائے ان کے پاس ایسی کتاب کہ ہم نے تفصیل سے بیان کیا ہے اسے علم کی بنیاد پر ہدایت اور رحمت بنا کر اس قوم کے لیے جو ایمان رکھتے ہیں",
        "English" : "Surely We have brought them a book that We have elaborated with knowledge, as guidance and mercy for a people who believe."
      },
      {
        "ayet_no" : 53,
        "arbi" : "هَلْ يَنْظُرُوْنَ اِلَّا تَاْوِيْلَهٗ ۭ يَوْمَ يَاْتِيْ تَاْوِيْلُهٗ يَقُوْلُ الَّذِيْنَ نَسُوْهُ مِنْ قَبْلُ قَدْ جَاۗءَتْ رُسُلُ رَبِّنَا بِالْحَقِّ ۚ فَهَلْ لَّنَا مِنْ شُفَعَاۗءَ فَيَشْفَعُوْا لَنَآ اَوْ نُرَدُّ فَنَعْمَلَ غَيْرَ الَّذِيْ كُنَّا نَعْمَلُ ۭقَدْ خَسِرُوْٓا اَنْفُسَهُمْ وَضَلَّ عَنْهُمْ مَّا كَانُوْا يَفْتَرُوْنَ",
        "Urdu" : "نہیں وہ انتظار کرتے مگر اس کے انجام قیامت کا جس دن وہ آئے گااس کا انجام کہیں گے وہ لوگ جنہوں نے بھلادیا تھا اسے اس سے پہلے بلاشبہ آئے تھے ہمارے رب کے رسول حق کے ساتھ تو کیا ہمارے لیے کوئی سفارشی ہیں کہ پس وہ سفارش کریں ہمارے لیے یا لوٹادیے جائیں تو ہم عمل کریں گے علاوہ اس کے جو تھے ہم عمل کرتے بلاشبہ انہوں نے خسارے میں ڈالااپنی جانوں کو اور گم ہوگیا ان سے جو تھے وہ افترا باندھتے",
        "English" : "They are waiting for nothing but its final result (i.e. the punishment promised in the Qur‘an). The day when its final result will come, those who had ignored it earlier will say, :Surely, the messengers of our Lord had come with truth. So, are there any intercessors for us who could intercede in our favor? Or, could we be sent back, so that we might do contrary to what we used to do? Indeed, they have put their selves to loss, and vanished from them all that they used to fabricate."
      },
      {
        "ayet_no" : 54,
        "arbi" : " اِنَّ رَبَّكُمُ اللّٰهُ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ فِيْ سِتَّةِ اَيَّامٍ ثُمَّ اسْتَوٰى عَلَي الْعَرْشِ يُغْشِي الَّيْلَ النَّهَارَ يَطْلُبُهٗ حَثِيْثًا   ۙ وَّالشَّمْسَ وَالْقَمَرَ وَالنُّجُوْمَ مُسَخَّرٰتٍۢ بِاَمْرِهٖ  ۭاَلَا لَهُ الْخَلْقُ وَالْاَمْرُ  ۭ تَبٰرَكَ اللّٰهُ رَبُّ الْعٰلَمِيْنَ",
        "Urdu" : "بیشک تمہارا رب اللہ ہے جس نے پیدا کیا آسمانوں کو اور نہ زمین کو چھ دنوں پھر جا ٹھہرا عرش پر وہ ڈھانپتا ہے رات کو دن سے وہ پیچھے آتا ہے اس کے تیزی سے اور اسی نے پیدا کیا سورج اور چاند ستاروں کو (اس حال میں کہ)وہ تابع کیے ہوئے ہیں اس کے حکم کے، آگاہ رہو! اسی کے لیے ہے پیدا کرنا اور حکم دیینا، بہت برکت والا ہے اللہ جو سب جہانوں کا رب ہے",
        "English" : "Surely, your Lord is Allah who created the heavens and the earth in six days, then He positioned himself on the Throne. He covers the day with the night that pursues it swiftly. (He created) the sun and the moon and the stars, subjugated to His command. Lo! To Him alone belong the creation and the command. Glorious is Allah, the Lord of all the worlds."
      },
      {
        "ayet_no" : 55,
        "arbi" : "اُدْعُوْا رَبَّكُمْ تَضَرُّعًا وَّخُفْيَةً ۭاِنَّهٗ لَا يُحِبُّ الْمُعْتَدِيْنَ",
        "Urdu" : "تم پکارو اپنے رب کو عاجزی اور چپکے چپکے بیشک وہ نہیں پسند کرتا حد سے بڑھنے والوں کو",
        "English" : "Supplicate to your Lord humbly and secretly. Surely, He does not like those who cross the limits."
      },
      {
        "ayet_no" : 56,
        "arbi" : " وَلَا تُفْسِدُوْا فِي الْاَرْضِ بَعْدَ اِصْلَاحِهَا وَادْعُوْهُ خَوْفًا وَّطَمَعًا   ۭاِنَّ رَحْمَتَ اللّٰهِ قَرِيْبٌ مِّنَ الْمُحْسِنِيْنَ",
        "Urdu" : "اور نہ فساد پھیلاؤ زمین میں اس کی اصلاح کے بعد اور پکارو اسے ڈرتے ہوئے اور طمع کرتے ہوئے بیشک اللہ کی رحمت قریب ہے نیکی کرنے والوں سے ۔",
        "English" : "Do not make mischief on the earth after it has been set in order. Supplicate Him in fear and hope. Surely, the mercy of Allah is close to those who are good in their deeds."
      },
      {
        "ayet_no" : 57,
        "arbi" : "وَهُوَ الَّذِيْ يُرْسِلُ الرِّيٰحَ بُشْرًۢا بَيْنَ يَدَيْ رَحْمَتِهٖ ۭ حَتّٰى اِذَآ اَقَلَّتْ سَحَابًا ثِقَالًا سُقْنٰهُ لِبَلَدٍ مَّيِّتٍ فَاَنْزَلْنَا بِهِ الْمَاۗءَ فَاَخْرَجْنَا بِهٖ مِنْ كُلِّ الثَّمَرٰتِ ۭكَذٰلِكَ نُخْرِجُ الْمَوْتٰى لَعَلَّكُمْ تَذَكَّرُوْنَ",
        "Urdu" : "اور وہی ہے جو بھیجتا ہے ہوائیں خوشخبری بناکراپنی رحمت بارش سے پہلے یہاں تک کہ جب اٹھا لاتی ہے بھاری بادل ہم ہانک دیتے ہیں اسے مردہ شہر زمین کی طرف پھر ہم اتارتے ہیں اس سے پانی ، پھر ہم نکالتے ہیں اس کے ذریعے ہر قسم کے پھل، اسی طرح ہم نکالیں گے مردوں کو تاکہ تم نصیحت حاصل کرو ۔",
        "English" : "He is the One who sends the winds carrying good news before His blessings, until when they lift up the heavy clouds, We drive them to a dead land. Then, there We pour down water. Then, We bring forth with it all sorts of fruits. In similar way, We will bring forth all the dead. (All this is being explained to you), so that you may learn a lesson."
      },
      {
        "ayet_no" : 58,
        "arbi" : "وَالْبَلَدُ الطَّيِّبُ يَخْرُجُ نَبَاتُهٗ بِاِذْنِ رَبِّهٖ ۚ وَالَّذِيْ خَبُثَ لَا يَخْرُجُ اِلَّا نَكِدًا   ۭ كَذٰلِكَ نُصَرِّفُ الْاٰيٰتِ لِقَوْمٍ يَّشْكُرُوْنَ",
        "Urdu" : "اور عمدہ(زرخیز) شہر(زمین) نکلتی ہے اس کی کھیتی اس کے رب کے حکم سے اور جو زمین خراب ہے نہیں نکلتی اس کی کھیتی مگر ناقص اسی طرح ہم پھیر پھیر کر بیان کرتے ہیں آیات کو اس قوم کے لیے جو شکر کر تے ہیں",
        "English" : "As for a good land, its vegetation comes out with the permission of its Lord. But that which is bad does not grow except what is bad. Thus We alternate the verses in various ways for a people who pay gratitude."
      },
      {
        "ayet_no" : 59,
        "arbi" : "لَقَدْ اَرْسَلْنَا نُوْحًا اِلٰي قَوْمِهٖ فَقَالَ يٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗ ۭ اِنِّىْٓ اَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيْمٍ",
        "Urdu" : "بلاشبہ ہم بھیجا نوح کو اس کی قوم کی طرف تو اس نے کہا اے میری قوم عبادت کرو اللہ کی نہیں ہے تمہارے لیے کوئی معبود اس کے سوا بیشک میں ڈرتا ہوں تم پر بڑے دن کے عذاب سے",
        "English" : "Surely We sent NuH to his people. So he said, :O my people, worship Allah. You have no god other than Him. I fear for you the punishment of a great Day."
      },
      {
        "ayet_no" : 60,
        "arbi" : "قَالَ الْمَلَاُ مِنْ قَوْمِهٖٓ اِنَّا لَنَرٰكَ فِيْ ضَلٰلٍ مُّبِيْنٍ",
        "Urdu" : "کہا سرداروں نے اس کی قوم میں سے بیشک ہم یقینا دیکھ رہے ہیں تجھے کھلی گمراہی میں",
        "English" : "The chiefs of his people said, :Indeed we see you in an obvious error."
      },
      {
        "ayet_no" : 61,
        "arbi" : "قَالَ يٰقَوْمِ لَيْسَ بِيْ ضَلٰلَةٌ وَّلٰكِنِّيْ رَسُوْلٌ مِّنْ رَّبِّ الْعٰلَمِيْنَ",
        "Urdu" : "اس نے کہا اے میری قوم انہیں ہے مجھ کو کوئی گمراہی اور لیکن میں رسول ہوں جہانوں کے رب کی طرف سے",
        "English" : "He said, :O my people, there is no error in me, but I am a messenger from the Lord of all the worlds."
      },
      {
        "ayet_no" : 62,
        "arbi" : "اُبَلِّغُكُمْ رِسٰلٰتِ رَبِّيْ وَاَنْصَحُ لَكُمْ وَاَعْلَمُ مِنَ اللّٰهِ مَا لَا تَعْلَمُوْنَ",
        "Urdu" : "میں پہنچاتا ہوں تمہیں پیغامات اپنے رب کے اور میں خیرخواہی کرتا ہوں تمہاری اور میں جانتاہوں اللہ کی طرف سے کچھ جو تم نہیں جانتے",
        "English" : "I convey to you the messages of my Lord and wish your betterment, and I know from Allah what you do not know."
      },
      {
        "ayet_no" : 63,
        "arbi" : "اَوَعَجِبْتُمْ اَنْ جَاۗءَكُمْ ذِكْرٌ مِّنْ رَّبِّكُمْ عَلٰي رَجُلٍ مِّنْكُمْ لِيُنْذِرَكُمْ وَلِتَتَّقُوْا وَلَعَلَّكُمْ تُرْحَمُوْنَ",
        "Urdu" : "اور کیا تم نے تعجب کیا ہے کہ آئی ہے تمہارے پاس نصیحت تمہارے رب کی طرف ایک ایسے آدمی پر جو تم میں سے تاکہ وہ ڈرائے تمہیں اور تاکہ تم بچ جاؤ اور تاکہ تم رحم کیے جاؤ",
        "English" : "Do you wonder that an advice from your Lord has come to you through a man from among you, so that he may warn you and that you may fear Allah, and that you may be blessed with mercy ?"
      },
      {
        "ayet_no" : 64,
        "arbi" : "فَكَذَّبُوْهُ فَاَنْجَيْنٰهُ وَالَّذِيْنَ مَعَهٗ فِي الْفُلْكِ وَاَغْرَقْنَا الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَا  ۭاِنَّهُمْ كَانُوْا قَوْمًا عَمِيْنَ",
        "Urdu" : "پھر انہوں نے جھٹلایا اسے تو ہم نے بچالیا اسے اور ان لوگوں کو جو اس کے ساتھ تھے کشتی میں اور ہم نے غرق کردیا ان لوگوں کو جنہوں نے جھٹلایا ہماری آیات کو یقینا وہ تھے اندھے لوگ",
        "English" : "Then, they accused him of falsehood; so We saved him, and those with him in the Ark, and drowned those who rejected Our signs. Certainly, they were a blind people."
      },
      {
        "ayet_no" : 65,
        "arbi" : "وَاِلٰي عَادٍ اَخَاهُمْ هُوْدًا ۭقَالَ يٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗ ۭ اَفَلَا تَتَّقُوْنَ",
        "Urdu" : "اور قوم عادکی طرف ان کے بھائی ہود کو (بھیجا)اس نے کہا اے میری قوم! صرف اللہ کی عبادت کرو نہیں ہے تمہارے لیے کوئی معبود اس کے علاوہ تو کیا تم ڈرتے نہیں",
        "English" : "To _Ad, We sent their brother Hud. He said, :O my people, worship Allah; you have no god other than Him. So, will you not fear Allah?"
      },
      {
        "ayet_no" : 66,
        "arbi" : "قَالَ الْمَلَاُ الَّذِيْنَ كَفَرُوْا مِنْ قَوْمِهٖٓ اِنَّا لَنَرٰكَ فِيْ سَفَاهَةٍ وَّاِنَّا لَنَظُنُّكَ مِنَ الْكٰذِبِيْنَ",
        "Urdu" : "کہا ان سرداروں نے جنہوں نے کفر کیا اس کی قوم میں سے بیشک ہم یقینا دیکھتے ہیں تجھے بے وقوفی میں، اور بیشک ہم یقینا خیال کرتے ہیں تجھے جھوٹوں میں سے",
        "English" : "Said the chiefs of his people who disbelieved, :Indeed, we see you in folly, and we believe you are one of the liars."
      },
      {
        "ayet_no" : 67,
        "arbi" : "قَالَ يٰقَوْمِ لَيْسَ بِيْ سَفَاهَةٌ وَّلٰكِنِّيْ رَسُوْلٌ مِّنْ رَّبِّ الْعٰلَمِيْنَ",
        "Urdu" : "اس نے کہا اے میری قوم! انہیں ہے مجھ کو کوئی بے وقوفی اور لیکن میں تو رسول ہوں تمام جہانوں کے رب کی طرف سے ۔",
        "English" : "He said, :O my people, there is no folly in me, but I am a messenger from the Lord of all the worlds."
      },
      {
        "ayet_no" : 68,
        "arbi" : "اُبَلِّغُكُمْ رِسٰلٰتِ رَبِّيْ وَاَنَا لَكُمْ نَاصِحٌ اَمِيْنٌ",
        "Urdu" : "میں پہنچاتا ہوں تمہیں پیغامات اپنے رب کے اور میں تمہارے لیے ایک خیرخواہ امین ہوں ۔",
        "English" : "I convey to you the messages of my Lord; and I am an honest well-wisher for you."
      },
      {
        "ayet_no" : 69,
        "arbi" : "اَوَعَجِبْتُمْ اَنْ جَاۗءَكُمْ ذِكْرٌ مِّنْ رَّبِّكُمْ عَلٰي رَجُلٍ مِّنْكُمْ لِيُنْذِرَكُمْ ۭ وَاذْكُرُوْٓا اِذْ جَعَلَكُمْ خُلَفَاۗءَ مِنْۢ بَعْدِ قَوْمِ نُوْحٍ وَّزَادَكُمْ فِي الْخَلْقِ بَصْۜطَةً ۚ فَاذْكُرُوْٓا اٰلَاۗءَ اللّٰهِ لَعَلَّكُمْ تُفْلِحُوْنَ",
        "Urdu" : "اور کیا تم نے تعجب کیا ہے اس پر کہ آئی ہے تمہارے پاس نصیحت تمہارے رب کی طرف سے ایک ایسے آدمی پر جو تم میں سے ہے تاکہ وہ ڈرائے تمہیں اور یاد کرو جب اس نے بنایا تمہیں جانشین نوح کی قوم کے بعد اور زیادہ دیا تمہیں قدوقامت میں پھیلاؤ سو یاد کرو اللہ کی نعمتوں کو تاکہ تم فلاح پاجاؤ",
        "English" : "Do you wonder that an advice from your Lord has come to you through a man from among you, so that he may warn you? And remember when He made you successors after the people of NuH and gave you increased strength in physique. So, be mindful of the bounties of Allah, so that you may be successful."
      },
      {
        "ayet_no" : 70,
        "arbi" : "قَالُوْٓا اَجِئْتَنَا لِنَعْبُدَ اللّٰهَ وَحْدَهٗ وَنَذَرَ مَا كَانَ يَعْبُدُ اٰبَاۗؤُنَا  ۚ فَاْتِنَا بِمَا تَعِدُنَآ اِنْ كُنْتَ مِنَ الصّٰدِقِيْنَ",
        "Urdu" : "انہوں نے کہا کیا تو آیا ہے ہمارے پاس اس لیے کہ ہم عبادت کریں اس اکیلے اللہ کی اور ہم چھوڑدیں اسے جو تھے عبادت کرتے ہمارے باپ دادا، پس لے آئے ہمارے پاس اس کو جو وعدہ کرتا ہے ہم سے اگر ہے تو سچوں میں سے",
        "English" : "They said, :Have you come to us that we should worship Allah alone and give up what our fathers used to worship? Now, bring upon us that (scourge) with which you threaten us if you are one of the truthful."
      },
      {
        "ayet_no" : 71,
        "arbi" : "قَالَ قَدْ وَقَعَ عَلَيْكُمْ مِّنْ رَّبِّكُمْ رِجْسٌ وَّغَضَبٌ ۭ اَتُجَادِلُوْنَنِيْ فِيْٓ اَسْمَاۗءٍ سَمَّيْتُمُوْهَآ اَنْتُمْ وَاٰبَاۗؤُكُمْ مَّا نَزَّلَ اللّٰهُ بِهَا مِنْ سُلْطٰنٍ ۭ فَانْتَظِرُوْٓا اِنِّىْ مَعَكُمْ مِّنَ الْمُنْتَظِرِيْنَ",
        "Urdu" : "اس نے کہا یقینا ثابت ہوگیا تم پر تمہارے رب کی طرف سے عذاب اور غضب۔ (غصہ) کیا تم جھگڑتے ہو مجھ سے ان ناموں کے بارے میں کہ رکھ لیا ہے انہیں تم نے اور تمہارے باپ دادا نے نہیں اتاری اللہ نے اس کی کوئی دلیل۔ پس انتظارکرو بیشک میں بھی تمہارے ساتھ انتظار کرنے والوں میں سے ہوں ۔",
        "English" : "He said, :The punishment and the anger from your Lord have fallen upon you. Do you quarrel with me about mere names that you and your fathers have concocted and for which Allah has sent down no authority? So, wait. I am one of those waiting with you."
      },
      {
        "ayet_no" : 72,
        "arbi" : "فَاَنْجَيْنٰهُ وَالَّذِيْنَ مَعَهٗ بِرَحْمَةٍ مِّنَّا وَقَطَعْنَا دَابِرَ الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَا وَمَا كَانُوْا مُؤْمِنِيْنَ",
        "Urdu" : "تو نجات دی ہم نے اسے اور ان لوگوں کو جو اس کے ساتھ تھے رحمت کے ساتھ اپنی طرف سے اور کاٹ دی ہم نے جڑ ان لوگوں کی جنہوں نے جھٹلایا ہماری آیات کو اور وہ نہ تھے ایمان لانیوالے ۔",
        "English" : "So, We saved him and those with him out of mercy from Us, and We eradicated those who rejected Our signs. They were not believers."
      },
      {
        "ayet_no" : 73,
        "arbi" : "وَاِلٰي ثَمُوْدَ اَخَاهُمْ صٰلِحًا ۘ قَالَ يٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗ ۭقَدْ جَاۗءَتْكُمْ بَيِّنَةٌ مِّنْ رَّبِّكُمْ ۭهٰذِهٖ نَاقَةُ اللّٰهِ لَكُمْ اٰيَةً فَذَرُوْهَا تَاْكُلْ فِيْٓ اَرْضِ اللّٰهِ وَلَا تَمَسُّوْهَا بِسُوْۗءٍ فَيَاْخُذَكُمْ عَذَابٌ اَلِيْمٌ",
        "Urdu" : "اور قوم ثمود کی طرف ان کے بھائی صالح کو اس نے کہا اے میری ! عبادت کرو اللہ کی نہیں تمہارے لیے کوئی معبود اس کے سوا، یقینا آچکی ہے تمہارے پاس واضح دلیل تمہارے رب کی طرف سے، یہ اللہ کی اونٹنی تمہارے لیے نشانی ہے تو چھوڑدو اسے کہ وہ کھاتی پھرے اللہ کی زمین میں اور ہ ہاتھ لگانااسے برائی کے ارادے سے تو پکڑ لے گا تمہیں دردناک عذاب",
        "English" : "To Thamud, (We sent) their brother, SaliH. He said, :O my people, worship Allah. You have no god other than Him. There has come to you a clear sign from your Lord. This is the she-camel of Allah, a sign for you. So, leave her to eat on the earth of Allah, and do not touch her with mischief, lest a painful punishment should seize you."
      },
      {
        "ayet_no" : 74,
        "arbi" : "وَاذْكُرُوْٓا اِذْ جَعَلَكُمْ خُلَفَاۗءَ مِنْۢ بَعْدِ عَادٍ وَّبَوَّاَكُمْ فِي الْاَرْضِ تَتَّخِذُوْنَ مِنْ سُهُوْلِهَا قُصُوْرًا وَّتَنْحِتُوْنَ الْجِبَالَ بُيُوْتًا  ۚ فَاذْكُرُوْٓا اٰلَاۗءَ اللّٰهِ وَلَا تَعْثَوْا فِي الْاَرْضِ مُفْسِدِيْنَ",
        "Urdu" : "اور یاد کرو جب اس نے بنایا تمہیں جانشین عاد کے بعد اور اس نے ٹھکانا دیا تمہیں زمین میں تم بناتے ہو اس کی نرم مٹی سے محل اور تراشتے ہو تم پہاڑوں کو گھرو ں کی صورت میں پس یاد کرو اللہ کی نعمتوں کو اور مت پھرو زمین میں فسادی بن کر ۔",
        "English" : "Remember when He made you successors after _Ad and lodged you on earth (whereby) you make castles in its plains and hew out the mountains to build houses. So be mindful of the bounties of Allah, and do not go about the earth spreading disorder."
      },
      {
        "ayet_no" : 75,
        "arbi" : "قَالَ الْمَلَاُ الَّذِيْنَ اسْتَكْبَرُوْا مِنْ قَوْمِهٖ لِلَّذِيْنَ اسْتُضْعِفُوْا لِمَنْ اٰمَنَ مِنْهُمْ اَتَعْلَمُوْنَ اَنَّ صٰلِحًا مُّرْسَلٌ مِّنْ رَّبِّهٖ ۭقَالُوْٓا اِنَّا بِمَآ اُرْسِلَ بِهٖ مُؤْمِنُوْنَ",
        "Urdu" : "کہا ان سرداروں نے جنہوں نے تکبر کیا اس کی قوم میں سے ان لوگوں سے جو کمزور سمجھے جاتے تھے ان سے جو ایمان لے آئے ان میں سے کیا تم جانتے ہو کہ واقعی صالح بھیجا ہوا ہے اپنے رب کی طرف سے انہوں نے کہا بیشک ہم اس چیز پر جو کہ وہ بھیجا گیا ہے اس کے ساتھ ایمان لانیوالے ہیں ۔",
        "English" : "The haughty chiefs of his people said to those of the oppressed who had believed (in the Messenger), :Do you know for sure that SaliH is a messenger from his Lord? They said, :Of course, we believe in what he has been sent with."
      },
      {
        "ayet_no" : 76,
        "arbi" : "قَالَ الَّذِيْنَ اسْتَكْبَرُوْٓا اِنَّا بِالَّذِيْٓ اٰمَنْتُمْ بِهٖ كٰفِرُوْنَ",
        "Urdu" : "کہا ان لوگوں نے جنہوں نے تکبر کیا بیشک ہم اس کا جو کہ تم ایمان لائے ہو اس پر انکار کرنیوالے ہیں",
        "English" : "The haughty people said, :As for us, we disbelieve in what you believe."
      },
      {
        "ayet_no" : 77,
        "arbi" : "فَعَقَرُوا النَّاقَةَ وَعَتَوْا عَنْ اَمْرِ رَبِّهِمْ وَقَالُوْا يٰصٰلِحُ ائْتِنَا بِمَا تَعِدُنَآ اِنْ كُنْتَ مِنَ الْمُرْسَلِيْنَ",
        "Urdu" : "پھر انہوں نے کاٹ ڈالا اونٹنی کی ٹانگوں کو اور سرکشی کی اپنے رب کے حکم سے اور کہنے لگے اے صالح لے آ ہم پر اس عذاب کو جس کا تو وعدہ کرتا ہے ہم سے اگر ہے تو واقعی رسولوں میں سے",
        "English" : "Then they slaughtered the she-camel and defied the command of their Lord and said, :O SaliH, bring to us what you threaten us with, if you are one of the messengers."
      },
      {
        "ayet_no" : 78,
        "arbi" : "فَاَخَذَتْهُمُ الرَّجْفَةُ فَاَصْبَحُوْا فِيْ دَارِهِمْ جٰثِمِيْنَ",
        "Urdu" : "تو پکڑ لیاان کو زلزلے نے تو وہ ہوگئے اپنے گھر میں اوندھے گرے ہوئے",
        "English" : "So, the earthquake seized them, and they were (found dead) in their homes, fallen on their faces."
      },
      {
        "ayet_no" : 79,
        "arbi" : "فَتَوَلّٰى عَنْهُمْ وَقَالَ يٰقَوْمِ لَقَدْ اَبْلَغْتُكُمْ رِسَالَةَ رَبِّيْ وَنَصَحْتُ لَكُمْ وَلٰكِنْ لَّا تُحِبُّوْنَ النّٰصِحِيْنَ",
        "Urdu" : "پھر اس نے منہ پھیرا ان سے اور کہا اے میری قوم! بلاشبہ میں پہنچادیا تھا تمہیں اپنے رب کا پیغام اور میں نے خیر خواہی کی تمہاری اور لیکن نہیں تم پسند کرتے خیرخواہی کرنے والوں کو",
        "English" : "So, he turned away from them and said, :O my people, indeed I have delivered to you the message of my Lord, and wished you betterment, but you do not like the well-wishers."
      },
      {
        "ayet_no" : 80,
        "arbi" : "وَلُوْطًا اِذْ قَالَ لِقَوْمِهٖٓ اَتَاْتُوْنَ الْفَاحِشَةَ مَا سَبَقَكُمْ بِهَا مِنْ اَحَدٍ مِّنَ الْعٰلَمِيْنَ",
        "Urdu" : "اور ہم نے بھیجا لوط کو جب اس نے کہااپنی قوم سے کیا تم ارتکاب کرتے ہو ایسی بے حیائی کا کہ نہیں سبقت لی تم سے اس کی کسی ایک نے جہان والوں میں سے",
        "English" : "And (We sent) LuT (Lot) when he said to his people, :Do you commit the shameful act in which nobody in the world has ever preceded you ?"
      },
      {
        "ayet_no" : 81,
        "arbi" : "اِنَّكُمْ لَتَاْتُوْنَ الرِّجَالَ شَهْوَةً مِّنْ دُوْنِ النِّسَاۗءِ ۭ بَلْ اَنْتُمْ قَوْمٌ مُّسْرِفُوْنَ",
        "Urdu" : "بیشک تم یقینا آتے ہو مردوں کے پاس اپنی خواہش بجھانے کے لیے عورتوں کو چھوڑ کر بلکہ تم حد سے بڑھنے والے لوگ ہو",
        "English" : "You come to men lustfully instead of women. No, you are a people who cross the limits."
      },
      {
        "ayet_no" : 82,
        "arbi" : "وَمَا كَانَ جَوَابَ قَوْمِهٖٓ اِلَّآ اَنْ قَالُوْٓا اَخْرِجُوْهُمْ مِّنْ قَرْيَتِكُمْ ۚاِنَّهُمْ اُنَاسٌ يَّتَطَهَّرُوْنَ",
        "Urdu" : "اور نہ تھا جواب اس کی قوم کا مگر یہ کہ انہوں نے کہا نکال دو انہیں اپنی بستی سے بیشک یہ ایسے لوگ ہیں جو بہت پاک بنتے ہیں",
        "English" : "The answer of his people was no other than to say, :Expel them from your town. They are a people who pretend too much purity."
      },
      {
        "ayet_no" : 83,
        "arbi" : "فَاَنْجَيْنٰهُ وَاَهْلَهٗٓ اِلَّا امْرَاَتَهٗ ڮ كَانَتْ مِنَ الْغٰبِرِيْنَ",
        "Urdu" : "تو ہم نے بچالیا اسے اور اس کے گھر والوں کو مگر اس کی بیوی تھی وہ پیچھے رہنے والوں میں سے (جو ہلاک ہوئے)",
        "English" : "So, We saved him and his family, except his wife. She was one of those who remained behind."
      },
      {
        "ayet_no" : 84,
        "arbi" : "وَاَمْطَرْنَا عَلَيْهِمْ مَّطَرًا   ۭفَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُجْرِمِيْنَ",
        "Urdu" : "اور بارش برسائی ہم نے ان پر زور کی بارش(پتھروں کی) پس دیکھیے کیسے ہوا انجام مجرموں کا",
        "English" : "And We rained down upon them a rain. So, look! How was the fate of the sinners!"
      },
      {
        "ayet_no" : 85,
        "arbi" : "وَاِلٰي مَدْيَنَ اَخَاهُمْ شُعَيْبًا ۭقَالَ يٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗ ۭقَدْ جَاۗءَتْكُمْ بَيِّنَةٌ مِّنْ رَّبِّكُمْ فَاَوْفُوا الْكَيْلَ وَالْمِيْزَانَ وَلَا تَبْخَسُوا النَّاسَ اَشْـيَاۗءَهُمْ وَلَا تُفْسِدُوْا فِي الْاَرْضِ بَعْدَ اِصْلَاحِهَا ۭذٰلِكُمْ خَيْرٌ لَكُمْ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
        "Urdu" : "اور مدین کی طرف ان کے بھائی شعیب کو بھیجا اس نے کہا اے میری قوم! عبادت کرو اللہ کی نہیں ہے تمہارے لیے کوئی معبود اس کے علاوہ یقینا آچکی ہے تمہارے پاس ایک واضح دلیل تمہارے رب کی طرف سے، تو پورا کرو ماپ کو اور تول کو اور نہ کم دو لوگوں کو ان کی چیزیں اور نہ فساد پھیلاؤ زمین میں اس کی اصلاح کے بعد ، یہی بہتر ہے تمہارے لیے اگر ہو تم ایمان لانے والے",
        "English" : "And to Madyan (We sent) their brother Shu'aib. He said, :O my people, worship Allah. You have no god other than Him. There has come to you a clear sign from your Lord. Give the measure and weight in full, and do not make people short of their things, and do not make mischief on the earth after it has been set in order. That is good for you, if you are believers."
      },
      {
        "ayet_no" : 86,
        "arbi" : "وَلَا تَقْعُدُوْا بِكُلِّ صِرَاطٍ تُوْعِدُوْنَ وَتَصُدُّوْنَ عَنْ سَبِيْلِ اللّٰهِ مَنْ اٰمَنَ بِهٖ وَتَبْغُوْنَهَا عِوَجًا  ۚ وَاذْكُرُوْٓا اِذْ كُنْتُمْ قَلِيْلًا فَكَثَّرَكُمْ  ۠ وَانْظُرُوْا كَيْفَ كَانَ عَاقِبَةُ الْمُفْسِدِيْنَ",
        "Urdu" : "اور مت بیٹو ہر راستے پر کہ تم ڈراتے ہو اور تم روکتے ہو اللہ کے راستے سے اسے جو ایمان لایا اس پر اور تم تلاش کرتے ہو اس میں کجی اور یاد کرو جب تم تھے تھوڑے سے تو اس نے زیادہ کردیا تمہیں اور دیکھ کیسا ہوا انجام فساد کرنیوالوں کا",
        "English" : "Do not sit in every path threatening and preventing from the way of Allah the people who believe in Him, and seeking a twist in it. Remember the time when you were few, then He increased you in number. Consider the fate of those who used to make mischief."
      },
      {
        "ayet_no" : 87,
        "arbi" : "وَاِنْ كَانَ طَاۗىِٕفَةٌ مِّنْكُمْ اٰمَنُوْا بِالَّذِيْٓ اُرْسِلْتُ بِهٖ وَطَاۗىِٕفَةٌ لَّمْ يُؤْمِنُوْا فَاصْبِرُوْا حَتّٰي يَحْكُمَ اللّٰهُ بَيْنَنَا ۚ وَهُوَ خَيْرُ الْحٰكِمِيْنَ",
        "Urdu" : "اور اگر ہے ایک گروہ تم میں سے کہ وہ ایمان لے آئے اس پر جو کہ میں بھیجاگیا ہوں اس کے ساتھ، اور ایک گروہ ہے کہ نہیں وہ ایمان لائے (آپ پر)تو تم صبر کرو یہاں تک کہ اللہ فیصلہ فرمادے ہمارے درمیان اور وہ بہتر ہے سب فیصلہ کرنیوالوں سے ۔",
        "English" : "If a group from among you has believed in what I have been sent with, and another group has not believed, then keep patience until Allah decides between us. He is the best of all judges."
      },
      {
        "ayet_no" : 88,
        "arbi" : "قَالَ الْمَلَاُ الَّذِيْنَ اسْتَكْبَرُوْا مِنْ قَوْمِهٖ لَنُخْرِجَنَّكَ يٰشُعَيْبُ وَالَّذِيْنَ اٰمَنُوْا مَعَكَ مِنْ قَرْيَتِنَآ اَوْ لَتَعُوْدُنَّ فِيْ مِلَّتِنَا  ۭ قَالَ اَوَلَوْ كُنَّا كٰرِهِيْنَ",
        "Urdu" : "کہا ان سرداروں نے جنہوں نے تکبر کیا اس کی قوم میں سے ضرور بالضرور ہم نکال دیں گے تجھے اے شعیب! اور ان لوگوں کو جو ایمان لائے تیرے ساتھ اپنی بستی میں سے یا ضرور بالضرور تم لوٹ آؤ گے ہمارے دین میں اس نے کہا اور کیا اگرچہ ہم ہوں ناپسند کرنیوالے",
        "English" : "The chiefs of his people, who were arrogant, said, :O Shu'aib, we will expel you and those who believe with you from our town, or you shall have to turn to our faith. He said, :Even if we hate it ?"
      },
      {
        "ayet_no" : 89,
        "arbi" : "قَدِ افْتَرَيْنَا عَلَي اللّٰهِ كَذِبًا اِنْ عُدْنَا فِيْ مِلَّتِكُمْ بَعْدَ اِذْ نَجّٰىنَا اللّٰهُ مِنْهَا ۭوَمَا يَكُوْنُ لَنَآ اَنْ نَّعُوْدَ فِيْهَآ اِلَّآ اَنْ يَّشَاۗءَ اللّٰهُ رَبُّنَا ۭوَسِعَ رَبُّنَا كُلَّ شَيْءٍ عِلْمًا ۭ عَلَي اللّٰهِ تَوَكَّلْنَا رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَاَنْتَ خَيْرُ الْفٰتِحِيْنَ",
        "Urdu" : "یقینا ہم نے باندھا اللہ پر جھوٹ اگر ہم لوٹ آئیں تمہارے دین میں اس کے بعد کہہ جب اللہ نے ہمیں نجات دے دی اس سے اور نہیں ہے مناسب ہمارے لیے کہ ہم لوٹ آئیں اس میں مگر یہ کہ اللہ چاہے جو ہمارا رب ہے احاطہ کر رکھا ہے ہمارے رب نے ہر چیز کا علم سے اللہ پر ہم نے بھروسہ کیا اے ہمارے رب! فیصلہ فرما ہمارے درمیان اور ہماری قوم کے درمیان حق کے ساتھ اور تو سب سے بہتر ہے تمام فیصلہ کرنیوالوں میں",
        "English" : "We will be forging a lie against Allah, if we were to turn to your faith after Allah has saved us from it. It is not for us that we turn to it unless Allah, our Lord, so wills. Our Lord has encompassed everything with His knowledge. In Allah we place our trust. __Our Lord, decide between us and our people, with truth, and You are the best of all judges."
      },
      {
        "ayet_no" : 90,
        "arbi" : "وَقَالَ الْمَلَاُ الَّذِيْنَ كَفَرُوْا مِنْ قَوْمِهٖ لَىِٕنِ اتَّبَعْتُمْ شُعَيْبًا اِنَّكُمْ اِذًا لَّـخٰسِرُوْنَ",
        "Urdu" : "اور کہا ان سرداروں نے جنہوں نے کفر کیا اس کی قوم میں سے البتہ اگر تم نے پیروی کی شعیب کی بیشک تم اس وقت یقینا نقصان اٹھانیوالے ہوگے",
        "English" : "The chiefs of his people who disbelieved said, :If you are to follow Shu'aib, then you will be utter losers."
      },
      {
        "ayet_no" : 91,
        "arbi" : "فَاَخَذَتْهُمُ الرَّجْفَةُ فَاَصْبَحُوْا فِيْ دَارِهِمْ جٰثِمِيْنَ",
        "Urdu" : "تو پکڑ لیا ان کو زلزلے نے پھر ہوگئے صبح کو اپنے گھر میں اوندھے پڑے ہوئے",
        "English" : "So, the earthquake seized them, and they were (found dead) in their homes, fallen on their faces."
      },
      {
        "ayet_no" : 92,
        "arbi" : " الَّذِيْنَ كَذَّبُوْا شُعَيْبًا كَاَنْ لَّمْ يَغْنَوْا فِيْهَا  ڔ اَلَّذِيْنَ كَذَّبُوْا شُعَيْبًا كَانُوْا هُمُ الْخٰسِرِيْنَ",
        "Urdu" : "جنہوں نے جھٹلایا شعیب کو (وہ ایسے ہوگئے) گویا کہ وہ بسے ہی نہ تھے اس میں جنہوں نے جھٹلایا شعیب کو وہی خسارہ پانے والے تھے ۔",
        "English" : "Those who rejected Shu'aib became as if they never dwelt there. Those who rejected Shu'aib were themselves the losers."
      },
      {
        "ayet_no" : 93,
        "arbi" : "فَتَوَلّٰي عَنْهُمْ وَقَالَ يٰقَوْمِ لَقَدْ اَبْلَغْتُكُمْ رِسٰلٰتِ رَبِّيْ وَنَصَحْتُ لَكُمْ ۚ فَكَيْفَ اٰسٰي عَلٰي قَوْمٍ كٰفِرِيْنَ",
        "Urdu" : "پھر منہ پھیرلیا ان سے شعیب نے اور کہا اے میری قوم! البتہ تحقیق میں پہنچادیے تمہیں اپنے رب کے پیغامات اور میں نے خیر خواہی کی تمہاری تو کیسے میں غم کروں کافر قوم پر ۔",
        "English" : "So, he turned away from them and said, :O my people, I have surely delivered to you the message of my Lord, and wished your betterment. How, then, should I grieve over a disbelieving people ?"
      },
      {
        "ayet_no" : 94,
        "arbi" : "وَمَآ اَرْسَلْنَا فِيْ قَرْيَةٍ مِّنْ نَّبِيٍّ اِلَّآ اَخَذْنَآ اَهْلَهَا بِالْبَاْسَاۗءِ وَالضَّرَّاۗءِ لَعَلَّهُمْ يَضَّرَّعُوْنَ",
        "Urdu" : "اور نہیں ہم نے بھیجا کسی بستی میں کوئی نبی مگر یہ کہ ہم نے پکڑا اس کے رہنے والوں کو تنگی کے ساتھ اور تکلیف کے ساتھ تاکہ وہ گڑگڑائیں ۔",
        "English" : "We did not send any prophet to a town, but We seized its people with hardship and suffering, so that they may turn humble."
      },
      {
        "ayet_no" : 95,
        "arbi" : "ثُمَّ بَدَّلْنَا مَكَانَ السَّيِّئَةِ الْحَسَنَةَ حَتّٰي عَفَوْا وَّقَالُوْا قَدْ مَسَّ اٰبَاۗءَنَا الضَّرَّاۗءُ وَالسَّرَّاۗءُ فَاَخَذْنٰهُمْ بَغْتَةً وَّهُمْ لَا يَشْعُرُوْنَ",
        "Urdu" : "پھر ہم نے بدل دی بدحالی کی جگہ خوشحالی یہاں تک کہ وہ بڑھ گئے، اور انہوں نے کہا یقینا پہنچی تھی ہمارے آباؤ واجداد کو بھی تکلیف اور خوشی تو ہم نے پکڑ لیا انہیں اچانک اس حال میں کہ وہ شعور نہیں رکھتے تھے ۔",
        "English" : "Thereafter, We substituted good in place of evil until they increased, and said, :Hardship and prosperity came to our fathers (too). Then We seized them suddenly while they were not aware."
      },
      {
        "ayet_no" : 96,
        "arbi" : "وَلَوْ اَنَّ اَهْلَ الْقُرٰٓي اٰمَنُوْا وَاتَّقَوْا لَفَتَحْنَا عَلَيْهِمْ بَرَكٰتٍ مِّنَ السَّمَاۗءِ وَالْاَرْضِ وَلٰكِنْ كَذَّبُوْا فَاَخَذْنٰهُمْ بِمَا كَانُوْا يَكْسِبُوْنَ",
        "Urdu" : "اور اگر واقعی بستیوں والے ایمان لے آتے اور تقوی اختیار کرتے تو ضرور ہم کھول دیتے ان پر برکتیں آسمان سے اور زمین سے اور لیکن انہوں نے جھٹلایا تو ہم نے پکڑ لیا انہیں اس وجہ سے جو تھے وہ کمایا کرتے ۔",
        "English" : "If the people of the towns believed and feared Allah, We would have opened for them blessings from the heavens and the earth, but they disbelieved. So, We seized them because of what they used to earn for themselves."
      },
      {
        "ayet_no" : 97,
        "arbi" : "اَفَاَمِنَ اَهْلُ الْقُرٰٓي اَنْ يَّاْتِيَهُمْ بَاْسـُنَا بَيَاتًا وَّهُمْ نَاۗىِٕمُوْنَ",
        "Urdu" : "تو کیا نڈر ہوگئے ہیں بستیوں والے اس سے کہ آجائے ان کے پاس ہمارا عذاب رات کو اس حال میں کہ وہ سوئے ہوئے ہوں ۔",
        "English" : "So, do the people of the towns feel themselves immune from Our punishment that may befall them at night while they are asleep ?"
      },
      {
        "ayet_no" : 98,
        "arbi" : "اَوَاَمِنَ اَهْلُ الْقُرٰٓي اَنْ يَّاْتِيَهُمْ بَاْسُنَا ضُحًى وَّهُمْ يَلْعَبُوْنَ",
        "Urdu" : "تو کیا نڈر ہوگئے ہیں بستیوں والے (اس سے) کہ آجائے ان کے پاس ہمارا عذاب دن چڑھے اس حال میں کہ وہ کھیل رہے ہوں ۔",
        "English" : "Or do the people of the towns feel themselves immune from Our punishment that may befall them in broad daylight while they are at play ?"
      },
      {
        "ayet_no" : 99,
        "arbi" : "اَفَاَمِنُوْا مَكْرَ اللّٰهِ ۚ فَلَا يَاْمَنُ مَكْرَ اللّٰهِ اِلَّا الْقَوْمُ الْخٰسِرُوْنَ",
        "Urdu" : "تو کیا وہ نڈر ہوگئے ہیں اللہ کی تدبیر سے تو نہیں نڈر ہوتے اللہ کی تدبیر سے مگر خسارہ پانے والے لوگ",
        "English" : "Do they feel secure from Allah‘s plan? None can feel secure from Allah‘s plan except the people who are losers."
      },
      {
        "ayet_no" : 100,
        "arbi" : "اَوَلَمْ يَهْدِ لِلَّذِيْنَ يَرِثُوْنَ الْاَرْضَ مِنْۢ بَعْدِ اَهْلِهَآ اَنْ لَّوْ نَشَاۗءُ اَصَبْنٰهُمْ بِذُنُوْبِهِمْ ۚ وَنَطْبَعُ عَلٰي قُلُوْبِهِمْ فَهُمْ لَا يَسْمَعُوْنَ",
        "Urdu" : "اور کیا نہیں رہنمائی کی ان لوگوں کی جو وارث بنتے ہیں زمین کے اس کے رہنے والوں کی ہلاکت کے بعد، اس بات نے کہ اگر ہم چاہیں تو ہم سزا دیں انہیں ان کے گناہوں کی، اور ہم مہر لگادیں ان کے دلوں پرتو وہ کچھ نہ سنیں ۔",
        "English" : "Have all these events still not taught a lesson to those who inherit the land after its (former) inhabitants, that if We so willed, We could afflict them for their sins? But We seal their hearts, so that they do not listen."
      },
      {
        "ayet_no" : 101,
        "arbi" : "تِلْكَ الْقُرٰي نَقُصُّ عَلَيْكَ مِنْ اَنْۢبَاۗىِٕهَا ۚ وَلَقَدْ جَاۗءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنٰتِ ۚ فَمَا كَانُوْا لِيُؤْمِنُوْا بِمَا كَذَّبُوْا مِنْ قَبْلُ ۭكَذٰلِكَ يَطْبَعُ اللّٰهُ عَلٰي قُلُوْبِ الْكٰفِرِيْنَ",
        "Urdu" : "یہ بستیاں ہیں ہم بیان کرتے ہیں آپ پر ان کی خبروں سے اور البتہ تحقیق آئے ان کے پاس ان کے رسول واضح دلائل کے ساتھ پس نہ ہوئے اس لائق کہ وہ ایمان لاتے اس پر جس کو وہ جھٹلا چکے تھے اس سے پہلے اسی طرح مہر لگا دیتا ہے اللہ کافروں کے دلوں پر",
        "English" : "Those are the towns We narrate to you their important events. Surely their messengers came to them with clear signs, but they were not able to believe in what they had rejected earlier. This is how Allah seals the hearts of the disbelievers."
      },
      {
        "ayet_no" : 102,
        "arbi" : "وَمَا وَجَدْنَا لِاَكْثَرِهِمْ مِّنْ عَهْدٍ ۚ وَاِنْ وَّجَدْنَآ اَكْثَرَهُمْ لَفٰسِقِيْنَ",
        "Urdu" : "اور نہیں ہم نے پایا ان کے اکثر کے لیے کوئی عہد اور بیشک ہم نے پایا ان میں سے اکثر کو یقینا فاسق",
        "English" : "We did not find with most of them any covenant (unbroken), and surely We have found most of them sinners."
      },
      {
        "ayet_no" : 103,
        "arbi" : "ثُمَّ بَعَثْنَا مِنْۢ بَعْدِهِمْ مُّوْسٰي بِاٰيٰتِنَآ اِلٰى فِرْعَوْنَ وَمَلَا۟ىِٕهٖ فَظَلَمُوْا بِهَا  ۚ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُفْسِدِيْنَ",
        "Urdu" : "پھر ہم نے بھیجا ان کے بعد موسی کواپنی آیات کے ساتھ فرعون اور اس کے سرداروں کی طرف تو انہوں نے ظلم کیا ان کے ساتھ، پھر دیکھ کیسے ہوا انجام فساد کرنے والوں کا",
        "English" : "After them, We sent Musa with Our signs to Pharaoh and his chiefs. But they did injustice to them. So, consider the fate of the mischief-makers."
      },
      {
        "ayet_no" : 104,
        "arbi" : "وَقَالَ مُوْسٰي يٰفِرْعَوْنُ اِنِّىْ رَسُوْلٌ مِّنْ رَّبِّ الْعٰلَمِيْنَ",
        "Urdu" : "اور موسی نے کہا اے فرعون بے شک میں رسول ہوں تمام جہانوں کے رب کی طرف سے ۔",
        "English" : "Musa said, :O Pharaoh, I am a messenger from the Lord of all the worlds."
      },
      {
        "ayet_no" : 105,
        "arbi" : "حَقِيْقٌ عَلٰٓي اَنْ لَّآ اَقُوْلَ عَلَي اللّٰهِ اِلَّا الْحَقَّ  ۭقَدْ جِئْتُكُمْ بِبَيِّنَةٍ مِّنْ رَّبِّكُمْ فَاَرْسِلْ مَعِيَ بَنِيْٓ اِ سْرَاۗءِيْلَ",
        "Urdu" : "میں قائم ہوں اس پر کہ میں نہیں کہتا اللہ پر مگر حق ،یقینا میں لایا ہوں تمہارے پاس واضح دلیل تمہارے رب کی طرف سے چنانچہ توبھیج میرے ساتھ بنی اسرائیل کو ۔",
        "English" : "Incumbent it is upon me that I speak naught respecting Allah save the truth; surely I have brought you an evidence from your Lord; wherefore let then go with me the Children of Isra'il."
      },
      {
        "ayet_no" : 106,
        "arbi" : "قَالَ اِنْ كُنْتَ جِئْتَ بِاٰيَةٍ فَاْتِ بِهَآ اِنْ كُنْتَ مِنَ الصّٰدِقِيْنَ",
        "Urdu" : "اس نے کہا اگرہے تولایا کوئی نشانی تولے آ اس کو،اگرتوہے سچوں میں سے ۔",
        "English" : "He said, :If you have come with a sign, then bring it forth, if you are really truthful."
      },
      {
        "ayet_no" : 107,
        "arbi" : "فَاَلْقٰى عَصَاهُ فَاِذَا ھِىَ ثُعْبَانٌ مُّبِيْنٌ",
        "Urdu" : "توڈال دیا اس نےاپنی لاٹھی کو تواچانک وہ واضح اژدھا تھی ۔",
        "English" : "So he threw down his staff, and in no time it was a vivid serpent."
      },
      {
        "ayet_no" : 108,
        "arbi" : "وَّنَزَعَ يَدَهٗ فَاِذَا ھِىَ بَيْضَاۗءُ لِلنّٰظِرِيْنَ",
        "Urdu" : "اورنکالا اپناہاتھ تواچانک وہ سفید تھا دیکھنے والوں کے لیے ۔",
        "English" : "And he drew forth his hand, when lo: it was white unto the beholders."
      },
      {
        "ayet_no" : 109,
        "arbi" : "قَالَ الْمَلَاُ مِنْ قَوْمِ فِرْعَوْنَ اِنَّ هٰذَا لَسٰحِرٌ عَلِيْمٌ",
        "Urdu" : "کہا سرداروں نے فرعون کی قوم میں سے بیشک یہ یقینا جادوگر ہے بڑا دانا ۔",
        "English" : "The chiefs of the people of Pharaoh said, :This man is certainly a sorcerer of great knowledge."
      },
      {
        "ayet_no" : 110,
        "arbi" : "يُّرِيْدُ اَنْ يُّخْرِجَكُمْ مِّنْ اَرْضِكُمْ ۚ فَمَاذَا تَاْمُرُوْنَ",
        "Urdu" : "وہ چاہتا ہے کہ نکال دے تمہیں تمہاری زمین سے تو کیا تم حکم (مشورہ) دیتے ہو ۔",
        "English" : "He wants to expel you from your land. So, what do you suggest ?"
      },
      {
        "ayet_no" : 111,
        "arbi" : "قَالُوْٓا اَرْجِهْ وَاَخَاهُ وَاَرْسِلْ فِي الْمَدَاۗىِٕنِ حٰشِرِيْنَ",
        "Urdu" : "وہ کہنے لگے مہلت دے دو اسے اور اس کے بھائی کو اور تو بھیج شہروں میں اکٹھے کرنے والے",
        "English" : "They said, :leave him and his brother alone for a while, and send (your) men to the cities to collect"
      },
      {
        "ayet_no" : 112,
        "arbi" : "يَاْتُوْكَ بِكُلِّ سٰحِرٍ عَلِيْمٍ",
        "Urdu" : "وہ لے آئیں تیرے پاس ہر دانا جادو گر کو",
        "English" : "That they may bring to thee every magician knowing."
      },
      {
        "ayet_no" : 113,
        "arbi" : "وَجَاۗءَ السَّحَرَةُ فِرْعَوْنَ قَالُوْٓا اِنَّ لَنَا لَاَجْرًا اِنْ كُنَّا نَحْنُ الْغٰلِبِيْنَ",
        "Urdu" : "اور آئے جادو گر فرعون کے پاس وہ کہنے لگے بیشک ہمارے لیے یقینا کوئی انعام ہوگا اگر ہوئے ہم ہی غالب",
        "English" : "The sorcerers came to Pharaoh. They said, :There must be a reward for us, if we are the victors."
      },
      {
        "ayet_no" : 114,
        "arbi" : "قَالَ نَعَمْ وَاِنَّكُمْ لَمِنَ الْمُقَرَّبِيْنَ",
        "Urdu" : "اس نے کہا، ہاں اور یقینا تم ضرور مقرب لوگوں میں سے ہوگے",
        "English" : "He said, :Yes, and of course, you will be among the closer ones (to me)."
      },
      {
        "ayet_no" : 115,
        "arbi" : "قَالُوْا يٰمُوْسٰٓي اِمَّآ اَنْ تُلْقِيَ وَاِمَّآ اَنْ نَّكُوْنَ نَحْنُ الْمُلْقِيْنَ",
        "Urdu" : "انہوں نے کہا اے موسی!یا یہ کہ توڈالے اور یا یہ کہ ہوں ہم (پہلے) ڈالنے والے",
        "English" : "They said, :O Musa, would you throw (first) or are we to throw ?"
      },
      {
        "ayet_no" : 116,
        "arbi" : "قَالَ اَلْقُوْا ۚ فَلَمَّآ اَلْقَوْا سَحَرُوْٓا اَعْيُنَ النَّاسِ وَاسْتَرْهَبُوْهُمْ وَجَاۗءُوْ بِسِحْرٍ عَظِيْمٍ",
        "Urdu" : "اس نے کہا تم ڈالو، پھر جب انہوں نے ڈال دیں (لاٹھیاں) تو انہوں نے جادو کردیا لوگوں کی آنکھوں پر اور ڈرا دیا انہیں اور لائے بہت بڑا جادو",
        "English" : "He said, :You throw. So when they threw, they bewitched the eyes of the people, and made them frightened, and produced great sorcery."
      },
      {
        "ayet_no" : 117,
        "arbi" : "وَاَوْحَيْنَآ اِلٰى مُوْسٰٓي اَنْ اَلْقِ عَصَاكَ ۚ فَاِذَا هِىَ تَلْقَفُ مَا يَاْفِكُوْنَ",
        "Urdu" : "اور ہم نے وحی کی موسی کی طرف یہ کہ تو بھی ڈال دے اپنی لاٹھی تو اچانک وہ نگلنے لگی جو وہ جھوٹ موٹ بنا رہے تھے",
        "English" : "We revealed to Musa, :Throw your staff. Then of a sudden, it began to swallow all that they had concocted."
      },
      {
        "ayet_no" : 118,
        "arbi" : "فَوَقَعَ الْحَقُّ وَبَطَلَ مَا كَانُوْا يَعْمَلُوْنَ",
        "Urdu" : "پس حق ثابت ہوگیا اور باطل ہوگیا جو کچھ وہ کر رہے تھے",
        "English" : "Thus the truth prevailed, and what they were doing became a nullity."
      },
      {
        "ayet_no" : 119,
        "arbi" : "فَغُلِبُوْا هُنَالِكَ وَانْقَلَبُوْا صٰغِرِيْنَ",
        "Urdu" : "تو وہ مغلوب ہوگئے وہاں اور لوٹے ذلیل ہوکر",
        "English" : "So, they were overcome then and there and turned humiliated."
      },
      {
        "ayet_no" : 120,
        "arbi" : "وَاُلْقِيَ السَّحَرَةُ سٰجِدِيْنَ",
        "Urdu" : "اور گرادیے گئے جادوگر سجدے کی حالت میں",
        "English" : "The sorcerers could not but fall in prostration."
      },
      {
        "ayet_no" : 121,
        "arbi" : "قَالُوْٓا اٰمَنَّا بِرَبِّ الْعٰلَمِيْنَ",
        "Urdu" : "انہوں نے کہا ہم ایمان لائے تمام جہانوں کے رب پر",
        "English" : "They said, :We believe in the Lord of the worlds."
      },
      {
        "ayet_no" : 122,
        "arbi" : "رَبِّ مُوْسٰي وَهٰرُوْنَ",
        "Urdu" : "موسی اور ہارون کے رب پر",
        "English" : "The Lord of Musa and Harun."
      },
      {
        "ayet_no" : 123,
        "arbi" : "قَالَ فِرْعَوْنُ اٰمَنْتُمْ بِهٖ قَبْلَ اَنْ اٰذَنَ لَكُمْ  ۚ اِنَّ هٰذَا لَمَكْرٌ مَّكَرْتُمُوْهُ فِي الْمَدِيْنَةِ لِتُخْرِجُوْا مِنْهَآ اَهْلَهَا  ۚ فَسَوْفَ تَعْلَمُوْنَ",
        "Urdu" : "فرعون نے کہا کیا تم ایمان لے آئے ہو اس پر اس سے پہلے کہ میں اجازت دیتا تمہیں بیشک یہ ایک چال ہے جو کہ تم نے چلی ہے وہ شہر میں تاکہ تم نکال دو اس شہر سے اس کے رہنے والوں کو تو عنقریب تم جان لوگے",
        "English" : "Pharaoh said, :You have believed in him before my permission. Undoubtedly, this is a plot you have designed in the city, so that you may expel its people from it. Now you shall know (its end)."
      },
      {
        "ayet_no" : 124,
        "arbi" : "لَاُقَطِّعَنَّ اَيْدِيَكُمْ وَاَرْجُلَكُمْ مِّنْ خِلَافٍ ثُمَّ لَاُصَلِبَنَّكُمْ اَجْمَعِيْنَ",
        "Urdu" : "ضرور میں بری طرح کاٹ دوں گا تمہارے ہاتھ اور تمہارے پاؤں مخالف سمت سے پھر البتہ ضرور میں سولی پر چڑھاؤ ں گا تم سب کو",
        "English" : "I will cut off your hands and your legs from opposite sides. Then I will crucify you all together."
      },
      {
        "ayet_no" : 125,
        "arbi" : "قَالُوْٓا اِنَّآ اِلٰى رَبِّنَا مُنْقَلِبُوْنَ",
        "Urdu" : "انہوں نے کہا : یقینا ہم اپنے ر ب کی طرف لوٹنے والے ہیں ۔",
        "English" : "They said, :We have surely to return to our Lord."
      },
      {
        "ayet_no" : 126,
        "arbi" : "وَمَا تَنْقِمُ مِنَّآ اِلَّآ اَنْ اٰمَنَّا بِاٰيٰتِ رَبِّنَا لَمَّا جَاۗءَتْنَا ۭرَبَّنَآ اَفْرِغْ عَلَيْنَا صَبْرًا وَّ تَوَفَّنَا مُسْلِمِيْنَ",
        "Urdu" : "اور نہیں تو بدلہ لے رہا ہم سے مگر صرف اس کا کہ ہم ایمان لائے ہیں اپنے رب کی آیات پر، جب وہ آئی ہیں ہمارے پاس اے ہمارے رب ! تو ڈال ہم پر صبر اور فوت کر ہمیں اس حال میں کہ فرمانبردار ہوں",
        "English" : "For what fault would you punish us except that we have believed in the signs of our Lord when they appeared to us? O our Lord, pour out patience upon us, and cause us to die as Muslims (those who submit to you.)"
      },
      {
        "ayet_no" : 127,
        "arbi" : " وَقَالَ الْمَلَاُ مِنْ قَوْمِ فِرْعَوْنَ اَتَذَرُ مُوْسٰي وَقَوْمَهٗ لِيُفْسِدُوْا فِي الْاَرْضِ وَيَذَرَكَ وَاٰلِهَتَكَ   ۭقَالَ سَنُقَتِّلُ اَبْنَاۗءَهُمْ وَنَسْتَحْيٖ نِسَاۗءَهُمْ  ۚ وَاِنَّا فَوْقَهُمْ قٰهِرُوْنَ",
        "Urdu" : "اور کہا سرداروں نے فرعون کی قوم میں سے کیا تو چھوڑے رکھے گا موسی اور اس کی قوم کو تاکہ وہ فساد پھیلائیں زمین میں اور وہ چھوڑدے تجھے اور تیرے معبودوں کو اس نے کہا عنقریب ہم قتل کردیں گے ان کے بیٹوں کو اور ہم زندہ رہنے دیں گے ان کی عورتوں (بیٹیوں کو) اور بیشک ہم ان پر غالب ہیں",
        "English" : "The chiefs of the people of Pharaoh said, :Shall you leave Musa and his people free to spread disorder in the land and to abandon you and your gods? He said, :We shall slaughter their sons and let their women remain alive. We have full power over them."
      },
      {
        "ayet_no" : 128,
        "arbi" : "قَالَ مُوْسٰي لِقَوْمِهِ اسْتَعِيْنُوْا بِاللّٰهِ وَاصْبِرُوْا ۚ اِنَّ الْاَرْضَ لِلّٰهِ ڐ يُوْرِثُهَا مَنْ يَّشَاۗءُ مِنْ عِبَادِهٖ ۭوَالْعَاقِبَةُ لِلْمُتَّقِيْنَ",
        "Urdu" : "کہا موسی نےاپنی قوم سے تم مدد طلب کرو اللہ سے اور صبر کرو بیشک زمین تو اللہ کی ہے وہ وارث بناتا ہے اس کا جس کو چاہتا ہے اپنے بندوں میں سے اور اچھا انجام تو متقی لوگوں کے لیے ہے",
        "English" : "Musa said to his people, :Seek help from Allah and be patient. Surely, the land belongs to Allah. He lets whomsoever He wills inherit it from among His servants; and the end-result is in favor of the God-fearing."
      },
      {
        "ayet_no" : 129,
        "arbi" : "قَالُوْٓا اُوْذِيْنَا مِنْ قَبْلِ اَنْ تَاْتِيَنَا وَمِنْۢ بَعْدِ مَا جِئْتَنَا    ۭ قَالَ عَسٰي رَبُّكُمْ اَنْ يُّهْلِكَ عَدُوَّكُمْ وَيَسْتَخْلِفَكُمْ فِي الْاَرْضِ فَيَنْظُرَ كَيْفَ تَعْمَلُوْنَ",
        "Urdu" : "انہوں نے کہا ہمیں تکلیف دی گئی ہے اس سے پہلے کہ آپ آتے ہمارے پاس اور اس کے بعد کہ آپ آئے ہمارے پاس اس نے کہا امید ہے کہ تمہارا رب یہ کہ ہلاک کردے تمہارے دشمن کو اور وہ جانشین بنادے تمہیں زمین میں پھر وہ دیکھے کیسے تم عمل کرتے ہو",
        "English" : "They said, :We were persecuted before you came to us and after you have come to us. He said, :Hopefully your Lord will destroy your enemy and make you successors in the land, then He will see how you act."
      },
      {
        "ayet_no" : 130,
        "arbi" : "وَلَقَدْ اَخَذْنَآ اٰلَ فِرْعَوْنَ بِالسِّنِيْنَ وَنَقْصٍ مِّنَ الثَّمَرٰتِ لَعَلَّهُمْ يَذَّكَّرُوْنَ",
        "Urdu" : "اور البتہ تحقیق ہم نے پکڑا آل فرعون کو قحط سالیوں سے اور نقصان کر کے پھلوں سے تاکہ وہ نصیحت پکڑیں ۔",
        "English" : "And We seized the people of Pharaoh with years of famine and poor production of fruits, so that they may learn a lesson."
      },
      {
        "ayet_no" : 131,
        "arbi" : "فَاِذَا جَاۗءَتْهُمُ الْحَسَنَةُ قَالُوْا لَنَا هٰذِهٖ    ۚ وَاِنْ تُصِبْهُمْ سَيِّئَةٌ يَّطَّيَّرُوْا بِمُوْسٰي وَمَنْ مَّعَهٗ  ۭاَلَآ اِنَّمَا طٰۗىِٕرُهُمْ عِنْدَ اللّٰهِ وَلٰكِنَّ اَكْثَرَهُمْ لَا يَعْلَمُوْنَ",
        "Urdu" : "تو جب آئی ان پر خوشحالی تو کہتے ہیں ہمارا حق ہے یہ اور اگر پہنچتی انہیں کوئی تکلیف تو نحوست کا باعث ٹھہراتے ہیں موسی کو اور جو ان کے ساتھ ہیں خبردار درحقیقت ان کی نحوست تو اللہ کے پاس ہے۔ اور لیکن ان کے اکثر نہیں جانتے",
        "English" : "When good times came to them, they said, :This is our right. And if an evil touched them, they took it as an ill omen of Musa and those with him. Listen, their ill omen lies with Allah only, but most of them do not know."
      },
      {
        "ayet_no" : 132,
        "arbi" : "وَقَالُوْا مَهْمَا تَاْتِنَا بِهٖ مِنْ اٰيَةٍ لِّتَسْحَرَنَا بِهَا ۙ فَمَا نَحْنُ لَكَ بِمُؤْمِنِيْنَ",
        "Urdu" : "اور انہوں نے کہا جو بھی تو لائے گا ہمارے پاس اس کو کوئی نشانی تاکہ تو جادو کرے ہم پر اس کے ذریعے تو نہیں ہیں ہم آپ پر ایمان لانے والے",
        "English" : "They said, :Whatever sign you bring to us to enchant us with, we are not going to believe in you."
      },
      {
        "ayet_no" : 133,
        "arbi" : "فَاَرْسَلْنَا عَلَيْهِمُ الطُّوْفَانَ وَالْجَرَادَ وَالْقُمَّلَ وَالضَّفَادِعَ وَالدَّمَ اٰيٰتٍ مُّفَصَّلٰتٍ  فَاسْتَكْبَرُوْا وَكَانُوْاقَوْمًا مُّجْرِمِيْنَ",
        "Urdu" : "چنانچہ ہم نے بھیجا ان پر طوفان اور ٹڈی دل اور جوئیں اور مینڈک اور خون جو نشانیاں تھیں الگ الگ پھر بھی انہوں نے تکبر کیا اور تھے وہ مجرم لوگ",
        "English" : "So We sent upon them the storm and locusts and lice and frogs and blood, as signs distinct from each other. Yet they showed arrogance, and they were a guilty people."
      },
      {
        "ayet_no" : 134,
        "arbi" : "وَلَمَّا وَقَعَ عَلَيْهِمُ الرِّجْزُ قَالُوْا يٰمُوْسَى ادْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِنْدَكَ ۚ لَىِٕنْ كَشَفْتَ عَنَّا الرِّجْزَ لَنُؤْمِنَنَّ لَكَ وَلَنُرْسِلَنَّ مَعَكَ بَنِيْٓ اِ سْرَاۗءِيْلَ",
        "Urdu" : "اور جب واقع ہوتا ان پر عذاب تو کہتے اے موسی! دعا کر ہمارے لیے اپنے رب سے اس واسطے سے جو اس نے عہد کر رکھا ہے تیرے ہاں البتہ اگر تو دور کردے ہم سے یہ عذاب تو یقیناضرور ہم ایمان لے آئیں گے آپ پر اور یقینا ضرور ہم بھیجیں گے تیرے ساتھ بنی اسرائیل کو",
        "English" : "Whenever a scourge befell them, they said, :O Musa, pray for us to your Lord by the covenant He has made with you. If you remove the scourge from us, we will truly believe in you, and will send the children of Isra‘il with you."
      },
      {
        "ayet_no" : 135,
        "arbi" : "فَلَمَّا كَشَفْنَا عَنْهُمُ الرِّجْزَ اِلٰٓي اَجَلٍ هُمْ بٰلِغُوْهُ اِذَا هُمْ يَنْكُثُوْنَ",
        "Urdu" : "پھر جب ہم دور کردیتے ان سے عذاب کو ایک وقت تک کہ وہ پہنچنے والے ہوتے اس کو تواچانک وہ عہد توڑ دیتے",
        "English" : "But when We removed the scourge from them for a term they had to reach, in no time they started to break their promise."
      },
      {
        "ayet_no" : 136,
        "arbi" : "فَانْتَقَمْنَا مِنْهُمْ فَاَغْرَقْنٰهُمْ فِي الْيَمِّ بِاَنَّهُمْ كَذَّبُوْا بِاٰيٰتِنَا وَكَانُوْا عَنْهَا غٰفِلِيْنَ",
        "Urdu" : "چنانچہ ہم نے ان سے انتقام لیا تو ہم نے غرق کردیا انہیں سمندر میں اس وجہ سے کہ انہوں نے جھٹلایا ہماری آیات کو اور وہ تھے اس سے غافل ۔",
        "English" : "Then We subjected them to retribution, and drowned them in the sea, because they rejected Our signs, and were neglectful of them."
      },
      {
        "ayet_no" : 137,
        "arbi" : "وَاَوْرَثْنَا الْقَوْمَ الَّذِيْنَ كَانُوْا يُسْتَضْعَفُوْنَ مَشَارِقَ الْاَرْضِ وَمَغَارِبَهَا الَّتِيْ بٰرَكْنَا فِيْهَا    ۭ وَتَمَّتْ كَلِمَتُ رَبِّكَ الْحُسْنٰى عَلٰي بَنِيْٓ اِسْرَاۗءِيْلَ ڏ بِمَا صَبَرُوْا   ۭوَدَمَّرْنَا مَا كَانَ يَصْنَعُ فِرْعَوْنُ وَقَوْمُهٗ وَمَا كَانُوْا يَعْرِشُوْنَ",
        "Urdu" : "اور ہم نے وارث بنادیا اس قوم کو جو تھے کمزور سمجھے جاتے زمیں کے مشرقوں کو اور اس کے مغربوں کا وہ زمین کہ جو ہم نے برکت رکھی ہے اس میں اور پوری ہوگئی تیرے رب کی بہترین بات بنی اسرائیل پر، اس وجہ سے جو انہوں نے صبر کیا اور ہم نے برباد کردیا جو کچھ بناتاتھا فرعون اور اس کی قوم، اور جو تھے وہ محلات بلند کرتے ۔",
        "English" : "We caused those people who were deemed to be weak (the Israelites) to inherit the East and West of the land that We had blessed. And the sublime word of your Lord was fulfilled for the children of Isra‘il, because they stood patient; and We destroyed what Pharaoh and his people used to build and what they used to raise high."
      },
      {
        "ayet_no" : 138,
        "arbi" : "وَجٰوَزْنَا بِبَنِيْٓ اِسْرَاۗءِيْلَ الْبَحْرَ فَاَتَوْا عَلٰي قَوْمٍ يَّعْكُفُوْنَ عَلٰٓي اَصْنَامٍ لَّهُمْ ۚ قَالُوْا يٰمُوْسَى اجْعَلْ لَّنَآ اِلٰـهًا كَمَا لَهُمْ اٰلِهَةٌ ۭقَالَ اِنَّكُمْ قَوْمٌ تَجْـهَلُوْنَ",
        "Urdu" : "اور ہم نے پار اتارا بنی اسرائیل کو سمندر سے تو وہ آئے ایسی قوم پر کہ وہ جمے بیٹھے تھے اپنے کچھ بتوں پر انہوں نے کہا: اے موسی! تو بنادے ہمارے لیے ایک معبود، جس طرح ہیں ان کے معبود (موسی نے) کہا: بیشک تم وہ قوم ہو کہ نادانی کرتے ہو",
        "English" : "We made the children of Isra‘il cross the sea, then they came across a people sitting in devotion before their idols. They (the Israelites) said, :O Musa, make a god for us like they have gods. He said, :You are really an ignorant people."
      },
      {
        "ayet_no" : 139,
        "arbi" : "اِنَّ هٰٓؤُلَاۗءِ مُتَبَّرٌ مَّا هُمْ فِيْهِ وَبٰطِلٌ مَّا كَانُوْا يَعْمَلُوْنَ",
        "Urdu" : "بیشک یہ لوگ ہیں کہ تباہ کیا جانے والا ہے جس (دین) میں وہ ہیں اور باطل ہے جو وہ کر رہے ہیں",
        "English" : "What these people are engaged in is sure to be destroyed; and false is what they are doing."
      },
      {
        "ayet_no" : 140,
        "arbi" : "قَالَ اَغَيْرَ اللّٰهِ اَبْغِيْكُمْ اِلٰهًا وَّهُوَ فَضَّلَكُمْ عَلَي الْعٰلَمِيْنَ",
        "Urdu" : "کہا(موسی نے) کیا اللہ کے سوا میں تلاش کروں تمہارے لیے کوئی اور معبود حالانکہ وہی ہے کہ اس نے فضیلت دی ہے تمہیں تمام جہانوں پر",
        "English" : "He said, :Shall I seek any one other than Allah as God for you, while He has given you excellence over the (people of all the) worlds."
      },
      {
        "ayet_no" : 141,
        "arbi" : "وَاِذْ اَنْجَيْنٰكُمْ مِّنْ اٰلِ فِرْعَوْنَ يَسُوْمُوْنَكُمْ سُوْۗءَ الْعَذَابِ ۚ يُقَتِّلُوْنَ اَبْنَاۗءَكُمْ وَ يَسْتَحْيُوْنَ نِسَاۗءَكُمْ  ۭوَفِيْ ذٰلِكُمْ بَلَاۗءٌ مِّنْ رَّبِّكُمْ عَظِيْمٌ",
        "Urdu" : "اور جب ہم نے نجات دی تمہیں فرعون کی آل سے وہ پہنچاتے تھے تمہیں برا عذاب وہ قتل کردیتے تھے تمہارے بیٹوں کو اور وہ زندہ چھوڑ دیتے تھے تمہاری عورتوں کو اور اس میں آزمائش تھی تمہارے رب کی طرف سے بہت بڑی",
        "English" : "(Remember) when We delivered you from the people of Pharaoh who inflicted grievous torment upon you, slaughtered your sons and left your women alive. In all that there was a great trial from your Lord."
      },
      {
        "ayet_no" : 142,
        "arbi" : "وَوٰعَدْنَا مُوْسٰي ثَلٰثِيْنَ لَيْلَةً وَّاَتْمَمْنٰهَا بِعَشْرٍ فَتَمَّ مِيْقَاتُ رَبِّهٖٓ اَرْبَعِيْنَ لَيْلَةً ۚ وَقَالَ مُوْسٰي لِاَخِيْهِ هٰرُوْنَ اخْلُفْنِيْ فِيْ قَوْمِيْ وَاَصْلِحْ وَلَا تَتَّبِعْ سَبِيْلَ الْمُفْسِدِيْنَ",
        "Urdu" : "اور ہم نے وعدہ کیا موسی سے تیس راتوں کا اور ہم نے پورا کیا اسے مزید دس راتوں سے تو پوری ہوگئی اس کے رب کی مقرر مدت چالیس راتیں اور کہا موسی نے اپنے بھائی ہارون سے میرا جانشین رہ میری قوم میں اور اصلاح کرتے رہنا اور نہ پیروی کرنا فساد کرنے والوں کے راستے کی",
        "English" : "And We made an appointment with Musa for thirty nights, then We supplemented them with another ten. So, the total period fixed by his Lord was forty nights. Musa said to his brother Harun, :Take my place among my people and keep things right, and do not follow the way of mischief makers."
      },
      {
        "ayet_no" : 143,
        "arbi" : "وَلَمَّا جَاۗءَ مُوْسٰي لِمِيْقَاتِنَا وَكَلَّمَهٗ رَبُّهٗ  ۙ قَالَ رَبِّ اَرِنِيْٓ اَنْظُرْ اِلَيْكَ    ۭقَالَ لَنْ تَرٰىنِيْ وَلٰكِنِ انْظُرْ اِلَى الْجَبَلِ فَاِنِ اسْـتَــقَرَّ مَكَانَهٗ فَسَوْفَ تَرٰىنِيْ ۚ فَلَمَّا تَجَلّٰى رَبُّهٗ لِلْجَبَلِ جَعَلَهٗ دَكًّا وَّخَرَّ مُوْسٰي صَعِقًا   ۚ فَلَمَّآ اَفَاقَ قَالَ سُبْحٰنَكَ تُبْتُ اِلَيْكَ وَاَنَا اَوَّلُ الْمُؤْمِنِيْنَ",
        "Urdu" : "اور جب آئے موسی ہماری مقررہ مدت پر اور بات کی اس سے اس کے رب نے کہنے لگے اے میرے رب! دکھا مجھے کہ میں دیکھوں تیری طرف فرمایا: ہرگز نہیں تو دیکھ سکے گا مجھے اور لیکن تو دیکھ اس پہاڑ کی طرف پس اگر وہ ٹھہرا رہااپنی جگہ پر تو عنقریب تو بھی دیکھ سکے گا مجھے پھر جب جلوہ ڈالا اس کے رب نے پہاڑ پر تو کردیا اسے ریزہ ریزہ اور گر پڑے موسی بے ہوش ہوکر پھر جب ہوش آیا تو میں نے توبہ کی تیری طرف، اور میں سب سے پہلا ہوں ایمان لانے والوں میں",
        "English" : "When Musa came at Our appointed time and his Lord spoke to him, he said, :My Lord, show (Yourself) to me that I may look at You. He said: :You shall never see Me. But look at the mount. If it stays at its place, you will see Me. So when his Lord appeared to the Mount, He made it smashed, and Musa fell down unconscious. When he recovered, he said: :Pure are You. I repent to You, and I am the first to believe (that no one can see You in this world.)"
      },
      {
        "ayet_no" : 144,
        "arbi" : "قَالَ يٰمُوْسٰٓي اِنِّى اصْطَفَيْتُكَ عَلَي النَّاسِ بِرِسٰلٰتِيْ وَبِكَلَامِيْ ڮ فَخُذْ مَآ اٰتَيْتُكَ وَكُنْ مِّنَ الشّٰكِرِيْنَ",
        "Urdu" : "فرمایا اے موسی بیشک میں نے چن لیا ہے تجھے لوگوں پر اپنے پیغامات اور اپنے کلام کے ساتھ پس پکڑ لے جو میں نے دیا ہے تجھے اور ہوجا شکر کرنے والوں میں سے",
        "English" : "He said, :Musa, I have chosen you above all men for my messages and for My speaking (to you). So, take what I have given to you, and be among the grateful."
      },
      {
        "ayet_no" : 145,
        "arbi" : "وَكَتَبْنَا لَهٗ فِي الْاَلْوَاحِ مِنْ كُلِّ شَيْءٍ مَّوْعِظَةً وَّتَفْصِيْلًا لِّكُلِّ شَيْءٍ  ۚ فَخُذْهَا بِقُوَّةٍ وَّاْمُرْ قَوْمَكَ يَاْخُذُوْا بِاَحْسَنِهَا   ۭ سَاُورِيْكُمْ دَارَ الْفٰسِقِيْنَ",
        "Urdu" : "اور ہم نے لکھ دی اس کے لیے تختیوں میں ہر چیز کی نصیحت اور تفصیل ہر چیز کی تو پکڑ لے ان کو مضبوطی کے ساتھ اور حکم دےاپنی قوم کو کہ وہ پکڑے رکھیں ان کی اچھی باتوں کو عنقریب میں دکھاؤ ں گا تمہیں نافرمانوں کاگھر",
        "English" : "We wrote for him on the Tablets advice of every kind, and explanations of all (needful) things. :So hold it firm, and ask your people to hold on to the best things in it. I shall show you the house of the sinners."
      },
      {
        "ayet_no" : 146,
        "arbi" : "سَاَصْرِفُ عَنْ اٰيٰتِيَ الَّذِيْنَ يَتَكَبَّرُوْنَ فِي الْاَرْضِ بِغَيْرِ الْحَقِّ ۭ وَاِنْ يَّرَوْا كُلَّ اٰيَةٍ لَّا يُؤْمِنُوْا بِهَا ۚ وَاِنْ يَّرَوْا سَبِيْلَ الرُّشْدِ لَا يَتَّخِذُوْهُ سَبِيْلًا ۚ وَاِنْ يَّرَوْا سَبِيْلَ الْغَيِّ يَتَّخِذُوْهُ سَبِيْلًا ۭذٰلِكَ بِاَنَّهُمْ كَذَّبُوْا بِاٰيٰتِنَا وَكَانُوْا عَنْهَا غٰفِلِيْنَ",
        "Urdu" : "عنقریب میں پھیردوں گااپنی آیتوں سے ان لوگوں کو جو تکبر کرتے ہیں زمین میں ناحق طریقے سے اور اگر وہ دیکھ لیں ہر نشانی تو نہ وہ ایمان لائیں گے اس پر اور اگر وہ دیکھ لیں بھلائی کا راستہ تو نہیں پکڑتے اسے اپنے لیے راستہ اور اگر وہ دیکھ لیں گمراہی کا راستہ تو پکڑ لیتے ہیں اسے اپنے لیے راستہ یہ اس وجہ سے ہے کہ بیشک انہوں نے جھٹلایا ہماری آیتوں کو اور تھے ان سے غافل",
        "English" : "I shall keep away from My verses those who show arrogance on the earth with no right to do so. Even if they were to see every sign, they would not believe in it; and if they see the Path of guidance, they do not take it as their way; and if they see the path of misguidance, they would take it as their way. That is because they have rejected Our signs, and have been neglectful of them."
      },
      {
        "ayet_no" : 147,
        "arbi" : "وَالَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَا وَلِقَاۗءِ الْاٰخِرَةِ حَبِطَتْ اَعْمَالُهُمْ ۭ هَلْ يُجْزَوْنَ اِلَّا مَا كَانُوْا يَعْمَلُوْنَ",
        "Urdu" : "اور وہ لوگ جنہوں نے جھٹلایا ہماری آیات کو اور آخرت کی ملاقات کو، ضائع ہوگئے ان کے اعمال نہیں وہ بدلہ دیے جائیں گے مگر اس کا جو تھے وہ عمل کرتے",
        "English" : "Gone to waste are the deeds of those who have rejected Our signs and the meeting of the Hereafter. They will be recompensed only for what they have been doing."
      },
      {
        "ayet_no" : 148,
        "arbi" : "وَاتَّخَذَ قَوْمُ مُوْسٰي مِنْۢ بَعْدِهٖ مِنْ حُلِيِّهِمْ عِجْلًا جَسَدًا لَّهٗ خُوَارٌ ۭ اَلَمْ يَرَوْا اَنَّهٗ لَا يُكَلِمُهُمْ وَلَا يَهْدِيْهِمْ سَبِيْلًا ۘ اِتَّخَذُوْهُ وَكَانُوْا ظٰلِمِيْنَ",
        "Urdu" : "اور بنالیا موسی کی قوم نے اس کے جانے کے بعد اپنے زیورات سے ایک بچھڑا جو ایک جسم تھا اور اس کی گائے جیسی آواز تھی کیا نہیں انہوں نے دیکھا کہ بیشک وہ نہ بات کرتا تھا ان سے اور نہ وہ دکھاتا ہے انہیں کوئی راہ انہوں نے بنالیا اسے معبود اور وہ تھے اپنے آپ پر ظلم کرنے والے",
        "English" : "And in the absence of Musa, his people made a calf from their ornaments, which was merely a sculpture with a moaning sound. Did they not see that it neither talked to them nor could it guide them to any way? They adopted it (as god), and were so unjust."
      },
      {
        "ayet_no" : 149,
        "arbi" : "وَلَمَّا سُقِطَ فِيْٓ اَيْدِيْهِمْ وَرَاَوْا اَنَّهُمْ قَدْ ضَلُّوْا  ۙ قَالُوْا لَىِٕنْ لَّمْ يَرْحَمْنَا رَبُّنَا وَيَغْفِرْ لَنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ",
        "Urdu" : "اور جب گرائے گئے (ان کے منہ) ان کے ہاتھوں میں (وہ نادم ہوئے) اور انہوں نے دیکھا کہ بیشک وہ یقینا گمراہ ہوگئے ہیں کہنے لگے کہ واقعی اگر نہ رحم کیا ہم پر ہمارے رب نے اور نہ بخشا ہمیں تو البتہ یقینا ہم ہوجائیں گے خسارہ پانے والوں میں سے",
        "English" : "When they became remorseful and saw that they had gone astray, they said, :If Allah shows no mercy to us, and does not forgive us, we shall certainly be among the losers."
      },
      {
        "ayet_no" : 150,
        "arbi" : "وَلَمَّا رَجَعَ مُوْسٰٓي اِلٰى قَوْمِهٖ غَضْبَانَ اَسِفًا ۙ قَالَ بِئْسَمَا خَلَفْتُمُوْنِيْ مِنْۢ بَعْدِيْ ۚ اَعَجِلْتُمْ اَمْرَ رَبِّكُمْ ۚ وَاَلْقَى الْاَلْوَاحَ وَاَخَذَ بِرَاْسِ اَخِيْهِ يَجُرُّهٗٓ اِلَيْهِ ۭ قَالَ ابْنَ اُمَّ اِنَّ الْقَوْمَ اسْتَضْعَفُوْنِيْ وَكَادُوْا يَقْتُلُوْنَنِيْ ڮ فَلَا تُشْمِتْ بِيَ الْاَعْدَاۗءَ وَلَا تَجْعَلْنِيْ مَعَ الْقَوْمِ الظّٰلِمِيْنَ",
        "Urdu" : "اور جب لوٹے موسی اپنی قوم کی طرف غصے میں افسوس کرتے ہوئے تو کہا: بری ہے جو تم نے میری جانشینی کی میرے بعد کیا تم نے جلدی کی اپنے رب کے حکم سے اور ڈال دیں تختیاں اور پکڑ لیا اپنے بھائی کے سر کو کھینچتے تھے اسےاپنی طرف، کہا: ہارون نے اے میری ماں کے بیٹے بیشک قوم نے کمزور سمجھا مجھے اور قریب تھے کہ مجھے قتل کردیتے تو نہ تو خوش کر مجھ پر دشمنوں کو اور نہ شامل کر مجھے ظالم قوم کے ساتھ",
        "English" : "When Musa returned to his people, angry and sad, he said, :How bad is the thing you have done in my absence! How did you act in haste against the command of your Lord? He dropped down the Tablets, and grabbed the head of his brother, pulling him towards himself. He (Harun) said, :My mother‘s son, the people took me as weak and were about to kill me. So do not let the enemies laugh at me, and do not count me with the wrong-doers."
      },
      {
        "ayet_no" : 151,
        "arbi" : "قَالَ رَبِّ اغْفِرْ لِيْ وَلِاَخِيْ وَاَدْخِلْنَا فِيْ رَحْمَتِكَ ڮ وَاَنْتَ اَرْحَمُ الرّٰحِمِيْنَ",
        "Urdu" : "کہا (موسی نے) اے میرے رب! تو بخش دے مجھے اور میرے بھائی کو اور داخل فرما ہمیں اپنی رحمت میں اور تو زیادہ رحم کرنیوالا ہے رحم کرنیوالوں میں سے",
        "English" : "He said, :My Lord! Forgive me and my brother, and admit us into Your mercy. You are the most Merciful of all the merciful."
      },
      {
        "ayet_no" : 152,
        "arbi" : "اِنَّ الَّذِيْنَ اتَّخَذُوا الْعِجْلَ سَيَنَالُهُمْ غَضَبٌ مِّنْ رَّبِّهِمْ وَذِلَّةٌ فِي الْحَيٰوةِ الدُّنْيَا وَكَذٰلِكَ نَجْزِي الْمُفْتَرِيْنَ",
        "Urdu" : "بیشک جن لوگوں نے معبود بنایا بچھڑے کو عنقریب پہنچے گا انہیں غضب ان کے رب کی طرف سے اور ذلت دنیوی زندگی میں اور اسی طرح ہم بدلہ دیتے ہیں بہتان باندھنے والوں کو",
        "English" : "Surely, those who have taken the calf (as god) shall be seized by Allah‘s wrath and by humiliation in the worldly life. That is how we recompense the fabricators."
      },
      {
        "ayet_no" : 153,
        "arbi" : "وَالَّذِيْنَ عَمِلُوا السَّيِّاٰتِ ثُمَّ تَابُوْا مِنْۢ بَعْدِهَا وَاٰمَنُوْٓا  ۡ اِنَّ رَبَّكَ مِنْۢ بَعْدِهَا لَغَفُوْرٌ رَّحِيْمٌ",
        "Urdu" : "اور وہ لوگ جنہوں نے برے اعمال کیے پھر انہوں نے توبہ کی ان کے بعد اور وہ ایمان لے آئے یقینا تیرا رب اس کے بعد ضرور بے حد بخشنے والا بڑا مہربان ہے",
        "English" : "As for those who do evil, and repent thereafter, and embrace faith, your Lord is then most forgiving, very merciful (for them)."
      },
      {
        "ayet_no" : 154,
        "arbi" : "وَلَمَّا سَكَتَ عَنْ مُّوْسَى الْغَضَبُ اَخَذَ الْاَلْوَاحَ ښ وَفِيْ نُسْخَتِهَا هُدًى وَّرَحْمَةٌ لِّلَّذِيْنَ هُمْ لِرَبِّهِمْ يَرْهَبُوْنَ",
        "Urdu" : "اور جب ٹھنڈا ہوگیا موسی سے غصہ اٹھالیں تختیاں اور ان میں جو لکھا تھا وہ ہدایت اور رحمت تھی ان لوگوں کے لیے جو کہ وہ اپنے رب سے ڈرتے ہیں",
        "English" : "When the fury of Musa calmed down, he picked up the Tablets, and in its contents there was guidance, and mercy for those who are fearful before their Lord."
      },
      {
        "ayet_no" : 155,
        "arbi" : "وَاخْتَارَ مُوْسٰي قَوْمَهٗ سَبْعِيْنَ رَجُلًا لِّمِيْقَاتِنَا   ۚ فَلَمَّآ اَخَذَتْهُمُ الرَّجْفَةُ قَالَ رَبِّ لَوْ شِئْتَ اَهْلَكْتَهُمْ مِّنْ قَبْلُ وَاِيَّايَ  ۭاَتُهْلِكُنَا بِمَا فَعَلَ السُّفَهَاۗءُ مِنَّا   ۚ اِنْ هِىَ اِلَّا فِتْنَتُكَ ۭ تُضِلُّ بِهَا مَنْ تَشَاۗءُ وَتَهْدِيْ مَنْ تَشَاۗءُ  اَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا وَاَنْتَ خَيْرُ الْغٰفِرِيْنَ",
        "Urdu" : "اور چنے موسی نےاپنی قوم میں سے ستر آدمی ہمارے مقررہ وقت کے لیے ، پھر جب پکڑ لیا انہیں زلزلے نے کہا: اے میرے رب! اگر تو چاہتا تو ہلاک کردیتا انہیں اس سے پہلے ہی اور مجھے بھی، کیا تو ہلاک کرے گا ہمیں اس وجہ سے جو کیا بے وقوف لوگوں نے ہم میں سے نہیں ہے یہ مگر تیری آزمائش تو گمراہ کرتا ہے، اس کے ذریعے جسے تو چاہتا ہے اور ہدایت دیتا ہے جسے تو چاہتا ہے تو ہمارا کارساز ہے ، پس معاف فرماہمیں اور رحم فرما ہم پر اور تو بہترین ہے معاف کرنے والوں میں ۔",
        "English" : "And Musa selected seventy men from his people for Our appointment. Later when the earthquake seized them, he said, :My Lord, had it been Your will, You could have destroyed them earlier, and me too. Would You destroy us for what the foolish among them have done? It is nothing but a trial from You, wherewith you let go astray whom You will, and give guidance to whom You will. You are our protector, so forgive us, and have mercy on us, and You are the best among those who forgive."
      },
      {
        "ayet_no" : 156,
        "arbi" : "وَاكْتُبْ لَنَا فِيْ هٰذِهِ الدُّنْيَا حَسَـنَةً وَّفِي الْاٰخِرَةِ اِنَّا هُدْنَآ اِلَيْكَ ۭقَالَ عَذَابِيْٓ اُصِيْبُ بِهٖ مَنْ اَشَاۗءُ ۚ وَرَحْمَتِيْ وَسِعَتْ كُلَّ شَيْءٍ ۭ فَسَاَكْتُبُهَا لِلَّذِيْنَ يَتَّقُوْنَ وَيُؤْتُوْنَ الزَّكٰوةَ وَالَّذِيْنَ هُمْ بِاٰيٰتِنَا يُؤْمِنُوْنَ",
        "Urdu" : "اور لکھ دے ہمارے لیے اس دنیا میں بھلائی اور آخرت میں(بھی) بیشک ہم نے رجوع کیا تیری طرف فرمایا: جو میرا عذاب ہے، میں پہنچاتا ہوں اس کو جس پر میں چاہتا ہوں اور جو میری رحمت ہے وہ گھیرے ہوئے ہے ہر چیز کو پس عنقریب میں لکھ دوں گا اسے ان لوگوں کے لیے جو پرہیز گاری اختیار کرتے ہیں اور ادا کرتے ہیں زکوة اور وہ لوگ جو ہماری آیات پر ایمان رکھتے ہیں",
        "English" : "And write for us good in this world and in the Hereafter. We turn to You in repentance. He (Allah) said, :As for My punishment, I afflict with it whom I will. And My mercy extends to everything. So, I shall write it for those who guard themselves against evil, and pay Zakah, and those who do believe in Our verses."
      },
      {
        "ayet_no" : 157,
        "arbi" : "اَلَّذِيْنَ يَتَّبِعُوْنَ الرَّسُوْلَ النَّبِيَّ الْاُمِّيَّ الَّذِيْ يَجِدُوْنَهٗ مَكْتُوْبًا عِنْدَهُمْ فِي التَّوْرٰىةِ وَالْاِنْجِيْلِ ۡ يَاْمُرُهُمْ بِالْمَعْرُوْفِ وَيَنْهٰىهُمْ عَنِ الْمُنْكَرِ وَيُحِلُّ لَهُمُ الطَّيِّبٰتِ وَيُحَرِّمُ عَلَيْهِمُ الْخَـبٰۗىِٕثَ وَيَضَعُ عَنْهُمْ اِصْرَهُمْ وَالْاَغْلٰلَ الَّتِيْ كَانَتْ عَلَيْهِمْ ۭفَالَّذِيْنَ اٰمَنُوْا بِهٖ وَعَزَّرُوْهُ وَنَصَرُوْهُ وَاتَّبَعُوا النُّوْرَ الَّذِيْٓ اُنْزِلَ مَعَهٗٓ  ۙ اُولٰۗىِٕكَ هُمُ الْمُفْلِحُوْنَ",
        "Urdu" : "اور وہ لوگ جو پیروی کرتے ہیں رسول کی جو امی نبی ہیں وہ جو کہ پاتے ہیں اس کے اوصاف کو لکھا ہوا اپنے پاس تورات اور انجیل میں، وہ حکم دیتا ہے انہیں نیکی کا اور روکتا ہے انہیں برائی سے اور وہ حلال کرتا ہے ان کےلیے پاکیزہ چیزیں اور حرام کرتا ہے ان پر ناپاک چیزیں اور دور کرتا ہے ان سے ان کا بوجھ اور وہ طوق جو ان پر تھے تو جو لوگ ایمان لائے اس پر اور حمایت کی اس کی اور مدد کی اس کی اور انہوں نے پیروی کی اس نور کی جو اتارا گیا اس کے ساتھ وہی لوگ ہی فلاح پانے والے ہیں",
        "English" : "Those who follow the Messenger, the Ummiyy (unlettered) prophet whom they find written with them in the Torah and the Injil , and who bids them what is fair and forbids what is unfair, and makes lawful for them good things, and makes unlawful for them impure things, and relieves them of their burden, and of the shackles that were upon them. So, those who believe in him and support him, and help him and follow the light sent down with him, __ those are the ones who are successful."
      },
      {
        "ayet_no" : 158,
        "arbi" : "قُلْ يٰٓاَيُّھَا النَّاسُ اِنِّىْ رَسُوْلُ اللّٰهِ اِلَيْكُمْ جَمِيْعَۨا الَّذِيْ لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ ۚ لَآ اِلٰهَ اِلَّا هُوَ يُـحْيٖ وَيُمِيْتُ ۠ فَاٰمِنُوْا بِاللّٰهِ وَرَسُوْلِهِ النَّبِيِّ الْاُمِّيِّ الَّذِيْ يُؤْمِنُ بِاللّٰهِ وَكَلِمٰتِهٖ وَاتَّبِعُوْهُ لَعَلَّكُمْ تَهْتَدُوْنَ",
        "Urdu" : "کہہ دیجیے اے لوگو! بیشک میں اللہ کا رسول ہوں تم سب کی طرف وہ جو کہ اسی کے لیے ہے بادشاہی آسمانوں اور زمین کی نہیں ہے کوئی معبود مگر وہی، وہ زندہ کرتا ہے اور مارتا ہے پس ایمان لاؤ اللہ پر اور اس کے رسول، امی نبی پر(وہ) جو ایمان رکھتا ہے اللہ پر اور اس کی باتوں (پر) اور پیروی کرو اسی کی تاکہ تم ہدایت پا جاؤ",
        "English" : "(O Prophet Muhammad) Say, :O people, I am a messenger of Allah (sent) to you from the One to whom belongs the kingdom of the heavens and the earth. There is no god but He. He gives life and brings death. So, believe in Allah and His Messenger, the Ummiyy (unlettered) prophet, who believes in Allah and in His words, and follow him, so that you may find the right path."
      },
      {
        "ayet_no" : 159,
        "arbi" : "وَمِنْ قَوْمِ مُوْسٰٓي اُمَّةٌ يَّهْدُوْنَ بِالْحَقِّ وَبِهٖ يَعْدِلُوْنَ",
        "Urdu" : "اور موسی کی قوم میں سے ایک گروہ ایسا ہے کہ وہ رہنمائی کرتے ہیں حق کے ساتھ اور اسی حق کے ساتھ وہ عدل وانصاف کرتے ہیں",
        "English" : "Among the community of Musa there are people who guide with truth and do justice thereby."
      },
      {
        "ayet_no" : 160,
        "arbi" : "وَقَطَّعْنٰهُمُ اثْنَتَيْ عَشْرَةَ اَسْبَاطًا اُمَمًا ۭوَاَوْحَيْنَآ اِلٰي مُوْسٰٓي اِذِاسْتَسْقٰىهُ قَوْمُهٗٓ اَنِ اضْرِبْ بِّعَصَاكَ الْحَجَرَ ۚ فَانْۢبَجَسَتْ مِنْهُ اثْنَتَا عَشْرَةَ عَيْنًا ۭقَدْ عَلِمَ كُلُّ اُنَاسٍ مَّشْرَبَهُمْ ۭوَظَلَّلْنَا عَلَيْهِمُ الْغَمَامَ وَاَنْزَلْنَا عَلَيْهِمُ الْمَنَّ وَالسَّلْوٰى ۭكُلُوْا مِنْ طَيِّبٰتِ مَا رَزَقْنٰكُمْ ۭوَمَا ظَلَمُوْنَا وَلٰكِنْ كَانُوْٓا اَنْفُسَهُمْ يَظْلِمُوْنَ",
        "Urdu" : "اور ہم نے جدا جدا کردیا انہیں بارہ قبیلے (بناکر) گروہوں کی شکل میں اور ہم نے وحی کی موسی کی طرف جب پانی مانگا اس سے اس کی قوم نے یہ کہ تو مار اپنی لاٹھی کو پتھر پر تو پھوٹ پڑے اس سے بارہ چشمے تحقیق معلوم کرلیا سب لوگوں نے اپنا گھاٹ اور ہم نے سایہ کیا ان پر بادلوں کا اور ہم نے اتارا ان پر من اور سلوی تم کھاؤ پاکیزہ چیزوں سے جو ہم نے رزق دیا تمہیں اور نہیں ظلم کیا انہوں نے ہم پر اور لیکن وہ تھےاپنی جانوں پر ظلم کرتے",
        "English" : "And We divided them into twelve tribes, as separate communities, and We revealed to Musa when his people asked him for water, :Strike the rock with your staff. Then twelve springs gushed forth from it. Each tribe came to know their drinking place. We shaded them with the shadow of the clouds. And We sent down to them Mann and Salwa (saying), :Eat of the good things we have provided you. And they did us no harm, rather they have been harming their own selves."
      },
      {
        "ayet_no" : 161,
        "arbi" : "وَاِذْ قِيْلَ لَهُمُ اسْكُنُوْا هٰذِهِ الْقَرْيَةَ وَكُلُوْا مِنْهَا حَيْثُ شِئْتُمْ وَقُوْلُوْا حِطَّةٌ وَّادْخُلُوا الْبَابَ سُجَّدًا نَّغْفِرْ لَكُمْ خَطِيْۗـــٰٔــتِكُمْ ۭسَنَزِيْدُ الْمُحْسِنِيْنَ",
        "Urdu" : "اور جب کہاگیا ان سے تم رہو اس بستی میں اور کھاؤ اس میں سے جہاں سے تم چاہو اور کہو بخش دے اور داخل ہوجاؤ دروازے میں سجدہ کرتے ہوئے ہم بخش دیں گے تمہارے لیے تمہاری خطائیں عنقریب ہم زیادہ دیں گے نیکی کرنے والوں کو",
        "English" : "(Recall) when it was said to them, :Live in this town and eat therefrom anywhere you like, and say, HiTTah (we seek forgiveness) and enter the gate prostrating yourselves, so that We forgive your errors. We shall give much more to those who are good in their deeds."
      },
      {
        "ayet_no" : 162,
        "arbi" : "فَبَدَّلَ الَّذِيْنَ ظَلَمُوْا مِنْهُمْ قَوْلًا غَيْرَ الَّذِيْ قِيْلَ لَهُمْ فَاَرْسَلْنَا عَلَيْهِمْ رِجْزًا مِّنَ السَّمَاۗءِ بِمَا كَانُوْا يَظْلِمُوْنَ",
        "Urdu" : "پھر بدل دیا ان لوگوں نے جنہوں نے ظلم کیا ان میں سے بات کوعلاوہ اس کے جو کہی گئی ان سے تو ہم نے بھیجا ان پر عذاب آسمان سے اس وجہ سے جو تھے وہ ظلم کرتے",
        "English" : "But those of them who were unjust substituted another word for the one that was said to them. So, We sent down upon them a scourge from the heavens, because they had been transgressing."
      },
      {
        "ayet_no" : 163,
        "arbi" : "وَسْــــَٔـلْهُمْ عَنِ الْقَرْيَةِ الَّتِيْ كَانَتْ حَاضِرَةَ الْبَحْرِ  ۘاِذْ يَعْدُوْنَ فِي السَّبْتِ اِذْ تَاْتِيْهِمْ حِيْتَانُهُمْ يَوْمَ سَبْتِهِمْ شُرَّعًا وَّيَوْمَ لَا يَسْبِتُوْنَ ۙ لَا تَاْتِيْهِمْ ڔ كَذٰلِكَ ڔ  نَبْلُوْهُمْ بِمَا كَانُوْا يَفْسُقُوْنَ",
        "Urdu" : "اور پوچھ ان سے اس بستی کے بارے میں جو تھی سمندر کے کنارے پر موجود، جب وہ تجاوز کرتے تھے ہفتے کے دن میں جب کہ آتی تھیں ان کے پاس ان کی مچھلیاں ان کے ہفتے کے دن سر اٹھاتے ہوئے اور جس دن نہ ہوتا ان کا ہفتہ نہ آتی تھیں ان کے پاس اسی طرح ہم آزماتے تھے انہیں اس وجہ سے جو وہ نافرمانی کرتے تھے",
        "English" : "Ask them about the town situated by the sea, when they used to transgress in the matter of Sabbath, when their fish came to them openly on the Sabbath, and did not come when they did not have Sabbath. In this way, We put them to a test, because they used to act sinfully."
      },
      {
        "ayet_no" : 164,
        "arbi" : "وَاِذْ قَالَتْ اُمَّةٌ مِّنْهُمْ لِمَ تَعِظُوْنَ قَوْمَۨا اللّٰهُ مُهْلِكُهُمْ اَوْ مُعَذِّبُهُمْ عَذَابًا شَدِيْدًا قَالُوْا مَعْذِرَةً اِلٰى رَبِّكُمْ وَلَعَلَّهُمْ يَتَّقُوْنَ",
        "Urdu" : "اور جب کہا ایک گروہ نے ان میں سے کیوں تم نصیحت کرتے ہو ایسی قوم کو کہ اللہ ہلاک کرنے والا ہے انہیں یا عذاب دینے والا ہے انہیں سخت عذاب تو انہوں نے کہا معذرت پیش کرنے کے لیے تمہارے رب کی طرف اور وہ اس لیے شاید کہ وہ ڈر جائیں",
        "English" : "When a group of them said, :Why do you exhort a people whom Allah is going to destroy or chastise with a severe punishment? They said, :To absolve ourselves before your Lord, and in order that they may fear Allah."
      },
      {
        "ayet_no" : 165,
        "arbi" : "فَلَمَّا نَسُوْا مَا ذُكِّرُوْا بِهٖٓ اَنْجَيْنَا الَّذِيْنَ يَنْهَوْنَ عَنِ السُّوْۗءِ وَاَخَذْنَا الَّذِيْنَ ظَلَمُوْا بِعَذَابٍۢ بَىِٕيْــسٍۢ  بِمَا كَانُوْا يَفْسُقُوْنَ",
        "Urdu" : "پھر جب انہوں نے بھلادیا جو وہ نصیحت کیے گئے تھے ساتھ اس کے تو ہم نے نجات دی ان لوگوں کو جو روکتے تھے برائی سے اور ہم نے پکڑ لیا ان لوگوں کو جنہوں نے ظلم کیا بدترین عذاب کے ساتھ اس وجہ سے جو وہ نافرمانی کیا کرتے تھے",
        "English" : "So, when they forgot the advice they were given, We saved those who used to forbid evil and seized those who transgressed with a bitter punishment, because they had been disobeying."
      },
      {
        "ayet_no" : 166,
        "arbi" : "فَلَمَّا عَتَوْا عَنْ مَّا نُهُوْا عَنْهُ قُلْنَا لَهُمْ كُوْنُوْا قِرَدَةً خٰسِـِٕـيْنَ",
        "Urdu" : "پھر جب انہوں نے سرکشی کی اس سے وہ روکے گئے تھے اس سے، توہم نے کہا ان سے کہ تم ہوجاؤ ذلیل بندر",
        "English" : "When they persisted in doing what they were forbidden from, We said to them, :Become apes debased."
      },
      {
        "ayet_no" : 167,
        "arbi" : "وَاِذْ تَاَذَّنَ رَبُّكَ لَيَبْعَثَنَّ عَلَيْهِمْ اِلٰي يَوْمِ الْقِيٰمَةِ مَنْ يَّسُوْمُهُمْ سُوْۗءَ الْعَذَابِ ۭ اِنَّ رَبَّكَ لَسَرِيْعُ الْعِقَابِ   ښ وَاِنَّهٗ لَغَفُوْرٌ رَّحِيْمٌ",
        "Urdu" : "اور جب اعلان کردیا تیرے رب نے کہ وہ البتہ ضرور بھیجتا رہے گا، ان پر قیامت کے دن تک جو چکھاتا رہے گا انہیں برا عذاب بیشک تیرا رب یقینا بہت جلد سزا (دینے) والا ہے۔ اور بیشک وہ یقینا بہت بخشنے والا ، نہایت رحم کرنیوالا ہے ۔",
        "English" : "(Recall) when your Lord declared that He would surely keep sending, till the Day of Judgment, those who inflict on them evil chastisement. Certainly, your Lord is swift in punishing, and certainly He is the Most-forgiving, Very Merciful."
      },
      {
        "ayet_no" : 168,
        "arbi" : "وَقَطَّعْنٰهُمْ فِي الْاَرْضِ اُمَمًا ۚمِنْهُمُ الصّٰلِحُوْنَ وَمِنْهُمْ دُوْنَ ذٰلِكَ ۡ وَبَلَوْنٰهُمْ بِالْحَسَنٰتِ وَالسَيِّاٰتِ لَعَلَّهُمْ يَرْجِعُوْنَ",
        "Urdu" : "اور ہم نے جدا جدا کردیا انہیں زمین میں گروہوں کی شکل میں، ان میں سے کچھ نیک تھے اور ان میں سے کچھ اس کے علاوہ تھے، اور ہم نے آزمایا انہیں خوشحالیوں اور بدحالیوں سے شاید کہ وہ رجوع کریں (اللہ کی طرف)",
        "English" : "We divided them on the earth as separate communities. Some of them were righteous, while some others were otherwise. We tested them with good and bad times, so that they might return."
      },
      {
        "ayet_no" : 169,
        "arbi" : "فَخَلَفَ مِنْۢ بَعْدِهِمْ خَلْفٌ وَّرِثُوا الْكِتٰبَ يَاْخُذُوْنَ عَرَضَ هٰذَا الْاَدْنٰى وَيَقُوْلُوْنَ سَيُغْفَرُ لَنَا  ۚ وَاِنْ يَّاْتِهِمْ عَرَضٌ مِّثْلُهٗ يَاْخُذُوْهُ  ۭ اَلَمْ يُؤْخَذْ عَلَيْهِمْ مِّيْثَاقُ الْكِتٰبِ اَنْ لَّا يَقُوْلُوْا عَلَي اللّٰهِ اِلَّا الْحَقَّ وَدَرَسُوْا مَا فِيْهِ ۭوَالدَّارُ الْاٰخِرَةُ خَيْرٌ لِّلَّذِيْنَ يَتَّقُوْنَ  ۭ اَفَلَا تَعْقِلُوْنَ",
        "Urdu" : "پھر جانشین بنے ان کے بعد کچھ ناخلف جو وارث ہوئے کتاب تورات کے وہ لے لیتے ہیں، سامان اس حقیر(دنیا) کا اور کہتے ہیں عنقریب بخش دیا جائے گا ہمیں اور اگر آجائے ان کے پاس کچھ سامان اس جیسا تو وہ لے لیتے اسے بھی کیا نہیں لازم کیا گیا، ان پر کتاب کا پختہ عہد یہ کہ نہ وہ کہیں گے اللہ پر مگر حق اور انہوں نے پڑھ لیا جو کچھ اس میں تھا اور آخرت کا گھر بہتر ہے ان کے لیے جو تقوی اختیار کرتے ہیں تو کیا تم عقل نہیں کرتے",
        "English" : "Then, after them, came a generation that inherited the Book, opting for the mundane stuff of this world and saying, :We shall be forgiven. But if there comes to them similar stuff, they would opt for it (again). Was not the covenant of the Book taken from them that they should not say anything but the truth about Allah? They learnt what it contained. Certainly, the Last Abode is better for those who fear Allah. Have you then, no sense ?"
      },
      {
        "ayet_no" : 170,
        "arbi" : "وَالَّذِيْنَ يُمَسِّكُوْنَ بِالْكِتٰبِ وَاَقَامُوا الصَّلٰوةَ ۭاِنَّا لَا نُضِيْعُ اَجْرَ الْمُصْلِحِيْنَ",
        "Urdu" : "اور وہ لوگ جو مضبوطی سے پکڑتے ہیں کتاب کو اور انہوں نے قائم کی نماز، بیشک ہم نہیں ہم ضائع کرتے اصلاح کرنیوالوں کا اجر",
        "English" : "Those who hold fast to the Book and establish Salah, We shall never let the reward of (such) righteous people to go to waste."
      },
      {
        "ayet_no" : 171,
        "arbi" : "وَاِذْ نَتَقْنَا الْجَبَلَ فَوْقَهُمْ كَاَنَّهٗ ظُلَّـةٌ وَّظَنُّوْٓا اَنَّهٗ وَاقِعٌۢ  بِهِمْ ۚ خُذُوْا مَآ اٰتَيْنٰكُمْ بِقُوَّةٍ وَّاذْكُرُوْا مَا فِيْهِ لَعَلَّكُمْ تَتَّقُوْنَ",
        "Urdu" : "اور جب ہم نے اٹھایا پہاڑ کو ان کے اوپر گویا کہ وہ ایک سائبان تھا اور انہوں نے یقین کرلیا کہ بیشک وہ گرنے والا ہے ان پر ہم نے کہا پکڑلو جو کچھ ہم نے تمہیں دیا ہے مضبوطی سے اور یادرکھو جو کچھ اس میں ہے، تاکہ تم بچ جاؤ",
        "English" : "When We raised the mountain over them as though it were a canopy, and they thought it was falling upon them, (We said,) :Adhere firmly to what We have given you and remember what is therein, so that you may become God-fearing."
      },
      {
        "ayet_no" : 172,
        "arbi" : "وَاِذْ اَخَذَ رَبُّكَ مِنْۢ بَنِيْٓ اٰدَمَ مِنْ ظُهُوْرِهِمْ ذُرِّيَّتَهُمْ وَاَشْهَدَهُمْ عَلٰٓي اَنْفُسِهِمْ ۚ اَلَسْتُ بِرَبِّكُمْ ۭ قَالُوْا بَلٰي ڔ شَهِدْنَا ڔ اَنْ تَقُوْلُوْا يَوْمَ الْقِيٰمَةِ اِنَّا كُنَّا عَنْ هٰذَا غٰفِلِيْنَ",
        "Urdu" : "اور جب لیا (نکالا) تیرے رب نے اولاد آدم سے ان کی پشتوں سے ان کی اولاد کو اور گواہ بنایا ان کو ان کی جانوں پر کیا نہیں ہوں میں تمہارا رب تو انہوں نے کہا ہاں، کیوں نہیں ہم نے گواہی دی ایسا نہ ہو کہ تم کہو قیامت کے دن بیشک ہم تھے اس بات سے غافل",
        "English" : "(Recall) when your Lord brought forth their progeny from the loins of the children of ‘Adam, and made them testify about themselves (by asking them,) :Am I not your Lord? They said, :Of course, You are. We testify. (We did so) lest you should say on the Day of Judgment, :We were unaware of this."
      },
      {
        "ayet_no" : 173,
        "arbi" : " اَوْ تَقُوْلُوْٓا اِنَّمَآ اَشْرَكَ اٰبَاۗؤُنَا مِنْ قَبْلُ وَكُنَّا ذُرِّيَّةً مِّنْۢ بَعْدِهِمْ ۚ اَفَتُهْلِكُنَا بِمَا فَعَلَ الْمُبْطِلُوْنَ",
        "Urdu" : "یا تم یہ کہو بیشک شرک کیا تھا ہمارے آباؤ و اجداد نے اس سے قبل اور ہم تھے ان کی اولاد ان کے بعد تو کیا تو ہلاک کرتا ہے ہمیں اس وجہ سے جو کیا گمراہوں نے",
        "English" : "Or lest ye should say: it Was only our fathers who associated afore, and we have been a posterity after them; wilt Thou then destroy us for that which the followers of falsehood did?"
      },
      {
        "ayet_no" : 174,
        "arbi" : "وَكَذٰلِكَ نُفَصِّلُ الْاٰيٰتِ وَلَعَلَّهُمْ يَرْجِعُوْنَ",
        "Urdu" : "اور اسی طرح ہم تفصیل سے بیان کرتے ہیں آیات کو اور تاکہ وہ رجوع کریں",
        "English" : "This is how We elaborate the verses, so that they may return."
      },
      {
        "ayet_no" : 175,
        "arbi" : "وَاتْلُ عَلَيْهِمْ نَبَاَ الَّذِيْٓ اٰتَيْنٰهُ اٰيٰتِنَا فَانْسَلَخَ مِنْهَا فَاَتْبَعَهُ الشَّيْطٰنُ فَكَانَ مِنَ الْغٰوِيْنَ",
        "Urdu" : "اور پڑھیے ان پر خبر اس کی جو کہ ہم نے دیں اسےاپنی آیتیں، پھر وہ نکل گیا ان سے پھر پیچھے لگایا اسے شیطان نے تو وہ ہوگیا گمراہوں میں سے",
        "English" : "Recite to them the story of the one whom We gave Our verses, then he wriggled out from them, so Satan pursued him and he became one of the perverted."
      },
      {
        "ayet_no" : 176,
        "arbi" : "وَلَوْ شِئْنَا لَرَفَعْنٰهُ بِهَا وَلٰكِنَّهٗٓ اَخْلَدَ اِلَى الْاَرْضِ وَاتَّبَعَ هَوٰىهُ ۚ فَمَثَلُهٗ كَمَثَلِ الْكَلْبِ ۚ اِنْ تَحْمِلْ عَلَيْهِ يَلْهَثْ اَوْ تَتْرُكْهُ يَلْهَثْ ۭ ذٰلِكَ مَثَلُ الْقَوْمِ الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَا ۚ فَاقْصُصِ الْقَصَصَ لَعَلَّهُمْ يَتَفَكَّرُوْنَ",
        "Urdu" : "اور اگر ہم چاہتے ضرور ہم بلند کرتے اسے ان کے ذریعے اور لیکن وہ جھک گیا زمین کی طرف اور اس نے پیروی کی اپنی خواہش کی تو اس کی مثال کتےکی طرح ہے اگر تو بوجھ لادے اس پر تو وہ زبان نکال کر ہانپتا ہے یا تو چھوڑدے اسے (پھر بھی) زبان نکال کر ہانپتا ہے یہ اس قوم کی مثال ہے جنہوں نے جھٹلایا ہماری آیات کو، تو آپ سنادیں یہ بیان تاکہ وہ غور وفکر کریں",
        "English" : "If We so willed, We would have elevated him thereby; but he clung to the earth and followed his desires. So, his example is like the example of a dog, if you attack him, he pants with his tongue protruding, and if you leave him alone he still pants with his tongue protruding. That is the example of those who rejected Our signs. So, relate the chronicles, so that they may ponder."
      },
      {
        "ayet_no" : 177,
        "arbi" : "سَاۗءَ مَثَلَۨا الْقَوْمُ الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَا وَاَنْفُسَهُمْ كَانُوْا يَظْلِمُوْنَ",
        "Urdu" : "بری ہے وہ قوم مثال کے لحاظ سے جنہوں نے جھٹلایا ہماری آیات کو اور اپنی جانوں پر وہ ظلم کرتے تھے",
        "English" : "Evil is the example of those who have rejected Our signs and have been doing wrong to themselves."
      },
      {
        "ayet_no" : 178,
        "arbi" : "مَنْ يَّهْدِ اللّٰهُ فَهُوَ الْمُهْتَدِيْ ۚ وَمَنْ يُّضْلِلْ فَاُولٰۗىِٕكَ هُمُ الْخٰسِرُوْنَ",
        "Urdu" : "جسے اللہ ہدایت دے تو وہی ہدایت یافتہ ہے اور جسے وہ گمراہ کردے تو وہی لوگ ہی خسارہ پانے والے ہیں",
        "English" : "The one whom Allah gives guidance is the one on the right path. As for those whom Allah lets go astray, those are the losers."
      },
      {
        "ayet_no" : 179,
        "arbi" : "وَلَقَدْ ذَرَاْنَا لِجَهَنَّمَ كَثِيْرًا مِّنَ الْجِنِّ وَالْاِنْسِ ڮ لَهُمْ قُلُوْبٌ لَّا يَفْقَهُوْنَ بِهَا ۡ وَلَهُمْ اَعْيُنٌ لَّا يُبْصِرُوْنَ بِهَا  ۡ وَلَهُمْ اٰذَانٌ لَّا يَسْمَعُوْنَ بِهَا  ۭاُولٰۗىِٕكَ كَالْاَنْعَامِ بَلْ هُمْ اَضَلُّ  اُولٰۗىِٕكَ هُمُ الْغٰفِلُوْنَ",
        "Urdu" : "اور البتہ تحقیق ہم نے پیدا کیے جہنم کے لیے بہت سے جن اور انسان ان کے دل ہیں لیکن وہ نہیں سمجھتے ان سے اور ان کی انکھیں ہیں لیکن وہ دیکھتے نہیں ان سے اور ان کے کان ہیں لیکن وہ سنتے نہیں ان سے یہ لوگ چوپاؤں کی طرح ہیں بلکہ وہ (ان سے بھی) زیادہ گمراہ ہیں وہ لوگ ہی بے خبر ہیں",
        "English" : "Surely We have created for Hell a lot of people from among Jinn and mankind. They have hearts wherewith they do not understand, eyes wherewith they do not see, and ears wherewith they do not hear. They are like cattle. Rather, they are much more astray. They are the heedless."
      },
      {
        "ayet_no" : 180,
        "arbi" : "وَلِلّٰهِ الْاَسْمَاۗءُ الْحُسْنٰى فَادْعُوْهُ بِهَا ۠ وَذَرُوا الَّذِيْنَ يُلْحِدُوْنَ فِيْٓ اَسْمَاۗىِٕهٖ ۭ سَيُجْزَوْنَ مَا كَانُوْا يَعْمَلُوْنَ",
        "Urdu" : "اور اللہ ہی کے ہیں سب نام اچھے اچھے تو تم پکارو اسے ان کے ساتھ اور چھوڑدو ان لوگوں کو جو کج روی اختیار کرتے ہیں اس کے ناموں (کے بارے میں )عنقریب وہ بدلہ دیے جائیں گے اس کا جو وہ عمل کرتے تھے",
        "English" : "For Allah there are the most beautiful names. So, call Him by them, and leave those who deviate in (the matter of) His names. They shall be recompensed for what they have been doing."
      },
      {
        "ayet_no" : 181,
        "arbi" : "وَمِمَّنْ خَلَقْنَآ اُمَّةٌ يَّهْدُوْنَ بِالْحَقِّ وَبِهٖ يَعْدِلُوْنَ",
        "Urdu" : "اور ان میں سے جنہیں ہم نے پیدا کیا ایک گروہ ہے جو رہنمائی کرتے ہیں حق کے ساتھ اور اس کے ساتھ وہ عدل کرتے ہیں",
        "English" : "Among those whom We have created there are people who guide with truth and do justice thereby."
      },
      {
        "ayet_no" : 182,
        "arbi" : "وَالَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَا سَنَسْـتَدْرِجُهُمْ مِّنْ حَيْثُ لَا يَعْلَمُوْنَ",
        "Urdu" : "اور وہ لوگ جنہوں نے جھٹلایا ہماری آیات کو عنقریب ہم پکڑیں گے تدریجا انہیں جہاں سے وہ جانتے نہ ہوں گے",
        "English" : "As for those who reject Our signs, We will lead them gradually (towards their punishment) in a way that they do not know."
      },
      {
        "ayet_no" : 183,
        "arbi" : "وَاُمْلِيْ لَهُمْ ڵ اِنَّ كَيْدِيْ مَتِيْنٌ",
        "Urdu" : "اور میں مہلت دوں گا انہیں بیشک میری تدبیربہت مضبوط ہے ۔",
        "English" : "I give them respite. Surely My plan is firm."
      },
      {
        "ayet_no" : 184,
        "arbi" : "اَوَلَمْ يَتَفَكَّرُوْا ۫مَا بِصَاحِبِهِمْ مِّنْ جِنَّةٍ ۭاِنْ هُوَ اِلَّا نَذِيْرٌ مُّبِيْنٌ",
        "Urdu" : "اور کیا نہیں انہوں غور کیا نہیں ہے ان کے ساتھی کو کوئی جنون نہیں ہے وہ مگر واضح ڈرانے والا",
        "English" : "Have they not reflected that their fellow (i.e. the Holy Prophet) does not suffer from any madness? He is but a plain warner."
      },
      {
        "ayet_no" : 185,
        "arbi" : "اَوَلَمْ يَنْظُرُوْا فِيْ مَلَكُوْتِ السَّمٰوٰتِ وَالْاَرْضِ وَمَا خَلَقَ اللّٰهُ مِنْ شَيْءٍ  ۙ وَّاَنْ عَسٰٓي اَنْ يَّكُوْنَ قَدِ اقْتَرَبَ اَجَلُهُمْ ۚ فَبِاَيِّ حَدِيْثٍۢ بَعْدَهٗ يُؤْمِنُوْنَ",
        "Urdu" : "اور کیا نہیں انہوں نے دیکھا آسمانوں کی بادشاہی میں اور زمین کی اور جو اللہ نے پیدا کی ہے کوئی چیز اور شاید یہ کہ ہو یقینا قریب ان کا مقررہ وقت تو کس بات پر اس کے بعد وہ ایمان لائیں گے",
        "English" : "Have they not looked into the kingdom of the heavens and the earth, and into the things Allah has created, and into the fact that their time might have possibly drawn near? In which other discourse, then, shall they believe after this ?"
      },
      {
        "ayet_no" : 186,
        "arbi" : "مَنْ يُّضْلِلِ اللّٰهُ فَلَا هَادِيَ لَهٗ ۭ وَيَذَرُهُمْ فِيْ طُغْيَانِهِمْ يَعْمَهُوْنَ",
        "Urdu" : "جسے اللہ گمراہ کردے تو کوئی نہیں ہدایت دینے والا اسے اور وہ چھوڑدیتا ہے انہیں ان کی سرکشی میں وہ بھٹکتے پھرتے ہیں",
        "English" : "For those whom Allah lets go astray, there is no one to guide, and He leaves them wandering blindly in their rebellion."
      },
      {
        "ayet_no" : 187,
        "arbi" : "يَسْــــَٔـلُوْنَكَ عَنِ السَّاعَةِ اَيَّانَ مُرْسٰىهَا  ۭقُلْ اِنَّمَا عِلْمُهَا عِنْدَ رَبِّيْ   ۚ لَا يُجَلِّيْهَا لِوَقْتِهَآ اِلَّا هُوَ  ۂ ثَقُلَتْ فِي السَّمٰوٰتِ وَالْاَرْضِ  ۭ لَا تَاْتِيْكُمْ اِلَّا بَغْتَةً  ۭ يَسْــــَٔـلُوْنَكَ كَاَنَّكَ حَفِيٌّ عَنْهَا  قُلْ اِنَّمَا عِلْمُهَا عِنْدَ اللّٰهِ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ",
        "Urdu" : "پوچھتے ہیں آپ سے قیامت کے بارے میں کہ کب ہے اس کا واقع ہونا، کہہ دیجیے درحقیقت اس کا علم تو میرے رب کے پاس ہے نہیں ظاہر کرتا اسے اس کے وقت پر مگر وہی وہ (قیامت) بہت بھاری ہے آسمانوں اور زمین میں نہیں آئے گی تم پر مگر اچانک وہ (ایسے) پوچھ رہے ہیں آپ سے گویا کہ آپ خوب تحقیق کرنے والے ہیں اس کی کہہ دیجیے درحقیقت اس کا علم اللہ کے پاس ہے اور لیکن اکثر لوگ نہیں جانتے",
        "English" : "They ask you about the Hour (i.e. the Doomsday), :When is it due to happen? Say, :Its knowledge is only with my Lord. No one can unfold it except He at its time. It shall weigh heavy in the heavens and the earth. It shall not come upon you but suddenly. They ask you as if you were aware of it. Say, :Its knowledge is only with Allah, but most of the people do not know."
      },
      {
        "ayet_no" : 188,
        "arbi" : "قُلْ لَّآ اَمْلِكُ لِنَفْسِيْ نَفْعًا وَّلَا ضَرًّا اِلَّا مَا شَاۗءَ اللّٰهُ ۭوَلَوْ كُنْتُ اَعْلَمُ الْغَيْبَ لَاسْتَكْثَرْتُ مِنَ الْخَيْر ِ ٻ وَمَا مَسَّنِيَ السُّوْۗءُ ڔ اِنْ اَنَا اِلَّا نَذِيْرٌ وَّبَشِيْرٌ لِّقَوْمٍ يُّؤْمِنُوْنَ",
        "Urdu" : "کہہ د یجیے نہیں میں اختیار رکھتااپنی جان کے لیے کسی نفع کا اور نہ کسی نقصان کا مگر جو اللہ چاہے اور اگر میں ہوتا جانتا غیب کو یقینا میں بہت حاصل کرلیتا بھلائی سے اور نہ پہنچتی مجھے کبھی کوئی تکلیف نہیں ہوں میں مگر ایک ڈرانے وال ااور خوشخبری دینے وال ااس قوم کے لیے جو ایمان رکھتے ہیں",
        "English" : "Say, :I have no power to bring a benefit or a harm to myself, except that which Allah wills. If I had the knowledge of the Unseen, I would have accumulated a lot of good things, and no evil would have ever touched me. I am but a warner, and a herald of good news for a people who believe."
      },
      {
        "ayet_no" : 189,
        "arbi" : "هُوَ الَّذِيْ خَلَقَكُمْ مِّنْ نَّفْسٍ وَّاحِدَةٍ وَّجَعَلَ مِنْهَا زَوْجَهَا لِيَسْكُنَ اِلَيْهَا  ۚ فَلَمَّا تَغَشّٰىهَا حَمَلَتْ حَمْلًا خَفِيْفًا فَمَرَّتْ بِهٖ ۚ فَلَمَّآ اَثْقَلَتْ دَّعَوَا اللّٰهَ رَبَّهُمَا لَىِٕنْ اٰتَيْتَنَا صَالِحًا لَّنَكُوْنَنَّ مِنَ الشّٰكِرِيْنَ",
        "Urdu" : "اللہ وہ ہے جس نے پیدا کیا تمہیں ایک جان سے اور اس نے بنایا اس سے اس کا جوڑا تاکہ وہ سکون حاصل کرے اس سے پھر جب اس نے ڈھانک لیا اسے (صحبت کی) تو اٹھایا اس نے ہلکا سا حمل تو لیے پھرتی رہی اس کو، پھر جب وہ بوجھل ہوگئی تو ان دونوں نے دعا کی اپنے رب اللہ سے البتہ اگر تونے دیا ہمیں تندرست بچہ تو یقینا ہم ہوں گے شکر گزاروں میں سے",
        "English" : "He is the One who has created you from a single soul, and out of him created his wife, so that he may find comfort in her. So when he covers her with himself, she carries a light burden and moves about with it. Thereafter, when she grows heavy, they both pray to Allah, their Lord, :If You bless us with a perfect child, we shall be grateful."
      },
      {
        "ayet_no" : 190,
        "arbi" : "فَلَمَّآ اٰتٰىهُمَا صَالِحًا جَعَلَا لَهٗ شُرَكَاۗءَ فِيْمَآ اٰتٰىهُمَا ۚ فَتَعٰلَى اللّٰهُ عَمَّا يُشْرِكُوْنَ",
        "Urdu" : "پھر جب اس نے دے دیا ان دونوں کو تندرست (بچہ) تو دونوں نے بنائے اس کے شریک اس میں جو اس نے دیا انہیں پس بہت بلند ہے اللہ اس سے جو وہ شریک بناتے ہیں",
        "English" : "But when We bless them with a perfect child, they ascribe partners to Him in what He blessed them with. Indeed Allah is much higher than what they associate with Him."
      },
      {
        "ayet_no" : 191,
        "arbi" : "اَيُشْرِكُوْنَ مَا لَا يَخْلُقُ شَـيْــــًٔـا وَّهُمْ يُخْلَقُوْنَ",
        "Urdu" : "کیا وہ شریک بناتے ہیں انہیں جو نہیں پید اکرسکتے کوئی چیز حالانکہ وہ خود پیدا کیے جاتے ہیں",
        "English" : "Do they associate those with Allah who do not create any thing, rather, they are created (themselves) ?"
      },
      {
        "ayet_no" : 192,
        "arbi" : "وَلَا يَسْتَطِيْعُوْنَ لَهُمْ نَصْرًا وَّلَآ اَنْفُسَهُمْ يَنْصُرُوْنَ",
        "Urdu" : "اور نہیں وہ طاقت رکھتے ان کی مدد کرنے کی اور نہ وہ اپنے نفسوں کی مدد کرسکتے ہیں",
        "English" : "And they (the alleged partners) cannot extend to them any help, nor can they help themselves."
      },
      {
        "ayet_no" : 193,
        "arbi" : "وَاِنْ تَدْعُوْهُمْ اِلَى الْهُدٰى لَا يَتَّبِعُوْكُمْ ۭ سَوَاۗءٌ عَلَيْكُمْ اَدَعَوْتُمُوْهُمْ اَمْ اَنْتُمْ صَامِتُوْنَ",
        "Urdu" : "اور اگر تم بلاؤ انہیں ہدایت کی طرف تو نہیں وہ پیروی کریں گے تمہاری برابر ہے تم پر خواہ تم پکارو انہیں یا تم خاموش رہنے والے ہو ۔",
        "English" : "If you call them to the right path, they will not follow you. It is all the same for them whether you call them or remain silent."
      },
      {
        "ayet_no" : 194,
        "arbi" : "اِنَّ الَّذِيْنَ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ عِبَادٌ اَمْثَالُكُمْ فَادْعُوْهُمْ فَلْيَسْتَجِيْبُوْا لَكُمْ اِنْ كُنْتُمْ صٰدِقِيْنَ",
        "Urdu" : "بیشک وہ لوگ جنہیں تم پکارتے ہو اللہ کے علاوہ وہ تو بندے ہیں تمہاری طرح، سو تم پکارو انہیں پھر چاہیے کہ وہ جواب دیں تمہیں اگر ہو تم سچے",
        "English" : "Surely, those whom you invoke beside Allah are slaves (of Allah) like you. So, call them, and they should respond to you if you are true."
      },
      {
        "ayet_no" : 195,
        "arbi" : "اَلَهُمْ اَرْجُلٌ يَّمْشُوْنَ بِهَآ  ۡ اَمْ لَهُمْ اَيْدٍ يَّبْطِشُوْنَ بِهَآ  ۡ اَمْ لَهُمْ اَعْيُنٌ يُّبْصِرُوْنَ بِهَآ  ۡ اَمْ لَهُمْ اٰذَانٌ يَّسْمَعُوْنَ بِهَا  ۭقُلِ ادْعُوْا شُرَكَاۗءَكُمْ ثُمَّ كِيْدُوْنِ فَلَا تُنْظِرُوْنِ",
        "Urdu" : "کیا ان کے پاؤ ں ہیں کہ وہ چلتے ہوں ان سے یا ان کے ہاتھ ہیں کہ وہ پکڑتے ہوں ان سے یا ان کی انکھیں ہیں کہ وہ دیکھتے ہوں ان سے یا ان کے کان ہیں کہ وہ سنتے ہوں ان سے کہہ دیجیے تم بلا لو اپنے شریکوں کو پھر تم تدبیرکرو میرے خلاف پس نہ مہلت دو مجھے",
        "English" : "Do they have legs to walk with? Or do they have hands to grasp with? Or do they have eyes to see with or do they have ears to hear with? Say, :Call to your associate-gods, then, plot against me and allow me no respite."
      },
      {
        "ayet_no" : 196,
        "arbi" : "اِنَّ وَلِيّۦ اللّٰهُ الَّذِيْ نَزَّلَ الْكِتٰبَ ڮ وَهُوَ يَتَوَلَّى الصّٰلِحِيْنَ",
        "Urdu" : "بیشک میرا کارساز اللہ ہے جس نے کتاب اتاری ہے اور وہی کارسازی کرتا ہے نیکوں کی",
        "English" : "Surely, my protector is Allah who has revealed the Book and who does protect the righteous."
      },
      {
        "ayet_no" : 197,
        "arbi" : "وَالَّذِيْنَ تَدْعُوْنَ مِنْ دُوْنِهٖ لَا يَسْتَطِيْعُوْنَ نَصْرَكُمْ وَلَآ اَنْفُسَهُمْ يَنْصُرُوْنَ",
        "Urdu" : "اور وہ لوگ جنہیں تم پکارتے ہو اس کے سوا نہیں وہ طاقت رکھتے تمہاری مدد (کرنے) کی اور نہ اپنے نفسوں کی وہ مدد کرسکتے ہیں",
        "English" : "Those whom you call beside Him cannot help you, nor can they help themselves."
      },
      {
        "ayet_no" : 198,
        "arbi" : "وَاِنْ تَدْعُوْهُمْ اِلَى الْهُدٰى لَا يَسْمَعُوْا ۭوَتَرٰىهُمْ يَنْظُرُوْنَ اِلَيْكَ وَهُمْ لَا يُبْصِرُوْنَ",
        "Urdu" : "اور اگر تم بلاؤ انہیں ہدایت کی طرف تو نہیں وہ سنیں گے اور آپ دیکھتے ہیں انہیں کہ وہ دیکھ رہے ہوں آپ کی طرف حالانکہ وہ نہیں دیکھتے ۔",
        "English" : "If you call them for guidance, they shall not hear. You see them as if they are looking at you, while they cannot see."
      },
      {
        "ayet_no" : 199,
        "arbi" : "خُذِ الْعَفْوَ وَاْمُرْ بِالْعُرْفِ وَاَعْرِضْ عَنِ الْجٰهِلِيْنَ",
        "Urdu" : "اختیار کیجیے درگزر کرنے کو اور حکم دیجیے نیکی کا اور اعراض کیجیے جاہلوں سے",
        "English" : "( O Prophet ) take forgiveness (as your habit), enjoin virtue, and ignore the ignorant."
      },
      {
        "ayet_no" : 200,
        "arbi" : "وَاِمَّا يَنْزَغَنَّكَ مِنَ الشَّيْطٰنِ نَزْغٌ فَاسْتَعِذْ بِاللّٰهِ ۭاِنَّهٗ سَمِيْعٌ عَلِيْمٌ",
        "Urdu" : "اور اگر ضرور ابھارے آپ کو شیطان کی طرف سے کوئی وسوسہ ، تو پناہ مانگیے اللہ سے بیشک وہ خوب سننے والا اور خوب جاننے والا ہے",
        "English" : "Should a stroke from the Satan strike you, seek refuge with Allah. Surely, He is All-Hearing, All-Knowing."
      },
      {
        "ayet_no" : 201,
        "arbi" : "اِنَّ الَّذِيْنَ اتَّقَوْا اِذَا مَسَّهُمْ طٰۗىِٕفٌ مِّنَ الشَّيْطٰنِ تَذَكَّرُوْا فَاِذَا هُمْ مُّبْصِرُوْنَ",
        "Urdu" : "بیشک وہ لوگ جنہوں نے تقوی اختیار کیا جب چھو جائے انہیں کوئی (برا) خیال شیطان سے تو چونک پڑتے ہیں پھر اچانک وہ دیکھنے والے (یعنی سوجھ بوجھ والے) ہوجاتے ہیں",
        "English" : "Surely when the God-fearing are touched by any instigation from Satan, they become conscious (of Allah), and at once they discern (the reality)."
      },
      {
        "ayet_no" : 202,
        "arbi" : "وَاِخْوَانُهُمْ يَمُدُّوْنَهُمْ فِي الْغَيِّ ثُمَّ لَا يُقْصِرُوْنَ",
        "Urdu" : "اور ان کے (شیطان) بھائی کھینچتے ہیں انہیں گمراہی میں پھر وہ کمی کرتے",
        "English" : "As for the brethren of satans, they are dragged by them on into the error, and they do not desist."
      },
      {
        "ayet_no" : 203,
        "arbi" : "وَاِذَا لَمْ تَاْتِهِمْ بِاٰيَةٍ قَالُوْا لَوْلَا اجْتَبَيْتَهَا  ۭقُلْ اِنَّمَآ اَتَّبِعُ مَا يُوْحٰٓى اِلَيَّ مِنْ رَّبِّيْ  ۚ هٰذَا بَصَاۗىِٕرُ مِنْ رَّبِّكُمْ وَهُدًى وَّرَحْمَةٌ لِّقَوْمٍ يُّؤْمِنُوْنَ",
        "Urdu" : "اور جب نہ لائیں آپ ان کے پاس کوئی نشانی تو کہتے ہیں کیوں نہ تونے خود بنالیا اسے کہہ دیجیے درحقیقت میں تو پیروی کرتا ہوں جو وحی کی جاتی ہے میری طرف میرے رب کی طرف سے یہ روشن دلائل ہیں تمہارے رب کی طرف سے اور ہدایت اور رحمت ہے اس قوم کے لیے جو ایمان لائے ہیں",
        "English" : "When you do not bring them a sign, they say, :Could you not make up one? Say, :I only follow what is revealed to me from my Lord. This is (a Book of) insights from your Lord and a guidance and mercy for a people who believe."
      },
      {
        "ayet_no" : 204,
        "arbi" : "وَاِذَا قُرِئَ الْقُرْاٰنُ فَاسْتَمِعُوْا لَهٗ وَاَنْصِتُوْا لَعَلَّكُمْ تُرْحَمُوْنَ",
        "Urdu" : "اور جب پڑھا جائے قران تو غور سے سنا کرو اس کو اور خاموش رہو تا کہ تم رحم کیے جاؤ",
        "English" : "When the Qur‘an is recited, listen to it and be silent, so that you may be blessed."
      },
      {
        "ayet_no" : 205,
        "arbi" : "وَاذْكُرْ رَّبَّكَ فِيْ نَفْسِكَ تَضَرُّعًا وَّخِيْفَةً وَّدُوْنَ الْجَــهْرِ مِنَ الْقَوْلِ بِالْغُدُوِّ وَالْاٰصَالِ وَلَا تَكُنْ مِّنَ الْغٰفِلِيْنَ",
        "Urdu" : "اور یاد کیجیے اپنے رب کو اپنے دل میں عاجزی سے اور ڈرتے ہوئے اور بغیر بلند آواز کے صبح کو اور شام کو اور مت ہوجاؤ تم غافلوں میں سے",
        "English" : "Remember your Lord in your heart with humility and awe, and without speaking loudly, in mornings and evenings, and do not be among the heedless."
      },
      {
        "ayet_no" : 206,
        "arbi" : "اِنَّ الَّذِيْنَ عِنْدَ رَبِّكَ لَا يَسْتَكْبِرُوْنَ عَنْ عِبَادَتِهٖ وَيُسَبِّحُوْنَهٗ وَلَهٗ يَسْجُدُوْنَ {السجدہ}",
        "Urdu" : "بیشک وہ لوگ جو تیرے رب کے پاس ہیں نہیں وہ تکبر کرتے اس کی عبادت سے اور وہ تسبیح بیان کرتے ہیں اس کی اور اسی کو وہ سجدہ کرتے ہیں",
        "English" : "Surely, those who are with your Lord (i.e. the angels) are not arrogant against His worship, and they proclaim His purity, and before Him they prostrate themselves."
      }

    ]
  }
]