[
  {
    "surah_no" : 23,
    "total_ayah" : 118,
    "name" : "Surah e MuMinun",
    "detail" : [

      {
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "قَدْ اَفْلَحَ الْمُؤْمِنُوْنَ",
        "Urdu" : "بیشک فلاح پا لی ان ایمان والوں نے ف۱",
        "English" : "Successful indeed are the believers."
      },
      {
        "ayet_no" : 2,
        "arbi" : "الَّذِيْنَ هُمْ فِيْ صَلَاتِهِمْ خٰشِعُوْنَ",
        "Urdu" : "(جو صحیح عقائد کے ساتھ ساتھ یہ صفات بھی اپنے اندر رکھتے ہیں کہ) وہ خشوع اور خضوع سے کام لیتے ہیںاپنی نماز میں ف۲",
        "English" : "Those who offer their Salt (prayers) with all solemnity and full submissiveness."
      },
      {
        "ayet_no" : 3,
        "arbi" : "وَالَّذِيْنَ هُمْ عَنِ اللَّغْوِ مُعْرِضُوْنَ",
        "Urdu" : "جو دور و نفور رہتے ہیں لغو اور بےکار باتوں سے۔ ف۳",
        "English" : "And those who from everything vain turn away."
      },
      {
        "ayet_no" : 4,
        "arbi" : "وَالَّذِيْنَ هُمْ لِلزَّكٰوةِ فٰعِلُوْنَ",
        "Urdu" : "جو پابندی کرتے ہیں ادائیگی زکوٰۃ کی۔ ف٤",
        "English" : "And those who for the sake of purification are doers."
      },
      {
        "ayet_no" : 5,
        "arbi" : "وَالَّذِيْنَ هُمْ لِفُرُوْجِهِمْ حٰفِظُوْنَ",
        "Urdu" : "اور جو حفاظت کرتے ہیںاپنی شرم گاہوں کی ۔",
        "English" : "And those who of their private Parts are guards."
      },
      {
        "ayet_no" : 6,
        "arbi" : "اِلَّا عَلٰٓي اَزْوَاجِهِمْ اَوْ مَا مَلَكَتْ اَيْمَانُهُمْ فَاِنَّهُمْ غَيْرُ مَلُوْمِيْنَ",
        "Urdu" : "بجزاپنی بیویوں کے یا ان عورتوں کے جو ان کی ملکِ یمین میں ہوں کہ ان پر کوئی الزام نہیں ۔",
        "English" : "Except from their wives or those slave-girls who are the possessions of their hands. (If they go to them according to the Islamic injunctions), there is surely no blame on them."
      },
      {
        "ayet_no" : 7,
        "arbi" : "فَمَنِ ابْتَغٰى وَرَاۗءَ ذٰلِكَ فَاُولٰۗىِٕكَ هُمُ الْعٰدُوْنَ",
        "Urdu" : "پس جو کوئی اس کے علاوہ کسی اور جگہ شہوت رانی کا طلب گار ہوگا تو ایسے لوگ یقینا حد سے بڑھنے والے ہیں",
        "English" : "But whoever desires someone beyond these (lawful women), it is these people who are transgressors (and disobedient)."
      },
      {
        "ayet_no" : 8,
        "arbi" : "وَالَّذِيْنَ هُمْ لِاَمٰنٰتِهِمْ وَعَهْدِهِمْ رٰعُوْنَ",
        "Urdu" : "اور جو لوگ پاس و لحاظ رکھتے ہیںاپنی امانتوں اور اپنے عہد و پیماں کا",
        "English" : "And those who of their trusts and covenant are keepers."
      },
      {
        "ayet_no" : 9,
        "arbi" : "وَالَّذِيْنَ هُمْ عَلٰي صَلَوٰتِهِمْ يُحَافِظُوْنَ",
        "Urdu" : "اور جو محافظت و پاسداری کرتے ہیںاپنی نمازوں کی۔ ف۵",
        "English" : "And those who of their prayers are observant."
      },
      {
        "ayet_no" : 10,
        "arbi" : "اُولٰۗىِٕكَ هُمُ الْوٰرِثُوْنَ",
        "Urdu" : "یہی لوگ ہیں وراثت پانے والے",
        "English" : "Those are the inheritors"
      },
      {
        "ayet_no" : 11,
        "arbi" : "الَّذِيْنَ يَرِثُوْنَ الْفِرْدَوْسَ ۭ هُمْ فِيْهَا خٰلِدُوْنَ",
        "Urdu" : "جو وارث ہوں گے فردوسِ بریں کے۔ جہاں ہمیشہ رہنا نصیب ہوگا ان خوش نصیبوں کو",
        "English" : "Who shall inherit the Firdaus (Paradise). They shall dwell therein forever."
      },
      {
        "ayet_no" : 12,
        "arbi" : "وَلَقَدْ خَلَقْنَا الْاِنْسَانَ مِنْ سُلٰـلَـةٍ مِّنْ طِيْنٍ",
        "Urdu" : "اور بلاشبہ ہم ہی نے پیدا کیا انسان کو مٹی کے ست اور خلاصہ سے ۔",
        "English" : "We have created man from an extract of clay."
      },
      {
        "ayet_no" : 13,
        "arbi" : "ثُمَّ جَعَلْنٰهُ نُطْفَةً فِيْ قَرَارٍ مَّكِيْنٍ",
        "Urdu" : "پھر ہم ہی نے اس کو رکھا ایک مدت تک ایک بوند کی شکل میں ایک محفوظ قرارگاہ میں ۔",
        "English" : "Then We made him a sperm-drop in a firm resting place."
      },
      {
        "ayet_no" : 14,
        "arbi" : "ثُمَّ خَلَقْنَا النُّطْفَةَ عَلَقَةً فَخَـلَقْنَا الْعَلَقَةَ مُضْغَةً فَخَـلَقْنَا الْمُضْغَةَ عِظٰمًا فَكَسَوْنَا الْعِظٰمَ لَحْــمًا  ۤ ثُمَّ اَنْشَاْنٰهُ خَلْقًا اٰخَرَ  ۭفَتَبٰرَكَ اللّٰهُ اَحْسَنُ الْخٰلِقِيْنَ",
        "Urdu" : "پھر اس نطفے کو ہم نے ایک لوتھڑا بنا دیا۔ پھر اس لوتھڑے کو ایک بوٹی بنا دیا۔ پھر اس بوٹی کی ہم نے ہڈیاں بنائیں۔ پھر ان ہڈیوں پر ہم نے گوشت چڑھا دیا۔ پھر ان سب تبدیلیوں کے بعد اس میں روح ڈال کر ہم نے اسے ایک اور ہی مخلوق بنا کر کھڑا کیا۔ سو بڑا ہی برکت والا ہے وہ اللہ جو سب سے بہتر بنانے والا ہے۔ ف۱",
        "English" : "Then We turned the sperm-drop into a clot, then We turned the clot into a fetus-lump, then We turned the fetus-lump into bones, then We clothed the bones with flesh; thereafter We developed it into another creature. So, glorious is Allah, the Best of the creators."
      },
      {
        "ayet_no" : 15,
        "arbi" : "ثُمَّ اِنَّكُمْ بَعْدَ ذٰلِكَ لَمَيِّتُوْنَ",
        "Urdu" : "پھر اس کے بعد تم سب کو اے لوگوں بہرحال مرنا ہے",
        "English" : "Then, after all this, you are to die."
      },
      {
        "ayet_no" : 16,
        "arbi" : "ثُمَّ اِنَّكُمْ يَوْمَ الْقِيٰمَةِ تُبْعَثُوْنَ",
        "Urdu" : "پھر تم سب کو قیامت کے روز یقینا دوبارہ زندہ کر کے اٹھایا جائے گا ف۲",
        "English" : "Then you are to be raised again on the Day of Judgment."
      },
      {
        "ayet_no" : 17,
        "arbi" : "وَلَقَدْ خَلَقْنَا فَوْقَكُمْ سَبْعَ طَرَاۗىِٕقَ ڰ وَمَا كُنَّا عَنِ الْخَلْقِ غٰفِلِيْنَ",
        "Urdu" : "اور بلاشبہ ہم ہی نے بنائے تمہارے اوپر اے لوگوں سات عظیم الشان راستے اور ہم غافل و بےخبر نہیں تھےاپنی مخلوق اور اس کی ضروریات اور مصلحتوں سے",
        "English" : "And assuredly We created above you seven paths, and of the creation We have not been neglectful."
      },
      {
        "ayet_no" : 18,
        "arbi" : "وَاَنْزَلْنَا مِنَ السَّمَاۗءِ مَاۗءًۢ بِقَدَرٍ فَاَسْكَنّٰهُ فِي الْاَرْضِ ڰ وَاِنَّا عَلٰي ذَهَابٍۢ بِهٖ لَقٰدِرُوْنَ",
        "Urdu" : "اور ہم ہی نے آسمان سے پانی اتارا ایک خاص اندازے کے ساتھ۔ پھر ہم ہی نے اس کو ٹھہرا دیا زمین پر میںاپنی قدرت کاملہ اور حکمت بالغہ سے اور بلاشبہ ہم جب چاہیں اور جیسے چاہیں اس کو لے جانے پر بھی پوری قدرت رکھتے ہیں",
        "English" : "And We sent down water from the sky in due measure, then We lodged it in the earth, and of course, We are able to take it away."
      },
      {
        "ayet_no" : 19,
        "arbi" : "فَاَنْشَاْنَا لَكُمْ بِهٖ جَنّٰتٍ مِّنْ نَّخِيْلٍ وَّ اَعْنَابٍ ۘلَكُمْ فِيْهَا فَوَاكِهُ كَثِيْرَةٌ وَّمِنْهَا تَاْكُلُوْنَ",
        "Urdu" : "پھر ہم ہی نے اس کے ذریعے اگائے تمہارے لیے طرح طرح کے باغ کھجوروں انگوروں و غیرہ قسما قسم پھلوں کے۔ جن میں تمہارے لیے طرح طرح کے لذیذ پھل بھی بکثرت پائے جاتے ہیں اور انہی سے تم لوگ کھاتے اوراپنی روزی بھی حاصل کرتے ہو ۔",
        "English" : "Then We produced with it gardens of date-palms and vines for your benefit. For you there are many fruits in them, and of them you eat"
      },
      {
        "ayet_no" : 20,
        "arbi" : "وَشَجَــرَةً تَخْــرُجُ مِنْ طُوْرِ سَيْنَاۗءَ تَنْۢبُتُ بِالدُّهْنِ وَصِبْغٍ لِّلْاٰكِلِيْنَ",
        "Urdu" : "اور زیتون کا ایک ایسا عظیم الشان درخت بھی ہم ہی نے پیدا کیا جو کہ سینا پہاڑ کے آس پاس خاص طور اور بکثرت اگتا ہے کھانے والوں کے لیے تیل اور سالن لے کر",
        "English" : "And also a tree that spring forth from mount Sinai, that grow oil and is a sauce for the eaters."
      },
      {
        "ayet_no" : 21,
        "arbi" : "وَاِنَّ لَكُمْ فِي الْاَنْعَامِ لَعِبْرَةً ۭ نُسْقِيْكُمْ مِّمَّا فِيْ بُطُوْنِهَا وَلَكُمْ فِيْهَا مَنَافِعُ كَثِيْرَةٌ وَّمِنْهَا تَاْكُلُوْنَ",
        "Urdu" : "اور بلاشبہ تمہارے لیے ان مویشیوں میں بھی بڑا سامان عبرت ہے۔ ہم تمہیں اس میں سے جو کہ ان پیٹوں میں ہے دودھ جیسا لذیذ اور مفید مشروب پلاتے ہیں اور تمہارے لیے ان میں اور بھی طرح طرح کے بکثرت فائدے ہیں اور انہی میں سے تم لوگ کھاتے بھی ہو",
        "English" : "And verily in the cattle for you is a lesson. We give you to drink of that which is in their bellies, and for you in them are advantages many, and of them ye eat."
      },
      {
        "ayet_no" : 22,
        "arbi" : "وَعَلَيْهَا وَعَلَي الْفُلْكِ تُحْمَلُوْنَ",
        "Urdu" : "اور ان پر اور ان کشتیوں پر تم لوگ لدے پھرتے بھی ہو ف۳",
        "English" : "And on them and on the ship ye are borne."
      },
      {
        "ayet_no" : 23,
        "arbi" : "وَلَقَدْ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖ فَقَالَ يٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗ ۭ اَفَلَا تَتَّقُوْنَ",
        "Urdu" : "اور بلاشبہ ہم ہی نے اس سے پہلے بھیجا نوح کو ان کی قوم کی طرف رسول بنا کر تو انہوں نے بھی یہی کہا کہ اے میری قوم کے لوگوں تم سب اللہ ہی کی بندگی کرو کہ اس کے سوا تمہارا کوئی معبود نہیں۔ تو کیا تم لوگ ڈرتے نہیں ہو ؟ ف۱",
        "English" : "Surely, We sent NuH to his nation. So he said, :My people, worship Allah. You have no god whatsoever other than Him. So, do you not fear Allah ?"
      },
      {
        "ayet_no" : 24,
        "arbi" : "فَقَالَ الْمَلَؤُا الَّذِيْنَ كَفَرُوْا مِنْ قَوْمِهٖ مَا ھٰذَآ اِلَّا بَشَرٌ مِّثْلُكُمْ ۙ يُرِيْدُ اَنْ يَّتَفَضَّلَ عَلَيْكُمْ ۭ وَلَوْ شَاۗءَ اللّٰهُ لَاَنْزَلَ مَلٰۗىِٕكَةً ښ مَّا سَمِعْنَا بِھٰذَا فِيْٓ اٰبَاۗىِٕنَا الْاَوَّلِيْنَ",
        "Urdu" : "اس پر آپ کی قوم کے وہ سردار جو کفر پر کمربستہ ہو چکے تھے، کہنے لگے کہ یہ شخص تو تم ہی جیسا ایک انسان ہے جو تم پر برتری حاصل کرنا چاہتا ہے۔ اور اگر اللہ کو کوئی رسول بھیجنا منظور ہوتا تو وہ ضرور آسمان سے کوئی نوری فرشتے بھیج دیتا۔ یہ بات تو ہم نے اپنے پہلے باپ دادوں میں کبھی نہیں سنی کہ کوئی بشر بھی پیغمبر بن کر آسکتا ہے ۔ ف۲",
        "English" : "So, said the disbelieving chiefs from among his nation, :This (man) is nothing but a human being like you. He wishes to impose his superiority over you. Had Allah willed, He would have sent down angels (instead of him). We have not heard of such a thing among our forefathers."
      },
      {
        "ayet_no" : 25,
        "arbi" : "اِنْ هُوَ اِلَّا رَجُلٌۢ بِهٖ جِنَّةٌ فَتَرَبَّصُوْا بِهٖ حَتّٰى حِيْنٍ",
        "Urdu" : "اسلیے اصل بات یہ ہے کہ یہ ایک ایسا شخص ہے جسے کچھ جنون ہوگیا ہے پس تم لوگ اس کے بارے میں صبر و انتظار سے کام لو ایک وقت تک ۔",
        "English" : "He is only a man in whom is madness wherefore await for him for a season."
      },
      {
        "ayet_no" : 26,
        "arbi" : "قَالَ رَبِّ انْــصُرْنِيْ بِمَا كَذَّبُوْنِ",
        "Urdu" : "نوح نے ان سے مایوس ہو جانے کے بعد عرض کیا اے میرے رب ان لوگوں نے جو مجھے جھٹلایا ہے تو اس پر تو ہی میری نصرت فرما ۔",
        "English" : "He said, :My Lord, help me, for they have rejected me."
      },
      {
        "ayet_no" : 27,
        "arbi" : "فَاَوْحَيْنَآ اِلَيْهِ اَنِ اصْنَعِ الْفُلْكَ بِاَعْيُنِنَا وَوَحْيِنَا فَاِذَا جَاۗءَ اَمْرُنَا وَفَارَ التَّنُّوْرُ ۙ فَاسْلُكْ فِيْهَا مِنْ كُلٍّ زَوْجَيْنِ اثْنَيْنِ وَاَهْلَكَ اِلَّا مَنْ سَبَقَ عَلَيْهِ الْقَوْلُ مِنْهُمْ ۚ وَلَا تُخَاطِبْنِيْ فِي الَّذِيْنَ ظَلَمُوْا ۚ اِنَّهُمْ مُّغْرَقُوْنَ",
        "Urdu" : "اس پر ہم نے نوح کو وحی کے ذریعے بتایا کہ تم ایک کشتی بناؤ ہماری نگرانی میں اور ہماری وحی و ہدایت کے مطابق پھر جب آپہنچے ہمارا حکم اور ابل پڑے فلاں تنور تو تم سوار ہو جانا اس کشتی میں ہر قسم کے جانوروں میں سے ایک ایک جوڑا لے کر اور اپنے گھر والوں کو بھی اپنے ساتھ لے لینا بجز ان کے جن کے غرق ہونے کے بارے میں ہمارا فیصلہ پہلے ہی طے ہو چکا ہے اور خبردار مجھ سے ان لوگوں کے بارے میں بات نہیں کرنا جو اڑے رہے اپنے ظلم پر کہ انہوں نے اب بہرحال غرق ہو کر رہنا ہے ۔",
        "English" : "So, We sent Our revelation to him, saying, :Make the ship under Our eyes and Our revelation. So, when Our command will come, and the oven will gush forth, take on its board a pair of two from each (species) along with your family, except those of them against whom the word has already come to pass. And do not speak to Me (in favor) of those who have done wrong. They are sure to be drowned."
      },
      {
        "ayet_no" : 28,
        "arbi" : "فَاِذَا اسْتَوَيْتَ اَنْتَ وَمَنْ مَّعَكَ عَلَي الْفُلْكِ فَقُلِ الْـحَمْدُ لِلّٰهِ الَّذِيْ نَجّٰىنَا مِنَ الْقَوْمِ الظّٰلِمِيْنَ",
        "Urdu" : "پھر جب کشتی میں بیٹھ جاؤ تم بھی اور وہ سب بھی جو عقیدہ و ایمان کے اعتبار سے تمہارے ساتھ ہیں تو یوں کہو کہ سب تعریفیں اس اللہ کے لیے ہیں جس نے ہمیں نجات دی ان ظالم لوگوں سے",
        "English" : "And when thou art settled, thou and those with thee, in the ark, say thou: praise unto Allah who hath delivered us from the wrong doing people."
      },
      {
        "ayet_no" : 29,
        "arbi" : "وَقُلْ رَّبِّ اَنْزِلْنِيْ مُنْزَلًا مُّبٰرَكًا وَّاَنْتَ خَيْرُ الْمُنْزِلِيْنَ",
        "Urdu" : "اور یہ دعا بھی کرنا کہ اے میرے رب مجھے اتاریو بابرکت اتارنا کہ تو ہی ہے سب سے بہتر اتارنے والا ۔",
        "English" : "And say: My Lord! Cause me to land at a blessed landing-place, for Thou art Best of all who bring to land."
      },
      {
        "ayet_no" : 30,
        "arbi" : "اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ وَّاِنْ كُنَّا لَمُبْتَلِيْنَ",
        "Urdu" : "بیشک اس قصے میں بڑی بھاری نشانیاں ہیں اور کھرا کھوٹا ظاہر کرنے کے لیے ہم آزمائش کر کے ہی رہتے ہیں ۔",
        "English" : "Verily in that are signs; Verily We have ever been provers."
      },
      {
        "ayet_no" : 31,
        "arbi" : "ثُمَّ اَنْشَاْنَا مِنْۢ بَعْدِهِمْ قَرْنًا اٰخَرِيْنَ",
        "Urdu" : "پھر ان کے بعد ہم نے اٹھا کھڑا کیا ایک اور قوم کو۔ ف۱",
        "English" : "Then, after them We brought forth anot her generation."
      },
      {
        "ayet_no" : 32,
        "arbi" : "فَاَرْسَلْنَا فِيْهِمْ رَسُوْلًا مِّنْهُمْ اَنِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗ  ۭ اَفَلَا تَتَّقُوْنَ",
        "Urdu" : "پھر ان میں بھی ہم نے انہی میں کا ایک رسول بھیجا اس نے بھی ان کو یہی دعوت دی کہ تم سب لوگ اللہ ہی کی بندگی کرو۔ اس کے سوا تمہارا کوئی معبود نہیں تو کیا تم لوگ ڈرتے نہیں ہو ؟ ف۲",
        "English" : "Then We sent amongst them an apostle from amongst themselves, saying: worship Allah, for you there is no god but he; will ye then not fear Him ?"
      },
      {
        "ayet_no" : 33,
        "arbi" : "وَقَالَ الْمَلَاُ مِنْ قَوْمِهِ الَّذِيْنَ كَفَرُوْا وَكَذَّبُوْا بِلِقَاۗءِ الْاٰخِرَةِ وَاَتْرَفْنٰهُمْ فِي الْحَيٰوةِ الدُّنْيَا ۙ مَا ھٰذَآ اِلَّا بَشَرٌ مِّثْلُكُمْ ۙ يَاْكُلُ مِمَّا تَاْكُلُوْنَ مِنْهُ وَيَشْرَبُ مِمَّا تَشْرَبُوْنَ",
        "Urdu" : "تو اس کے جواب میں ان کی قوم کے ان سرداروں نے جو کہ اَڑے ہوئے تھے اپنے کفر و باطل پر اور جنہوں نے جھٹلا دیا تھا آخرت کی پیشی کو اور جن کو ہم نے خوشحالی دے رکھی تھی دنیاوی زندگی میں۔ انہوں نے کہا کہ یہ شخص اس کے سوا کچھ نہیں کہ ایک بشر اور انسان ہے تم ہی جیسا۔ وہی کچھ کھاتا ہے جو تم کھاتے ہو اور وہی کچھ پیتا ہے جو تم لوگ پیتے ہو",
        "English" : "Then said the chiefs of his nation who were disbelievers and who denied facing the Hereafter and whom We made affluent in the worldly life, :This (man) is nothing but a human being. He eats from what you eat from, and drinks from what you drink."
      },
      {
        "ayet_no" : 34,
        "arbi" : "وَلَىِٕنْ اَطَعْتُمْ بَشَرًا مِّثْلَكُمْ ۙ اِنَّكُمْ اِذًا لَّخٰسِرُوْنَ",
        "Urdu" : "اور اگر تم لوگ اپنے ہی جیسے ایک آدمی کے کہنے پر چلنے لگے تو یقینا اس صورت میں تم لوگ بڑے ہی خسارے اور گھاٹے میں رہو گے۔ ف۳",
        "English" : "If you obey a human like yourselves, then you will be absolute losers."
      },
      {
        "ayet_no" : 35,
        "arbi" : "اَيَعِدُكُمْ اَنَّكُمْ اِذَا مِتُّمْ وَكُنْتُمْ تُرَابًا وَّعِظَامًا اِنَّكُمْ مُّخْــرَجُوْنَ",
        "Urdu" : "کیا یہ شخص تم سے یہ کہتا ہے کہ جب تم مر کر مٹی ہو جاؤ گے اور ہڈیوں کا پنجر بن کر رہ جاؤ گے تو تم قبروں سے زندہ کر کے نکالے جاؤ گے ؟",
        "English" : "Does he promise you that, when you die and are turned into dust and bones, you are to be brought forth ?"
      },
      {
        "ayet_no" : 36,
        "arbi" : "هَيْهَاتَ هَيْهَاتَ لِمَا تُوْعَدُوْنَ",
        "Urdu" : "دور بہت دور ہے وہ وعدہ جو تم لوگوں سے کیا جا رہا ہے ۔",
        "English" : "Far too improbable is what you are being promised."
      },
      {
        "ayet_no" : 37,
        "arbi" : "اِنْ هِىَ اِلَّا حَيَاتُنَا الدُّنْيَا نَمُوْتُ وَنَحْيَا وَمَا نَحْنُ بِمَبْعُوْثِيْنَ",
        "Urdu" : "زندگی تو بس ہماری یہی دنیاوی زندگی ہے جس میں ہم مرتے اور جیتے ہیں اور بس اور ہم دوبارہ اٹھائے جانے والے نہیں ہے۔ ف٤",
        "English" : "There is nothing but our worldly life. We die and we live, and we are not to be raised again."
      },
      {
        "ayet_no" : 38,
        "arbi" : "اِنْ هُوَ اِلَّا رَجُلُۨ افْتَرٰى عَلَي اللّٰهِ كَذِبًا وَّمَا نَحْنُ لَهٗ بِمُؤْمِنِيْنَ",
        "Urdu" : "یہ تو ایک ایسا شخص ہے جس نے اللہ پر جھوٹ باندھا ہے اور ہم اس کو کبھی ماننے والے نہیں ہیں ۔",
        "English" : "He is nothing but a man who has forged a lie against Allah, and we are not going to believe in him."
      },
      {
        "ayet_no" : 39,
        "arbi" : "قَالَ رَبِّ انْصُرْنِيْ بِمَا كَذَّبُوْنِ",
        "Urdu" : "اس ضد اور ہٹ دھرمی پر اس پیغمبر نے دعا کی کہ اے میرے رب اب تو ہی میری مدد فرما اس لیے کہ یہ لوگ تو میری تکذیب ہی پر کمربستہ ہو چکے ہیں",
        "English" : "He said, :My Lord, help me, for they have rejected me."
      },
      {
        "ayet_no" : 40,
        "arbi" : "قَالَ عَمَّا قَلِيْلٍ لَّيُصْبِحُنَّ نٰدِمِيْنَ",
        "Urdu" : "اس کے رب نے جواب میں ارشاد فرمایا کہ عنقریب ہی ان کو سخت ندامت اور شرمندگی اٹھانا ہوگی ۔",
        "English" : "Allah said: after a little while they will become regretful."
      },
      {
        "ayet_no" : 41,
        "arbi" : "فَاَخَذَتْهُمُ الصَّيْحَةُ بِالْحَقِّ فَجَعَلْنٰهُمْ غُثَاۗءً ۚ فَبُعْدًا لِّلْقَوْمِ الظّٰلِمِيْنَ",
        "Urdu" : "آخرکار آپکڑا ان کو اس ہولناک آواز نے جو ان کے لیے مقدر ہو چکی تھی حق کے ساتھ، سو ہم نے ان سب کو کچرا بنا کر رکھ دیا، سو بڑی پھٹکار ہے ایسے ظالم لوگوں کے لیے ف۱",
        "English" : "So the Cry seized them according to the true (promise), and We turned them in to scum. So, away with the wrongdoing people."
      },
      {
        "ayet_no" : 42,
        "arbi" : "ثُمَّ اَنْشَاْنَا مِنْۢ بَعْدِهِمْ قُرُوْنًا اٰخَرِيْنَ",
        "Urdu" : "پھر ان کے بعد ہم نے اور کئی قومیں پیدا کیں،",
        "English" : "Then after them We brought forth other generations."
      },
      {
        "ayet_no" : 43,
        "arbi" : "مَا تَسْبِقُ مِنْ اُمَّةٍ اَجَلَهَا وَمَا يَسْتَاْخِرُوْنَ",
        "Urdu" : "کوئی بھی قوماپنی مقررہ مدت سے نہ آگے بڑھ سکی، اور نہ ہی وہ اس کے بعد ٹھہر سکی، ف۲",
        "English" : "No community can anticipate their term, nor can they lay behind."
      },
      {
        "ayet_no" : 44,
        "arbi" : "ثُمَّ اَرْسَلْنَا رُسُلَنَا تَتْرَا  ۭ كُلَّمَا جَاۗءَ اُمَّةً رَّسُوْلُهَا كَذَّبُوْهُ فَاَتْبَعْنَا بَعْضَهُمْ بَعْضًا وَّجَعَلْنٰهُمْ اَحَادِيْثَ ۚ فَبُعْدًا لِّــقَوْمٍ لَّا يُؤْمِنُوْنَ",
        "Urdu" : "پھر ہم نے پے درپے اپنے رسول بھیجے مگر ان سب کا حال یہی رہا کہ جب بھی کبھی کسی قوم کے پاس اس کا رسول آیا تو اس نے اس کی تکذیب ہی کی، جس کے نتیجے میں ہم بھی ایک کے بعد ایک قوم کو ہلاک کرتے چلے گئے اور ہم نے ان سب کو قصے کہانیاں بنا کر رکھ دیا سو بڑی پھٹکار ہے ان لوگوں کیلیے جو ایمان نہیں لاتے،",
        "English" : "Then We sent Our Messengers in succession, every time there came to a nation their Messenger, they denied him, so We made them follow one another (to destruction), and We made them as Ahad (the true stories for mankind to learn a lesson from them). So away with a people who believe not."
      },
      {
        "ayet_no" : 45,
        "arbi" : "ثُمَّ اَرْسَلْنَا مُوْسٰى وَاَخَاهُ هٰرُوْنَ ڏ بِاٰيٰتِنَا وَ سُلْطٰنٍ مُّبِيْنٍ",
        "Urdu" : "پھر ہم نے موسیٰ اور ان کے بھائی ہارون کو بھی رسول بنا کر بھیجا،اپنی نشانیوں اور کھلی سند کے ساتھ،",
        "English" : "Thereafter, We sent Musa and his brother Harun with Our signs and a clear proof"
      },
      {
        "ayet_no" : 46,
        "arbi" : "اِلٰى فِرْعَوْنَ وَمَلَا۟ىِٕهٖ فَاسْتَكْبَرُوْا وَكَانُوْا قَوْمًا عَالِيْنَ",
        "Urdu" : "فرعون اور اس کے سرداروں کی طرف، مگر انہوں نے بھیاپنی بڑائی کا گھمنڈ کیا (اور وہ حق کے منکر ہوگئے) اور وہ تھے بھی بڑے سرکش لوگ، ف۳",
        "English" : "Unto Fir'awn and his chiefs, but they grew stiff-necked, and they were a people self-exalting."
      },
      {
        "ayet_no" : 47,
        "arbi" : "فَقَالُوْٓا اَنُؤْمِنُ لِبَشَرَيْنِ مِثْلِنَا وَقَوْمُهُمَا لَنَا عٰبِدُوْنَ",
        "Urdu" : "چنانچہ انہوں نے کہا کیا ہم اپنے ہی جیسے دو آدمیوں پر ایمان لے آئیں؟ اور وہ بھی اس حال میں کہ ان کی قوم کے لوگ ہماری غلامی کر رہے ہیں",
        "English" : "So they said: shall we believe In two human beings like unto us, while their nation are to us slaves ?"
      },
      {
        "ayet_no" : 48,
        "arbi" : "فَكَذَّبُوْهُمَا فَكَانُوْا مِنَ الْمُهْلَكِيْنَ",
        "Urdu" : "سو انہوں نے جھٹلا دیا ان دونوں کو اور ان کے پیغام حق کو جس کے نتیجے میں بالآخر وہ بھی شامل ہوگئے ہونے والوں میں",
        "English" : "Thus they rejected both of them and were among the destroyed."
      },
      {
        "ayet_no" : 49,
        "arbi" : "وَلَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ لَعَلَّهُمْ يَهْتَدُوْنَ",
        "Urdu" : "اور بلاشبہ ہم نے موسیٰ کو بھی وہ کتاب بخشی تھی تاکہ وہ لوگ اس سے راہنمائی حاصل کریں",
        "English" : "And assuredly We vouchsafed unto Musa the Book, that haply they may be guided."
      },
      {
        "ayet_no" : 50,
        "arbi" : "وَجَعَلْنَا ابْنَ مَرْيَمَ وَاُمَّهٗٓ اٰيَةً وَّاٰوَيْنٰهُمَآ اِلٰى رَبْوَةٍ ذَاتِ قَرَارٍ وَّمَعِيْنٍ",
        "Urdu" : "اور ہم نے مریم کے بیٹے کو اور اس کی ماں کو بھی بنایا تھا ایک عظیم الشان نشانی اور ان دونوں کو ہم نے جگہ دی تھی ایک ایسی بلند سرزمین پر لے جا کر جو ٹھہرنے کے قابل اور سرسبز و شاداب بھی،",
        "English" : "And We made the son of Maryam (Mary) and his mother a sign, and gave them shelter on a height, having a place of rest and running springs."
      },
      {
        "ayet_no" : 51,
        "arbi" : "يٰٓاَيُّهَا الرُّسُلُ كُلُوْا مِنَ الطَّيِّبٰتِ وَاعْمَلُوْا صَالِحًا ۭ اِنِّىْ بِمَا تَعْمَلُوْنَ عَلِيْمٌ",
        "Urdu" : "اے پیغمبرو، تم کھاؤ پیو پاکیزہ چیزوں میں سے اور کام کرو نیک بلاشبہ میں ان تمام کامون کو جو تم لوگ شب و روز کرتے ہو پوری طرح جانتا ہوں،",
        "English" : "O messengers, eat from the good things, and act righteously. Of whatever you do, I am fully aware."
      },
      {
        "ayet_no" : 52,
        "arbi" : "وَاِنَّ هٰذِهٖٓ اُمَّتُكُمْ اُمَّةً وَّاحِدَةً وَّاَنَا رَبُّكُمْ فَاتَّــقُوْنِ",
        "Urdu" : "اور بلاشبہ تمہاری یہ امت دین و ایمان کے لحاظ سے ایک ہی امت ہے جس کی اساس یہ ہے کہ میں ہی رب ہوں تم سب کا پس تم سب مجھ ہی سے ڈرو",
        "English" : "Surely, this is your creed, a single creed, and I am your Lord. So fear Me."
      },
      {
        "ayet_no" : 53,
        "arbi" : "فَتَقَطَّعُوْٓا اَمْرَهُمْ بَيْنَهُمْ زُبُرًا ۭ كُلُّ حِزْبٍۢ بِمَا لَدَيْهِمْ فَرِحُوْنَ",
        "Urdu" : "مگر ان لوگوں نے اپنے دین کو آ پس میں ٹکڑے ٹکڑے کر دیا، ہر گروہ اسی ٹکڑے پر مگن اور مست ہے جو اس کے پاس ہے",
        "English" : "Then they cut their affair among them in regard to the Scriptures: each band in that which is with them rejoicing."
      },
      {
        "ayet_no" : 54,
        "arbi" : "فَذَرْهُمْ فِيْ غَمْرَتِهِمْ حَتّٰى حِيْنٍ",
        "Urdu" : "پس تم چھوڑ دو ان کو ان کی مدہوشی میں کہ یہ اسی میں پڑے رہیں ف۱ ایک وقت تک",
        "English" : "So leave them in their negligence for some time."
      },
      {
        "ayet_no" : 55,
        "arbi" : "اَيَحْسَبُوْنَ اَنَّمَا نُمِدُّهُمْ بِهٖ مِنْ مَّالٍ وَّبَنِيْنَ",
        "Urdu" : "کیا انہوں نے یہ سمجھ رکھا ہے کہ ہم ان کو مال اور اولاد میں جو کچھ ترقی دئیے چلے جا رہے ہیں",
        "English" : "Deem they that in the wealth and sons wherewith We enlarge them."
      },
      {
        "ayet_no" : 56,
        "arbi" : "نُسَارِعُ لَهُمْ فِي الْخَــيْرٰتِ ۭ بَلْ لَّا يَشْعُرُوْنَ",
        "Urdu" : "وہ کوئی ان کے لیے بھلائیوں میں جلدی کر رہے ہیں؟ ہرگز نہیں بلکہ یہ لوگ شعور نہیں رکھتے اصل حقیقت کا۔ ف۲",
        "English" : "We are accelerating the (real) good things to them? The fact, however, is that they do not understand (the reality)."
      },
      {
        "ayet_no" : 57,
        "arbi" : "اِنَّ الَّذِيْنَ هُمْ مِّنْ خَشْـيَةِ رَبِّهِمْ مُّشْفِقُوْنَ",
        "Urdu" : "بیشک بھلائیوں میں سبقت کرنے والے لوگ وہ ہیں جو کہ اپنے رب کی عظمت و ہیبت سے لرزاں و ترساں رہتے ہیں",
        "English" : "Lo! those who go in awe for fear of their Lord."
      },
      {
        "ayet_no" : 58,
        "arbi" : "وَالَّذِيْنَ هُمْ بِاٰيٰتِ رَبِّهِمْ يُؤْمِنُوْنَ",
        "Urdu" : "جو اپنے رب کی آیتوں پر سچے دل سے ایمان رکھتے ہیں",
        "English" : "And those who in the signs of their Lord do believe."
      },
      {
        "ayet_no" : 59,
        "arbi" : "وَالَّذِيْنَ هُمْ بِرَبِّهِمْ لَا يُشْرِكُوْنَ",
        "Urdu" : "جو اپنے رب کے ساتھ کسی طرح کا شرک نہیں کرتے،",
        "English" : "And those who with their Lord associate not anyone."
      },
      {
        "ayet_no" : 60,
        "arbi" : "وَالَّذِيْنَ يُؤْتُوْنَ مَآ اٰتَوْا وَّقُلُوْبُهُمْ وَجِلَةٌ اَنَّهُمْ اِلٰى رَبِّهِمْ رٰجِعُوْنَ",
        "Urdu" : "اور جن کا حال یہ ہے کہ جب وہ دیتے ہیں اللہ کی راہ میں جو کچھ کہ ان کو دینا ہوتا ہے تو ان کے دل ڈر رہے ہوتے ہیں، اس عقیدہ و احساس کی بناء پر کہ ان کو بہرحال اپنے رب کے پاس ہی لوٹ کر جانا ہے،",
        "English" : "And those who give that (their charity) which they give (and also do other good deeds) with their hearts full of fear (whether their alms and charities, etc., have been accepted or not), because they are sure to return to their Lord (for reckoning)."
      },
      {
        "ayet_no" : 61,
        "arbi" : "اُولٰۗىِٕكَ يُسٰرِعُوْنَ فِي الْخَــيْرٰتِ وَهُمْ لَهَا سٰبِقُوْنَ",
        "Urdu" : "یہی لوگ ہیں جو دوڑتے ہیں بھلائیوں کی طرف اور یہی ہیں سبقت کر کے انکو پا لینے والے ف۳",
        "English" : "These are hastening on to good, and they are therein foremost."
      },
      {
        "ayet_no" : 62,
        "arbi" : "وَلَا نُكَلِّفُ نَفْسًا اِلَّا وُسْعَهَا وَلَدَيْنَا كِتٰبٌ يَّنْطِقُ بِالْحَقِّ وَهُمْ لَا يُظْلَمُوْنَ",
        "Urdu" : "ہم کسی بھی شخص کو اس کی طاقت سے زیادہ تکلیف نہیں دیتے اور ہمارے پاس ایک ایسی کتاب ہے (یعنی ہر شخص کا نامہ عمل) جو کہ (ہر ایک کا حال) ٹھیک ٹھیک بتا دے گی، اور ان پر ذرہ برابر کوئی ظلم نہ ہوگا،",
        "English" : "We do not place a burden on anyone except according to his ability. With Us there is a book which speaks with truth, and they shall not be wronged."
      },
      {
        "ayet_no" : 63,
        "arbi" : "بَلْ قُلُوْبُهُمْ فِيْ غَمْرَةٍ مِّنْ ھٰذَا وَلَهُمْ اَعْمَالٌ مِّنْ دُوْنِ ذٰلِكَ هُمْ لَهَا عٰمِلُوْنَ",
        "Urdu" : "مگر یہ لوگ ہیں کہ ان کے دل اس سے غفلت اور مدہوشی میں پڑے ہیں اور اس فساد عقیدہ کے علاوہ ان کے کچھ اور اعمال بھی ایسے ہیں جن کو یہ لوگ کرتے رہتے ہیں",
        "English" : "But their hearts are in ignorance about this, and they have deeds, other than that, which they are continuously doing."
      },
      {
        "ayet_no" : 64,
        "arbi" : "حَتّيٰٓ اِذَآ اَخَذْنَا مُتْرَفِيْهِمْ بِالْعَذَابِ اِذَا هُمْ يَجْــــَٔــرُوْنَ",
        "Urdu" : "اور یہ لوگ ایسے ہی غفلت و مدہوشی میں پڑے رہیں گے یہاں تک کہ جب ہم عذاب میں پکڑیں گے ان کے خوشحال اور عیش پرست لوگوں کو تو ان کا سب نشہ ہرن ہو جائے گا اور یہ چلانے لگیں گے،",
        "English" : "Until when We will seize their affluent ones with punishment, they will suddenly start crying."
      },
      {
        "ayet_no" : 65,
        "arbi" : "لَا تَجْــــَٔــرُوا الْيَوْمَ ۣاِنَّكُمْ مِّنَّا لَا تُنْصَرُوْنَ",
        "Urdu" : "اس وقت ان سے کہا جائے گا کہ اب چلاؤ مت کیونکہ ہماری طرف سے اب تمہاری کوئی مدد نہیں ہونے کی،",
        "English" : "(Then it will be said to them,) :Do not cry today. You will not be helped by Us."
      },
      {
        "ayet_no" : 66,
        "arbi" : "قَدْ كَانَتْ اٰيٰتِيْ تُتْلٰى عَلَيْكُمْ فَكُنْتُمْ عَلٰٓي اَعْقَابِكُمْ تَنْكِصُوْنَ",
        "Urdu" : "تم وہی تو ہو کہ اس سے پہلے جب میری آیتیں تم کو پڑھ پڑھ کر سنائی جاتی تھیں، تو تم اپنے کبر و غرور میں الٹے پاؤں پھر جایا کرتے تھے، ف۱",
        "English" : "My verses used to be recited to you, but you used to turn back on your heels"
      },
      {
        "ayet_no" : 67,
        "arbi" : "مُسْتَكْبِرِيْنَ ڰ بِهٖ سٰمِرًا تَهْجُرُوْنَ",
        "Urdu" : "اپنی بڑائی کا ف۱ گھمنڈ کرتے ہوئے اس قران کو مشغلہ بناتے ہوئے اور بکواس کرتے ہوئے، ف۲",
        "English" : "In pride (they Quraish pagans and polytheists of Makkah used to feel proud that they are the dwellers of Makkah sanctuary Haram), talking evil about it (the Qur'n) by night."
      },
      {
        "ayet_no" : 68,
        "arbi" : "اَفَلَمْ يَدَّبَّرُوا الْقَوْلَ اَمْ جَاۗءَهُمْ مَّا لَمْ يَاْتِ اٰبَاۗءَهُمُ الْاَوَّلِيْنَ",
        "Urdu" : "تو کیا ان لوگوں نے کبھی اس کلام پر غور نہیں کیا یا ان کے پاس کوئی ایسی انوکھی چیز آگئی ہے، جو ان کے پہلے بڑوں کے پاس نہیں آئی تھی ؟",
        "English" : "Then, is it that they did not ponder over the Word (of Allah), or there has come to them something that did not come to their forefathers ?"
      },
      {
        "ayet_no" : 69,
        "arbi" : "اَمْ لَمْ يَعْرِفُوْا رَسُوْلَهُمْ فَهُمْ لَهٗ مُنْكِرُوْنَ",
        "Urdu" : "یا انہوں نے اپنے رسول کو نہیں پہچانا تو انجان ہونے کی وجہ سے یہ اس کے منکر ہو رہے ہیں ؟",
        "English" : "Or did they not recognize their messenger and therefore they denied him ?"
      },
      {
        "ayet_no" : 70,
        "arbi" : "اَمْ يَقُوْلُوْنَ بِهٖ جِنَّةٌ  ۭ بَلْ جَاۗءَهُمْ بِالْحَقِّ وَاَكْثَرُهُمْ لِلْحَقِّ كٰرِهُوْنَ",
        "Urdu" : "کیا یہ لوگ اتنی ظالمانہ اور احمقانہ بات کہتے ہیں کہ اس شخص کو جنون ہوگیا ہے؟ نہیں ان میں سے کوئی وجہ بھی نہیں ہوسکتی بلکہ اصل وجہ یہ ہے کہ یہ رسول ان کے پاس حق لے کر آئے ہیں اور ان لوگوں کی اکثریت کو حق کا نور ہی ناگوار ہے",
        "English" : "Or do they say, :He is suffering from madness ? No, but he has come to them with truth, but it is the truth that most of them dislike."
      },
      {
        "ayet_no" : 71,
        "arbi" : "وَلَوِ اتَّبَـعَ الْحَقُّ اَهْوَاۗءَهُمْ لَــفَسَدَتِ السَّمٰوٰتُ وَالْاَرْضُ وَمَنْ فِيْهِنَّ ۭ بَلْ اَتَيْنٰهُمْ بِذِكْرِهِمْ فَهُمْ عَنْ ذِكْرِهِمْ مُّعْرِضُوْنَ",
        "Urdu" : "اور اگر بفرض محال کہیں حق ان کی خواہشات کے پیچھے چلنے لگتا تو کبھی کے تباہ و برباد ہو چکے ہوتے یہ آسمان اور زمین اور وہ سب مخلوق جو کہ ان کے اندر موجود ہے بلکہ اصل بات یہ ہے کہ ہم ان کے پاس ان کا ذکر لائے ہیں، مگر یہ ایسے بدبخت اور بے انصاف ہیں کہ اپنے ذکر ہی سے منہ موڑے ہوئے ہیں،",
        "English" : "Had the truth followed their desires, the heavens and the earth and all those therein would have fallen in total disorder. However, We have brought to them their advice, but it is their advice that they are averse to."
      },
      {
        "ayet_no" : 72,
        "arbi" : "اَمْ تَسْـَٔــلُهُمْ خَرْجًا فَخَــرَاجُ رَبِّكَ خَيْرٌ ڰ وَّهُوَ خَيْرُ الرّٰزِقِيْنَ",
        "Urdu" : "کیا آپ اے پیغمبر ان سے کوئی اجرت مانگ رہے ہیں؟ تو اس کا بھی کوئی سوال نہیں کیونکہ آپ کے رب کا اجر تو بہرحال سب سے بہتر ہے اور وہی ہے سب سے بہتر دینے والا،",
        "English" : "Or is it that you (O Prophet) demand remuneration from them? But the remuneration from your Lord is best, and He is the best of all givers."
      },
      {
        "ayet_no" : 73,
        "arbi" : "وَاِنَّكَ لَتَدْعُوْهُمْ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ",
        "Urdu" : "اور آپ یقینا بلا رہے ہیں ان لوگوں کو حق و ہدایت کے سیدھے راستے کی طرف،",
        "English" : "And verily thou! thou callest them unto a Path straight."
      },
      {
        "ayet_no" : 74,
        "arbi" : "وَاِنَّ الَّذِيْنَ لَا يُؤْمِنُوْنَ بِالْاٰخِرَةِ عَنِ الصِّرَاطِ لَنٰكِبُوْنَ",
        "Urdu" : "اور بلاشبہ جو لوگاپنی دنیاوی لذتوں پر فریفتہ ہو کر آخرت پر ایمان نہیں رکھتے، وہ قطعی طور پر سیدھی راہ سے ہٹے ہوئے ہیں ف۳",
        "English" : "And verily those who believe not in the Hereafter are from the path deviating."
      },
      {
        "ayet_no" : 75,
        "arbi" : "وَلَوْ رَحِمْنٰهُمْ وَكَشَفْنَا مَا بِهِمْ مِّنْ ضُرٍّ لَّـــلَجُّوْا فِيْ طُغْيَانِهِمْ يَعْمَهُوْنَ",
        "Urdu" : "اور اگر ہم ان پر رحم کر کے ان سے وہ تکلیف دور کر دیں جو ان کو پہنچی ہوتی ہے تو یہ یقینا شکر گزار بننے کی بجائے الٹااپنی سرکشی میں بھٹکتے ہوئے برابر اسی میں لگے رہیں گے،",
        "English" : "And if We have mercy on them and remove whatever distress they have, they would still persist obstinately in their rebellion, wandering blindly (in disbelief)."
      },
      {
        "ayet_no" : 76,
        "arbi" : "وَلَقَدْ اَخَذْنٰهُمْ بِالْعَذَابِ فَمَا اسْتَكَانُوْا لِرَبِّهِمْ وَمَا يَتَـضَرَّعُوْنَ",
        "Urdu" : "چنانچہ اس حقیقت کا ایک شاہد یہ ہے کہ ہم نے ان کو عذاب میں پکڑا پھر بھی یہ نہ تو اپنے رب کے سامنے جھکے ف۱ اور نہ ہی انہوں نے اس کے حضور عاجزی کی",
        "English" : "And assuredly We took hold of them with the torment, yet they humbled not themselves to their Lord, nor did they entreat."
      },
      {
        "ayet_no" : 77,
        "arbi" : "حَتّٰى اِذَا فَتَحْنَا عَلَيْهِمْ بَابًا ذَا عَذَابٍ شَدِيْدٍ اِذَا هُمْ فِيْهِ مُبْلِسُوْنَ",
        "Urdu" : "یہاں تک کہ جب ہم نے ان پر کھول دیا کوئی دروازہ کسی سخت عذاب کا تو اس وقت یکایک کٹ کر رہ گئیں ان کی سب آرزوئیں اور امیدیں ف۲",
        "English" : "Until when we shall open upon them a portal of severe torment, and lo! thereat they are despairing"
      },
      {
        "ayet_no" : 78,
        "arbi" : "وَهُوَ الَّذِيْٓ اَنْشَاَ لَـكُمُ السَّمْعَ وَالْاَبْصَارَ وَالْاَفْـــِٕدَةَ  ۭ قَلِيْلًا مَّا تَشْكُرُوْنَ",
        "Urdu" : "اور وہ اللہ وہی تو ہے جس نے تمہارے لیے کان انکھیں اور دل پیدا کیے مگر تم لوگ کم ہی شکر ادا کرتے ہو۔ ف۳",
        "English" : "He is the One who created for you ears and eyes and hearts. Little you are grateful."
      },
      {
        "ayet_no" : 79,
        "arbi" : "وَهُوَ الَّذِيْ ذَرَاَكُمْ فِي الْاَرْضِ وَاِلَيْهِ تُحْشَرُوْنَ",
        "Urdu" : "اور وہ وحدہ لاشریک وہی تو ہے جس نے پھیلا دیا تم کواپنی قدرت کاملہ اور حکمت بالغہ سے زمین میں اور آخرکار تم سب کو اس کے حضور لے جایا جائے گا اکٹھا کر کے",
        "English" : "And He it is Who spread you on the earth, and unto Him ye will be gathered."
      },
      {
        "ayet_no" : 80,
        "arbi" : "وَهُوَ الَّذِيْ يُـحْيٖ وَيُمِيْتُ وَ لَهُ اخْتِلَافُ الَّيْلِ وَالنَّهَارِ ۭ اَفَلَا تَعْقِلُوْنَ",
        "Urdu" : "اور وہ وہی ہے جو زندگی بخشتا اور موت دیتا ہے اور اسی کے قبضہ قدرت میں ہے رات اور دن کا ادلنا بدلنا تو کیا تم لوگ عقل سے کام نہیں لیتے ؟",
        "English" : "And it is He Who gives life and causes death, and His is the alternation of night and day. Will you not then understand ?"
      },
      {
        "ayet_no" : 81,
        "arbi" : "بَلْ قَالُوْا مِثْلَ مَا قَالَ الْاَوَّلُوْنَ",
        "Urdu" : "مگر اس سب کے برعکس یہ لوگ وہی کچھ کہتے ہیں جو کہ ان کے پیش رو کہتے آئے ہیں،",
        "English" : "But they say as the earlier people had said."
      },
      {
        "ayet_no" : 82,
        "arbi" : "قَالُوْٓا ءَاِذَا مِتْنَا وَكُنَّا تُرَابًا وَّعِظَامًا ءَ اِنَّا لَمَبْعُوْثُوْنَ",
        "Urdu" : "یعنی یوں کہتے ہیں کہ کیا جب ہم مر کر مٹی اور ہڈیاں ہوجائیں گے تو کیا ہمیں واقعی پھر زندہ کر کے اٹھایا جائے گا ؟",
        "English" : "They said, :Is it that, when we will die and become dust and bones – is it that we will be raised again ?"
      },
      {
        "ayet_no" : 83,
        "arbi" : "لَقَدْ وُعِدْنَا نَحْنُ وَاٰبَاۗؤُنَا ھٰذَا مِنْ قَبْلُ اِنْ ھٰذَآ اِلَّآ اَسَاطِيْرُ الْاَوَّلِيْنَ",
        "Urdu" : "یہ وعدہ تو ہم سے اور اس سے پہلے ہمارے باپ دادا سے بھی مدتوں سے ہوتا چلا آیا ہے پس یہ اگلے لوگوں سے چلے انے والے افسانوں کے سوا کچھ نہیں،",
        "English" : "This is what has been promised to us and to our fathers before. It is nothing but the tales of the ancients."
      },
      {
        "ayet_no" : 84,
        "arbi" : "قُلْ لِّمَنِ الْاَرْضُ وَمَنْ فِيْهَآ اِنْ كُنْتُمْ تَعْلَمُوْنَ",
        "Urdu" : "آپ ان سے ذرا یہ تو پوچھو کہ کس کی ہے یہ زمین اور جو کچھ کہ اس کے اندر ہے، اگر تم جانتے ؟",
        "English" : "Say, :Whose is the earth and all those therein if you have knowledge ?"
      },
      {
        "ayet_no" : 85,
        "arbi" : "سَيَقُوْلُوْنَ لِلّٰهِ ۭ قُلْ اَفَلَا تَذَكَّرُوْنَ",
        "Urdu" : "اس کے جواب میں یہ لوگ ضرور بالضرور یہی کہیں گے کہ اللہ ہی کا ہے یہ سب کچھ، کہو کیا پھر بھی تم لوگ ہوش میں نہیں آتے ؟",
        "English" : "They will say, :Allah‘s. Say, :Would you still pay no heed ?"
      },
      {
        "ayet_no" : 86,
        "arbi" : "قُلْ مَنْ رَّبُّ السَّمٰوٰتِ السَّبْعِ وَرَبُّ الْعَرْشِ الْعَظِيْمِ",
        "Urdu" : "ان سے کہو کہ کون ہے رب ساتوں آسمانوں کا اور رب عرش عظیم کا ؟",
        "English" : "Say, :Who is the Lord of the seven heavens and the Lord of the Great Throne ?"
      },
      {
        "ayet_no" : 87,
        "arbi" : "سَيَقُوْلُوْنَ لِلّٰهِ ۭ قُلْ اَفَلَا تَتَّقُوْنَ",
        "Urdu" : "تو اس کے جواب میں بھی انہوں نے ضرور یہی کہنا ہے کہ یہ سب کچھ اللہ ہی کے لیے ہے، کہو کہ کیا پھر بھی تم لوگ ڈرتے نہیں ہو ؟",
        "English" : "They will say, :(All this belongs) to Allah . Say, :Would you still not fear Allah ?"
      },
      {
        "ayet_no" : 88,
        "arbi" : "قُلْ مَنْۢ بِيَدِهٖ مَلَكُوْتُ كُلِّ شَيْءٍ وَّهُوَ يُجِيْرُ وَلَا يُجَارُ عَلَيْهِ اِنْ كُنْتُمْ تَعْلَمُوْنَ",
        "Urdu" : "نیز پوچھو ان سے کہ کون ہے وہ ہستی جس کے ہاتھ میں ہے باگ ڈور ہرچیز کی؟ وہ جس کو چاہتا ہے پناہ دیتا ہے اور اس کے مقابلے میں کوئی کسی کو پناہ نہیں دے سکتا، بتاؤ اگر تم جانتے ہو ف۱",
        "English" : "Say, :Who is the One in whose hand lies the kingdom of every thing and who gives protection, and no protection can be given against him, if you have knowledge ?"
      },
      {
        "ayet_no" : 89,
        "arbi" : "سَيَقُوْلُوْنَ لِلّٰهِ ۭ قُلْ فَاَنّٰى تُسْحَرُوْنَ",
        "Urdu" : "تو اس کے جواب میں بھی یہ لوگ ضرور یہی کہیں گے کہ یہ سب کچھ اللہ ہی کی شان ہے کہو ظالمو! پھر کہاں سے تم پر جادو کیا جاتا ہے ف۲",
        "English" : "They will surely say: God's. Say thou: how then are ye turned away ?"
      },
      {
        "ayet_no" : 90,
        "arbi" : "بَلْ اَتَيْنٰهُمْ بِالْحَقِّ وَاِنَّهُمْ لَكٰذِبُوْنَ",
        "Urdu" : "اور یہ پہلوں کے افسانے نہیں بلکہ ہم تو ان کے پاس حق لے کر آئے ہیں اور یہ یقینا پرلے درجے کے جھوٹے لوگ ہیں،",
        "English" : "The fact is that We have brought to them The Truth, and they are absolute liars."
      },
      {
        "ayet_no" : 91,
        "arbi" : "مَا اتَّخَذَ اللّٰهُ مِنْ وَّلَدٍ وَّمَا كَانَ مَعَهٗ مِنْ اِلٰهٍ اِذًا لَّذَهَبَ كُلُّ اِلٰهٍۢ بِمَا خَلَقَ وَلَعَلَا بَعْضُهُمْ عَلٰي بَعْضٍ ۭ سُبْحٰنَ اللّٰهِ عَمَّا يَصِفُوْنَ",
        "Urdu" : "اللہ نے نہ تو کسی کواپنی اولاد بنایا ہے اور نہ ہی اس کے ساتھ دوسرا کوئی خدا ہے، اگر ایسا ہوتا تو اس صورت میں ہر خدااپنی مخلوق کو لے کر الگ ہو جاتا اور ان میں سے ایک دوسرے پر چڑھ دوڑتا، اللہ پاک ہے ان سب باتوں سے جو یہ لوگ بناتے ہیں،",
        "English" : "Allah hath not chosen any son, nor is there any god along with Him; else would each god have assuredly championed that which he created, and some of them would assuredly have overcome others. Glorified be Allah above all that they allege."
      },
      {
        "ayet_no" : 92,
        "arbi" : "عٰلِمِ الْغَيْبِ وَالشَّهَادَةِ فَتَعٰلٰى عَمَّا يُشْرِكُوْنَ",
        "Urdu" : "ایک برابر جاننے والا نہاں و عیاں کا، وہ بالاتر ہے اس شرک سے جو یہ لوگ کرتے ہیں",
        "English" : "He is the Knower of the hidden and the manifest. So, He is far higher than their ascribing of partners to Him."
      },
      {
        "ayet_no" : 93,
        "arbi" : "قُلْ رَّبِّ اِمَّا تُرِيَــنِّيْ مَا يُوْعَدُوْنَ",
        "Urdu" : "اپنے رب کے حضور اے پیغمبر اس طرح عرض کرو کہ اے میرے رب اگر تو دکھا دے مجھے یعنی میرے جیتے جی لے آئے وہ عذاب جس کا ان لوگوں سے وعدہ کیا جا رہا ہے،",
        "English" : "Say (O Muhammad ): ( My Lord! If You would show me that with which they are threatened (torment),"
      },
      {
        "ayet_no" : 94,
        "arbi" : "رَبِّ فَلَا تَجْعَلْنِيْ فِي الْقَوْمِ الظّٰلِمِيْنَ",
        "Urdu" : "تو میرے رب ایسی صورت میں مجھے ان ظالم لوگوں میں شامل نہ کیجیئو، ف۳",
        "English" : "My Lord! then place me not among the wrong-doing people."
      },
      {
        "ayet_no" : 95,
        "arbi" : "وَاِنَّا عَلٰٓي اَنْ نُّرِيَكَ مَا نَعِدُهُمْ لَقٰدِرُوْنَ",
        "Urdu" : "اور بلاشبہ ہم اس پر پوری طرح قادر ہیں کہ وہ آپ کو وہ عذاب دکھا دیں جس کا ہم ان سے وعدہ کر رہے ہیں،",
        "English" : "And of course, We do have the power to show you that with which We have threatened them."
      },
      {
        "ayet_no" : 96,
        "arbi" : "اِدْفَعْ بِالَّتِيْ هِىَ اَحْسَنُ السَّيِّئَةَ  ۭ نَحْنُ اَعْلَمُ بِمَا يَصِفُوْنَ",
        "Urdu" : "پر آپ یہی برتاؤ کیے جاؤ کہ برائی کو اس طریقہ سے دفع کرو جو سب سے اچھا ہو ہم خوب جانتے ہیں ان سب باتوں کو جو یہ لوگ بناتے ہیں ف٤",
        "English" : "Repel evil with that which is best. We are well aware of what they describe."
      },
      {
        "ayet_no" : 97,
        "arbi" : "وَقُلْ رَّبِّ اَعُوْذُ بِكَ مِنْ هَمَزٰتِ الشَّيٰطِيْنِ",
        "Urdu" : "اپنے رب کے حضور اس طرح عرض کرو کہ اے، میرے رب میں تیری پناہ مانگتا ہوں شیطانوں کی اکساہتوں سے",
        "English" : "And say: (My Lord! I seek refuge with You from the whisperings (suggestions) of the Shaytin (devils)."
      },
      {
        "ayet_no" : 98,
        "arbi" : "وَاَعُوْذُ بِكَ رَبِّ اَنْ يَّحْضُرُوْنِ",
        "Urdu" : "اور میں تیری پناہ مانگتا ہوں اے میرے رب، اس سے کہ وہ شیاطین میرے پاس آئیں، ف۵",
        "English" : "And I seek refuge in You, my Lord, even from their coming near me."
      },
      {
        "ayet_no" : 99,
        "arbi" : "حَتّيٰٓ اِذَا جَاۗءَ اَحَدَهُمُ الْمَوْتُ قَالَ رَبِّ ارْجِعُوْنِ",
        "Urdu" : "یہ بدعقیدہ و بدکردار لوگ اسی طرح رہتے ہیں یہاں تک کہ جب ان میں سے کسی کو آپہنچتی ہے موت تو اس کی انکھیں کھلتی ہیں اور وہ کہنے لگتا ہے کہ اے میرے رب مجھے وا پس لوٹا دے",
        "English" : "lt cease not until when death come to one of them, and he saith: my Lord! send me back."
      },
      {
        "ayet_no" : 100,
        "arbi" : "لَعَلِّيْٓ اَعْمَلُ صَالِحًا فِيْمَا تَرَكْتُ كَلَّا  ۭ اِنَّهَا كَلِمَةٌ هُوَ قَاۗىِٕلُهَا  ۭ وَمِنْ وَّرَاۗىِٕهِمْ بَرْزَخٌ اِلٰى يَوْمِ يُبْعَثُوْنَ",
        "Urdu" : "تاکہ میں نیک عمل کر سکوں اس دنیا میں جسے میں چھوڑ آیا ہوں ایسا ہرگز ہونے کا نہیں یہ تو محض ایک حسرت بھری بات ہوگی جسے وہ کہے جا رہا ہوگا، اور ان کے آگے ایک پردہ حائل ہے، ف۱ اس دن تک جس میں یہ لوگ قبروں سے اٹھائے جائیں گے،",
        "English" : "So that I may act righteously in that (world) which I have left behind. Never! It is simply a word he utters, and in front of such people there is a barrier till the day when they will be resurrected."
      },
      {
        "ayet_no" : 101,
        "arbi" : "فَاِذَا نُفِخَ فِي الصُّوْرِ فَلَآ اَنْسَابَ بَيْنَهُمْ يَوْمَىِٕذٍ وَّلَا يَتَسَاۗءَلُوْنَ",
        "Urdu" : "پھر اس دن کی آمد پر جب صور میں پھونک مار دی جائے گی، تو ہول و ہیبت کے اس عالم میں نہ تو ان کے درمیان کوئی رشتہ رہے گا اور نہ ہی وہ آ پس میں ایک دوسرے سے کوئی حال ہی پوچھیں گے،",
        "English" : "Thereafter, when the Sur (the trumpet) is blown, no ties of kinship will remain between them any more, nor will they inquire about one another."
      },
      {
        "ayet_no" : 102,
        "arbi" : "فَمَنْ ثَقُلَتْ مَوَازِيْنُهٗ فَاُولٰۗىِٕكَ هُمُ الْمُفْلِحُوْنَ",
        "Urdu" : "پھر جس کے ایمان و اعمال صالحہ کا پلڑا بھاری ہوگا تو وہی لوگ ہوں گے فلاح پانے والے",
        "English" : "Then he whose balances shall be heavy --these! they are the blissful ones."
      },
      {
        "ayet_no" : 103,
        "arbi" : "وَمَنْ خَفَّتْ مَوَازِيْنُهٗ فَاُولٰۗىِٕكَ الَّذِيْنَ خَسِرُوْٓا اَنْفُسَهُمْ فِيْ جَهَنَّمَ خٰلِدُوْنَ",
        "Urdu" : "اور جس کا پلڑا ہلکا ہوا تو وہی ہوں گے وہ لوگ جنہوں نے خود خسارے میں ڈال دیا ہوگااپنی جانوں کو، ان کو ہمیشہ کے لیے جنہم میں رہنا ہوگا، ف۲",
        "English" : "And the one whose scales turn out to be light, then such people are the ones who harmed their own selves; in Jahannam (Hell) they are to remain for ever."
      },
      {
        "ayet_no" : 104,
        "arbi" : "تَلْفَحُ وُجُوْهَهُمُ النَّارُ وَهُمْ فِيْهَا كٰلِحُوْنَ",
        "Urdu" : "جہاں آگ جھلس رہی ہوگی ان کے چہروں کو اور وہاں پر نہایت بری طرح بگڑی ہوں گی ان کی شکلیں",
        "English" : "Fire will scorch their faces, and they will be disfigured therein."
      },
      {
        "ayet_no" : 105,
        "arbi" : "اَلَمْ تَكُنْ اٰيٰـتِيْ تُتْلٰى عَلَيْكُمْ فَكُنْتُمْ بِهَا تُكَذِّبُوْنَ",
        "Urdu" : "اس وقت ان سے کہا جائے گا کہ کیا تم وہی نہیں وہ کہ میری آیتیں تم کو پڑھ پڑھ کر سنائی جاتی تھیں، پر تم لوگ ان کو جھٹلاتے ہی چلے جا رہے تھے ؟",
        "English" : "Have not My revelations been rehearsed unto you, and them ye have been belying ?"
      },
      {
        "ayet_no" : 106,
        "arbi" : "قَالُوْا رَبَّنَا غَلَبَتْ عَلَيْنَا شِقْوَتُنَا وَكُنَّا قَوْمًا ضَاۗلِّيْنَ",
        "Urdu" : "کہیں گے اے ہمارے رب، ہم پر غالب آگئی تھی ہماری بدبختی اور واقعی ہم گمراہ لوگ تھے",
        "English" : "They will say, :Our Lord, our wretchedness prevailed over us, and we were a people wandering astray."
      },
      {
        "ayet_no" : 107,
        "arbi" : "رَبَّنَآ اَخْرِجْنَا مِنْهَا فَاِنْ عُدْنَا فَاِنَّا ظٰلِمُوْنَ",
        "Urdu" : "اے ہمارے رب، اب ہمیں یہاں سے نکال دے (اور دنیا میں اب ھر کام کرنے کی فرصت و مہلت عطا فرما دے) پھر اگر ہم دوبارہ قصور کریں تو جو مرضی سزا دے کیونکہ اس صورت میں ہم بلاشبہ ظالم ہوں گے،",
        "English" : "Our Lord, get us out from here; if we do this again, then of course, we will be transgressors."
      },
      {
        "ayet_no" : 108,
        "arbi" : "قَالَ اخْسَـُٔـوْا فِيْهَا وَلَا تُكَلِّمُوْنِ",
        "Urdu" : "ارشاد ہوگا پھٹکارے ہوئے پڑے رہو تم لوگ اسی جنہم میں اور مجھ سے کوئی بات مت کرو، ف۳",
        "English" : "He (Allah) will say, :Stay in it, humiliated, and do not speak to Me."
      },
      {
        "ayet_no" : 109,
        "arbi" : "اِنَّهٗ كَانَ فَرِيْقٌ مِّنْ عِبَادِيْ يَقُوْلُوْنَ رَبَّنَآ اٰمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَاَنْتَ خَيْرُ الرّٰحِمِيْنَ",
        "Urdu" : "تم لوگ وہی تو ہو کہ میرے کچھ بندے جب یوں کہتے تھے کہ اے ہمارے پروردگار ہم ایمان لے آئے پس تو ہماری بخشش فرما دے اور ہم پر رحم فرما کہ تو ہی ہے سب سے بڑا رحم کرنے والا",
        "English" : "Verily there was a party of My bondmen who said: our Lord! we have believed, wherefore forgive us and have mercy upon us, and Thou art the Best of the merciful ones!"
      },
      {
        "ayet_no" : 110,
        "arbi" : "فَاتَّخَذْتُمُوْهُمْ سِخْرِيًّا حَتّٰٓي اَنْسَوْكُمْ ذِكْرِيْ وَكُنْتُمْ مِّنْهُمْ تَضْحَكُوْنَ",
        "Urdu" : "تو تم ان کا مذاق اڑایا کرتے تھے، یہاں تک کہ ان سے تمہارے اس مذاق نے تمہیں میری یاد بھی بھلا دی تھی اور تم ان سے ہنسی ہی کرتے رہے",
        "English" : "But you made fun of them, so much so that they caused you to forget My remembrance, and you used to laugh at them."
      },
      {
        "ayet_no" : 111,
        "arbi" : "اِنِّىْ جَزَيْتُهُمُ الْيَوْمَ بِمَا صَبَرُوْٓا ۙ اَنَّهُمْ هُمُ الْفَاۗىِٕزُوْنَ",
        "Urdu" : "مگر انہوں نے صبر و استقامات کا دامن نہ چھوڑا، جس پر آج میں نے ان کو ان کے صبر کا پھل دیا کہ وہی ہیں کامیاب اور فائز المرام ف۱",
        "English" : "Today I have so recompensed them for their observing patience that they are the triumphant."
      },
      {
        "ayet_no" : 112,
        "arbi" : "قٰلَ كَمْ لَبِثْتُمْ فِي الْاَرْضِ عَدَدَ سِنِيْنَ",
        "Urdu" : "پھر اللہ ان سے پوچھے گا کہ اچھا یہ تو بتاؤ کہ تم لوگ زمین میں کتنے برس رہے ؟",
        "English" : "He (Allah) will say (to unbelievers), :How long did you stay on the earth by number of years ?"
      },
      {
        "ayet_no" : 113,
        "arbi" : "قَالُوْا لَبِثْنَا يَوْمًا اَوْ بَعْضَ يَوْمٍ فَسْـَٔـــلِ الْعَاۗدِّيْنَ",
        "Urdu" : "تو اس پر وہ کہیں گے کہ ایک دن یا دن کا بھی کچھہ ہی حصہ ٹھہرے ہوں گے، کچھ صحیح یاد نہیں پس آپ خود ہی پوچھ لیں گنتی کرنے والوں سے",
        "English" : "They will say, :We stayed for a day or for a part of a day. So, ask those (angels) who have (exact) calculation."
      },
      {
        "ayet_no" : 114,
        "arbi" : "قٰلَ اِنْ لَّبِثْتُمْ اِلَّا قَلِيْلًا لَّوْ اَنَّكُمْ كُنْتُمْ تَعْلَمُوْنَ",
        "Urdu" : "ارشاد ہوگا کہ آخرت کے مقابلے میں دنیا میں تم لوگ واقعی بہت ہی کم ٹھہرے ہو کاش کہ تم لوگ یہ حقیقت اس وقت جان لیتے",
        "English" : "He (Allah) will say: (You stayed not but a little, if you had only known!"
      },
      {
        "ayet_no" : 115,
        "arbi" : "اَفَحَسِبْتُمْ اَنَّمَا خَلَقْنٰكُمْ عَبَثًا وَّاَنَّكُمْ اِلَيْنَا لَا تُرْجَعُوْنَ",
        "Urdu" : "تو کیا تم لوگوں نے یہ سمجھ رکھا تھا کہ ہم نے تم کو یوں ہی بےکار پیدا کیا ہے؟ اور تمہیں ہمارے پاس لوٹ کر نہیں انا ؟",
        "English" : "So did you think that We created you for nothing, and that you will not be brought back to Us ?"
      },
      {
        "ayet_no" : 116,
        "arbi" : "فَتَعٰلَى اللّٰهُ الْمَلِكُ الْحَقُّ ۚ لَآ اِلٰهَ اِلَّا هُوَ ۚ رَبُّ الْعَرْشِ الْكَرِيْمِ",
        "Urdu" : "پس بڑا ہی بلند ہے اللہ تعالیٰ جو کہ بادشاہ حقیقی ہے، اس کے سوا کوئی بھی عبادت کے لائق نہیں وہی مالک ہے عرشی کریم کا",
        "English" : "So, High above all is Allah, the King, the True. There is no god but He, the Lord of the Noble Throne."
      },
      {
        "ayet_no" : 117,
        "arbi" : "وَمَنْ يَّدْعُ مَعَ اللّٰهِ اِلٰــهًا اٰخَرَ ۙ لَا بُرْهَانَ لَهٗ بِهٖ ۙ فَاِنَّمَا حِسَابُهٗ عِنْدَ رَبِّهٖ ۭ اِنَّهٗ لَا يُفْلِحُ الْكٰفِرُوْنَ",
        "Urdu" : "اور جو کوئی اس سب کے باوجود اللہ کے ساتھ کسی بھی اور ایسے خودساختہ اور فرضی معبود کو پکارے گا جس کے لیے اس کے پاس کوئی دلیل نہیں تو سوائے اسکے نہیں کہ اس کا حساب اس کے رب کے یہاں ہی ہوگا، یہ قطعی اور یقینی امر ہے کہ کافر کبھی فلاح نہیں پا سکیں گے",
        "English" : "And whoever invokes another god with Allah, while he has no proof for it, his reckoning is only with his Lord. Surely, the infidels will not achieve success."
      },
      {
        "ayet_no" : 118,
        "arbi" : "وَقُلْ رَّبِّ اغْفِرْ وَارْحَمْ وَاَنْتَ خَيْرُ الرّٰحِمِيْنَ",
        "Urdu" : "اور اے پیغمبر آپ یوں کہا کریں کہ اے میرے رب، بخشش فرما، اور رحم فرما کہ تو ہی ہے سب سے بڑا رحم کرنے والا۔ ف۲",
        "English" : "And say (O prophet) :My Lord, grant pardon and have mercy, for you are the best of all the merciful."
      }
    ]
  }

]