[
  {
    "surah_no" : 84,
    "total_ayah" : 25,
    "name" : "Surah e AL-Inshiqaq",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "اِذَا السَّمَاۗءُ انْشَقَّتْ",
        "Urdu" : "جب آسمان پھٹ جائے گا",
        "English" : "When the heaven is sundered."
      },
      {
        "ayet_no" : 2,
        "arbi" : "وَاَذِنَتْ لِرَبِّهَا وَحُقَّتْ",
        "Urdu" : "اور وہ کان لگائے ہوئے ہے اپنے رب کے حکم کیلئے اوریہی اس کا حق ہے",
        "English" : "And obeys its Lord and it must. "
      },
      {
        "ayet_no" : 3,
        "arbi" : "وَاِذَا الْاَرْضُ مُدَّتْ",
        "Urdu" : "اور جب زمین میں پھیلادی جائے گی ۔",
        "English" : "And when the earth shall be stretched forth."
      },
      {
        "ayet_no" : 4,
        "arbi" : "وَاَلْقَتْ مَا فِيْهَا وَتَخَلَّتْ",
        "Urdu" : "اور باہر پھینک دے گی جو کچھ اس میں ہے اور وہ خالی ہوجائے گی",
        "English" : "And shall cast forth that which is therein, and shall become empty."
      },
      {
        "ayet_no" : 5,
        "arbi" : "وَاَذِنَتْ لِرَبِّهَا وَحُقَّتْ",
        "Urdu" : "اور وہ کان لگائے گی اپنے رب کے حکم پر اور اس کا حق بھی یہی ہے ۔",
        "English" : "And it hearken to its Lord, and is duteous."
      },
      {
        "ayet_no" : 6,
        "arbi" : "يٰٓاَيُّهَا الْاِنْسَانُ اِنَّكَ كَادِحٌ اِلٰى رَبِّكَ كَدْحًا فَمُلٰقِيْهِ",
        "Urdu" : "اے انسان بلاشبہ تو محنت کرنے والا ہے اپنے رب کی طرف خوب محنت پھر تو ملنے والا ہے اس سے",
        "English" : "O man, you have to work hard constantly to reach your Lord, and then you have to meet Him."
      },
      {
        "ayet_no" : 7,
        "arbi" : "فَاَمَّا مَنْ اُوْتِيَ كِتٰبَهٗ بِيَمِيْنِهٖ",
        "Urdu" : "پھر رہا وہ جو دیا گیا اپنا اعمال نامہ اپنے دائیں ہاتھ میں",
        "English" : "Then who so is given his account in his right hand"
      },
      {
        "ayet_no" : 8,
        "arbi" : "فَسَوْفَ يُحَاسَبُ حِسَابًا يَّسِيْرًا",
        "Urdu" : "تو عنقریب اس کا محاسبہ کیا جائے گا آسان حساب کی صورت میں ۔",
        "English" : "His account shall presently be taken by an easy reckoning."
      },
      {
        "ayet_no" : 9,
        "arbi" : "وَّيَنْقَلِبُ اِلٰٓى اَهْلِهٖ مَسْرُوْرًا",
        "Urdu" : "اور وہ لوٹے گا اپنے گھروالوں کی طرف ہنسی خوشی",
        "English" : "And he shall return Unto his people joyfully."
      },
      {
        "ayet_no" : 10,
        "arbi" : "وَاَمَّا مَنْ اُوْتِيَ كِتٰبَهٗ وَرَاۗءَ ظَهْرِهٖ",
        "Urdu" : "اور رہا وہ جو دیاگیا اپنا اعمال نامہ اپنی پیٹھ کے پیچھے",
        "English" : "And as for him who shall be given his record behind his back,"
      },
      {
        "ayet_no" : 11,
        "arbi" : "فَسَوْفَ يَدْعُوْا ثُبُوْرًا",
        "Urdu" : "تو عنقریب وہ پکارے گا ہلاکت کو",
        "English" : "He will soon cry out for death."
      },
      {
        "ayet_no" : 12,
        "arbi" : "وَّيَصْلٰى سَعِيْرًا",
        "Urdu" : "اور داخل ہوگا بھڑکتی ہوئی آگ میں",
        "English" : "And he shall roast into a Blaze."
      },
      {
        "ayet_no" : 13,
        "arbi" : "اِنَّهٗ كَانَ فِيْٓ اَهْلِهٖ مَسْرُوْرًا",
        "Urdu" : "بے شک وہ تھا اپنے گھروالوں میں بہت خوش",
        "English" : "He had been joyful among his people (in the world)."
      },
      {
        "ayet_no" : 14,
        "arbi" : "اِنَّهٗ ظَنَّ اَنْ لَّنْ يَّحُوْرَ",
        "Urdu" : "بے شک وہ سمجھا کہ ہرگز نہیں لوٹے گا (اپنے رب کی طرف)",
        "English" : "He thought he would never revert (to Allah)."
      },
      {
        "ayet_no" : 15,
        "arbi" : "بَلٰٓى ڔ اِنَّ رَبَّهٗ كَانَ بِهٖ بَصِيْرًا",
        "Urdu" : "ہاں کیوں نہیں یقینا اس کا رب ہے اس کو خوب دیکھنے والا",
        "English" : "No! Indeed his Lord was watchful over him."
      },
      {
        "ayet_no" : 16,
        "arbi" : "فَلَآ اُقْسِمُ بِالشَّفَقِ",
        "Urdu" : "پس نہیں میں قسم کھاتا ہون شفق (شام کی سرخی) کی",
        "English" : "So I swear by the afterglow of sunset;"
      },
      {
        "ayet_no" : 17,
        "arbi" : "وَالَّيْلِ وَمَا وَسَقَ",
        "Urdu" : "اور رات کی اور ان کی جو کچھ وہ جمع کرتی سمیٹی ہے",
        "English" : "And the night and that which it drives on,"
      },
      {
        "ayet_no" : 18,
        "arbi" : "وَالْقَمَرِ اِذَا اتَّسَقَ",
        "Urdu" : "اور چاند کی جب وہ پورا ہوتا ہے",
        "English" : "And by the moon when she become full."
      },
      {
        "ayet_no" : 19,
        "arbi" : "لَتَرْكَبُنَّ طَبَقًا عَنْ طَبَقٍ",
        "Urdu" : "ضررو بضرور تم چڑھتے جاؤ گے ایک حالت سے دوسری حالت کو",
        "English" : "You shall certainly travel from stage to stage (in this life and in the Hereafter)."
      },
      {
        "ayet_no" : 20,
        "arbi" : "فَمَا لَهُمْ لَا يُؤْمِنُوْنَ",
        "Urdu" : "تو کیا ہوا ہے ان کو کہ وہ ایمان نہیں لاتے",
        "English" : "What is the matter with them, that they believe not ?"
      },
      {
        "ayet_no" : 21,
        "arbi" : "وَاِذَا قُرِئَ عَلَيْهِمُ الْقُرْاٰنُ لَا يَسْجُدُوْنَ {السجدہ}",
        "Urdu" : "اور جب پڑھاجاتا ہے ان پر قران تو وہ سجدہ نہیں کرتے",
        "English" : "And, when the Qur'an is recited unto them, worship not (Allah) ?"
      },
      {
        "ayet_no" : 22,
        "arbi" : "بَلِ الَّذِيْنَ كَفَرُوْا يُكَذِّبُوْنَ",
        "Urdu" : "بلکہ وہ لوگ جنہوں نے کفر کیا وہ جھٹلاتے ہیں",
        "English" : "Rather, those who disbelieve deny (the truth)."
      },
      {
        "ayet_no" : 23,
        "arbi" : "وَاللّٰهُ اَعْلَمُ بِمَا يُوْعُوْنَ",
        "Urdu" : "اور اللہ خوب جانتا ہے اس کو جو وہ سینوں میں محفوظ رکھتے چھپاتے ہیں",
        "English" : "And Allah is most aware of what they store."
      },
      {
        "ayet_no" : 24,
        "arbi" : "فَبَشِّرْهُمْ بِعَذَابٍ اَلِيْمٍ",
        "Urdu" : "پس خوشخبری سنادیں انہیں دردناک عذاب کی",
        "English" : "So give them the news of a painful punishment."
      },
      {
        "ayet_no" : 25,
        "arbi" : "اِلَّا الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَهُمْ اَجْرٌ غَيْرُ مَمْنُوْنٍ",
        "Urdu" : "سوائے ان لوگوں کے جو ایمان لائے اور انہوں نے نیک اعمال کیے ان کے لیے اجر ہے نہ ختم ہونے والا",
        "English" : "But those who believe and work righteous works, theirs shall be a hire unending."
      }
    ]
  }
]