[
  {
    "surah_no" : 21,
    "total_ayah" : 112,
    "name" : "Surah e Ambiyaa",
    "detail" : [

      {
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "اِقْتَرَبَ لِلنَّاسِ حِسَابُهُمْ وَهُمْ فِيْ غَفْلَةٍ مُّعْرِضُوْنَ",
        "Urdu" : "قریب آ لگا ہے لوگوں سے ان کے حساب کا وقت، اور وہ ہیں کہ غفلت میں پڑے منہ موڑے بیٹھے ہیں، ف۱",
        "English" : "Draws near for mankind their reckoning, while they turn away in heedlessness."
      },
      {
        "ayet_no" : 2,
        "arbi" : "مَا يَاْتِيْهِمْ مِّنْ ذِكْرٍ مِّنْ رَّبِّهِمْ مُّحْدَثٍ اِلَّا اسْتَـمَعُوْهُ وَهُمْ يَلْعَبُوْنَ",
        "Urdu" : "جو بھی کوئی نئی نصیحت ان کے پاس ان کے رب کی جانب سے آتی ہے یہ اسے گرانی ہی سے سنتے ہیں، اور وہ بھی کھیلتے ہوئے ان کی حالت یہ ہوتی ہے",
        "English" : "There come not unto them a fresh admonition from their Lord but they listen to it while they are playing."
      },
      {
        "ayet_no" : 3,
        "arbi" : "لَاهِيَةً قُلُوْبُهُمْ ۭ وَاَسَرُّوا النَّجْوَي ڰ الَّذِيْنَ ظَلَمُوْا ڰ هَلْ ھٰذَآ اِلَّا بَشَرٌ مِّثْلُكُمْ ۚ اَفَتَاْتُوْنَ السِّحْرَ وَاَنْتُمْ تُبْصِرُوْنَ",
        "Urdu" : "کہ ان کے دل کہیں اور ہی لگے ہوتے ہیں، اور وہ لوگ جنہوں نے ظلم کی روش کو ہی اپنایا، چپکے چپکے آ پس میں سرگوشی کرتے ہیں، کہ یہ شخص تو ہم ہی جیسا ایک بشر (اور انسان) ہے، تو کیا تم لوگ پھر بھی دیدہ دانستہ اس جادو (کے پھندے میں پھنسنے) کو آ رہے ہو ؟ ف۲",
        "English" : "In sport being their hearts. And those who do wrong keep secret their private discourse this is but a human being like unto yourselves; will ye then betake yourselves to magic while ye know ?"
      },
      {
        "ayet_no" : 4,
        "arbi" : "قٰلَ رَبِّيْ يَعْلَمُ الْقَوْلَ فِي السَّمَاۗءِ وَالْاَرْضِ ۡ وَهُوَ السَّمِيْعُ الْعَلِيْمُ",
        "Urdu" : "پیغمبر نے فرمایا کہ (تم لوگ خواہ چپکے چپکے باتیں کرو یا زور سے کہو) میرا رب بہرحال جانتا ہے ہر بات کو خواہ وہ آسمان کی بلندیوں میں ہو یا زمین کی پستیوں میں اور وہی ہے سب کچھ سننے جاننے والا، ف۳",
        "English" : "He said: My Lord knows what is spoken in the heaven and the earth, and He is the Hearing, the Knowing. "
      },
      {
        "ayet_no" : 5,
        "arbi" : "بَلْ قَالُـوْٓا اَضْغَاثُ اَحْلَامٍۢ بَلِ افْتَرٰىهُ بَلْ هُوَ شَاعِرٌ ښ فَلْيَاْتِنَا بِاٰيَةٍ كَمَآ اُرْسِلَ الْاَوَّلُوْنَ",
        "Urdu" : "اور ان ظالموں نے صرف جادو کہنے پر ہی اکتفا نہیں کیا بلکہ انہوں نے یہ بھی کہا کہ یہ قران تو بس مجموعہ ہے پراگندہ خیالات کا بلکہ اس کو یہ شخص خود ہی گھڑ کے لے آیا ہے بلکہ یہ تو ایک شاعر ہے جس کا کام ہی فرضی اور خیالی باتیں بنانا ہوتا ہے پس اسے چاہیے کہ لے آئے ہمارے پاس ویسی ہی کوئی نشانی جیسی نشانیوں کے ساتھ پہلے کے پیغمبر بھیجے گئے ۔",
        "English" : "Further they said, :(The Qur‘an is) a mixture of jumble dreams. Rather, he (the prophet) has fabricated it. Rather, he is a poet. So, let him bring a sign to us, as the earlier ones were sent with."
      },
      {
        "ayet_no" : 6,
        "arbi" : "مَآ اٰمَنَتْ قَبْلَهُمْ مِّنْ قَرْيَةٍ اَهْلَكْنٰهَا  ۚ اَفَهُمْ يُؤْمِنُوْنَ",
        "Urdu" : "حالانکہ ان سے پہلے کوئی بھی ایسی بستی جسے ہم نے ہلاک کیا ہو ایمان نہ لائی تھی تو کیا اب یہ لوگ ایمان لے آئیں گے ؟",
        "English" : "Not a city before them which We destroyed believed; will they then believe ?"
      },
      {
        "ayet_no" : 7,
        "arbi" : "وَمَآ اَرْسَلْنَا قَبْلَكَ اِلَّا رِجَالًا نُّوْحِيْٓ اِلَيْهِمْ فَسْــَٔـلُوْٓا اَهْلَ الذِّكْرِ اِنْ كُنْتُمْ لَا تَعْلَمُوْنَ",
        "Urdu" : "اور ان کا یہ شبہ کہ رسول انسان نہ ہونا چاہیے اس لئے بھی باطل ہے کہ ہم نے آپ سے پہلے انسانوں ہی کو رسول بنا کر بھیجا جن کی طرف ہم اسی طرح وحی بھیجتے رہے سو تم لوگ پوچھ لو اہل علم سے اگر تم خود نہیں جانتے",
        "English" : "And We did not send before you messengers except men whom We inspired with revelation. So, ask the people (having the knowledge) of the Message, if you do not know."
      },
      {
        "ayet_no" : 8,
        "arbi" : "وَمَا جَعَلْنٰهُمْ جَسَدًا لَّا يَاْكُلُوْنَ الطَّعَامَ وَمَا كَانُوْا خٰلِدِيْنَ",
        "Urdu" : "(اور ان کا دوسرا شبہ کہ رسول کوئی ایسی نوری مخلوق ہونا چاہیے جو نہ کچھ کھائے نہ پیئے بھی باطل ہے کیونکہ) ہم نے ان رسولوں کے کوئی ایسے مافوق الفطرت اور نوری بدن نہیں بنائے تھے کہ وہ کھانا ہی نہ کھاتے ہوں اور نہ ہی وہ ہمیشہ رہنے والے تھے ف۱",
        "English" : "We did not make them such bodies as ate no food, nor were they immortal."
      },
      {
        "ayet_no" : 9,
        "arbi" : "ثُمَّ صَدَقْنٰهُمُ الْوَعْدَ فَاَنْجَيْنٰهُمْ وَمَنْ نَّشَاۗءُ وَاَهْلَكْنَا الْمُسْرِفِيْنَ",
        "Urdu" : "پھر یہ بھی دیکھ لو کہ ہم نے ان سے کئے ہوئے اپنے وعدے پورے کر دکھائے سو ہم نے بچا دیا ان کو بھی اور ان سب کو بھی جنہیں ہم نے بچانا چاہا اور ہلاک کر دیا ہم نے حد سے بڑھنے والوں کو",
        "English" : "Then We made good unto them the premise; so We delivered them and those whom We willed, and We destroyed the extravagant."
      },
      {
        "ayet_no" : 10,
        "arbi" : "لَقَدْ اَنْزَلْنَآ اِلَيْكُمْ كِتٰبًا فِيْهِ ذِكْرُكُمْ ۭ اَفَلَا تَعْقِلُوْنَ",
        "Urdu" : "بلاشبہ ہم ہی نے اتاری تمہاری طرف اے لوگو! ایک ایسی عظیم الشان کتاب جس میں خود تمہاری نصیحت اور ہدایت کا سامان ہے تو کیا تم لوگ پھر بھی عقل سے کام نہیں لیتے ؟ ف۲",
        "English" : "And assuredly We have sent down unto you a Book wherein is admonition for you; will ye not then reflect ?"
      },
      {
        "ayet_no" : 11,
        "arbi" : "وَكَمْ قَصَمْنَا مِنْ قَرْيَةٍ كَانَتْ ظَالِمَةً وَّاَنْشَاْنَا بَعْدَهَا قَوْمًا اٰخَرِيْنَ",
        "Urdu" : "اور کتنی ہی ظالم بستیاں ایسی تھیں جن کو ہم نے پیس کر رکھ دیا ان کے ظلم وعدوان کی بناء پر اور اٹھا کھڑا کیا ہم نے ان کے بعد کسی اور قوم کو",
        "English" : "And how many a city have We overthrown which were doing wrong, and We caused to grow up thereafter anot her nation!"
      },
      {
        "ayet_no" : 12,
        "arbi" : "فَلَمَّآ اَحَسُّوْا بَاْسَنَآ اِذَا هُمْ مِّنْهَا يَرْكُضُوْنَ",
        "Urdu" : "پھر جب ان لوگوں نے آتا محسوس کیا ہمارے عذاب کو تو وہ فوراً وہاں سے بھاگنے لگے",
        "English" : "Then when they perceived Our violence, lo! they were from it fleeing."
      },
      {
        "ayet_no" : 13,
        "arbi" : "لَا تَرْكُضُوْا وَارْجِعُوْٓا اِلٰى مَآ اُتْرِفْتُمْ فِيْهِ وَمَسٰكِنِكُمْ لَعَلَّكُمْ تُسْــَٔـلُوْنَ",
        "Urdu" : "تب ان سے کہا گیا کہ بھاگو مت اور لوٹ جاؤ تم اپنے اس سامان عیش وعشرت کی طرف، جس میں تم لوگ مست ومگن تھے اور اپنے انہی گھروں کی طرف جن کی پختگی وعمدگی پر تم کو بڑا غرور اور ناز تھا شاید تم سے کوئی پوچھ پاچھ ہو",
        "English" : "Do not fly (now) and come back to what you were made to lead easy lives in and to your dwellings, haply you will be questioned."
      },
      {
        "ayet_no" : 14,
        "arbi" : "قَالُوْا يٰوَيْلَنَآ اِنَّا كُنَّا ظٰلِمِيْنَ",
        "Urdu" : "تب وہ کہنے لگے ہائے ہماری کم بختی بیشک ہم لوگ ظالم تھے",
        "English" : "They said, :Alas for us! We were wrongdoers indeed."
      },
      {
        "ayet_no" : 15,
        "arbi" : "فَمَا زَالَتْ تِّلْكَ دَعْوٰىهُمْ حَتّٰى جَعَلْنٰهُمْ حَصِيْدًا خٰمِدِيْنَ",
        "Urdu" : "پھر ان کی یہی چیخ وپکار رہی یہاں تک کہ ہم نے ان کو ایسا نیست ونابود کر کے رکھ دیا جیسے کوئی کٹی ہوئی کھیتی ہو یا بجھے ہوئے انگاروں کا ڈھیر ف۳",
        "English" : "And that cry of theirs ceased not, till We made them as a field that is reaped, extinct (dead)."
      },
      {
        "ayet_no" : 16,
        "arbi" : "وَمَا خَلَقْنَا السَّمَاۗءَ وَالْاَرْضَ وَمَا بَيْنَهُمَا لٰعِبِيْنَ",
        "Urdu" : "اور ہم نے اس بلند وبالا (عبرتوں بھرے) آسمان کو اور اس خزانوں اور درسوں بھری زمین کو اور ان دونوں کے درمیان کی اس پوری کائنات کو کچھ کھیل تماشا کے طور پر تو نہیں بنایا",
        "English" : "We did not create the heavens and the earth and what lies between them for play."
      },
      {
        "ayet_no" : 17,
        "arbi" : "لَوْ اَرَدْنَآ اَنْ نَّتَّخِذَ لَهْوًا لَّاتَّخَذْنٰهُ مِنْ لَّدُنَّآ ڰ اِنْ كُنَّا فٰعِلِيْنَ",
        "Urdu" : "اگر ہم کوئی کھیل تماشا بنانا چاہتے بھی تو اپنے یہاں کی کسی اور چیز سے بنا لیتے اگر ہمیں ایسا کرنا ہوتا",
        "English" : "Had We intended to have a pastime, We would have had it from Our own, if We were ever to do so."
      },
      {
        "ayet_no" : 18,
        "arbi" : "بَلْ نَقْذِفُ بِالْحَقِّ عَلَي الْبَاطِلِ فَيَدْمَغُهٗ فَاِذَا هُوَ زَاهِقٌ ۭ وَلَـكُمُ الْوَيْلُ مِمَّا تَصِفُوْنَ",
        "Urdu" : "بلکہ ہم تو حق کی ضرب سے باطل پر ایسی چوٹ لگاتے ہیں کہ وہ اس کا سر کچل کر رکھ دیتی ہے جس سے وہ دفعتاً نابود ہو جاتا ہے اور تمہارے لئے بڑی خرابی ہے ان باتوں کی وجہ سے جو تم لوگ حق اور اہل حق کے خلاف از خود بناتے ہو ف۱",
        "English" : "Instead, We launch the truth against falsehood, which gets it smashed, and in no time it is gone. Alas to you for what you describe!"
      },
      {
        "ayet_no" : 19,
        "arbi" : "وَ لَهٗ مَنْ فِي السَّمٰوٰتِ وَالْاَرْضِ ۭ وَ مَنْ عِنْدَهٗ لَا يَسْـتَكْبِرُوْنَ عَنْ عِبَادَتِهٖ وَ لَا يَسْتَحْسِرُوْنَ",
        "Urdu" : "اور اسی کی ہے وہ سب مخلوق جو آسمانوں اور زمین میں ہے اور وہ سب بھی جو اس کے پاس ہیں یعنی فرشتے ان کا حال یہ ہے کہ وہ نہ تو کبھیاپنی بڑائی کا گھمنڈ کرکے اس کی عبادت سے سرتابی کرتے ہیں اور نہ ہی وہ تھکتے ہیں،",
        "English" : "And His is whosoever is in the heavens and the earth; and those nigh unto Him are not too stiff-necked for His worship nor are they weary."
      },
      {
        "ayet_no" : 20,
        "arbi" : "يُسَبِّحُوْنَ الَّيْلَ وَالنَّهَارَ لَايَفْتُرُوْنَ",
        "Urdu" : "بلکہ وہ شب وروز اس طرح تسبیح کرتے رہتے ہیں کہ دم بھی نہیں لیتے ف۲",
        "English" : "They proclaim His purity night and day, never slackening."
      },
      {
        "ayet_no" : 21,
        "arbi" : "اَمِ اتَّخَذُوْٓا اٰلِهَةً مِّنَ الْاَرْضِ هُمْ يُنْشِرُوْنَ",
        "Urdu" : "کیا ان لوگوں نے زمین کی مخلوقات میں سے کچھ ایسے معبود بنا رکھے ہیں جو زندہ کرکے اٹھا سکتے ہوں ؟",
        "English" : "Or have they adopted gods from the earth, who raise the dead ?"
      },
      {
        "ayet_no" : 22,
        "arbi" : "لَوْ كَانَ فِيْهِمَآ اٰلِهَةٌ اِلَّا اللّٰهُ لَفَسَدَتَا  ۚ فَسُبْحٰنَ اللّٰهِ رَبِّ الْعَرْشِ عَمَّا يَصِفُوْنَ",
        "Urdu" : "تو سنو! کہ اگر آسماں و زمین میں اللہ جل جلالہ کے سوا کچھ اور خدا بھی ہوتے جس طرح کہ ان مشرکوں کا کہنا ہے تو ان دونوں یعنی زمین وآسمان کا نظام کبھی کا درہم برہم ہوگیا ہوتا پس اللہ جو کہ مالک ہے عرش کا وہ پاک ہے ان تمام باتوں سے جو یہ لوگ بنا رہے ہیں ف۳",
        "English" : "Had there been gods beside Allah, in the heavens and the earth, both of them would have fallen in disorder. So pure is Allah, the Lord of the Throne, from what they describe."
      },
      {
        "ayet_no" : 23,
        "arbi" : "لَا يُسْــَٔـلُ عَمَّا يَفْعَلُ وَهُمْ يُسْــَٔــلُوْنَ",
        "Urdu" : "وہ ایسی بےمثال عظمت والا ہے کہ وہ جو بھی کچھ کرے اس سے کوئی پوچھ نہیں سکتا اور باقی سب کی باز پرس کی جاسکتی ہے",
        "English" : "He is not questioned of what He does, and they are questioned."
      },
      {
        "ayet_no" : 24,
        "arbi" : "اَمِ اتَّخَذُوْا مِنْ دُوْنِهٖٓ اٰلِهَةً  ۭ قُلْ هَاتُوْا بُرْهَانَكُمْ ۚ ھٰذَا ذِكْرُ مَنْ مَّعِيَ وَذِكْرُ مَنْ قَبْلِيْ  ۭ بَلْ اَكْثَرُهُمْ لَا يَعْلَمُوْنَ  ۙ الْحَقَّ فَهُمْ مُّعْرِضُوْنَ",
        "Urdu" : "کیا (باین ہمہ) انہوں نے اس کے سوا اور کوئی معبود بنا رکھے ہیں؟ اچھا تو ان سے کہو کہ لاؤ تم لوگاپنی دلیل یہ رہی وہ کتاب جس میں میرے دور کے لوگوں کی نصیحت ہے اور وہ کتابیں بھی جن میں مجھ سے پہلے لوگوں کے لئے نصیحت تھی۔ مگر حق کے خلاف کوئی دلیل ملے تو کہاں سے اور کیونکر اس لئے بات یہ نہیں بلکہ اصل بات یہ ہے کہ لوگوں کی اکثریت چونکہ حق اور حقیقت کو جانتی نہیں اس لئے وہ اس سے منہ موڑے ہوئے ہیں ۔",
        "English" : "Is it that they have adopted gods besides Him? Say, :Bring your proof. Here is the (book carrying) advice for those with me, and the (books carrying) advice for those before me. Yet most of them do not know the truth, and therefore they are averse."
      },
      {
        "ayet_no" : 25,
        "arbi" : "وَمَآ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَّسُوْلٍ اِلَّا نُوْحِيْٓ اِلَيْهِ اَنَّهٗ لَآ اِلٰهَ اِلَّآ اَنَا فَاعْبُدُوْنِ",
        "Urdu" : "اور ہم نے آپ سے پہلے اے پیغمبر! جو بھی کوئی رسول بھیجا اس کو یہی وحی کی کہ کوئی معبود نہیں سوائے میرے پس تم سب لوگ میری ہی بندگی کرو",
        "English" : "We did not send before you any messenger but We revealed to him that there is no god but I, so worship Me."
      },
      {
        "ayet_no" : 26,
        "arbi" : "وَقَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَـدًا سُبْحٰنَهٗ  ۭ بَلْ عِبَادٌ مُّكْرَمُوْنَ",
        "Urdu" : "اور ان کا کہنا ہے کہ خدائے رحمان نے اولاد بنا رکھی ہے وہ پاک ہے اور جن کو یہ خدا کی اولاد کہتے ہیں وہ اولاد نہیں بلکہ وہ تو اس کے ایسے بندے ہیں جن کو عزت بخشی گئی",
        "English" : "They said, :The Rehman (the All-Merciful, Allah) has taken children for Himself. Pure is He (from having children). They are but (His) honored servants."
      },
      {
        "ayet_no" : 27,
        "arbi" : "لَا يَسْبِقُوْنَهٗ بِالْقَوْلِ وَهُمْ بِاَمْرِهٖ يَعْمَلُوْنَ",
        "Urdu" : "وہ تو اس کے حضور آگے بڑھ کر بات بھی نہیں کر سکتے اور وہ کام بھی اسی کے حکم پر کرتے ہیں ف۱",
        "English" : "They do not precede Him in speech, and only under His command they act."
      },
      {
        "ayet_no" : 28,
        "arbi" : "يَعْلَمُ مَا بَيْنَ اَيْدِيْهِمْ وَمَا خَلْفَهُمْ وَلَا يَشْفَعُوْنَ ۙ اِلَّا لِمَنِ ارْتَضٰى وَهُمْ مِّنْ خَشْيَتِهٖ مُشْفِقُوْنَ",
        "Urdu" : "اللہ ایک برابر جانتا ہے وہ سب کچھ جو کہ ان کے سامنے ہے اور وہ سب کچھ بھی جو کہ ان کے پیچھے ہے اور وہ سفارش بھی نہیں کرتے مگر اسی کے لئے جس کے لئے اللہ پسند فرمائے اور وہ ہمیشہ اس کے خوف سے ڈرتے رہتے ہیں",
        "English" : "He knows what is in front of them and what is behind them, and they make recommendation for none but for whom He likes, and in awe of Him they are fearful."
      },
      {
        "ayet_no" : 29,
        "arbi" : "وَمَنْ يَّقُلْ مِنْهُمْ اِنِّىْٓ اِلٰهٌ مِّنْ دُوْنِهٖ فَذٰلِكَ نَجْزِيْهِ جَهَنَّمَ ۭ كَذٰلِكَ نَجْزِي الظّٰلِمِيْنَ",
        "Urdu" : "اور جو کوئی ان میں سے بالفرض یہ کہہ دے کہ میں بھی معبود ہوں اس وحدہ لا شریک کے سوا تو اس کو ہم جہنم کی سزا دیں گے اسی طرح ہم بدلہ دیتے ہیں ظالموں کو",
        "English" : "Should any one of them say, :I am god besides Him , We will recompense him with Jahannam (Hell). This is how We recompense the transgressors."
      },
      {
        "ayet_no" : 30,
        "arbi" : "اَوَلَمْ يَرَ الَّذِيْنَ كَفَرُوْٓا اَنَّ السَّمٰوٰتِ وَالْاَرْضَ كَانَتَا رَتْقًا فَفَتَقْنٰهُمَا  ۭ وَجَعَلْنَا مِنَ الْمَاۗءِ كُلَّ شَيْءٍ حَيٍّ  ۭ اَفَلَا يُؤْمِنُوْنَ",
        "Urdu" : "کیا ان لوگوں نے جو اڑے ہوئے ہیں اپنے کفر وباطل پر کبھی اس پر غور نہیں کیا کہ آسمان اور زمین بند تھے پھر ہم نے ان دونوں کو کھول دیاف۲ اور ہم نے پانی سے ہرچیز کو زندہ کیا تو کیا یہ لوگ پھر بھی ایمان نہیں لاتے",
        "English" : "Did the disbelievers not observe that the heavens and the earth were closed, then We opened them? And We created from water every living thing. Would they still not believe ?"
      },
      {
        "ayet_no" : 31,
        "arbi" : "وَجَعَلْنَا فِي الْاَرْضِ رَوَاسِيَ اَنْ تَمِيْدَ بِهِمْ ۠ وَجَعَلْنَا فِيْهَا فِجَـاجًا سُبُلًا لَّعَلَّهُمْ يَهْتَدُوْنَ",
        "Urdu" : "اور ہم نے گاڑ دئیے زمین میں طرح طرح کے پہاڑوں کے عظیم الشان لنگر کہ کہیں یہ ڈولنے نہ لگے اپنے اوپر رہنے والے ان لوگوں کو لیکر اور رکھ دئیے ہم نے اس کے اندر طرح طرح کے کشادہ راستے تاکہ یہ لوگ راہ پا سکیں ف۳",
        "English" : "And We created mountains on the earth, lest it should shake with them, and We have made therein paths and ways, so that they are guided."
      },
      {
        "ayet_no" : 32,
        "arbi" : "وَجَعَلْنَا السَّمَاۗءَ سَقْفًا مَّحْفُوْظًا ښ وَّهُمْ عَنْ اٰيٰـتِهَا مُعْرِضُوْنَ",
        "Urdu" : "اور ہم نے زمین کے اس عظیم الشان فرش کے لئے آسمان کو ایک عظیم الشان محفوظ چھت بنا دیا مگر یہ لوگ ہیں کہ اس کی ان تمام عظیم الشان نشانیوں سے منہ موڑے ہوئے ہیں",
        "English" : "We made the sky a protected roof; and they are averse to its signs."
      },
      {
        "ayet_no" : 33,
        "arbi" : "وَهُوَ الَّذِيْ خَلَقَ الَّيْلَ وَالنَّهَارَ وَالشَّمْسَ وَالْقَمَرَ ۭ كُلٌّ فِيْ فَلَكٍ يَّسْبَحُوْنَ",
        "Urdu" : "اور وہ اللہ وہی تو ہے جس نے پیدا فرمایا رات و دن اور سورج وچاند کے اس عظیم الشان نظام کو اور اس قدر عمدہ تقدیر اور بہترین انداز کے ساتھ کہ سب اپنے اپنے فلک میں تیرتے جا رہے ہیں",
        "English" : "And He it is Who has created the night and the day, and the sun and the moon, each in an orbit floating."
      },
      {
        "ayet_no" : 34,
        "arbi" : "وَمَا جَعَلْنَا لِبَشَرٍ مِّنْ قَبْلِكَ الْخُلْدَ  ۭ اَفَا۟ىِٕنْ مِّتَّ فَهُمُ الْخٰلِدُوْنَ",
        "Urdu" : "اور ہم نے آپ سے پہلے اے پیغمبر! کسی بھی انسان کے لئے ہمیشگی نہیں رکھی تو کیا آپ اگر اپنے وقت پر مر گئے تو یہ ہمیشہ رہیں گے ف۱",
        "English" : "We did not assign immortality to any human (even) before you. So, if you die, will they live for ever ?"
      },
      {
        "ayet_no" : 35,
        "arbi" : "كُلُّ نَفْسٍ ذَاۗىِٕقَةُ الْمَوْتِ ۭ وَنَبْلُوْكُمْ بِالشَّرِّ وَالْخَيْرِ فِتْنَةً ۭ وَاِلَيْنَا تُرْجَعُوْنَ",
        "Urdu" : "موت کا مزہ تو ہر جاندار کو بہرحال چکھنا ہے اور ہم نے دنیا کی یہ چند روزہ زندگی بھی تمہیں اے لوگو! اس لئے دی کہ ہم تمہاری آزمائش کرتے رہیں جانچنے کیلئے برے حالات سے بھی اور اچھے حالات سے بھی اور آخرکار تم نے لوٹ کر بہرحال ہمارے ہی پاس انا ہے",
        "English" : "Every one has to taste death, and We test you through bad and good (situations) with a trial, and to Us you are to be returned."
      },
      {
        "ayet_no" : 36,
        "arbi" : "وَاِذَا رَاٰكَ الَّذِيْنَ كَفَرُوْٓا اِنْ يَّـتَّخِذُوْنَكَ اِلَّا هُـزُوًا  ۭ اَھٰذَا الَّذِيْ يَذْكُرُ اٰلِهَتَكُمْ ۚ وَهُمْ بِذِكْرِ الرَّحْمٰنِ هُمْ كٰفِرُوْنَ",
        "Urdu" : "اور جب دیکھتے ہیں آپ کو وہ لوگ جو اڑے ہوئے ہیں اپنے کفر وباطل پر تو مذاق اڑانے کے سوا ان کا کوئی کام ہی نہیں رہ جاتا کہتے ہیں کہ کیا یہی ہیں وہ صاحب جو تمہارے معبودوں کا نام لینے کی جسارت کرتے ہیں؟ اور خود ان کا اپنا حال یہ ہے کہ یہ خدائے رحمان کے ذکر کے منکر ہیں",
        "English" : "When disbelievers see you, they do nothing but take you in jest (saying to one another,) :Is this the one who talks of your gods ? _ while they themselves reject even talking of the Rehman (All-Merciful)."
      },
      {
        "ayet_no" : 37,
        "arbi" : "خُلِقَ الْاِنْسَانُ مِنْ عَجَلٍ ۭ سَاُورِيْكُمْ اٰيٰتِيْ فَلَا تَسْتَعْجِلُوْنِ",
        "Urdu" : "انسان کی جلد بازی کا یہ عالم ہے کہ گویا اس کا خمیر ہی جلد بازی سے بنایا گیا ہے تو اے جلد باز منکرو! میں عنقریب ہی وقت انے پر تم کو دکھا دوں گااپنی نشانیاں، پس تم مجھ سے جلدی مت مچاؤ۔ ف۲",
        "English" : "Man is made of haste. I shall show you My signs, so do not seek haste from Me."
      },
      {
        "ayet_no" : 38,
        "arbi" : "وَيَقُوْلُوْنَ مَتٰى ھٰذَا الْوَعْدُ اِنْ كُنْتُمْ صٰدِقِيْنَ",
        "Urdu" : "اور کہتے ہیں کہ آخر کب پوری ہوگی تمہاری یہ دھمکی اگر تم سچے ہو!",
        "English" : "They say, :When will this promise be (fulfilled), if you are true ?"
      },
      {
        "ayet_no" : 39,
        "arbi" : "لَوْ يَعْلَمُ الَّذِيْنَ كَفَرُوْا حِيْنَ لَا يَكُفُّوْنَ عَنْ وُّجُوْهِهِمُ النَّارَ وَلَا عَنْ ظُهُوْرِهِمْ وَلَا هُمْ يُنْــصَرُوْنَ",
        "Urdu" : "اگر کسی طرح جان لیتے کافر لوگ اس ہولناک وقت کو کہ جب یہ دوزخ کی لپکیں مارتی ہوئی اس آگ کو نہ روک سکیں گے نہ اپنے چہروں سے اور نہاپنی پیٹھوں سے اور نہ ہی ان کی کہیں سے کوئی مدد کی جائے گی تو ان کا حال کچھ اور ہی ہوتا",
        "English" : "Only if the disbelievers were to know the time when they will not (be able to) keep off the fire from their faces or from their backs, nor will they be helped."
      },
      {
        "ayet_no" : 40,
        "arbi" : "بَلْ تَاْتِيْهِمْ بَغْتَةً فَتَبْهَتُهُمْ فَلَا يَسْتَطِيْعُوْنَ رَدَّهَا وَلَا هُمْ يُنْظَرُوْنَ",
        "Urdu" : "اور معاملہ کچھ ان کی فرمائش اور جلد بازی پر موقوف نہیں بلکہ وہ گھڑی تو ان پر اس طرح اچانک آپہنچے گی کہ ان کے ہوش اڑا کر رکھ دے گی پھر ان کو نہ تو اس کے لوٹا دینے کا یارا ہوگا اور نہ ہی ان کو کوئی مہلت ہی مل سکے گی ف۳",
        "English" : "In fact, it (i.e. the Last Day) will come upon them all of a sudden and stun them. So neither will they have the power to avert it, nor will they be granted respite."
      },
      {
        "ayet_no" : 41,
        "arbi" : "وَلَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِّنْ قَبْلِكَ فَحَـاقَ بِالَّذِيْنَ سَخِــرُوْا مِنْهُمْ مَّا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ",
        "Urdu" : "اور اے پیغمبر! آپ ان کی ٹھٹھا بازی سے دلگیر نہ ہوں کیونکہ یقینی طور پر آپ سے پہلے رسولوں کا بھی مذاق اڑایا گیا مگر انجام کار ان میں سے ان لوگوں کا جو مذاق اڑایا کرتے تھے گھیر لیا اسی چیز نے جس کا وہ مذاق اڑایا کرتے تھے ف۱",
        "English" : "Indeed (many) Messengers were mocked before you ( O Muhammad ), but the scoffers were surrounded by that, whereat they used to mock."
      },
      {
        "ayet_no" : 42,
        "arbi" : "قُلْ مَنْ يَّـكْلَـؤُكُمْ بِالَّيْلِ وَالنَّهَارِ مِنَ الرَّحْمٰنِ ۭ بَلْ هُمْ عَنْ ذِكْرِ رَبِّهِمْ مُّعْرِضُوْنَ",
        "Urdu" : "اور ان بے انصافوں سے یہ تو پوچھو کہ بھلا کون ہے وہ جو رات اور دن تمہاری حفاظت کرتا ہے خدائے رحمان سے سوائے اسی کی رحمت وعنایت کے؟ مگر یہ ہیں کہ اس کی احسان مندی وشکر گزاری کے بجائے اپنے رب کی یاد سے منہ موڑے ہوئے ہیں ف۲",
        "English" : "Say: ‘Who can guard and save you from ( the punishment of ) the Most Kind (Lord) by night and by day?’ In fact they keep away from the remembrance of the ( same ) Lord."
      },
      {
        "ayet_no" : 43,
        "arbi" : "اَمْ لَهُمْ اٰلِـهَةٌ تَمْــنَعُهُمْ مِّنْ دُوْنِنَا ۭ لَا يَسْتَطِيْعُوْنَ نَـصْرَ اَنْـفُسِهِمْ وَلَا هُمْ مِّنَّا يُصْحَبُوْنَ",
        "Urdu" : "کیا ان لوگوں کے اور کچھ ایسے معبود ہیں ہمارے سوا جو ان کو بچائیں گے ہماری گرفت پکڑ سے؟ اور بےچارے ان کو کیا بچائیں گے وہ تو خوداپنی مدد بھی نہیں کر سکتے اور نہ ہی ان کو ہماری طرف سے کوئی تائید مل سکتی ہے",
        "English" : "Or have they gods who can shield them from Us ? They cannot help themselves nor can they be defended from Us."
      },
      {
        "ayet_no" : 44,
        "arbi" : "بَلْ مَتَّعْنَا هٰٓؤُلَاۗءِ وَاٰبَاۗءَهُمْ حَتّٰى طَالَ عَلَيْهِمُ الْعُمُرُ ۭاَفَلَا يَرَوْنَ اَنَّا نَاْتِي الْاَرْضَ نَنْقُصُهَا مِنْ اَطْرَافِهَا  ۭ اَفَـهُمُ الْغٰلِبُوْنَ",
        "Urdu" : "ان میں سے کوئی وجہ بھی نہیں بلکہ اصل بات یہ ہے کہ ہم زندگی کا سازو سامان دیتے رہے ان لوگوں کو بھی اور ان کے باپ دادا کو بھیاپنی رحمت وعنایت سے یہاں تک کہ ان پر ایک زمانہ گزر گیا اور یہ مست ہوگئے مگر کیا انھیں یہ نظر نہیں آرہا کہ ہم کم کرتے چلے رہے زمین کو اس کی مختلف سمتوں سے تو کیا یہ لوگ پھر بھی غالب آجائیں گے حق کے مقابلے میں ؟",
        "English" : "But We have given benefits to these and their fathers until life was prolonged for them. So do they not see that We are coming to the land narrowing it down from all its sides? Then, are they the ones to prevail ?"
      },
      {
        "ayet_no" : 45,
        "arbi" : "قُلْ اِنَّمَآ اُنْذِرُكُمْ بِالْوَحْيِ ڮ وَلَا يَسْمَعُ الصُّمُّ الدُّعَاۗءَ اِذَا مَا يُنْذَرُوْنَ",
        "Urdu" : "ان سے صاف کہہ دو کہ میرا کام تو بس یہ ہے کہ میں تم کو خبردار کردوں تمہارے انجام سے وحی کی روشنی کے ساتھ مگر بہرے پکار کو نہیں سنا کرتے جب کہ ان کو خبردار کیا جائے مخاف وخطرات سے ف۳",
        "English" : "Say, :I warn you only by revelation, but the deaf do not listen to the call when they are warned."
      },
      {
        "ayet_no" : 46,
        "arbi" : "وَلَىِٕنْ مَّسَّتْهُمْ نَفْحَةٌ مِّنْ عَذَابِ رَبِّكَ لَيَقُوْلُنَّ يٰوَيْلَنَآ اِنَّا كُنَّا ظٰلِمِيْنَ",
        "Urdu" : "ان کی بڑکیں تو یہ ہیں مگر ان کی بلند ہمتی کا حال یہ ہے کہ اگر ان کو تیرے رب کے عذاب کا ایک جھونکا بھی چھو جائے تو یہ چیخ اٹھیں کہ ہائے ہماری کم بختی بیشک ہم لوگ ظالم تھے ف٤",
        "English" : "And if a breath of the torment of thy Lord were to touch them, they will say: woe unto us! we have been wrong-doers."
      },
      {
        "ayet_no" : 47,
        "arbi" : "وَنَضَعُ الْمَوَازِيْنَ الْقِسْطَ لِيَوْمِ الْقِيٰمَةِ فَلَا تُظْلَمُ نَفْسٌ شَـيْــــــًٔا ۭ وَ اِنْ كَانَ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ اَتَيْنَا بِهَا ۭ وَكَفٰى بِنَا حٰسِـبِيْنَ",
        "Urdu" : "اور ہم قیامت کے روز انصاف کے ایسے ترازو رکھیں گے کہ کسی بھی جان پر ذرہ برابرکوئی ظلم نہیں ہونے پائے گا اور اگر رائی کے دانے کے برابر بھی کسی کا کوئی عمل ہوگا تو ہم اس کو بھی لا حاضر کریں گے اور ہم کافی ہیں حساب لگانے والے۔ ف۱",
        "English" : "We shall place scales to do justice on the Day of Judgment. So no one shall be wronged in the least. Even if it (a deed) is to the measure of a mustard seed, We will bring it forth, and We are enough to take account."
      },
      {
        "ayet_no" : 48,
        "arbi" : "وَلَقَدْ اٰتَيْنَا مُوْسٰى وَهٰرُوْنَ الْـفُرْقَانَ وَضِيَاۗءً وَّذِكْرًا لِّـلْمُتَّـقِيْنَ",
        "Urdu" : "اور بلاشبہ ہم اس سے پہلے موسیٰ اور ہارون کو بھی حق اور باطل کے درمیان فیصلے کا وہ سامان دے چکے ہیں اور ایک عظیم الشان روشنی اور نصیحت بھی ان پرہیزگار لوگوں کے لئے",
        "English" : "And assuredly We vcuchsafed unto Musa and Harun the distinction and illumination and an admonition for the God-fearing."
      },
      {
        "ayet_no" : 49,
        "arbi" : "الَّذِيْنَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ وَهُمْ مِّنَ السَّاعَةِ مُشْفِقُوْنَ",
        "Urdu" : "جو ڈرتے ہیں اپنے رب سے بن دیکھے اور ان کو کھٹکا لگا رہتا ہے قیامت کی اس ہولناک گھڑی کا",
        "English" : "These who fear their Lord unseen, and who are of the Hour fearful."
      },
      {
        "ayet_no" : 50,
        "arbi" : "وَھٰذَا ذِكْرٌ مُّبٰرَكٌ اَنْزَلْنٰهُ  ۭ اَفَاَنْتُمْ لَهٗ مُنْكِرُوْنَ",
        "Urdu" : "اور یہ قران برکتوں بھرا ایک عظیم الشان ذکر ہے جسے ہم نے ہی اتارا ہے کیا پھر بھی تم لوگ اس کا انکار ہی کرتے ہو ؟ ف۲",
        "English" : "And this is a blessed Reminder (the Quran) which We have sent down, will you then (dare to) deny it ?"
      },
      {
        "ayet_no" : 51,
        "arbi" : "وَلَقَدْ اٰتَيْنَآ اِبْرٰهِيْمَ رُشْدَهٗ مِنْ قَبْلُ وَكُنَّا بِهٖ عٰلِمِيْنَ",
        "Urdu" : "اور اس زمانہ موسوی سے پہلے ابراہیم کو بھی اس کی شان کے مطابق ہوش مندری عطا کر چکے تھے اور ہم اس کو خوب جانتے تھے",
        "English" : "Even earlier We had given Ibrahim his right course, and We knew him well"
      },
      {
        "ayet_no" : 52,
        "arbi" : "اِذْ قَالَ لِاَبِيْهِ وَقَوْمِهٖ مَا هٰذِهِ التَّـمَاثِيْلُ الَّتِيْٓ اَنْتُمْ لَهَا عٰكِفُوْنَ",
        "Urdu" : "ان کا وہ وقت یاد کرنے کے لائق ہے کہ جب انہوں نے کفر وشرک کے ان گھٹا ٹوپ اندھیروں میں کلمہ حق بلند کرتے ہوئے اپنے مشرک باپ اور اس کی مشرک قوم سے کہا کہ کیا ہیں یہ بےجان مورتیاں جن کی پوچا وپرستش پر تم جمے بیٹھے ہو ؟",
        "English" : "Recall what time he said unto his father and his people what are these images to which ye are cleaving ?"
      },
      {
        "ayet_no" : 53,
        "arbi" : "قَالُوْا وَجَدْنَآ اٰبَاۗءَنَا لَهَا عٰبِدِيْنَ",
        "Urdu" : "تو انہوں نے کہا کہ ہم نے اپنے باپ دادا کو ان کی پوچا کرتے پایا تو ہم بھی اس میں لگ گئے",
        "English" : "They said: we found our fathers the worshippers thereof."
      },
      {
        "ayet_no" : 54,
        "arbi" : "قَالَ لَقَدْ كُنْتُمْ اَنْتُمْ وَاٰبَاۗؤُكُمْ فِيْ ضَلٰلٍ مُّبِيْنٍ",
        "Urdu" : "فرمایا کہ یقینا تم لوگ ایک کھلی گمراہی میں ڈوبے ہوئے ہو تم بھی اور تمہارے یہ باپ دادا بھی",
        "English" : "He said, :Surely you and your fathers have been in open error."
      },
      {
        "ayet_no" : 55,
        "arbi" : "قَالُوْٓا اَجِئْـتَنَا بِالْحَــقِّ اَمْ اَنْتَ مِنَ اللّٰعِبِيْنَ",
        "Urdu" : "(اس اعلان حق پر وہ لوگ تعجب میں ڈوب کر بولے) ابراہیم کیا تم سچ مچ یہ بات کہہ رہے ہو یا یوں ہی دل لگی کرنا مقصود ہے ؟",
        "English" : "They said: hast thou come unto us with the truth, or art thou of those who sport ?"
      },
      {
        "ayet_no" : 56,
        "arbi" : "قَالَ بَلْ رَّبُّكُمْ رَبُّ السَّمٰوٰتِ وَالْاَرْضِ الَّذِيْ فَطَرَهُنَّ ڮ وَاَنَا عَلٰي ذٰلِكُمْ مِّنَ الشّٰهِدِيْنَ",
        "Urdu" : "فرمایا دل لگی نہیں بلکہ حقیقت یہ ہے کہ تم سب کا رب وہی ہے جو کہ رب ہے آسمانوں اور زمین کی اس پوری کائنات کا جس نے پیدا فرمایا ہے ان سب کو اور میں ڈنکے کی چوٹ پر تمہارے سامنے اس بات کی گواہی دیتا ہوں ف۳",
        "English" : "He said, :No, your Lord is the Lord of the heavens and the earth, who has created them, and I am one of those who bear witness to it."
      },
      {
        "ayet_no" : 57,
        "arbi" : "وَتَاللّٰهِ لَاَكِيْدَنَّ اَصْنَامَكُمْ بَعْدَ اَنْ تُوَلُّوْا مُدْبِرِيْنَ",
        "Urdu" : "اور اللہ کی قسم میں ضرور بالضرور خبر لے کر رہوں گا تمہارے ان بتوں کی اس کے بعد تم لوگ ان سے جا چکے ہو گے پیٹھ پھیر کر",
        "English" : "And by Allah I shall surely devise a plot against your idols after ye turned away backward."
      },
      {
        "ayet_no" : 58,
        "arbi" : "فَجَــعَلَهُمْ جُذٰذًا اِلَّا كَبِيْرًا لَّهُمْ لَعَلَّهُمْ اِلَيْهِ يَرْجِعُوْنَ",
        "Urdu" : "چنانچہ موقع ملتے ہی ابراہیم نے ٹکڑے ٹکڑے کرکے رکھ دیا ان سب کو سوائے ان کے ایک بڑے کے کہ اسے چھوڑ دیا تاکہ وہ اس کی طرف رجوع کریں ف۱",
        "English" : "Then he made them fragments, all except the big one of them, that haply unto it they may return."
      },
      {
        "ayet_no" : 59,
        "arbi" : "قَالُوْا مَنْ فَعَلَ ھٰذَا بِاٰلِـهَتِنَآ اِنَّهٗ لَمِنَ الظّٰلِمِيْنَ",
        "Urdu" : "میلے سے وا پسی پر جب انہوں نے اپنے ان ٹھاکروں کی یہ درگت دیکھی تو انہوں نے کہا ہائے ہمارے ان خداؤں کا یہ حشر کس نے کیا ہے؟ واقعی وہ بڑا ہی کوئی ظالم شخص ہے",
        "English" : "They said: who hath wrought this to our gods? verily he is of the wrong-doers."
      },
      {
        "ayet_no" : 60,
        "arbi" : "قَالُوْا سَمِعْنَا فَـتًى يَّذْكُرُهُمْ يُقَالُ لَهٗٓ اِبْرٰهِيْمُ",
        "Urdu" : "ان میں سے بعض نے کہا کہ ہم نے ایک نوجوان کے بارے میں جس کو ابراہیم کہا جاتا ہے، یہ سنا ہے کہ وہ ان کی برائی کرتا رہتا ہے",
        "English" : "Some of them said, :We have heard a youth talking about them. He is called Ibrahim."
      },
      {
        "ayet_no" : 61,
        "arbi" : "قَالُوْا فَاْتُوْا بِهٖ عَلٰٓي اَعْيُنِ النَّاسِ لَعَلَّهُمْ يَشْهَدُوْنَ",
        "Urdu" : "کہنے لگے فوراً پکڑ لاؤ اسے ان سب لوگوں کے سامنے تاکہ یہ سب دیکھ لیں اس کے اس حشر اور انجام کو ف۲",
        "English" : "They said: bring him then before the eyes of the people, haply they may bear witness."
      },
      {
        "ayet_no" : 62,
        "arbi" : "قَالُوْٓا ءَاَنْتَ فَعَلْتَ ھٰذَا بِاٰلِهَتِنَا يٰٓـاِبْرٰهِيْمُ",
        "Urdu" : "لانے کے بعد انہوں نے پوچھا ابراہیم کیا تم نے ہی ہمارے خداؤں کے ساتھ یہ حرکت کی ؟",
        "English" : "They said, :Is it you O Ibrahim who has done this to our gods ?"
      },
      {
        "ayet_no" : 63,
        "arbi" : "قَالَ بَلْ فَعَلَه ٗٗ ڰ كَبِيْرُهُمْ ھٰذَا فَسْـَٔــلُوْهُمْ اِنْ كَانُوْا يَنْطِقُوْنَ",
        "Urdu" : "فرمایا تم یہ کیوں نہیں فرض کرتے کہ میں نے نہیں بلکہ یہ حرکت ان کے اس بڑے گرو نے کی ہو تم خود ان سے پوچھ لو اگر یہ بولتے ہیں ؟ ف۳",
        "English" : "He said: But this, their chief hath done it. So question them, if they can speak."
      },
      {
        "ayet_no" : 64,
        "arbi" : "فَرَجَعُوْٓا اِلٰٓى اَنْفُسِهِمْ فَقَالُوْٓا اِنَّكُمْ اَنْتُمُ الظّٰلِمُوْنَ",
        "Urdu" : "اس پر وہ پلٹے اپنے ضمیروں کی طرف اور اپنے دلوں میں کہا کہ حقیقت یہ ہے کہ تم لوگ خود ہی ظالم ہو ف٤",
        "English" : "They then turned to themselves, and said: verily ye it is who are the wrong-doers."
      },
      {
        "ayet_no" : 65,
        "arbi" : "ثُمَّ نُكِسُوْا عَلٰي رُءُوْسِهِمْ ۚ لَقَدْ عَلِمْتَ مَا هٰٓؤُلَاۗءِ يَنْطِقُوْنَ",
        "Urdu" : "پھر مارے ندامت کے وہ اوندھے ہوگئے اپنے سروں کو جھکا کر اور کھسیانے ہو کر ابراہیم سے کہنے لگے کہ تم خود اچھی طرح جانتے ہو کہ یہ بول نہیں سکتے",
        "English" : "Then, hanging their heads they reversed their position (and replied to Ibrahim,) :You already knew that they do not speak."
      },
      {
        "ayet_no" : 66,
        "arbi" : "قَالَ اَفَتَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ مَا لَا يَنْفَعُكُمْ شَـيْــــًٔا وَّلَا يَضُرُّكُمْ",
        "Urdu" : "ابراہیم علیہ السلام نے کہا تو کیا تم لوگ اللہ کے سوا ان چیزوں کی پوجا کرتے ہو جو نہ تو تمہیں کچھ نفع دے سکیں اور نہ کوئی نقصان پہنچا سکیں ؟",
        "English" : "He said, :Do you then worship, beside Allah, what does neither benefit you in the least nor harm you ?"
      },
      {
        "ayet_no" : 67,
        "arbi" : "اُفٍّ لَّكُمْ وَلِمَا تَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ ۭ اَفَلَا تَعْقِلُوْنَ",
        "Urdu" : "تف ہے تم پر بھی اور تمہارے ان معبودوں پر بھی جن کی پوجا تم لوگ کرتے ہو اللہ وحدہ لا شریک کے سوا کیا تم لوگ کام نہیں لیتےاپنی عقلوں سے ؟",
        "English" : "Fie upon you and upon that which ye worship beside Allah! Will ye not then reflect ?"
      },
      {
        "ayet_no" : 68,
        "arbi" : "قَالُوْا حَرِّقُـوْهُ وَانْصُرُوْٓا اٰلِهَتَكُمْ اِنْ كُنْتُمْ فٰعِلِيْنَ",
        "Urdu" : "انہوں نے کہا جلا ڈالو اس شخص کو اور مدد کرو اپنے معبودوں کی اگر تمہیں کچھ کرنا ہے",
        "English" : "They said, :(O people) burn him and help your gods, if you are to take action."
      },
      {
        "ayet_no" : 69,
        "arbi" : "قُلْنَا يٰنَارُكُـوْنِيْ بَرْدًا وَّسَلٰمًا عَلٰٓي اِبْرٰهِيْمَ",
        "Urdu" : "تب ہم نے حکم کر دیا (چیخا میں جلتی اس آگ کو) کہ اے آگ تو ٹھنڈی ہو جا اور سلامتی والی بن جا ابراہیم پر۔ ف۱",
        "English" : "We said, :O fire, be cold and safe for Ibrahim."
      },
      {
        "ayet_no" : 70,
        "arbi" : "وَاَرَادُوْا بِهٖ كَيْدًا فَجَعَلْنٰهُمُ الْاَخْسَرِيْنَ",
        "Urdu" : "ان لوگوں نے تو ابراہیم علیہ السلام کے ساتھ ایک بڑی برائی کرنا چاہی تھی مگر ہم نے خود انہی کو سب سے بڑا ناکام بنا دیا",
        "English" : "And they intended to harm him, but We made them the worst losers."
      },
      {
        "ayet_no" : 71,
        "arbi" : "وَنَجَّيْنٰهُ وَلُوْطًا اِلَى الْاَرْضِ الَّتِيْ بٰرَكْنَا فِيْهَا لِلْعٰلَمِيْنَ",
        "Urdu" : "اور بچا کر نکال لائے ہم اس کو بھی اور لوط کو بھی اس سرزمین کی طرف جس میں ہم نے طرح طرح کی برکتیں رکھی ہیں دنیا والوں کے لئے ف۲",
        "English" : "And We delivered him and Lut to the land wherein We had placed Our blessings for the worlds."
      },
      {
        "ayet_no" : 72,
        "arbi" : "وَوَهَبْنَا لَهٗٓ اِسْحٰقَ  ۭ وَيَعْقُوْبَ نَافِلَةً  ۭ وَكُلًّا جَعَلْنَا صٰلِحِيْنَ",
        "Urdu" : "اور ہم نے اسے اسحاق علیہ السلام جیسا بیٹا بھی بخشا اور یعقوب جیسا پوتا بھی انعام مزید کے طور پر اور ان سب کو ہم نے اعلیٰ درجے کا نیک بخت بنایا تھا",
        "English" : "And We bestowed upon him ls-haq and Ya qub as a grandson; and each one We made righteous."
      },
      {
        "ayet_no" : 73,
        "arbi" : "وَجَعَلْنٰهُمْ اَىِٕمَّةً يَّهْدُوْنَ بِاَمْرِنَا وَاَوْحَيْنَآ اِلَيْهِمْ فِعْلَ الْخَيْرٰتِ وَاِقَامَ الصَّلٰوةِ وَاِيْتَاۗءَ الزَّكٰوةِ ۚ وَكَانُوْا لَنَا عٰبِدِيْنَ",
        "Urdu" : "اور ہم نے ان کو ایسا امام بنایا تھا جو لوگوں کی راہنمائی کرتے تھے ہمارے حکم سے اور ہم نے ان کو وحی کے ذریعے ہدایت کی تھی نیک کام کرنے کی اور خاص کر نماز قائم رکھنے اور زکوٰۃ ادا کرنے کی اور وہ سب ہماری ہی عبادت کیا کرتے تھے",
        "English" : "And We made them the Imams who guided (people) under Our command, and We inspired them to do good deeds and to establish Salah and pay Zakah, and Us alone they worshipped."
      },
      {
        "ayet_no" : 74,
        "arbi" : "ڌوَلُوْطًا اٰتَيْنٰهُ حُكْمًا وَّعِلْمًا وَّنَجَّيْنٰهُ مِنَ الْقَرْيَةِ الَّتِيْ كَانَتْ تَّعْمَلُ الْخَـبٰۗىِٕثَ  ۭ اِنَّهُمْ كَانُوْا قَوْمَ سَوْءٍ فٰسِقِيْنَ",
        "Urdu" : "اور لوط کو بھی ہم نے نوازا تھا حکم اور علم کی دولت سے اور ہم نے ان کو بچا نکالا تھا اس بستی سے جو گندے کام کرتی تھی بلاشبہ وہ بڑے برے اور بد کردار لوگ تھے",
        "English" : "And Lut! We vouchsafed unto him judgment and knowledge, and We delivered him out of the city which had been working foul deeds; verily they were a people evil, wicked."
      },
      {
        "ayet_no" : 75,
        "arbi" : "وَاَدْخَلْنٰهُ فِيْ رَحْمَتِنَا ۭ اِنَّهٗ مِنَ الصّٰلِحِيْنَ",
        "Urdu" : "اور ان کو بھی داخل کر دیا تھا ہم نےاپنی خاص رحمت وعنایت کے دائرہ میں کہ وہ بھی یقینی طور پر اعلیٰ درجے کے نیکوکار لوگوں میں سے تھے",
        "English" : "And We admitted him to Our mercy. Indeed, He was of the righteous."
      },
      {
        "ayet_no" : 76,
        "arbi" : "وَنُوْحًا اِذْ نَادٰي مِنْ قَبْلُ فَاسْتَجَبْنَا لَهٗ فَنَجَّيْنٰهُ وَاَهْلَهٗ مِنَ الْكَرْبِ الْعَظِيْمِ",
        "Urdu" : "اور نوح کو بھی ہم نے اسی نعمت سے نوازا اور ان کے سلسلہ میں وہ وقت یاد کرنے کے لائق ہے کہ جب انہوں نے بھی اس سے پہلے ہم ہی کو پکارااپنی حاجت روائی ومشکل کشائی کے لئے تو ہم نے سن لیا ان کی پکار کو اور نجات دے دی ہم نے ان کو بھی اور ان کو ماننے والوں کو بھی اس بری گھبراہٹ سے",
        "English" : "And Nuh! recall what time he cried a fore time; so we answered him and delivered him and his house hold from a calamity mighty."
      },
      {
        "ayet_no" : 77,
        "arbi" : "وَنَــصَرْنٰهُ مِنَ الْقَوْمِ الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَا ۭ اِنَّهُمْ كَانُوْا قَوْمَ سَوْءٍ فَاَغْرَقْنٰهُمْ اَجْمَعِيْنَ",
        "Urdu" : "اور ہم نے ان کی مدد کی اس ناہنجار قوم کے مقابلے میں جو جھٹلاتی تھی ہماری آیتوں کو بیشک وہ بڑے ہی برے لوگ تھے سو ہم نے غرق کر دیا ان سب کو اکٹھا اور یکجا طور پر ف۱",
        "English" : "And We succoured him against the people who belied Our signs; verily they were a people evil, so we drowned them all."
      },
      {
        "ayet_no" : 78,
        "arbi" : "وَدَاوٗدَ وَسُلَيْمٰنَ اِذْ يَحْكُمٰنِ فِي الْحَرْثِ اِذْ نَفَشَتْ فِيْهِ غَنَمُ الْقَوْمِ  ۚ وَكُنَّا لِحُـكْمِهِمْ شٰهِدِيْنَ",
        "Urdu" : "اور داؤد وسلیمان علیہما السلام کو بھی ہم نے اسی نعمت سے سرفراز فرما دیا تھا ان کے بارے میں بھی وہ وقت یاد کرنے کے لائق ہے کہ جب وہ دونوں فیصلہ کر رہے تھے ایک کھیت کے بارے میں جب کہ رات کے وقت اس میں جا پڑی تھیں کچھ لوگوں کی بکریاں اور ہم ان کے فیصلے کو خود دیکھ رہے تھے ف۲",
        "English" : "And (remember) Dawud (David) and Sulaiman (Solomon), when they were adjudicating about the tillage in which the goats of other people wandered at night (and trampled it), and We were witness to their judgment."
      },
      {
        "ayet_no" : 79,
        "arbi" : "فَفَهَّمْنٰهَا سُلَيْمٰنَ ۚ وَكُلًّا اٰتَيْنَا حُكْمًا وَّعِلْمًا ۡ وَّسَخَّرْنَا مَعَ دَاوٗدَ الْجِبَالَ يُسَبِّحْنَ وَالطَّيْرَ ۭ وَكُنَّا فٰعِلِيْنَ",
        "Urdu" : "پھر ہم نے اس سے متعلق بہتر فیصلہ سجھا دیا سلیمان کو اور یوں حکمت اور علم کی دولت بےمثال سے ہم نے ان دونوں ہی کو نواز رکھا تھا اور داؤد علیہ السلام کے ساتھ ہم نے پہاڑوں کو مسخر کر دیا تھا جو تسبیح کرتے تھے اور پرندوں کو بھی اور اس میں تعجب کی کوئی بات نہیں کہ یہ سب کچھ ہم ہی کرنے والے تھے",
        "English" : "So, We enabled Sulaiman to understand it. And to each one of them We gave wisdom and knowledge. And with Dawud We subjugated the mountains that pronounced tasbiH (Allah‘s purity), and the birds as well. And We were the One who did (it)."
      },
      {
        "ayet_no" : 80,
        "arbi" : "وَعَلَّمْنٰهُ صَنْعَةَ لَبُوْسٍ لَّكُمْ لِتُحْصِنَكُمْ مِّنْۢ بَاْسِكُمْ ۚ فَهَلْ اَنْتُمْ شٰكِرُوْنَ",
        "Urdu" : "اور ہم نے ان کو تمہارے لئے ایک خاص لباس زرہ کی صنعت بھی سکھا دی تھی تاکہ وہ تمہیں لڑائی میں ایک دوسرے کی زد سے بچا سکے تو کیا تم لوگ شکر گزار بنتے ہو ؟",
        "English" : "We taught him the skill of making armor as dress for you to protect you from what may harm you (in combat). So are you grateful ?"
      },
      {
        "ayet_no" : 81,
        "arbi" : "وَلِسُلَيْمٰنَ الرِّيْحَ عَاصِفَةً تَجْرِيْ بِاَمْرِهٖٓ اِلَى الْاَرْضِ الَّتِيْ بٰرَكْنَا فِيْهَا ۭ وَكُنَّا بِكُلِّ شَيْءٍ عٰلِمِيْنَ",
        "Urdu" : "اور سلیمان کے لئے ہم نے زور کی ہوا کو بھی مسخر کر دیا تھا جو ان کے حکم کے مطابق چلتی تھی اس سرزمین کی طرف جس میں ہم نے طرح طرح کی برکتیں رکھی تھیں اور ہم ہرچیز کو پوری طرح جاننے والے ہیں اس لئے ہم نے جس کو جو دیا ٹھیک ہی دیا",
        "English" : "And for Sulaiman, (We subjugated) the violent wind that blew under his command to the land in which We placed Our blessings. And We were the One who knew everything."
      },
      {
        "ayet_no" : 82,
        "arbi" : "وَمِنَ الشَّيٰطِيْنِ مَنْ يَّغُوْصُوْنَ لَهٗ وَيَعْمَلُوْنَ عَمَلًا دُوْنَ ذٰلِكَ  ۚ وَكُنَّا لَهُمْ حٰفِظِيْنَ",
        "Urdu" : "اور شیطانوں یعنی جنوں میں سے بھی ہم نے بہت سے ایسوں کو ان کے تابع کر دیا تھا جو ان کے لئے غوطے لگاتے اور وہ اس کے علاوہ اور بھی کئی کام کرتے تھے اور ان کے سنبھالنے والے بھی ہم ہی تھے",
        "English" : "And of the satans were some who dove for him, and worked a work beside that; and of them We were the Watchers."
      },
      {
        "ayet_no" : 83,
        "arbi" : "وَاَيُّوْبَ اِذْ نَادٰي رَبَّهٗٓ اَنِّىْ مَسَّنِيَ الضُّرُّ وَاَنْتَ اَرْحَمُ الرّٰحِمِيْنَ",
        "Urdu" : "اور ایوب کو بھی یاد کرو کہ جب انہوں نے اپنے رب کو پکارا کہ مجھے روگ لگ گیا ہے اور تو ہی اے میرے مالک! سب مہربانوں سے بڑا مہربان ہے، ف۳",
        "English" : "And (remember) Ayub (Job), when he called his Lord saying, :Here I am, afflicted by pain and You are the most merciful of all the merciful."
      },
      {
        "ayet_no" : 84,
        "arbi" : "فَاسْتَجَبْنَا لَهٗ فَكَشَفْنَا مَا بِهٖ مِنْ ضُرٍّ وَّاٰتَيْنٰهُ اَهْلَهٗ وَمِثْلَهُمْ مَّعَهُمْ رَحْمَةً مِّنْ عِنْدِنَا وَذِكْرٰي لِلْعٰبِدِيْنَ",
        "Urdu" : "ہم نے سن لیا اس کی پکار کو اور دور کر دیا ان سے اس تکلیف کو جو ان کو لاحق تھی اور مزید کرم یہ کیا کہ ہم نے ان کو ان کے گھر والے بھی دے دئیے اور ان کے ساتھ اتنے ہی اور بھی محضاپنی رحمت سے اور عبادت گزاروں کے لئے ایک عطیم الشان نصیحت کے طور پر ف۱",
        "English" : "So We answered him and We removed that which was with him of the hurt, and We vouchsafed unto him his household and the like thereof along with them, as a mercy from us and a remembrance unto the worshippers."
      },
      {
        "ayet_no" : 85,
        "arbi" : "وَاِسْمٰعِيْلَ وَاِدْرِيْسَ وَذَا الْكِفْلِ ۭ كُلٌّ مِّنَ الصّٰبِرِيْنَ",
        "Urdu" : "اور اسماعیل، ادریس اور ذوالکفل کو بھی یاد کرو کہ یہ سب بھی صبر و استقامت والے لوگ تھے",
        "English" : "And (remember) Ismai'l and Idris and Dhul-Kifl. Each one of them was of those who observed patience."
      },
      {
        "ayet_no" : 86,
        "arbi" : "وَاَدْخَلْنٰهُمْ فِيْ رَحْمَتِنَا  ۭ اِنَّهُمْ مِّنَ الصّٰلِحِيْنَ",
        "Urdu" : "اور ہم نے ان کو بھی داخل فرمایا تھااپنی خاص رحمت وعنایت میں یہ سب بھی یقینی طور پر کمال صلاحیت والوں میں سے تھے",
        "English" : "And We admitted them to Our mercy. Surely, they were of the righteous."
      },
      {
        "ayet_no" : 87,
        "arbi" : "وَذَا النُّوْنِ اِذْ ذَّهَبَ مُغَاضِبًا فَظَنَّ اَنْ لَّنْ نَّقْدِرَ عَلَيْهِ فَنَادٰي فِي الظُّلُمٰتِ اَنْ لَّآ اِلٰهَ اِلَّآ اَنْتَ سُبْحٰــنَكَ ڰ اِنِّىْ كُنْتُ مِنَ الظّٰلِمِيْنَ",
        "Urdu" : "اور مچھلی والے یعنی حضرت یونس کو بھی جب کہ وہاپنی قوم سے خفا ہو کر چلے گئے تھے اور انہوں نے یہ سمجھا کہ ہم ان پر کوئی داروگیر نہ کریں گے پھر انہوں نے تہ در تہ اندھیروں میں پکارا کہ اے میرے رب تیرے سوا کوئی معبود نہیں، تو پاک ہے ہر نقص وعیب اور ہر شائبہ شرک سے بیشک میں ہی ہوں قصور واروں میں سے ف۲",
        "English" : "And (remember) Dhunnun (the man of the fish, namely Yunus X), when he walked away in anger and thought that We would never put him to trouble. Then, he called (Us) in depths of darkness saying, :There is no god but You. Pure are You. Indeed I was among the wrongdoers."
      },
      {
        "ayet_no" : 88,
        "arbi" : "فَاسْتَجَبْنَا لَهٗ  ۙ وَنَجَّيْنٰهُ مِنَ الْغَمِّ  ۭ وَكَذٰلِكَ نُـــــْۨـجِي الْمُؤْمِنِيْنَ",
        "Urdu" : "تب ہم نے قبول کر لیا ان کی دعا کو اور نجات دے دی ہم نے ان کو اس غم سے اور ہم اسی طرح نجات دیتے ہیں ایمان والوں کو",
        "English" : "So We responded to him and rescued him from the distress. And this is how We rescue the believers."
      },
      {
        "ayet_no" : 89,
        "arbi" : "وَزَكَرِيَّآ اِذْ نَادٰي رَبَّهٗ رَبِّ لَا تَذَرْنِيْ فَرْدًا وَّاَنْتَ خَيْرُ الْوٰرِثِيْنَ",
        "Urdu" : "اور زکریا کو بھی یاد کرو کہ جب انہوں نے پکارا اپنے رب کو کہ اے میرے پروردگار مجھے لاوارث نہ رکھیو اور یوں سب سے اچھے اور حقیقی وارث تو آپ ہی ہیں",
        "English" : "And Zakariyya! recall what time he cried unto his Lord: my Lord! leave me not solitary, though Thou art the best of heirs."
      },
      {
        "ayet_no" : 90,
        "arbi" : "فَاسْتَجَبْنَا لَهٗ  ۡ وَوَهَبْنَا لَهٗ يَحْــيٰى وَاَصْلَحْنَا لَهٗ زَوْجَهٗ  ۭ اِنَّهُمْ كَانُوْا يُسٰرِعُوْنَ فِي الْخَــيْرٰتِ وَيَدْعُوْنَنَا رَغَبًا وَّرَهَبًا  ۭ وَكَانُوْا لَنَا خٰشِعِيْنَ",
        "Urdu" : "سو ہم نے ان کی دعاء بھی قبول کر لی اور ان کو یحیی جیسا بیٹا بھی عطا کیا اور ان کی خاطر ان کی بیوی کو بھی ہم نے اولاد کے قابل بنا دیا بلاشبہ یہ مذکورہ بالا سب حضرات لپک لپک کر نیک کام کرتے تھے اور یہ سب ہم ہی کو پکارا کرتے تھے رغبت اور خوف کے ساتھ اور یہ سب ہمارے حضور ہی جھکے رہتے تھے صدق واخلاص کے ساتھ ۔",
        "English" : "So, We responded to him and gave him YaHya and made his wife good for him. They used to race towards the good deeds and call Us with hope and fear; and they were humble to Us."
      },
      {
        "ayet_no" : 91,
        "arbi" : "وَالَّتِيْٓ اَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيْهَا مِنْ رُّوْحِنَا وَجَعَلْنٰهَا وَابْنَهَآ اٰيَةً لِّـلْعٰلَمِيْنَ",
        "Urdu" : "اور انفرادی شان رکھنے والی اس پاک دامن خاتون کو بھی یاد کرو جس نے محفوظ رکھا تھااپنی عصمت وناموس کو پھر ہم نے اس کے اندر بواسطہ جبرائیل پھونک مار دیاپنی روح سے اور ہم نے بنا دیا اس کو اور اس کے بیٹے کو ایک عظیم الشان نشانی سب دنیا والوں کے لئے ف۱",
        "English" : "And (remember) her who protected her private part (that is, Maryam). So, We blew in her (a life) through Our Spirit, and made her and her son (lsa, X) a sign for all the worlds."
      },
      {
        "ayet_no" : 92,
        "arbi" : "اِنَّ هٰذِهٖٓ اُمَّتُكُمْ اُمَّةً وَّاحِدَةً ڮ وَّاَنَا رَبُّكُمْ فَاعْبُدُوْنِ",
        "Urdu" : "بیشک یہ امت ہے تم سب کی ایک ہی امت اور میں رب ہوں تم سب کا پس تم سب لوگ میری ہی بندگی کرو ف۲",
        "English" : "Surely, this is the fraternity of your Faith, a single Faith, and I am your Lord; so worship Me."
      },
      {
        "ayet_no" : 93,
        "arbi" : "وَتَقَطَّعُوْٓا اَمْرَهُمْ بَيْنَهُمْ ۭكُلٌّ اِلَيْنَا رٰجِعُوْنَ",
        "Urdu" : "مگر اس ٹھوس حقیقت کے برعکس لوگوں نے ٹکڑے ٹکڑے کر دیا آ پس میں اپنے دین کو اور وہ اپنے کئے کا بدلہ پا کر رہیں گے کیونکہ سب نے بہرحال لوٹ کر ہمارے ہی پاس انا ہے",
        "English" : "And they cut up their affair among them: , all are unto Us returners."
      },
      {
        "ayet_no" : 94,
        "arbi" : "فَمَنْ يَّعْمَلْ مِنَ الصّٰلِحٰتِ وَهُوَ مُؤْمِنٌ فَلَا كُفْرَانَ لِسَعْيِهٖ  ۚ وَاِنَّا لَهٗ كٰتِبُوْنَ",
        "Urdu" : "پس جو کوئی نیک کام کرتا رہے گا جب کہ وہ مومن بھی ہوگا تو اس کی محنت کی کوئی ناقدری نہ ہوگی اور ہم یقینی طور پر اس کے لئے لکھتے جا رہے ہیں",
        "English" : "So, whoever does righteous deeds, while he is a believer, his effort will not be rejected, and We are to put it on record."
      },
      {
        "ayet_no" : 95,
        "arbi" : "وَحَرٰمٌ عَلٰي قَرْيَةٍ اَهْلَكْنٰهَآ اَنَّهُمْ لَا يَرْجِعُوْنَ",
        "Urdu" : "اور جس کسی بستی والوں کو بھی ہم فنا کے گھاٹ اتار دیں ان کے لئے یہ ناممکن ہے کہ وہ پھر لوٹ کر آئیں",
        "English" : "And there is a ban upon any community which We have destroyed: that they shall not return."
      },
      {
        "ayet_no" : 96,
        "arbi" : "حَتّٰٓي اِذَا فُتِحَتْ يَاْجُوْجُ وَمَاْجُوْجُ وَهُمْ مِّنْ كُلِّ حَدَبٍ يَّنْسِلُوْنَ",
        "Urdu" : "یہاں تک کہ جب وہ وقت موعود آپہنچے جس کا ابتدائی سامان یہ ہوگاکہ یاجوج ماجوج کھول دئیے جائیں گے اور وہاپنی خوفناک کثرت کے سبب ہر بلندی سے امڈے چلے آرہے ہوں گے",
        "English" : "Until when Ya'juj and Ma'juj are let out, and from every mound they are trickling down."
      },
      {
        "ayet_no" : 97,
        "arbi" : "وَاقْتَرَبَ الْوَعْدُ الْحَقُّ فَاِذَا هِىَ شَاخِصَةٌ اَبْصَارُ الَّذِيْنَ كَفَرُوْا ۭ يٰوَيْلَنَا قَدْ كُنَّا فِيْ غَفْلَةٍ مِّنْ ھٰذَا بَلْ كُنَّا ظٰلِمِيْنَ",
        "Urdu" : "اور اپنے رب کی طرف لوٹنے کا وہ سچا وعدہ نزدیک ان پہنچے گا جس کا ذکر ہمیشہ سے ہوتا چلا آیا ہے پھر یکایک یہ حالت ہو جائے گی کہ ان لوگوں کی نگاہیں پھٹی کی پھٹی رہ جائیں گی جو اڑے ہوئے تھے اپنے کفر وباطل پر اور وہ یوں پکار رہے ہوں گے کہ ہائے ہماری کم بختی ہم تو اس ہولناک دن سے بالکل غفلت میں رہے بلکہ ہم تو خود ہیاپنی جانوں پر ستم ڈھانے والے تھے",
        "English" : "And the True Promise draws near, then it will so happen that the eyes of the disbelievers shall remain upraised (in terror, and they will say,) :Alas to us! We were in negligence about this; rather we were transgressors."
      },
      {
        "ayet_no" : 98,
        "arbi" : "اِنَّكُمْ وَمَا تَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ حَصَبُ جَهَنَّمَ  ۭ اَنْتُمْ لَهَا وٰرِدُوْنَ",
        "Urdu" : "بلاشبہ تم بھی اور تمہارے وہ سب معبود بھی جن کی پوجا تم لوگ کرتے ہو اللہ کے سوا سب کے سب ایندھن ہوں گے جہنم کی دہکتی بھڑکتی آگ کے تم سب کو بہرحال اس میں داخل ہونا ہوگا۔ ف۳",
        "English" : "Verily ye and whatsoever ye worship beside Allah shall be firewood for Hell: thereunto ye shall go down."
      },
      {
        "ayet_no" : 99,
        "arbi" : "لَوْ كَانَ هٰٓؤُلَاۗءِ اٰلِهَةً مَّا وَرَدُوْهَا ۭ وَكُلٌّ فِيْهَا خٰلِدُوْنَ",
        "Urdu" : "اگر یہ واقعی خدا ہوتے تو وہاں کبھی نہ جاتے اور بات صرف داخل ہونے ہی کی نہیں بلکہ ان سب کو اس میں ہمیشہ کے لئے رہنا ہوگا ف۱",
        "English" : "Had these (idols, etc.) been liha (gods), they would not have entered there (Hell), and all of them will abide therein."
      },
      {
        "ayet_no" : 100,
        "arbi" : "لَهُمْ فِيْهَا زَفِيْرٌ وَّهُمْ فِيْهَا لَا يَسْمَعُوْنَ",
        "Urdu" : "ان کی وہاں چیخیں ہی چیخیں ہوں گی اور وہاں یہ لوگ کچھ سننے بھی نہ پائیں گے",
        "English" : "For them, there will be screams in it and they will not hear."
      },
      {
        "ayet_no" : 101,
        "arbi" : "اِنَّ الَّذِيْنَ سَبَقَتْ لَهُمْ مِّنَّا الْحُسْنٰٓى ۙ اُولٰۗىِٕكَ عَنْهَا مُبْعَدُوْنَ",
        "Urdu" : "رہے وہ لوگ جن کے لئے ہماری طرف سے بھلائی کا فیصلہ پہلے ہی ہو چکا ہوگا تو وہ یقینی طور پر اس سے دور رکھے جائیں گے",
        "English" : "As for those for whom the good (news) from Us has come earlier, they will be kept far away from it."
      },
      {
        "ayet_no" : 102,
        "arbi" : "لَا يَسْمَعُوْنَ حَسِيْسَهَا  ۚ وَهُمْ فِيْ مَا اشْتَهَتْ اَنْفُسُهُمْ خٰلِدُوْنَ",
        "Urdu" : "اور اتنے دور کہ وہ اس کی سرسراہٹ تک کو بھی نہ سنیں گے اور وہ لوگ ہمیشہاپنی من بھائی نعمتوں میں سدا خوش وخرم رہیں گے",
        "English" : "They will not hear the slightest of its sound, and they will remain forever in what their souls desire."
      },
      {
        "ayet_no" : 103,
        "arbi" : "لَا يَحْزُنُهُمُ الْفَزَعُ الْاَكْبَرُ وَتَتَلَقّٰىهُمُ الْمَلٰۗىِٕكَةُ ۭ ھٰذَا يَوْمُكُمُ الَّذِيْ كُنْتُمْ تُوْعَدُوْنَ",
        "Urdu" : "ان کو قیام کی اس بری گھبراہٹ سے بھی کوئی پریشانی لاحق نہ ہوگی فرشتے جنت کے دروازوں پر آگے بڑھ بڑھ کر ان کا استقبال کر رہے ہوں گے اور ان سے کہہ رہے ہوں گے کہ یہ ہے تمہارا وہ دن جس کا تم سے وعدہ کیا جاتا رہا تھا",
        "English" : "They shall not be grieved by the Biggest Panic, and the angels shall receive them (saying), :This is your day that you had been promised"
      },
      {
        "ayet_no" : 104,
        "arbi" : "يَوْمَ نَطْوِي السَّمَاۗءَ كَـطَيِّ السِّجِلِّ لِلْكُتُبِ  ۭ كَمَا بَدَاْنَآ اَوَّلَ خَلْقٍ نُّعِيْدُهٗ  ۭ وَعْدًا عَلَيْنَا  ۭ اِنَّا كُنَّا فٰعِلِيْنَ",
        "Urdu" : "اور وہ دن بھی یاد کرنے کے لائق ہے کہ جس دن ہم آسمان کو اس طرح لپیٹ کر رکھ دیں گے جس طرح لکھے ہوئے مضامین کا کاغذ لپیٹ دیا جاتا ہے جس طرح ہم نے پہلی مرتبہ پیدا کرنے کی ابتداء کی تھی اس طرح بغیر کسی دقت و دشواری کے ہم اس کو دوبارہ بھی پیدا کر دیں گے یہ ہمارے ذمے ایک وعدہ ہے جسے ہم نے بہرحال پورا کرنا ہے ف۲",
        "English" : "And (remember) the Day when We shall roll up the heavens like a scroll rolled up for books, as We began the first creation, We shall repeat it, (it is) a promise binding upon Us. Truly, We shall do it."
      },
      {
        "ayet_no" : 105,
        "arbi" : "وَلَقَدْ كَتَبْنَا فِي الزَّبُوْرِ مِنْۢ بَعْدِ الذِّكْرِ اَنَّ الْاَرْضَ يَرِثُهَا عِبَادِيَ الصّٰلِحُوْنَ",
        "Urdu" : "اور یقینا ہم نے لکھ دیا زبور میں ذکر کے بعد کہ بلاشبہ اس زمین کے وارث ہمارے نیک بندے ہی ہوں گے ف۳",
        "English" : "And We have written in Zabur (Psalms) after the advice that the land will be inherited by My righteous slaves."
      },
      {
        "ayet_no" : 106,
        "arbi" : "اِنَّ فِيْ ھٰذَا لَبَلٰغًا لِّقَوْمٍ عٰبِدِيْنَ",
        "Urdu" : "بلاشبہ اس میں ایک بڑا پیغام ہے عبادت گزاروں کے لئے",
        "English" : "Surely, in this (Qur‘an) there is a message conveyed to a people who worship (Allah)."
      },
      {
        "ayet_no" : 107,
        "arbi" : "وَمَآ اَرْسَلْنٰكَ اِلَّا رَحْمَةً لِّلْعٰلَمِيْنَ",
        "Urdu" : "اور ہم نے نہیں بھیجا آپ کو اے پیغمبر مگر ایک عظیم الشان رحمت کے طور پر سب جہانوں کے لئے",
        "English" : "And We have not sent you but as mercy for all the worlds."
      },
      {
        "ayet_no" : 108,
        "arbi" : "قُلْ اِنَّمَا يُوْحٰٓى اِلَيَّ اَنَّـمَآ اِلٰــهُكُمْ اِلٰهٌ وَّاحِدٌ ۚ فَهَلْ اَنْتُمْ مُّسْلِمُوْنَ",
        "Urdu" : "کہو کہ سوائے اس کے نہیں کہ میری طرف یہ وحی کی جاتی ہے کہ تم سب کا معبود ایک ہی معبود ہے اے لوگو! تو کیا تم لوگ اس کے حضور سر تسلیم خم کرتے ہو ؟",
        "English" : "Say, :What is revealed to me is simply that your God is One God. So do you submit ?"
      },
      {
        "ayet_no" : 109,
        "arbi" : "فَاِنْ تَوَلَّوْا فَقُلْ اٰذَنْتُكُمْ عَلٰي سَوَاۗءٍ ۭ وَاِنْ اَدْرِيْٓ اَقَرِيْبٌ اَمْ بَعِيْدٌ مَّا تُوْعَدُوْنَ",
        "Urdu" : "پھر بھی اگر یہ لوگ اے پیغمبر! راہ حق وصداقت سے منہ موڑے ہی رہے تو ان سے کہہ دو کہ میں نے تو تم کو علی الاعلان اور ایک برابر خبردار کر دیا ہے اب میں یہ نہیں کہہ سکتا کہ وہ چیز دور ہے یا قریب جس کا تم لوگوں سے وعدہ کیا جارہا ہے ف۱",
        "English" : "But, if they turn away, then say (to them), :I have warned you all alike, and I do not know whether what you have been warned of is near or far."
      },
      {
        "ayet_no" : 110,
        "arbi" : "اِنَّهٗ يَعْلَمُ الْجَـــهْرَ مِنَ الْقَوْلِ وَيَعْلَمُ مَا تَكْتُمُوْنَ",
        "Urdu" : "وہ خوب جانتا ہے اس بات کو بھی جو تم پکار کر کہتے ہو اور اسے وہ بھی پوری طرح معلوم ہے جس کو تم لوگ چھپا کر رکھتے ہو",
        "English" : "Verily He know that which is public in speech, and He know that which ye hide."
      },
      {
        "ayet_no" : 111,
        "arbi" : "وَاِنْ اَدْرِيْ لَعَلَّهٗ فِتْنَةٌ لَّكُمْ وَمَتَاعٌ اِلٰى حِيْنٍ",
        "Urdu" : "اور میں نہیں جانتا کہ یہ تاخیر عذاب تمہارے لئے ایک آزمائش ہے یا چند روزہ زندگی کا سامان ہے ایک وقت مقرر تک",
        "English" : "And I do not know; perhaps it is a trial for you and an enjoyment for a while."
      },
      {
        "ayet_no" : 112,
        "arbi" : "قٰلَ رَبِّ احْكُمْ ‎بِالْحَقِّ  ۭ وَرَبُّنَا الرَّحْمٰنُ الْمُسْتَعَانُ عَلٰي مَا تَصِفُوْنَ",
        "Urdu" : "آخر کار! پیغمبر نے کہا اے میرے رب فیصلہ فرما دے حق کے ساتھ ہمارا رب جو بڑا ہی مہربان ہے اسی سے مدد مانگی جاتی ہے ان باتوں کے مقابلے میں جو تم لوگ بناتے ہو۔ ف۲",
        "English" : "He (Our Messenger) said, :My Lord, judge with truth. And Our Lord is the RaHman (All-Merciful), the One whose help is sought against what you describe."
      }
    ]
  }
]