[
  {
    "surah_no" : 49,
    "total_ayah" : 18,
    "name" : "Surah e AL-Hajrat",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تُـقَدِّمُوْا بَيْنَ يَدَيِ اللّٰهِ وَرَسُوْلِهٖ وَاتَّقُوا اللّٰهَ ۭ اِنَّ اللّٰهَ سَمِيْعٌ عَلِيْمٌ",
        "Urdu" : "اے وہ لوگوں جو ایمان لائے ہو پیش قدمی مت کرنا تم اللہ اور اس کے رسول کے (حکم کے) آگے اور (ہمیشہ اور ہر حال) میں ڈرتے رہا کرو تم اللہ سے بیشک اللہ (ہر کسی کی) سنتا (سب کچھ) جانتا ہے ف۱",
        "English" : "O you who believe, do not proceed ahead of Allah and His Messenger, and fear Allah. Surely Allah is All-Hearing, All-Knowing."
      },
      {
        "ayet_no" : 2,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَرْفَعُوْٓا اَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ وَلَا تَجْـهَرُوْا لَهٗ بِالْقَوْلِ كَجَــهْرِ بَعْضِكُمْ لِبَعْضٍ اَنْ تَحْبَــطَ اَعْمَالُكُمْ وَاَنْتُمْ لَا تَشْعُرُوْنَ",
        "Urdu" : "اے وہ لوگوں جو ایمان لائے ہو بلند نہیں کرنااپنی آوازوں کو پیغمبر کی آواز سے اور نہ ہی ان سے ایسی اونچی آواز میں بات کرنا جس طرح کہ تم آ پس میں ایک دوسرے سے بات کرتے ہو کہیں ایسا نہ ہو کہ اکارت ہو جائیں تمہارے سب عمل اور تمہیں خبر بھی نہ ہو ف۲",
        "English" : "O you who believe, do not raise your voices above the voice of the Prophet, and be not loud when speaking to him, as you are loud when speaking to one another, lest your good deeds should become void while you are not aware."
      },
      {
        "ayet_no" : 3,
        "arbi" : "اِنَّ الَّذِيْنَ يَغُضُّوْنَ اَصْوَاتَهُمْ عِنْدَ رَسُوْلِ اللّٰهِ اُولٰۗىِٕكَ الَّذِيْنَ امْتَحَنَ اللّٰهُ قُلُوْبَهُمْ لِلتَّقْوٰى ۭ لَهُمْ مَّغْفِرَةٌ وَّاَجْرٌ عَظِيْمٌ",
        "Urdu" : "بیشک جو لوگ پست رکھتے ہیںاپنی آوازوں کو اللہ کے رسول کے حضور اللہ نے جانچ (اور پرکھ) لیا ان کے دلوں کو قوی (و پرہیزگاری) کے لئے ایسے (خوش نصیب) لوگوں کے لئے عظیم الشان بخشش بھی ہے اور بہت بڑا اجر بھی",
        "English" : "Surely, those who lower their voices before Allah‘s Messenger are the ones whose hearts Allah has tested for piety; for them there is forgiveness, and a great reward."
      },
      {
        "ayet_no" : 4,
        "arbi" : "اِنَّ الَّذِيْنَ يُنَادُوْنَكَ مِنْ وَّرَاۗءِ الْحُـجُرٰتِ اَكْثَرُهُمْ لَا يَعْقِلُوْنَ",
        "Urdu" : "بلاشبہ جو لوگ پکارتے ہیں آپ کو (اے پیغمبر !) حجروں کے باہر سے ان میں سے اکثر بے عقل ہیں",
        "English" : "As for those who call you from behind the chambers, most of them have no sense."
      },
      {
        "ayet_no" : 5,
        "arbi" : "وَلَوْ اَنَّهُمْ صَبَرُوْا حَتّٰى تَخْرُجَ اِلَيْهِمْ لَكَانَ خَيْرًا لَّهُمْ ۭ وَاللّٰهُ غَفُوْرٌ رَّحِيْمٌ",
        "Urdu" : "اور اگر یہ لوگ صبر سے کام لیتے یہاں تک کہ آپ صلی اللہ علیہ وسلم خود ہی ان کے پاس نکل آتے تو یہ زیادہ بہتر ہوتا خود ان کے لئے اور اللہ بڑا ہی درگزر کرنے والا انتہائی مہربان ہے",
        "English" : "Had they remained patient until you come out to them, it would have been much better for them. And Allah is Most-Forgiving, Very-Merciful."
      },
      {
        "ayet_no" : 6,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِنْ جَاۗءَكُمْ فَاسِقٌۢ بِنَبَاٍ فَتَبَيَّنُوْٓا اَنْ تُصِيْبُوْا قَوْمًۢا بِجَــهَالَةٍ فَتُصْبِحُوْا عَلٰي مَا فَعَلْتُمْ نٰدِمِيْنَ",
        "Urdu" : "اے وہ لوگوں جو ایمان لائے ہو اگر کوئی فاسق آدمی تمہارے پاس کوئی خبر لایا کرے تو تم اس کی اچھی طرح تحقیق کرلیا کرو کہیں ایسا نہ ہو کہ تم کوئی نقصان پہنچا بیٹھو کسی قوم کو جہالت (و نادانی) کی بناء پر تو پھر اس کے نتیجے میں تمہیں خود اپنے کئے پر ندامت اٹھانا پڑ جائے",
        "English" : "O you who believe, if a sinful person brings you a report, verify its correctness, lest you should harm a people out of ignorance, and then become remorseful on what you did."
      },
      {
        "ayet_no" : 7,
        "arbi" : "وَاعْلَمُوْٓا اَنَّ فِيْكُمْ رَسُوْلَ اللّٰهِ ۭ لَوْ يُطِيْعُكُمْ فِيْ كَثِيْرٍ مِّنَ الْاَمْرِ لَعَنِتُّمْ وَلٰكِنَّ اللّٰهَ حَبَّبَ اِلَيْكُمُ الْاِيْمَانَ وَزَيَّنَهٗ فِيْ قُلُوْبِكُمْ وَكَرَّهَ اِلَيْكُمُ الْكُفْرَ وَالْفُسُوْقَ وَالْعِصْيَانَ ۭاُولٰۗىِٕكَ هُمُ الرّٰشِدُوْنَ",
        "Urdu" : "اور خوب جان رکھو کہ تمہارے درمیان اللہ کا رسول موجود ہے اگر وہ بہت سی باتوں میں تمہارا کہنا مان لیا کرے تو تم لوگ خود ہی سخت مشکلات میں پڑ جاؤ لیکن اللہ نے تم کو (اس سے بچا کر) ایمان کی محبت سے نواز دیا اور اس کو مزین (و محبوب) بنا دیا تمہارے دلوں میں اور تمہارے اندر نفرت (و کراہیت) پیدا کر دی کفر نافرمانی اور گناہ سے ایسے ہی لوگ راہ راست پر ہیں ف۱",
        "English" : "And know that verily among you is the apostle of Allah. Were he to obey you in many affairs, ye would surely be in trouble but Allah hath endeared belief to you and hath made it fair-seeming in your hearts, and hath rendered detestable Unto you infidelity and wickedness and disobedience. These! they are the men of rectitude."
      },
      {
        "ayet_no" : 8,
        "arbi" : "فَضْلًا مِّنَ اللّٰهِ وَنِعْمَةً ۭ وَاللّٰهُ عَلِيْمٌ حَكِيْمٌ",
        "Urdu" : "محض اللہ کے فضل اور اس کے احسان سے اور اللہ سب کچھ جانتا نہایت حکمت والا ہے",
        "English" : "Through grace from Allah and His favour; and Allah is Knowing, Wise."
      },
      {
        "ayet_no" : 9,
        "arbi" : "وَاِنْ طَاۗىِٕفَتٰنِ مِنَ الْمُؤْمِنِيْنَ اقْتَتَلُوْا فَاَصْلِحُوْا بَيْنَهُمَا ۚ فَاِنْۢ بَغَتْ اِحْدٰىهُمَا عَلَي الْاُخْرٰى فَقَاتِلُوا الَّتِيْ تَبْغِيْ حَتّٰى تَفِيْۗءَ اِلٰٓى اَمْرِ اللّٰهِ ۚ فَاِنْ فَاۗءَتْ فَاَصْلِحُوْا بَيْنَهُمَا بِالْعَدْلِ وَاَقْسِطُوْا ۭ اِنَّ اللّٰهَ يُحِبُّ الْمُقْسِطِيْنَ",
        "Urdu" : "اور اگر مسلمانوں کے دو گروہ آ پس میں لڑ پڑیں تو تم ان کے درمیان صلح کرا دیا کرو پھر اگر ان میں سے ایک دوسرے پر زیادتی کرے تو تم اس سے لڑو جو زیادتی کرتا ہے یہاں تک کہ وہ لوٹ آئے اللہ کے حکم کی طرف پھر اگر وہ لوٹ آئے پس تم صلح کرا دو ان دونوں کے درمیان عدل (و انصاف) کے ساتھ اور یوں بھی انصاف ہی کیا کرو کہ بیشک اللہ محبت کرتا ہے انصاف کرنے والوں کے ساتھ",
        "English" : "If two groups of the believers fight each other, seek reconciliation between them. And if one of them commits aggression against the other, fight the one that commits aggression until it comes back to Allah‘s command. So if it comes back, seek reconciliation between them with fairness, and maintain justice. Surely Allah loves those who maintain justice."
      },
      {
        "ayet_no" : 10,
        "arbi" : "اِنَّمَا الْمُؤْمِنُوْنَ اِخْوَةٌ فَاَصْلِحُوْا بَيْنَ اَخَوَيْكُمْ ۚ وَاتَّقُوا اللّٰهَ لَعَلَّكُمْ تُرْحَمُوْنَ",
        "Urdu" : "سوائے اس کے نہیں کہ ایمان والے آ پس میں بھائی ہیں پس (اختلاف کی صورت میں) تم صلح کرا دیا کرو اپنے دونوں بھائیوں کے درمیان اور (ہر حال میں) ڈرتے رہا کرو تم لوگ اللہ سے (اور بچتے رہا کرو اس کی نافرمانی سے) تاکہ تم پر رحم کیا جائے",
        "English" : "All believers are but brothers, therefore seek reconciliation between your two brothers, and fear Allah, so that you may be blessed with mercy."
      },
      {
        "ayet_no" : 11,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا يَسْخَرْ قَوْمٌ مِّنْ قَوْمٍ عَسٰٓى اَنْ يَّكُوْنُوْا خَيْرًا مِّنْهُمْ وَلَا نِسَاۗءٌ مِّنْ نِّسَاۗءٍ عَسٰٓى اَنْ يَّكُنَّ خَيْرًا مِّنْهُنَّ ۚ وَلَا تَلْمِزُوْٓا اَنْفُسَكُمْ وَلَا تَنَابَزُوْا بِالْاَلْقَابِ ۭ بِئْسَ الِاسْمُ الْفُسُوْقُ بَعْدَ الْاِيْمَانِ ۚ وَمَنْ لَّمْ يَتُبْ فَاُولٰۗىِٕكَ هُمُ الظّٰلِمُوْنَ",
        "Urdu" : "اے وہ لوگوں جو ایمان لائے ہو نہ مرد مذاق اڑائیں دوسرے مردوں کا ہو سکتا ہے کہ وہ ان (مذاق اڑانے والوں) سے کہیں بڑھ کر اچھے ہوں اور نہ عورتیں مذاق اڑائیں دوسری عورتوں کا ہو سکتا ہے کہ وہ ان (مذاق اڑانے والیوں) سے کہیں بڑھ کر اچھی ہوں نہ تم آ پس میں ایک دوسرے کو طعنے دو اور نہ ایک دوسرے کے برے نام رکھو کہ بڑا برا نام ہے گنہگاری (دولتِ) ایمان (سے سرفرازی) کے بعد اور جو باز نہیں آئیں گے تو وہی ہیں ظالم ف۱",
        "English" : "O you who believe, no men should ever scoff at other men. May be, the latter are better than the former. Nor should women (ever scoff) at other women. May be, the latter women are better than the former ones. And do not find fault with one another, nor call one another with bad nicknames. Bad is the name of sinfulness after embracing Faith. If anyone does not repent, then such people are the wrongdoers."
      },
      {
        "ayet_no" : 12,
        "arbi" : "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوا اجْتَنِبُوْا كَثِيْرًا مِّنَ الظَّنِّ ۡ اِنَّ بَعْضَ الظَّنِّ اِثْمٌ وَّلَا تَجَسَّسُوْا وَلَا يَغْتَبْ بَّعْضُكُمْ بَعْضًا ۭ اَيُحِبُّ اَحَدُكُمْ اَنْ يَّاْكُلَ لَحْمَ اَخِيْهِ مَيْتًا فَكَرِهْتُمُوْهُ ۭ وَاتَّقُوا اللّٰهَ ۭ اِنَّ اللّٰهَ تَوَّابٌ رَّحِيْمٌ",
        "Urdu" : "اے وہ لوگوں جو ایمان لائے ہو بچتے رہا کرو تم بہت سے گمانوں سے کہ بعض گمان یقینا گناہ ہوتے ہیں اور نہ تم تجسس کرو (اور نہ کسی کے عیب تلاش کرو) اور نہ ہی تم میں سے کوئی کسی کی غیبت کرے کیا تم میں سے کوئی یہ پسند کرے گا کہ وہ گوشت کھائے اپنے مرے ہوئے بھائی کا؟ اس کو تو تم لوگ خود ہی برا سمجھتے ہو اور (ہر حال میں) ڈرتے رہا کرو تم اللہ سے (اور بچتے رہا کرو اس کی نافرمانی سے) اللہ بڑا ہی توبہ قبول کرنے والا انتہائی مہربان ہے",
        "English" : "O you who believe, abstain from many of the suspicions. Some suspicions are sins. And do not be curious (to find out faults of others), and do not backbite one another. Does one of you like that he eats the flesh of his dead brother? You would abhor it. And fear Allah. Surely Allah is Most-Relenting, Very-Merciful."
      },
      {
        "ayet_no" : 13,
        "arbi" : "يٰٓاَيُّهَا النَّاسُ اِنَّا خَلَقْنٰكُمْ مِّنْ ذَكَرٍ وَّاُنْثٰى وَجَعَلْنٰكُمْ شُعُوْبًا وَّقَبَاۗىِٕلَ لِتَعَارَفُوْا  ۭ اِنَّ اَكْرَمَكُمْ عِنْدَ اللّٰهِ اَتْقٰىكُمْ ۭ اِنَّ اللّٰهَ عَلِيْمٌ خَبِيْرٌ",
        "Urdu" : "اے لوگوں یقینا ہم نے تم سب کو ایک ہی مرد اور عورت سے پیدا کیا ہے اور تمہیں مختلف قوموں اور خاندانوں میں (محض اس لئے) تقسیم کر دیا کہ تاکہ تم آ پس میں پہچان کر سکو بیشک اللہ کے یہاں تم میں سے سب سے بڑا عزت دار وہ شخص ہے جو سب سے زیادہ متقی (و پرہیز گار) ہو بیشک اللہ پوری طرح جانتا ہے (تمہارے عمل و کردار کو اور وہ) پوری طرح باخبر ہے (تمہاری احوال سے)",
        "English" : "O mankind, We have created you from a male and a female, and made you into races and tribes, so that you may identify one another. Surely the noblest of you, in Allah‘s sight, is the one who is most pious of you. Surely Allah is All-Knowing, All-Aware."
      },
      {
        "ayet_no" : 14,
        "arbi" : "قَالَتِ الْاَعْرَابُ اٰمَنَّا ۭ قُلْ لَّمْ تُؤْمِنُوْا وَلٰكِنْ قُوْلُوْٓا اَسْلَمْنَا وَلَمَّا يَدْخُلِ الْاِيْمَانُ فِيْ قُلُوْبِكُمْ ۭ وَاِنْ تُطِيْعُوا اللّٰهَ وَرَسُوْلَهٗ لَا يَـلِتْكُمْ مِّنْ اَعْمَالِكُمْ شَـيْـــــًٔا ۭ اِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ",
        "Urdu" : "یہ بدوی لوگ کہتے ہیں کہ ہم ایمان لے آئے (ان سے) کہو کہ تم ایمان نہیں لائے ہاں یوں کہو کہ ہم مسلمان ہوگئے کہ ایمان تو ابھی تمہارے دلوں میں داخل نہیں ہوا اور اگر تم نے (صدق دل سے) اطاعت و فرمانبرداری کی اللہ اور اس کے رسول کی تو اللہ تمہارے اعمال میں سے کچھ بھی کم نہیں کرے گا بلاشبہ اللہ بڑا ہی درگزر فرمانے والا انتہائی مہربان ہے",
        "English" : "The Bedouins say, :We have come to believe. Say, :You have not come to believe; instead, you (should) say, _We have surrendered‘ and the belief has not entered your hearts so far. If you obey Allah and His Messenger, He will not curtail (the reward of) any of your deeds in the least. Surely Allah is Most-Forgiving, Very-Merciful."
      },
      {
        "ayet_no" : 15,
        "arbi" : "اِنَّمَا الْمُؤْمِنُوْنَ الَّذِيْنَ اٰمَنُوْا بِاللّٰهِ وَرَسُوْلِهٖ ثُمَّ لَمْ يَرْتَابُوْا وَجٰهَدُوْا بِاَمْوَالِهِمْ وَاَنْفُسِهِمْ فِيْ سَبِيْلِ اللّٰهِ ۭ اُولٰۗىِٕكَ هُمُ الصّٰدِقُوْنَ",
        "Urdu" : "مومن تو حقیقت میں وہی لوگ ہیں جو (صدق دل سے) ایمان لائے اللہ اور اس کے رسول پر پھر انہوں نے کوئی شک نہیں کیا اور انہوں نے جہاد کیا اپنے مالوں اوراپنی جانوں کے ساتھ اللہ کی راہ میں یہی لوگ ہیں سچے ف۱",
        "English" : "Believers, in fact, are those who believe in Allah and His Messenger, then have no doubt, and struggle, with their riches and their lives, in the way of Allah. Those are the truthful."
      },
      {
        "ayet_no" : 16,
        "arbi" : "قُلْ اَتُعَلِّمُوْنَ اللّٰهَ بِدِيْنِكُمْ ۭ وَاللّٰهُ يَعْلَمُ مَا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ ۭ وَاللّٰهُ بِكُلِّ شَيْءٍ عَلِيْمٌ",
        "Urdu" : "(ان سے) کہو (اے پیغمبر !) کہ کیا تم اللہ کو آگاہ کر رہے ہو اپنے دین کے بارے میں؟ حالانکہ اللہ جانتا ہے وہ سب کچھ جو کہ آسمانوں میں ہے اور جو زمین میں ہے اور اللہ ہرچیز کو پوری طرح جانتا ہے",
        "English" : "Say, :Would you apprise Allah of your religion, while Allah knows all that is in the heavens and all that is in the earth, and Allah is All-Knowing about every thing ?"
      },
      {
        "ayet_no" : 17,
        "arbi" : "يَمُنُّوْنَ عَلَيْكَ اَنْ اَسْلَمُوْا ۭ قُلْ لَّا تَمُنُّوْا عَلَيَّ اِسْلَامَكُمْ ۚ بَلِ اللّٰهُ يَمُنُّ عَلَيْكُمْ اَنْ هَدٰىكُمْ لِلْاِيْمَانِ اِنْ كُنْتُمْ صٰدِقِيْنَ",
        "Urdu" : "یہ لوگ آپ پر احسان رکھتے ہیں اس بات کا یہ اسلام لائے ہیں (ان سے) کہو کہ اپنے اسلام کا احسان مجھ پر نہ رکھو بلکہ احسان تو اللہ نے تم پر فرمایا ہے کہ اس نے تمہیں ایمان کی ہدایت سے نوازا اگر تم سچے ہو (اپنے دعوی ایمان میں)",
        "English" : "They oblige you that they have accepted Islam, (as if it was a favour shown to you). Say, :Do not oblige me for your accepting Islam. Rather, Allah makes you obliged for His having guided you to the Faith, if you are truthful."
      },
      {
        "ayet_no" : 18,
        "arbi" : "اِنَّ اللّٰهَ يَعْلَمُ غَيْبَ السَّمٰوٰتِ وَالْاَرْضِ ۭ وَاللّٰهُ بَصِيْرٌۢ بِمَا تَعْمَلُوْنَ",
        "Urdu" : "بلاشبہ اللہ جانتا ہے آسمانوں اور زمین کے غیب (اور ان کی چھپی باتوں) کو اور اللہ پوری طرح نگاہ میں رکھے ہوئے ہے ان تمام کاموں کو جو تم کرتے ہو ف۲",
        "English" : "Surely Allah knows the Unseen of the heavens and the earth, and Allah keeps in sight whatever you do."
      }
    ]
  }
]