[
  {
    "surah_no" : 65,
    "total_ayah" : 12,
    "name" : "Surah e AL-Talaq",
    "detail" : [

      {
        "ayet_no" : 0,
        "arbi" : "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
        "Urdu" : "اللہ کے پاک نام سے شروع کرتا ہوں جو کہ بڑا مہربان نہایت ہی رحم فرمانے والا ہے ۔",
        "English" : "In the name of Allah, the Compassionate, the Merciful."
      },
      {
        "ayet_no" : 1,
        "arbi" : "يٰٓاَيُّهَا النَّبِيُّ اِذَا طَلَّقْتُمُ النِّسَاۗءَ فَطَلِّقُوْهُنَّ لِعِدَّتِهِنَّ وَاَحْصُواالْعِدَّةَ   ۚ وَاتَّقُوا اللّٰهَ رَبَّكُمْ ۚ لَا تُخْرِجُوْهُنَّ مِنْۢ بُيُوْتِهِنَّ وَلَا يَخْرُجْنَ اِلَّآ اَنْ يَّاْتِيْنَ بِفَاحِشَةٍ مُّبَيِّنَةٍ   ۭ وَتِلْكَ حُدُوْدُ اللّٰهِ   ۭ وَمَنْ يَّتَعَدَّ حُدُوْدَ اللّٰهِ فَقَدْ ظَلَمَ نَفْسَهٗ   ۭ لَا تَدْرِيْ لَعَلَّ اللّٰهَ يُحْدِثُ بَعْدَ ذٰلِكَ اَمْرًا",
        "Urdu" : "اے نبی جب تم طلاق دواپنی عورتوں کو تو ان کو طلاق دیا کرو ان کی عدت کے لئے ف۱ اور اچھی طرح شمار کیا کرو عدت (کے زمانے) کو اور (ہمیشہ) ڈرتے رہا کرو تم لوگ اللہ سے جو کہ رب ہے تم سب کا نہ تو تم ان (عورتوں) کو ان کے گھروں سے نکالو اور نہ ہی وہ خود نکلیں مگر یہ کہ وہ ارتکاب کر بیٹھیں کسی کھلی بیحیائی کا اور یہ حدیں ہیں اللہ کی (مقرر کی ہوئی) اور جو کوئی تجاوز کرے گا اللہ کی (مقرر کردہ ان) حدود سے تو وہ یقینا خود اپنے ہی اوپر ظلم کرے گا تم نہیں جانتے (اے طلاق دینے والے) کہ شاید اللہ تعالیٰ پیدا فرما دے اس (طلاق) کے بعد (بہتری اور موافقت کی) کوئی صورت ف۲",
        "English" : "O prophet, when you people divorce women, divorce them at a time when the period of _Iddah may start. And count the period of _Iddah, and fear Allah, your Lord. Do not expel them from their houses, nor should they go out, unless they come up with a clearly shameless act. These are the limits prescribed by Allah. And whoever exceeds the limits prescribed by Allah wrongs his own self. You do not know (what will happen in future) ; it may be that Allah brings about a new situation thereafter."
      },
      {
        "ayet_no" : 2,
        "arbi" : "فَاِذَا بَلَغْنَ اَجَلَهُنَّ فَاَمْسِكُوْهُنَّ بِمَعْرُوْفٍ اَوْ فَارِقُوْهُنَّ بِمَعْرُوْفٍ وَّاَشْهِدُوْا ذَوَيْ عَدْلٍ مِّنْكُمْ وَاَقِيْمُوا الشَّهَادَةَ لِلّٰهِ ۭ ذٰلِكُمْ يُوْعَظُ بِهٖ مَنْ كَانَ يُؤْمِنُ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِ ڛ وَمَنْ يَّتَّقِ اللّٰهَ يَجْعَلْ لَّهٗ مَخْرَجًا",
        "Urdu" : "پھر جب وہ پہنچ جائیںاپنی مدت (کے خاتمے) کو تو پھر تم یا تو ان کو روک رکھو (اپنے عقد نکاح میں رجوع کے ذریعے) دستور کے مطابق یا ان کو چھوڑ دو دستور کے مطابق اور گواہ بنا لیا کرو تم لوگ (ایسے ہر موقع پر) اپنے میں سے دو معتبر شخصوں کو اور تماپنی گواہی ٹھیک ٹھیک اللہ (کی رضا) کے لئے ادا کیا کرو (اے گواہو!) ان باتوں کی نصیحت کی جاتی ہے ہر اس شخص کو جو (سچے دل سے) ایمان رکھتا ہو اللہ پر اور قیامت کے دن پر ف۱ اور جو کوئی (سچے دل سے) ڈرتا رہے گا اللہ سے تو وہ اس کے لئے پیدا فرما دے گا (مشکلات سے) نکلنے کا راستہ",
        "English" : "So, when they (the divorced women) have (almost) reached their term, then either retain them with fairness, or part with them with fairness. And make two just men from among you witnesses (of your either decision) . And (O witnesses,) keep your testimony upright for the sake of Allah. That is what anyone who believes in Allah and the Last Day is exhorted to do. Whoever fears Allah, He brings forth a way out for him,"
      },
      {
        "ayet_no" : 3,
        "arbi" : "وَّيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۭ وَمَنْ يَّتَوَكَّلْ عَلَي اللّٰهِ فَهُوَ حَسْبُهٗ   ۭ اِنَّ اللّٰهَ بَالِغُ اَمْرِهٖ    ۭ قَدْ جَعَلَ اللّٰهُ لِكُلِّ شَيْءٍ قَدْرًا",
        "Urdu" : "اور وہ اس کو وہاں سے رزق عطا فرمائے گا جہاں سے اس کا گمان بھی نہیں ہوگا ف ۲ اور جو کوئی (صحیح معنوں میں) بھروسہ کرے گا اللہ پر تو وہ اس کو کافی ہے (تمام مہمات کے لئے) بیشک اللہ پورا کر کے رہتا ہے اپنا کام یقینا اللہ نے مقرر فرما رکھا ہے ہرچیز کا ایک خاص اندازہ ف۳",
        "English" : "And He provide for him from whence he reckon not upon. And whosoever put his trust in Allah He will suffice him. Verily Allah is sure to attain His purpose, and Allah hath appointed Unto everything a measure."
      },
      {
        "ayet_no" : 4,
        "arbi" : "وَاڿ يَىِٕسْنَ مِنَ الْمَحِيْضِ مِنْ نِّسَاۗىِٕكُمْ اِنِ ارْتَبْتُمْ فَعِدَّتُهُنَّ ثَلٰثَةُ اَشْهُرٍ ۙ وَّاڿ لَمْ يَحِضْنَ ۭ وَاُولَاتُ الْاَحْمَالِ اَجَلُهُنَّ اَنْ يَّضَعْنَ حَمْلَهُنَّ ۭ وَمَنْ يَّتَّقِ اللّٰهَ يَجْعَلْ لَّهٗ مِنْ اَمْرِهٖ يُسْرًا",
        "Urdu" : "اور جو عورتیں مایوس ہوجائیں حیض (کے انے) سے تمہاری عورتوں میں سے اگر تمہیں ان کے بارے میں شک پڑ جائے تو (جان لو کہ) ان کی عدت تین مہینے ہے اور جن عورتوں کو ابھی تک حیض آیا ہی نہ ہو (ان کا حکم بھی یہی ہے) اور حمل والی عورتوں کی عدت ان کے بچہ جننے تک ہے اور جو کوئی ڈرتا رہے گا اللہ سے تو اللہ آسانی پیدا فرما دے گا اس کے لئے ہر معاملے میں",
        "English" : "And those of your women as have passed the age of monthly courses, for them the 'Iddah (prescribed period) , if you have doubts (about their periods) , is three months, and for those who have no courses [(i.e. they are still immature) their 'Iddah (prescribed period) is three months likewise, except in case of death] . And for those who are pregnant (whether they are divorced or their husbands are dead) , their 'Iddah (prescribed period) is until they deliver (their burdens) , and whosoever fearsAllah and keeps his duty to Him, He will make his matter easy for him."
      },
      {
        "ayet_no" : 5,
        "arbi" : "ذٰلِكَ اَمْرُ اللّٰهِ اَنْزَلَهٗٓ اِلَيْكُمْ ۭ وَمَنْ يَّتَّقِ اللّٰهَ يُكَفِّرْ عَنْهُ سَـيِّاٰتِهٖ وَيُعْظِمْ لَهٗٓ اَجْرًا",
        "Urdu" : "یہ اللہ کا حکم ہے جو اس نے اتارا ہے تمہاری طرف (اے لوگو!) اور جو کوئی ڈرتا رہے گا اللہ سے تو اللہ دور فرما دے گا اس سے اس کی برائیوں کو اور (مزید یہ کہ) وہ اس کو عطا فرمائے گا بہت بڑا اجر",
        "English" : "This is the command of Allah that He has sent down to you. And whoever fears Allah, He will write off his evil deeds, and will give him a huge reward."
      },
      {
        "ayet_no" : 6,
        "arbi" : "اَسْكِنُوْهُنَّ مِنْ حَيْثُ سَكَنْتُمْ مِّنْ وُّجْدِكُمْ وَلَا تُضَاۗرُّوْهُنَّ لِتُضَيِّقُوْا عَلَيْهِنَّ ۭ وَاِنْ كُنَّ اُولَاتِ حَمْلٍ فَاَنْفِقُوْا عَلَيْهِنَّ حَتّٰى يَضَعْنَ حَمْلَهُنَّ ۚ فَاِنْ اَرْضَعْنَ لَكُمْ فَاٰتُوْهُنَّ اُجُوْرَهُنَّ ۚ وَاْتَمِرُوْا بَيْنَكُمْ بِمَعْرُوْفٍ ۚ وَاِنْ تَعَاسَرْتُمْ فَسَتُرْضِعُ لَهٗٓ اُخْرٰى",
        "Urdu" : "تم ان مطلقہ عورتوں کو وہیں رکھو جہاں تم خود رہتے ہواپنی طاقت کے مطابق اور انہیں تکلیف مت پہنچاؤ کہ اس طرح تم ان پر تنگی کرو اور اگر وہ حمل والی ہوں تو ان پر خرچ کرتے رہو یہاں تک کہ وہ وضع کرلیں اپنے حمل کو پھر اگر وہ تمہارے لئے (بچے کو) دودھ پلائیں تو تم ان کو ان کی (مقرر کردہ) اجرتیں دے دیا کرو اور آ پس میں مناسب طور پر مشورہ کرلیا کرو اور اگر تم آ پس میں تنگی کرو گے تو اس کے لئے کوئی اور عورت دودھ پلا لے گی",
        "English" : "Provide to them (the divorced women) residence where you reside according to your means, and do not hurt them to straiten (life) for them. And if they are pregnant, spend on them till they give birth to their child. Then if they suckle the child for you, give them their fees, and consult each other (for determining the fee) with fairness, and if you create a deadlock between you, then another woman will suckle him."
      },
      {
        "ayet_no" : 7,
        "arbi" : "لِيُنْفِقْ ذُوْ سَعَةٍ مِّنْ سَعَتِهٖ    ۭ وَمَنْ قُدِرَ عَلَيْهِ رِزْقُهٗ فَلْيُنْفِقْ مِمَّآ اٰتٰىهُ اللّٰهُ ۭ لَا يُكَلِّفُ اللّٰهُ نَفْسًا اِلَّا مَآ اٰتٰىهَا    ۭ سَيَجْعَلُ اللّٰهُ بَعْدَ عُسْرٍ يُّسْرًا",
        "Urdu" : "گنجائش والے کو چاہیے کہ وہ خرچ کرےاپنی گنجائش کے مطابق اور جس پر اس کی روزی تنگ کر دی گئی ہو تو اس کو چاہیے کہ وہ (اپنی حیثیت کے مطابق) اسی میں سے خرچ کرے جو کہ اللہ نے اسے دے رکھا ہے اللہ کسی شخص پر بوجھ نہیں ڈالتا مگر اتنا ہی جتنا کہ اس نے اسے دے رکھا ہوتا ہے بعید نہیں کہ اللہ پیدا فرما دے (اپنی عنایت سے) تنگی کے بعد آسانی ف۱",
        "English" : "A man of vast means should spend according to his vast means. And anyone whose sustenance is limited should spend from whatever Allah has given to him. Allah makes no one liable beyond what He has given to him. Allah will soon bring ease after a difficulty."
      },
      {
        "ayet_no" : 8,
        "arbi" : "وَكَاَيِّنْ مِّنْ قَرْيَةٍ عَتَتْ عَنْ اَمْرِ رَبِّهَا وَرُسُلِهٖ فَحَاسَبْنٰهَا حِسَابًا شَدِيْدًا ۙ وَّعَذَّبْنٰهَا عَذَابًا نُّكْرًا",
        "Urdu" : "اور کتنی ہی بستیاں ایسی تھیں جنہوں نے سرکشی (و سرتابی) کی اپنے رب کے حکم اور اس کے رسولوں (کی ہدایات) سے سو آخرکار ہم نے ان کا محاسبہ کیا بڑا ہی سخت محاسبہ اور ہم نے ان کو سزا دی (طرح طرح کے عذابوں) سے بڑی بری سزا",
        "English" : "And how many a township rebelled against the command of its Lord, and against His messengers, so We called them to a severe account, and punished them with a punishment that was unimagined by them."
      },
      {
        "ayet_no" : 9,
        "arbi" : "فَذَاقَتْ وَبَالَ اَمْرِهَا وَكَانَ عَاقِبَةُ اَمْرِهَا خُسْرًا",
        "Urdu" : "سوانہوں نے چکھا وبال اپنے کئے کا اور انجام کار ان کا معاملہ بڑے ہی خسارے (اور سخت نقصان) کا تھا ف۲",
        "English" : "Thus they tasted the evil consequence of their acts, and the end of their conduct was loss."
      },
      {
        "ayet_no" : 10,
        "arbi" : "اَعَدَّ اللّٰهُ لَهُمْ عَذَابًا شَدِيْدًا ۙ فَاتَّقُوا اللّٰهَ يٰٓاُولِي الْاَلْبَابِ ڂ الَّذِيْنَ اٰمَنُوْا ٽ قَدْ اَنْزَلَ اللّٰهُ اِلَيْكُمْ ذِكْرًا",
        "Urdu" : "(اور دنیا کے اسی عذاب پر بس نہیں بلکہ) اللہ نے تیار کر رکھا ہے ان کے لئے (آخرت میں) ایک بڑا ہی سخت (اور ہولناک) عذاب پس بچو تم لوگ اللہ (کی نافرمانی اور اس کی ناراضگی) سے اے عقل سلیم رکھنے والو جو ایمان لاچکے ہو بلاشبہ اللہ نے اتار دی تمہاری طرف ایک عظیم الشان نصیحت",
        "English" : "Allah has prepared for them a severe torment. So fear Allah and keep your duty to Him, O men of understanding who have believed! -Allah has indeed sent down to you a Reminder (this Qur'n)."
      },
      {
        "ayet_no" : 11,
        "arbi" : "رَّسُوْلًا يَّتْلُوْا عَلَيْكُمْ اٰيٰتِ اللّٰهِ مُبَيِّنٰتٍ لِّيُخْرِجَ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ مِنَ الظُّلُمٰتِ اِلَى النُّوْرِ ۭ وَمَنْ يُّؤْمِنْۢ بِاللّٰهِ وَيَعْمَلْ صَالِحًا يُّدْخِلْهُ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَآ اَبَدًا   ۭ قَدْ اَحْسَنَ اللّٰهُ لَهٗ رِزْقًا",
        "Urdu" : "یعنی ایک ایسا عظیم الشان رسول جو پڑھ (پڑھ) کرسناتا ہے تم لوگوں کو اللہ کی ایسی آیتیں جو کھول کر بتانے والی ہیں تاکہ وہ نکال باہر کرے ان لوگوں کو جو ایمان لائے اور انہوں نے کام بھی نیک کئے (کفر و شرک اور جہل و ضلال کی طرح طرح کی گھٹا ٹوپ) تاری کیوں سے (حق و ہدایت کے) نور (مبین) کی طرف اور جو کوئی (سچے دل سے) ایمان لائے گا اللہ پر اور (اس کے مطابق) وہ نیک کام بھی کرے گا تو اللہ داخل فرما دے گا اس کو (اپنے کرم سے) ایسی عظیم الشان جنتوں میں جن کے نیچے سے بہہ رہی ہوں گی طرح طرح کی (عظیم الشان) نہریں جہاں ان کو ہمیشہ ہمیش کے لئے رہنا نصیب ہوگا بیشک اللہ نے اس کو بڑے ہی عمدہ رزق سے نوازا ف۱",
        "English" : "A messenger reciting unto you the revelations of Allah made plain, that He may bring forth those who believe and do good works from darkness unto light. And whosoever believeth in Allah and doeth right, He will bring him into Gardens underneath which rivers flow, therein to abide for ever. Allah hath made good provision for him."
      },
      {
        "ayet_no" : 12,
        "arbi" : "اَللّٰهُ الَّذِيْ خَلَقَ سَبْعَ سَمٰوٰتٍ وَّمِنَ الْاَرْضِ مِثْلَهُنَّ ۭ يَـتَنَزَّلُ الْاَمْرُ بَيْنَهُنَّ لِتَعْلَمُوْٓا اَنَّ اللّٰهَ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ ڏ وَّاَنَّ اللّٰهَ قَدْ اَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا",
        "Urdu" : "اللہ وہ ہے جس نے پیدا فرمایا (اپنی قدرت کاملہ اور حکمت بالغہ سے) سات آسمانوں کو اور زمین سے بھی انہی کے مانند ان سب کے درمیان اتر تے رہتے ہیں اس کے احکام (تکوینی و تشریعی اور تمہیں یہ اس لئے بتا دیا گیا ہے کہ) تاکہ تم لوگ یقین جان لو کہ اللہ (پاک) ہرچیز پر پوری قدرت رکھتا ہے اور (تا کہ تم لوگ اس کا بھی یقین کر لو کہ) بلاشبہ اللہ نے ہرچیز کو اپنے احاطہ میں لے رکھا ہے علم کے اعتبار سے ف۲",
        "English" : "Allah is the One who has created seven skies, and their like from earth. The Command descends among them, so that you may know that Allah is powerful over every thing, and that Allah has encompassed every thing in knowledge."
      }
    ]
  }
]